{
  "propositions": [
    {
      "id": "1",
      "text": "Description of a ritualistic opening of a box containing a bronze fish with snake-like eyebrows.",
      "level": 1
    },
    {
      "id": "1.1",
      "text": "The box lid opened automatically.",
      "level": 2
    },
    {
      "id": "1.2",
      "text": "The box contained a small bronze fish.",
      "level": 2
    },
    {
      "id": "1.3",
      "text": "The fish had snake-like eyebrows.",
      "level": 2
    },
    {
      "id": "2",
      "text": "Discussion between Wu Sansheng (Third Uncle) and the narrator about the bronze fish and its implications.",
      "level": 1
    },
    {
      "id": "2.1",
      "text": "Third Uncle expresses surprise at how the box was opened.",
      "level": 2
    },
    {
      "id": "2.2",
      "text": "The narrator explains the digital lock issue.",
      "level": 2
    },
    {
      "id": "2.3",
      "text": "Third Uncle identifies the object as a 'snake-browed bronze fish'.",
      "level": 2
    },
    {
      "id": "2.4",
      "text": "Third Uncle shows a similar bronze fish from his possession.",
      "level": 2
    },
    {
      "id": "2.5",
      "text": "Third Uncle's fish is described as having fine craftsmanship but covered in white, lime-like dirt.",
      "level": 2
    },
    {
      "id": "2.6",
      "text": "The narrator identifies the dirt as characteristic of 'sea goods' (antiques salvaged from the sea).",
      "level": 2
    },
    {
      "id": "2.7",
      "text": "Third Uncle confirms the nature of sea goods and their associated dirt.",
      "level": 2
    },
    {
      "id": "3",
      "text": "Third Uncle recounts a past experience involving a 'sea tomb' and the disappearance of a woman named Wen Jin.",
      "level": 1
    },
    {
      "id": "3.1",
      "text": "Third Uncle expresses regret about getting involved in a 'sea tomb' expedition.",
      "level": 2
    },
    {
      "id": "3.2",
      "text": "Wen Jin, a 'Mòjīn' (tomb raider) from the northern school, was Third Uncle's former partner and was an archaeologist.",
      "level": 2
    },
    {
      "id": "3.3",
      "text": "They were known as a 'divine carving knightly couple' in the tomb raiding community.",
      "level": 2
    },
    {
      "id": "3.4",
      "text": "Wen Jin disappeared during an expedition.",
      "level": 2
    },
    {
      "id": "3.5",
      "text": "Third Uncle accompanied Wen Jin and her archaeology classmates on a shipwreck archaeological survey in Xisha.",
      "level": 2
    },
    {
      "id": "3.6",
      "text": "The discovery of submerged objects was surprisingly large.",
      "level": 2
    },
    {
      "id": "4",
      "text": "Detailed account of the shipwreck expedition in Xisha.",
      "level": 1
    },
    {
      "id": "4.1",
      "text": "The expedition took place over a decade ago.",
      "level": 2
    },
    {
      "id": "4.2",
      "text": "Third Uncle, inexperienced in sea tomb raiding, boasted to Wen Jin.",
      "level": 2
    },
    {
      "id": "4.3",
      "text": "They chartered a fishing boat and reached the Wánjiāo reef area.",
      "level": 2
    },
    {
      "id": "4.4",
      "text": "The area was known for shipwrecks and was a dangerous part of the ancient maritime Silk Road.",
      "level": 2
    },
    {
      "id": "4.5",
      "text": "The seabed was covered with Qinghua porcelain, indicating a significant shipwreck.",
      "level": 2
    },
    {
      "id": "4.6",
      "text": "The porcelain pieces were mostly damaged and covered in marine life.",
      "level": 2
    },
    {
      "id": "4.7",
      "text": "Third Uncle was disheartened by the poor condition of the porcelain.",
      "level": 2
    },
    {
      "id": "4.8",
      "text": "Third Uncle became a de facto leader of the archaeology team due to his knowledge of porcelain.",
      "level": 2
    },
    {
      "id": "5",
      "text": "An incident leads to the discovery of a snake-browed bronze fish and suspicion of a submerged tomb.",
      "level": 1
    },
    {
      "id": "5.1",
      "text": "An archaeology team member went missing during an evening search.",
      "level": 2
    },
    {
      "id": "5.2",
      "text": "The missing person's body was found trapped in coral, clutching a snake-browed bronze fish.",
      "level": 2
    },
    {
      "id": "5.3",
      "text": "Third Uncle suspected the person had discovered something significant in the seabed.",
      "level": 2
    },
    {
      "id": "5.4",
      "text": "Third Uncle used the snake-browed bronze fish as a clue to motivate the team for a thorough search.",
      "level": 2
    },
    {
      "id": "5.5",
      "text": "The search revealed over forty large, identical stone anchors.",
      "level": 2
    },
    {
      "id": "5.6",
      "text": "Third Uncle hypothesized the anchors belonged to a single, massive ship, suggesting a 'sunken ship burial tomb'.",
      "level": 2
    },
    {
      "id": "6",
      "text": "Discussion about the nature of a 'sunken ship burial tomb' and the differences between Third Uncle and Wen Jin.",
      "level": 1
    },
    {
      "id": "6.1",
      "text": "Third Uncle is pragmatic and profit-oriented, while Wen Jin is open-minded and driven by archaeological interest.",
      "level": 2
    },
    {
      "id": "6.2",
      "text": "Wen Jin's primary concern is the archaeological value of the tomb.",
      "level": 2
    },
    {
      "id": "6.3",
      "text": "Third Uncle is hesitant due to the prospect of confiscation of artifacts.",
      "level": 2
    },
    {
      "id": "6.4",
      "text": "Wen Jin persuades Third Uncle to cooperate by framing it as archaeological research.",
      "level": 2
    },
    {
      "id": "7",
      "text": "Third Uncle devises a strategy for raiding the sea tomb.",
      "level": 1
    },
    {
      "id": "7.1",
      "text": "Third Uncle acknowledges the difficulty of raiding a sea tomb due to water resistance and unknown seabed conditions.",
      "level": 2
    },
    {
      "id": "7.2",
      "text": "He recalls his grandfather's notes on sea tomb raiding, emphasizing topography.",
      "level": 2
    },
    {
      "id": "7.3",
      "text": "A sunken ship burial tomb is constructed on a ship and sunk into a sea valley or trench.",
      "level": 2
    },
    {
      "id": "7.4",
      "text": "Third Uncle deduces the burial point is likely near the anchor points.",
      "level": 2
    },
    {
      "id": "8",
      "text": "The team locates the tomb and begins excavation.",
      "level": 1
    },
    {
      "id": "8.1",
      "text": "Third Uncle leads the team to the anchor stones and marks a central point.",
      "level": 2
    },
    {
      "id": "8.2",
      "text": "They discover wood, indicating the presence of a structure.",
      "level": 2
    },
    {
      "id": "8.3",
      "text": "A '土' shaped underground palace is identified, spanning over 1000 square meters.",
      "level": 2
    },
    {
      "id": "8.4",
      "text": "The scale of the tomb suggests a person of high status.",
      "level": 2
    },
    {
      "id": "9",
      "text": "Discussion and planning for entering the submerged tomb.",
      "level": 1
    },
    {
      "id": "9.1",
      "text": "The team discusses the potential for water ingress into the tomb.",
      "level": 2
    },
    {
      "id": "9.2",
      "text": "The presence of air pockets is inferred from excavated wood fragments.",
      "level": 2
    },
    {
      "id": "9.3",
      "text": "The difficulty of digging a 'tomb raiding hole' in the sandy seabed is acknowledged.",
      "level": 2
    },
    {
      "id": "9.4",
      "text": "A plan to use explosives to clear sand and then dig a sloping tunnel is devised.",
      "level": 2
    },
    {
      "id": "9.5",
      "text": "A compromise is reached to send the deceased person's body back while the team continues the excavation.",
      "level": 2
    },
    {
      "id": "10",
      "text": "The excavation is underway, but concerns arise due to the delayed return of the main boat.",
      "level": 1
    },
    {
      "id": "10.1",
      "text": "The excavation progresses faster than expected.",
      "level": 2
    },
    {
      "id": "10.2",
      "text": "After four days, the team reaches the tomb wall, but the main boat has not returned.",
      "level": 2
    },
    {
      "id": "10.3",
      "text": "Third Uncle attempts to maintain order and morale among the worried team members.",
      "level": 2
    },
    {
      "id": "11",
      "text": "The structure of the tomb's outer wall is examined.",
      "level": 1
    },
    {
      "id": "11.1",
      "text": "The bricks of the outer wall are hollow, possibly to reduce weight.",
      "level": 2
    },
    {
      "id": "11.2",
      "text": "Small holes in the wall suggest the tomb was designed to be filled with water.",
      "level": 2
    },
    {
      "id": "11.3",
      "text": "The narrator reflects that underwater traps and mechanisms would be ineffective due to water resistance.",
      "level": 2
    },
    {
      "id": "12",
      "text": "Entry into a second tomb wall reveals a hidden passage.",
      "level": 1
    },
    {
      "id": "12.1",
      "text": "Behind the outer wall, they find another wall with larger bricks and sealed with white plaster.",
      "level": 2
    },
    {
      "id": "12.2",
      "text": "A square passage is discovered on the inner wall, indicating entry is not through digging.",
      "level": 2
    },
    {
      "id": "13",
      "text": "A discussion about the tomb's design and an unexpected geological event.",
      "level": 1
    },
    {
      "id": "13.1",
      "text": "The tomb has a double-layered wall system with the outer space filled with seawater.",
      "level": 2
    },
    {
      "id": "13.2",
      "text": "The design likely utilizes air pressure to retain air in an inner chamber.",
      "level": 2
    },
    {
      "id": "13.3",
      "text": "A plan is made for three people to explore the passage with oxygen tanks.",
      "level": 2
    },
    {
      "id": "13.4",
      "text": "Suddenly, the reef they are on rises significantly, revealing a dark line approaching on the horizon.",
      "level": 2
    },
    {
      "id": "13.5",
      "text": "A student named Li Siding identifies the approaching phenomenon as a major storm.",
      "level": 2
    },
    {
      "id": "14",
      "text": "The imminent storm forces a desperate decision to seek refuge in the tomb.",
      "level": 1
    },
    {
      "id": "14.1",
      "text": "Li Siding explains that the receding water is evidence of an approaching storm and potential tsunami.",
      "level": 2
    },
    {
      "id": "14.2",
      "text": "The team members panic, but Third Uncle remains calm.",
      "level": 2
    },
    {
      "id": "14.3",
      "text": "Third Uncle quickly assesses survival options and decides the tomb is the only viable refuge.",
      "level": 2
    },
    {
      "id": "14.4",
      "text": "He convinces the team to enter the tomb to escape the storm.",
      "level": 2
    },
    {
      "id": "15",
      "text": "The team enters the tomb passage.",
      "level": 1
    },
    {
      "id": "15.1",
      "text": "Third Uncle establishes underwater hand signals for communication.",
      "level": 2
    },
    {
      "id": "15.2",
      "text": "The tomb passage gradually narrows.",
      "level": 2
    },
    {
      "id": "15.3",
      "text": "The passage walls are decorated with human face reliefs, obscured by marine growth.",
      "level": 2
    },
    {
      "id": "15.4",
      "text": "The team gets lost and tired in the narrow, winding passage.",
      "level": 2
    },
    {
      "id": "16",
      "text": "A startling discovery is made within the passage.",
      "level": 1
    },
    {
      "id": "16.1",
      "text": "Wen Jin signals to Third Uncle that there is an extra person in the group.",
      "level": 2
    },
    {
      "id": "16.2",
      "text": "Upon counting, an unidentified ninth individual is indeed present.",
      "level": 2
    },
    {
      "id": "17",
      "text": "Encounter with a mysterious entity in the tomb passage.",
      "level": 1
    },
    {
      "id": "17.1",
      "text": "The ninth individual is described as shadowy and not clearly human.",
      "level": 2
    },
    {
      "id": "17.2",
      "text": "Third Uncle investigates, armed with a dagger.",
      "level": 2
    },
    {
      "id": "17.3",
      "text": "The entity mimics Li Siding's movements.",
      "level": 2
    },
    {
      "id": "17.4",
      "text": "Under the light of a lamp, the entity reveals a monstrous, scaled face before fleeing.",
      "level": 2
    },
    {
      "id": "17.5",
      "text": "Li Siding is terrified and attempts to remove his helmet.",
      "level": 2
    },
    {
      "id": "18",
      "text": "An unexpected mechanism activates, leading to a violent disorientation.",
      "level": 1
    },
    {
      "id": "18.1",
      "text": "Third Uncle pushes Li Siding against a wall, triggering a hidden mechanism.",
      "level": 2
    },
    {
      "id": "18.2",
      "text": "Water rushes into the wall cavity, and the team is sucked into a passage.",
      "level": 2
    },
    {
      "id": "18.3",
      "text": "The team experiences intense physical disorientation.",
      "level": 2
    },
    {
      "id": "19",
      "text": "Emergence into a chamber with a pleasant aroma and a surprising discovery.",
      "level": 1
    },
    {
      "id": "19.1",
      "text": "Third Uncle and the others emerge from the water into a chamber.",
      "level": 2
    },
    {
      "id": "19.2",
      "text": "The chamber is filled with a pleasant, uplifting fragrance.",
      "level": 2
    },
    {
      "id": "19.3",
      "text": "The chamber is identified as a side chamber, not the main tomb, containing porcelain funerary objects.",
      "level": 2
    },
    {
      "id": "19.4",
      "text": "The walls are adorned with heavily corroded murals depicting human figures with distended bellies.",
      "level": 2
    },
    {
      "id": "20",
      "text": "The murals and the entity are linked to the concept of 'sea ghosts'.",
      "level": 1
    },
    {
      "id": "20.1",
      "text": "Li Siding identifies the tomb as a 'sea ghost tomb' based on the murals.",
      "level": 2
    },
    {
      "id": "20.2",
      "text": "The narrator suspects the earlier entity was a sea ghost.",
      "level": 2
    },
    {
      "id": "20.3",
      "text": "Third Uncle decides to keep his suspicions about the sea ghost secret to avoid panic.",
      "level": 2
    },
    {
      "id": "21",
      "text": "The team finds refuge in the side chamber and discusses their situation.",
      "level": 1
    },
    {
      "id": "21.1",
      "text": "The team is instructed to stay in the chamber for their allotted refuge time.",
      "level": 2
    },
    {
      "id": "21.2",
      "text": "The porcelain artifacts are identified as Ming Dynasty.",
      "level": 2
    },
    {
      "id": "21.3",
      "text": "The narrator speculates it might be a tomb of Shen Wansan's clan.",
      "level": 2
    },
    {
      "id": "21.4",
      "text": "Third Uncle and Wen Jin share a moment of affection.",
      "level": 2
    },
    {
      "id": "22",
      "text": "Third Uncle falls asleep in the chamber.",
      "level": 1
    },
    {
      "id": "22.1",
      "text": "The pleasant fragrance and the exertion of diving induce deep sleep in Third Uncle.",
      "level": 2
    },
    {
      "id": "22.2",
      "text": "He instructs Wen Jin to wake him when the time is up.",
      "level": 2
    },
    {
      "id": "23",
      "text": "Third Uncle awakens alone in the chamber.",
      "level": 1
    },
    {
      "id": "23.1",
      "text": "He finds himself alone, with no trace of the others.",
      "level": 2
    },
    {
      "id": "23.2",
      "text": "He discovers the entrance to the main tomb is gone, and he is in an unfamiliar location with a golden nanmu coffin.",
      "level": 2
    },
    {
      "id": "23.3",
      "text": "Water is continuously emerging from the coffin, suggesting something inside.",
      "level": 2
    },
    {
      "id": "23.4",
      "text": "Terrified, Third Uncle jumps back into a spring-like opening and escapes.",
      "level": 2
    },
    {
      "id": "23.5",
      "text": "He emerges into daylight to find rescue boats, realizing a full day has passed since he entered the tomb.",
      "level": 2
    },
    {
      "id": "24",
      "text": "The narrator expresses doubt about Third Uncle's account and his own curiosity.",
      "level": 1
    },
    {
      "id": "24.1",
      "text": "The narrator suspects Third Uncle is withholding crucial information.",
      "level": 2
    },
    {
      "id": "25",
      "text": "Third Uncle explains the disappearance of the others and his inability to find the tomb again.",
      "level": 1
    },
    {
      "id": "25.1",
      "text": "He fainted upon reaching the rescue boat and was hospitalized for a week.",
      "level": 2
    },
    {
      "id": "25.2",
      "text": "He was unable to locate the specific coordinates of the tomb to return.",
      "level": 2
    },
    {
      "id": "25.3",
      "text": "Official records confirm the disappearance of the young people, including Wen Jin.",
      "level": 2
    },
    {
      "id": "25.4",
      "text": "Third Uncle expresses deep regret and guilt over the incident.",
      "level": 2
    },
    {
      "id": "26",
      "text": "Third Uncle theorizes about his survival and a potential connection to an artifact.",
      "level": 1
    },
    {
      "id": "26.1",
      "text": "He believes the snake-browed bronze fish might be the reason he survived.",
      "level": 2
    },
    {
      "id": "27",
      "text": "The narrator ponders a connection between the shipwreck tomb and a 'Lu Shang Wang' tomb.",
      "level": 1
    },
    {
      "id": "27.1",
      "text": "The chronological difference between the two tombs makes a direct connection unlikely.",
      "level": 2
    },
    {
      "id": "28",
      "text": "A surprising realization about a member of the expedition.",
      "level": 1
    },
    {
      "id": "28.1",
      "text": "Third Uncle remembers that one of the expedition members resembled 'that quiet little brother' (presumably 'Mute' or a similar character).",
      "level": 2
    },
    {
      "id": "28.2",
      "text": "A pre-expedition photograph confirms the resemblance of a young man to 'that quiet little brother'.",
      "level": 2
    },
    {
      "id": "28.3",
      "text": "Third Uncle questions why this individual has not aged in twenty years.",
      "level": 2
    },
    {
      "id": "29",
      "text": "Third Uncle's sudden departure to Xisha.",
      "level": 1
    },
    {
      "id": "29.1",
      "text": "Third Uncle experiences a sudden realization and decides to return to Xisha immediately.",
      "level": 2
    },
    {
      "id": "30",
      "text": "The narrator's financial predicament and decision to sell an artifact.",
      "level": 1
    },
    {
      "id": "30.1",
      "text": "The narrator is left with significant expenses and dwindling cash.",
      "level": 2
    },
    {
      "id": "30.2",
      "text": "He decides to sell a 'golden nanmu coffin set' to cover costs.",
      "level": 2
    },
    {
      "id": "31",
      "text": "The narrator visits a local antique market to sell the artifact.",
      "level": 1
    },
    {
      "id": "31.1",
      "text": "He is directed to Yingxiongshan Market, known for antiques and calligraphy, but also for fakes.",
      "level": 2
    },
    {
      "id": "32",
      "text": "Encounter with an antique dealer who recognizes a 'sea ghost' artifact.",
      "level": 1
    },
    {
      "id": "32.1",
      "text": "The narrator notices a bronze incense burner with carvings of pregnant figures, similar to the tomb murals.",
      "level": 2
    },
    {
      "id": "32.2",
      "text": "The dealer identifies the carvings as 'Jin Po' (禁婆) and the artifact as from Hainan.",
      "level": 2
    },
    {
      "id": "32.3",
      "text": "The dealer explains that 'Jin Po' is a type of ghost, and the incense burner contains its bone, emitting a scent.",
      "level": 2
    },
    {
      "id": "33",
      "text": "The narrator attempts to negotiate the price of the incense burner and ultimately offers the coffin set for sale.",
      "level": 1
    },
    {
      "id": "33.1",
      "text": "The narrator expresses interest in buying the 'bone incense' but not the entire burner due to its condition.",
      "level": 2
    },
    {
      "id": "33.2",
      "text": "The dealer, recognizing the value of the coffin set, treats the narrator with increased respect and offers superior tea.",
      "level": 2
    },
    {
      "id": "33.3",
      "text": "The narrator, identifying himself as 'Wu', inquires about the dealer's name, 'Lao Hai'.",
      "level": 2
    },
    {
      "id": "34",
      "text": "A lucrative deal is struck for the golden nanmu coffin set.",
      "level": 1
    },
    {
      "id": "34.1",
      "text": "Lao Hai agrees to buy the coffin set for 1.2 million RMB, implying a higher sale to his client.",
      "level": 2
    },
    {
      "id": "34.2",
      "text": "Lao Hai offers the 'Jin Po' incense burner as a gift to the narrator.",
      "level": 2
    },
    {
      "id": "35",
      "text": "The narrator settles his debts and enjoys a period of leisure.",
      "level": 1
    },
    {
      "id": "35.1",
      "text": "The narrator pays off all outstanding bills, including hospital fees for Pan Zi and financial support for others.",
      "level": 2
    },
    {
      "id": "35.2",
      "text": "He then indulges in leisure activities like sightseeing and fishing for about a week.",
      "level": 2
    },
    {
      "id": "36",
      "text": "A mysterious phone call initiates a new development.",
      "level": 1
    },
    {
      "id": "36.1",
      "text": "Upon returning from his leisure, the narrator receives a call from an unknown man asking if he knows Wu Sansheng.",
      "level": 2
    }
  ],
  "concepts": [
    {
      "name": "盗墓笔记之2：怒海潜沙",
      "frequency": 1,
      "context": "The title of the document, indicating the subject matter."
    },
    {
      "name": "蛇眉铜鱼",
      "frequency": 4,
      "context": "A significant artifact, a bronze fish with snake-like eyebrows, central to the early plot."
    },
    {
      "name": "三叔",
      "frequency": 27,
      "context": "Wu Sansheng, a key character, experienced tomb raider, and the narrator's uncle."
    },
    {
      "name": "海货",
      "frequency": 2,
      "context": "Antiques salvaged from the sea, often covered in dirt and difficult to clean."
    },
    {
      "name": "海斗",
      "frequency": 5,
      "context": "Tomb raiding in the sea, a more dangerous and complex undertaking than land tomb raiding."
    },
    {
      "name": "文锦",
      "frequency": 10,
      "context": "A former partner of Third Uncle, an archaeologist, and a central figure in the past expedition."
    },
    {
      "name": "摸金",
      "frequency": 2,
      "context": "A term associated with tomb raiding, specifically a school or method of tomb raiding."
    },
    {
      "name": "北派",
      "frequency": 1,
      "context": "Refers to a 'northern school' of tomb raiding."
    },
    {
      "name": "倒斗",
      "frequency": 10,
      "context": "The act of tomb raiding or grave robbing."
    },
    {
      "name": "西沙",
      "frequency": 3,
      "context": "The location of the shipwreck and sea tomb expedition."
    },
    {
      "name": "沉船",
      "frequency": 4,
      "context": "Shipwrecks, the source of many artifacts in the story and the basis of the tomb."
    },
    {
      "name": "青花瓷器",
      "frequency": 3,
      "context": "Blue and white porcelain, a common find in shipwrecks and ancient tombs."
    },
    {
      "name": "沉船葬海底墓",
      "frequency": 3,
      "context": "A rare burial method where a tomb is constructed on a ship and sunk to the seabed."
    },
    {
      "name": "考古",
      "frequency": 5,
      "context": "Archaeology, the scientific study of human history and prehistory."
    },
    {
      "name": "石碇",
      "frequency": 2,
      "context": "Stone anchors, used to secure ships, in this case, indicating a very large vessel."
    },
    {
      "name": "地宫",
      "frequency": 1,
      "context": "Underground palace or tomb complex."
    },
    {
      "name": "盗洞",
      "frequency": 3,
      "context": "A hole dug into a tomb for entry."
    },
    {
      "name": "风暴",
      "frequency": 4,
      "context": "A storm, a major environmental threat faced by the characters."
    },
    {
      "name": "海啸",
      "frequency": 1,
      "context": "A tsunami, a large ocean wave caused by seismic activity or other disturbances."
    },
    {
      "name": "氧气瓶",
      "frequency": 3,
      "context": "Oxygen tanks, essential equipment for underwater exploration."
    },
    {
      "name": "墓道",
      "frequency": 5,
      "context": "Passage or corridor within a tomb."
    },
    {
      "name": "壁画",
      "frequency": 4,
      "context": "Murals or paintings on tomb walls, providing clues and context."
    },
    {
      "name": "海鬼",
      "frequency": 5,
      "context": "Sea ghosts, supernatural entities associated with the sea and the tomb."
    },
    {
      "name": "禁婆",
      "frequency": 4,
      "context": "A type of 'sea ghost' associated with a particular scent and bone artifact."
    },
    {
      "name": "骨香",
      "frequency": 2,
      "context": "Fragrance emanating from the 'Jin Po's bone', believed to induce restful sleep."
    },
    {
      "name": "耳室",
      "frequency": 4,
      "context": "Side chamber or antechamber within a tomb."
    },
    {
      "name": "金丝楠木棺",
      "frequency": 2,
      "context": "A coffin made of precious golden nanmu wood, found in an unexpected location."
    },
    {
      "name": "潘子",
      "frequency": 2,
      "context": "A character who is in a coma, requiring significant medical expenses."
    },
    {
      "name": "古玩",
      "frequency": 5,
      "context": "Antiques or curios, the subject of trade and collection."
    },
    {
      "name": "英雄山市场",
      "frequency": 1,
      "context": "A market where antiques and calligraphy are traded."
    },
    {
      "name": "老海",
      "frequency": 3,
      "context": "The antique dealer who buys the coffin set."
    },
    {
      "name": "吴三省",
      "frequency": 1,
      "context": "The full name of Third Uncle, Wu Sansheng."
    },
    {
      "name": "小哥",
      "frequency": 3,
      "context": "A mysterious, ageless character often referred to as 'Mute' or similar, with an uncanny resemblance to a tomb expedition member."
    },
    {
      "name": "合照",
      "frequency": 1,
      "context": "A photograph from before the expedition that reveals a significant detail."
    }
  ],
  "relations": [
    {
      "source": "蛇眉铜鱼",
      "target": "三叔",
      "type": "possessed_by"
    },
    {
      "source": "蛇眉铜鱼",
      "target": " Narrator",
      "type": "found_by"
    },
    {
      "source": "海货",
      "target": "蛇眉铜鱼",
      "type": "is_a_type_of"
    },
    {
      "source": "海货",
      "target": "海货",
      "type": "characterized_by"
    },
    {
      "source": "海斗",
      "target": "沉船葬海底墓",
      "type": "can_be_a"
    },
    {
      "source": "文锦",
      "target": "三叔",
      "type": "former_partner"
    },
    {
      "source": "文锦",
      "target": "考古",
      "type": "practitioner_of"
    },
    {
      "source": "考古",
      "target": "西沙",
      "type": "location_of"
    },
    {
      "source": "沉船葬海底墓",
      "target": "青花瓷器",
      "type": "associated_with"
    },
    {
      "source": "沉船葬海底墓",
      "target": "石碇",
      "type": "indicated_by"
    },
    {
      "source": "沉船葬海底墓",
      "target": "地宫",
      "type": "contains"
    },
    {
      "source": "盗洞",
      "target": "海斗",
      "type": "method_of_entry"
    },
    {
      "source": "风暴",
      "target": "海斗",
      "type": "danger_to"
    },
    {
      "source": "氧气瓶",
      "target": "海斗",
      "type": "essential_for"
    },
    {
      "source": "墓道",
      "target": "沉船葬海底墓",
      "type": "part_of"
    },
    {
      "source": "壁画",
      "target": "沉船葬海底墓",
      "type": "found_in"
    },
    {
      "source": "海鬼",
      "target": "沉船葬海底墓",
      "type": "inhabitant_of"
    },
    {
      "source": "禁婆",
      "target": "海鬼",
      "type": "is_a_type_of"
    },
    {
      "source": "骨香",
      "target": "禁婆",
      "type": "emitted_by"
    },
    {
      "source": "耳室",
      "target": "沉船葬海底墓",
      "type": "part_of"
    },
    {
      "source": "金丝楠木棺",
      "target": "沉船葬海底墓",
      "type": "unexpectedly_found_in"
    },
    {
      "source": "潘子",
      "target": " Narrator",
      "type": "dependent_on_for_care"
    },
    {
      "source": "古玩",
      "target": "英雄山市场",
      "type": "traded_at"
    },
    {
      "source": "老海",
      "target": "古玩",
      "type": "dealer_of"
    },
    {
      "source": "吴三省",
      "target": "小哥",
      "type": "resembles"
    },
    {
      "source": "合照",
      "target": "小哥",
      "type": "depicts"
    },
    {
      "source": "三叔",
      "target": "西沙",
      "type": "returning_to"
    }
  ],
  "hierarchy": {
    "main_topics": [
      "The Discovery of the Snake-Browed Bronze Fish",
      "Third Uncle's Past Expedition and Wen Jin's Disappearance",
      "The Sunken Ship Burial Tomb Expedition",
      "The Storm and Refuge in the Tomb",
      "Encounter with Supernatural Entities",
      "The Mysterious Disappearances and Third Uncle's Escape",
      "The Aftermath and the Revelation of 'Little Brother's' Past"
    ],
    "structure": "The document follows a narrative structure, beginning with the discovery of a key artifact, then delving into a past expedition through flashbacks and anecdotes. It progresses through the discovery and exploration of a sunken tomb, a natural disaster forcing the characters into the tomb, and encounters with supernatural elements. The story culminates in the mysterious disappearance of the expedition members and the protagonist's escape, followed by revelations about a shared past and a sudden departure for further investigation."
  }
}