{
  "propositions": [
    {
      "id": "1",
      "text": "行路（女尊）",
      "level": 1
    },
    {
      "id": "1.1",
      "text": "序言",
      "level": 2
    },
    {
      "id": "1.2",
      "text": "第一章",
      "level": 2
    }
  ],
  "concepts": [
    {
      "name": "行路",
      "frequency": 1,
      "context": "Title of the document."
    },
    {
      "name": "女尊",
      "frequency": 1,
      "context": "Subtitle of the document, indicating a theme of female superiority."
    },
    {
      "name": "序言",
      "frequency": 1,
      "context": "Section heading: Preface."
    },
    {
      "name": "第一章",
      "frequency": 1,
      "context": "Section heading: Chapter One."
    },
    {
      "name": "N",
      "frequency": 602,
      "context": "Appears to be a placeholder or noise character within the text, often used in conjunction with other characters to form what might be intended as words or phrases in an unidentifiable script."
    },
    {
      "name": "0",
      "frequency": 162,
      "context": "Numerical character, often appearing in sequences with other characters."
    },
    {
      "name": "W",
      "frequency": 50,
      "context": "Appears to be a character or part of an unidentifiable script, often found in close proximity to other characters."
    },
    {
      "name": "T",
      "frequency": 47,
      "context": "Appears to be a character or part of an unidentifiable script."
    },
    {
      "name": "Y",
      "frequency": 57,
      "context": "Appears to be a character or part of an unidentifiable script."
    },
    {
      "name": "b",
      "frequency": 168,
      "context": "Appears to be a character or part of an unidentifiable script."
    },
    {
      "name": "R",
      "frequency": 31,
      "context": "Appears to be a character or part of an unidentifiable script."
    },
    {
      "name": "Q",
      "frequency": 54,
      "context": "Appears to be a character or part of an unidentifiable script."
    },
    {
      "name": "S",
      "frequency": 109,
      "context": "Appears to be a character or part of an unidentifiable script."
    },
    {
      "name": "g",
      "frequency": 102,
      "context": "Appears to be a character or part of an unidentifiable script."
    },
    {
      "name": "v",
      "frequency": 86,
      "context": "Appears to be a character or part of an unidentifiable script."
    },
    {
      "name": "l",
      "frequency": 53,
      "context": "Appears to be a character or part of an unidentifiable script."
    },
    {
      "name": "m",
      "frequency": 27,
      "context": "Appears to be a character or part of an unidentifiable script."
    },
    {
      "name": "c",
      "frequency": 74,
      "context": "Appears to be a character or part of an unidentifiable script."
    },
    {
      "name": "k",
      "frequency": 34,
      "context": "Appears to be a character or part of an unidentifiable script."
    },
    {
      "name": "u",
      "frequency": 20,
      "context": "Appears to be a character or part of an unidentifiable script."
    },
    {
      "name": "x",
      "frequency": 15,
      "context": "Appears to be a character or part of an unidentifiable script."
    },
    {
      "name": "q",
      "frequency": 7,
      "context": "Appears to be a character or part of an unidentifiable script."
    },
    {
      "name": "p",
      "frequency": 46,
      "context": "Appears to be a character or part of an unidentifiable script."
    },
    {
      "name": "f",
      "frequency": 21,
      "context": "Appears to be a character or part of an unidentifiable script."
    },
    {
      "name": "i",
      "frequency": 17,
      "context": "Appears to be a character or part of an unidentifiable script."
    },
    {
      "name": "e",
      "frequency": 52,
      "context": "Appears to be a character or part of an unidentifiable script."
    },
    {
      "name": "a",
      "frequency": 29,
      "context": "Appears to be a character or part of an unidentifiable script."
    },
    {
      "name": "o",
      "frequency": 26,
      "context": "Appears to be a character or part of an unidentifiable script."
    },
    {
      "name": "s",
      "frequency": 34,
      "context": "Appears to be a character or part of an unidentifiable script."
    },
    {
      "name": "h",
      "frequency": 44,
      "context": "Appears to be a character or part of an unidentifiable script."
    },
    {
      "name": "d",
      "frequency": 16,
      "context": "Appears to be a character or part of an unidentifiable script."
    },
    {
      "name": "w",
      "frequency": 56,
      "context": "Appears to be a character or part of an unidentifiable script."
    },
    {
      "name": "z",
      "frequency": 11,
      "context": "Appears to be a character or part of an unidentifiable script."
    },
    {
      "name": "j",
      "frequency": 10,
      "context": "Appears to be a character or part of an unidentifiable script."
    },
    {
      "name": "r",
      "frequency": 28,
      "context": "Appears to be a character or part of an unidentifiable script."
    },
    {
      "name": "n",
      "frequency": 31,
      "context": "Appears to be a character or part of an unidentifiable script."
    },
    {
      "name": "t",
      "frequency": 27,
      "context": "Appears to be a character or part of an unidentifiable script."
    },
    {
      "name": "I",
      "frequency": 7,
      "context": "Appears to be a character or part of an unidentifiable script."
    },
    {
      "name": "ل",
      "frequency": 3,
      "context": "Arabic letter Lam, appearing in the context of potentially garbled text."
    },
    {
      "name": "،",
      "frequency": 3,
      "context": "Arabic comma, appearing in the context of potentially garbled text."
    },
    {
      "name": "؛",
      "frequency": 1,
      "context": "Arabic semicolon, appearing in the context of potentially garbled text."
    },
    {
      "name": "ا",
      "frequency": 4,
      "context": "Arabic letter Alef, appearing in the context of potentially garbled text."
    },
    {
      "name": "ن",
      "frequency": 1,
      "context": "Arabic letter Nun, appearing in the context of potentially garbled text."
    },
    {
      "name": "ب",
      "frequency": 1,
      "context": "Arabic letter Ba, appearing in the context of potentially garbled text."
    },
    {
      "name": "له",
      "frequency": 1,
      "context": "Arabic letters Lam-He, appearing in the context of potentially garbled text."
    },
    {
      "name": "،؛",
      "frequency": 1,
      "context": "Arabic comma and semicolon, appearing in the context of potentially garbled text."
    },
    {
      "name": "ال",
      "frequency": 1,
      "context": "Arabic letters Alef-Lam, appearing in the context of potentially garbled text."
    },
    {
      "name": "الل",
      "frequency": 1,
      "context": "Arabic letters Alef-Lam-Lam, appearing in the context of potentially garbled text."
    },
    {
      "name": "الله",
      "frequency": 1,
      "context": "Arabic letters Alef-Lam-Lam-He, appearing in the context of potentially garbled text."
    },
    {
      "name": "الله،",
      "frequency": 1,
      "context": "Arabic letters Alef-Lam-Lam-He-Comma, appearing in the context of potentially garbled text."
    },
    {
      "name": "الله،؛",
      "frequency": 1,
      "context": "Arabic letters Alef-Lam-Lam-He-Semicolon, appearing in the context of potentially garbled text."
    },
    {
      "name": "الله،؛0",
      "frequency": 1,
      "context": "Arabic letters Alef-Lam-Lam-He-Semicolon-Zero, appearing in the context of potentially garbled text."
    },
    {
      "name": "الله،؛0L",
      "frequency": 1,
      "context": "Arabic letters Alef-Lam-Lam-He-Semicolon-Zero-L, appearing in the context of potentially garbled text."
    },
    {
      "name": "الله،؛0L s",
      "frequency": 1,
      "context": "Arabic letters Alef-Lam-Lam-He-Semicolon-Zero-L-S, appearing in the context of potentially garbled text."
    },
    {
      "name": "الله،؛0L sY",
      "frequency": 1,
      "context": "Arabic letters Alef-Lam-Lam-He-Semicolon-Zero-L-S-Y, appearing in the context of potentially garbled text."
    },
    {
      "name": "الله،؛0L sY \\",
      "frequency": 1,
      "context": "Arabic letters Alef-Lam-Lam-He-Semicolon-Zero-L-S-Y-Backslash, appearing in the context of potentially garbled text."
    },
    {
      "name": "الله،؛0L sY \\ 0",
      "frequency": 1,
      "context": "Arabic letters Alef-Lam-Lam-He-Semicolon-Zero-L-S-Y-Backslash-Zero, appearing in the context of potentially garbled text."
    },
    {
      "name": "الله،؛0L sY \\ 0mg",
      "frequency": 1,
      "context": "Arabic letters Alef-Lam-Lam-He-Semicolon-Zero-L-S-Y-Backslash-Zero-M-G, appearing in the context of potentially garbled text."
    },
    {
      "name": "الله،؛0L sY \\ 0mg]N",
      "frequency": 1,
      "context": "Arabic letters Alef-Lam-Lam-He-Semicolon-Zero-L-S-Y-Backslash-Zero-M-G-Bracket-N, appearing in the context of potentially garbled text."
    },
    {
      "name": "الله،؛0L sY \\ 0mg]N 0",
      "frequency": 1,
      "context": "Arabic letters Alef-Lam-Lam-He-Semicolon-Zero-L-S-Y-Backslash-Zero-M-G-Bracket-N-Zero, appearing in the context of potentially garbled text."
    },
    {
      "name": "الله،؛0L sY \\ 0mg]N 0 ,{Nz",
      "frequency": 1,
      "context": "Arabic letters Alef-Lam-Lam-He-Semicolon-Zero-L-S-Y-Backslash-Zero-M-G-Bracket-N-Zero-Comma-CurlyBrace-N-Z, appearing in the context of potentially garbled text."
    },
    {
      "name": "الله،؛0L sY \\ 0mg]N 0 ,{Nz 0",
      "frequency": 1,
      "context": "Arabic letters Alef-Lam-Lam-He-Semicolon-Zero-L-S-Y-Backslash-Zero-M-G-Bracket-N-Zero-Comma-CurlyBrace-N-Z-Zero, appearing in the context of potentially garbled text."
    },
    {
      "name": "الله،؛0L sY \\ 0mg]N 0 ,{Nz 0 0",
      "frequency": 1,
      "context": "Arabic letters Alef-Lam-Lam-He-Semicolon-Zero-L-S-Y-Backslash-Zero-M-G-Bracket-N-Zero-Comma-CurlyBrace-N-Z-Zero-Zero, appearing in the context of potentially garbled text."
    },
    {
      "name": "الله،؛0L sY \\ 0mg]N 0 ,{Nz 0 0 b",
      "frequency": 1,
      "context": "Arabic letters Alef-Lam-Lam-He-Semicolon-Zero-L-S-Y-Backslash-Zero-M-G-Bracket-N-Zero-Comma-CurlyBrace-N-Z-Zero-Zero-B, appearing in the context of potentially garbled text."
    },
    {
      "name": "الله،؛0L sY \\ 0mg]N 0 ,{Nz 0 0 b N*NsNv",
      "frequency": 1,
      "context": "Arabic letters Alef-Lam-Lam-He-Semicolon-Zero-L-S-Y-Backslash-Zero-M-G-Bracket-N-Zero-Comma-CurlyBrace-N-Z-Zero-Zero-B-N-Asterisk-N-s-N-v, appearing in the context of potentially garbled text."
    },
    {
      "name": "الله،؛0L sY \\ 0mg]N 0 ,{Nz 0 0 b N*NsNv tS",
      "frequency": 1,
      "context": "Arabic letters Alef-Lam-Lam-He-Semicolon-Zero-L-S-Y-Backslash-Zero-M-G-Bracket-N-Zero-Comma-CurlyBrace-N-Z-Zero-Zero-B-N-Asterisk-N-s-N-v-T-S, appearing in the context of potentially garbled text."
    },
    {
      "name": "الله،؛0L sY \\ 0mg]N 0 ,{Nz 0 0 b N*NsNv tS 0r q\\",
      "frequency": 1,
      "context": "Arabic letters Alef-Lam-Lam-He-Semicolon-Zero-L-S-Y-Backslash-Zero-M-G-Bracket-N-Zero-Comma-CurlyBrace-N-Z-Zero-Zero-B-N-Asterisk-N-s-N-v-T-S-Zero-r-q-Backslash-Backslash, appearing in the context of potentially garbled text."
    },
    {
      "name": "الله،؛0L sY \\ 0mg]N 0 ,{Nz 0 0 b N*NsNv tS 0r q\\ eQ",
      "frequency": 1,
      "context": "Arabic letters Alef-Lam-Lam-He-Semicolon-Zero-L-S-Y-Backslash-Zero-M-G-Bracket-N-Zero-Comma-CurlyBrace-N-Z-Zero-Zero-B-N-Asterisk-N-s-N-v-T-S-Zero-r-q-Backslash-Backslash-e-Q, appearing in the context of potentially garbled text."
    },
    {
      "name": "الله،؛0L sY \\ 0mg]N 0 ,{Nz 0 0 b N*NsNv tS 0r q\\ eQ q\\m",
      "frequency": 1,
      "context": "Arabic letters Alef-Lam-Lam-He-Semicolon-Zero-L-S-Y-Backslash-Zero-M-G-Bracket-N-Zero-Comma-CurlyBrace-N-Z-Zero-Zero-B-N-Asterisk-N-s-N-v-T-S-Zero-r-q-Backslash-Backslash-e-Q-q-Backslash-Backslash-m, appearing in the context of potentially garbled text."
    },
    {
      "name": "الله،؛0L sY \\ 0mg]N 0 ,{Nz 0 0 b N*NsNv tS 0r q\\ eQ q\\m Y",
      "frequency": 1,
      "context": "Arabic letters Alef-Lam-Lam-He-Semicolon-Zero-L-S-Y-Backslash-Zero-M-G-Bracket-N-Zero-Comma-CurlyBrace-N-Z-Zero-Zero-B-N-Asterisk-N-s-N-v-T-S-Zero-r-q-Backslash-Backslash-e-Q-q-Backslash-Backslash-m-Y, appearing in the context of potentially garbled text."
    },
    {
      "name": "الله،؛0L sY \\ 0mg]N 0 ,{Nz 0 0 b N*NsNv tS 0r q\\ eQ q\\m Y <wMRSmSm",
      "frequency": 1,
      "context": "Arabic letters Alef-Lam-Lam-He-Semicolon-Zero-L-S-Y-Backslash-Zero-M-G-Bracket-N-Zero-Comma-CurlyBrace-N-Z-Zero-Zero-B-N-Asterisk-N-s-N-v-T-S-Zero-r-q-Backslash-Backslash-e-Q-q-Backslash-Backslash-m-Y-Less-W-M-R-S-m-S-m, appearing in the context of potentially garbled text."
    },
    {
      "name": "الله،؛0L sY \\ 0mg]N 0 ,{Nz 0 0 b N*NsNv tS 0r q\\ eQ q\\m Y <wMRSmSm Q~",
      "frequency": 1,
      "context": "Arabic letters Alef-Lam-Lam-He-Semicolon-Zero-L-S-Y-Backslash-Zero-M-G-Bracket-N-Zero-Comma-CurlyBrace-N-Z-Zero-Zero-B-N-Asterisk-N-s-N-v-T-S-Zero-r-q-Backslash-Backslash-e-Q-q-Backslash-Backslash-m-Y-Less-W-M-R-S-m-S-m-Q-Tilde, appearing in the context of potentially garbled text."
    },
    {
      "name": "الله،؛0L sY \\ 0mg]N 0 ,{Nz 0 0 b N*NsNv tS 0r q\\ eQ q\\m Y <wMRSmSm Q~ bwSdke",
      "frequency": 1,
      "context": "Arabic letters Alef-Lam-Lam-He-Semicolon-Zero-L-S-Y-Backslash-Zero-M-G-Bracket-N-Zero-Comma-CurlyBrace-N-Z-Zero-Zero-B-N-Asterisk-N-s-N-v-T-S-Zero-r-q-Backslash-Backslash-e-Q-q-Backslash-Backslash-m-Y-Less-W-M-R-S-m-S-m-Q-Tilde-b-w-S-d-k-e, appearing in the context of potentially garbled text."
    },
    {
      "name": "الله،؛0L sY \\ 0mg]N 0 ,{Nz 0 0 b N*NsNv tS 0r q\\ eQ q\\m Y <wMRSmSm Q~ bwSdke NSvR",
      "frequency": 1,
      "context": "Arabic letters Alef-Lam-Lam-He-Semicolon-Zero-L-S-Y-Backslash-Zero-M-G-Bracket-N-Zero-Comma-CurlyBrace-N-Z-Zero-Zero-B-N-Asterisk-N-s-N-v-T-S-Zero-r-q-Backslash-Backslash-e-Q-q-Backslash-Backslash-m-Y-Less-W-M-R-S-m-S-m-Q-Tilde-b-w-S-d-k-e-N-S-v-R, appearing in the context of potentially garbled text."
    },
    {
      "name": "الله،؛0L sY \\ 0mg]N 0 ,{Nz 0 0 b N*NsNv tS 0r q\\ eQ q\\m Y <wMRSmSm Q~ bwSdke NSvR S_0RmceN",
      "frequency": 1,
      "context": "Arabic letters Alef-Lam-Lam-He-Semicolon-Zero-L-S-Y-Backslash-Zero-M-G-Bracket-N-Zero-Comma-CurlyBrace-N-Z-Zero-Zero-B-N-Asterisk-N-s-N-v-T-S-Zero-r-q-Backslash-Backslash-e-Q-q-Backslash-Backslash-m-Y-Less-W-M-R-S-m-S-m-Q-Tilde-b-w-S-d-k-e-N-S-v-R-S-Underscore-Zero-R-m-c-e-N, appearing in the context of potentially garbled text."
    },
    {
      "name": "الله،؛0L sY \\ 0mg]N 0 ,{Nz 0 0 b N*NsNv tS 0r q\\ eQ q\\m Y <wMRSmSm Q~ bwSdke NSvR S_0RmceN QLReMb",
      "frequency": 1,
      "context": "Arabic letters Alef-Lam-Lam-He-Semicolon-Zero-L-S-Y-Backslash-Zero-M-G-Bracket-N-Zero-Comma-CurlyBrace-N-Z-Zero-Zero-B-N-Asterisk-N-s-N-v-T-S-Zero-r-q-Backslash-Backslash-e-Q-q-Backslash-Backslash-m-Y-Less-W-M-R-S-m-S-m-Q-Tilde-b-w-S-d-k-e-N-S-v-R-S-Underscore-Zero-R-m-c-e-N-Q-L-R-e-M-b, appearing in the context of potentially garbled text."
    },
    {
      "name": "الله،؛0L sY \\ 0mg]N 0 ,{Nz 0 0 b N*NsNv tS 0r q\\ eQ q\\m Y <wMRSmSm Q~ bwSdke NSvR S_0RmceN QLReMb/f",
      "frequency": 1,
      "context": "Arabic letters Alef-Lam-Lam-He-Semicolon-Zero-L-S-Y-Backslash-Zero-M-G-Bracket-N-Zero-Comma-CurlyBrace-N-Z-Zero-Zero-B-N-Asterisk-N-s-N-v-T-S-Zero-r-q-Backslash-Backslash-e-Q-q-Backslash-Backslash-m-Y-Less-W-M-R-S-m-S-m-Q-Tilde-b-w-S-d-k-e-N-S-v-R-S-Underscore-Zero-R-m-c-e-N-Q-L-R-e-M-b-Fslash, appearing in the context of potentially garbled text."
    },
    {
      "name": "الله،؛0L sY \\ 0mg]N 0 ,{Nz 0 0 b N*NsNv tS 0r q\\ eQ q\\m Y <wMRSmSm Q~ bwSdke NSvR S_0RmceN QLReMb/f fzfKN>N",
      "frequency": 1,
      "context": "Arabic letters Alef-Lam-Lam-He-Semicolon-Zero-L-S-Y-Backslash-Zero-M-G-Bracket-N-Zero-Comma-CurlyBrace-N-Z-Zero-Zero-B-N-Asterisk-N-s-N-v-T-S-Zero-r-q-Backslash-Backslash-e-Q-q-Backslash-Backslash-m-Y-Less-W-M-R-S-m-S-m-Q-Tilde-b-w-S-d-k-e-N-S-v-R-S-Underscore-Zero-R-m-c-e-N-Q-L-R-e-M-b-Fslash-f-z-f-K-N-Greater-N, appearing in the context of potentially garbled text."
    },
    {
      "name": "الله،؛0L sY \\ 0mg]N 0 ,{Nz 0 0 b N*NsNv tS 0r q\\ eQ q\\m Y <wMRSmSm Q~ bwSdke NSvR S_0RmceN QLReMb/f fzfKN>N 0S",
      "frequency": 1,
      "context": "Arabic letters Alef-Lam-Lam-He-Semicolon-Zero-L-S-Y-Backslash-Zero-M-G-Bracket-N-Zero-Comma-CurlyBrace-N-Z-Zero-Zero-B-N-Asterisk-N-s-N-v-T-S-Zero-r-q-Backslash-Backslash-e-Q-q-Backslash-Backslash-m-Y-Less-W-M-R-S-m-S-m-Q-Tilde-b-w-S-d-k-e-N-S-v-R-S-Underscore-Zero-R-m-c-e-N-Q-L-R-e-M-b-Fslash-f-z-f-K-N-Greater-N-Zero-S, appearing in the context of potentially garbled text."
    },
    {
      "name": "الله،؛0L sY \\ 0mg]N 0 ,{Nz 0 0 b N*NsNv tS 0r q\\ eQ q\\m Y <wMRSmSm Q~ bwSdke NSvR S_0RmceN QLReMb/f fzfKN>N 0S/fI{N",
      "frequency": 1,
      "context": "Arabic letters Alef-Lam-Lam-He-Semicolon-Zero-L-S-Y-Backslash-Zero-M-G-Bracket-N-Zero-Comma-CurlyBrace-N-Z-Zero-Zero-B-N-Asterisk-N-s-N-v-T-S-Zero-r-q-Backslash-Backslash-e-Q-q-Backslash-Backslash-m-Y-Less-W-M-R-S-m-S-m-Q-Tilde-b-w-S-d-k-e-N-S-v-R-S-Underscore-Zero-R-m-c-e-N-Q-L-R-e-M-b-Fslash-f-z-f-K-N-Greater-N-Zero-S-Fslash-I-CurlyBrace-N, appearing in the context of potentially garbled text."
    },
    {
      "name": "الله،؛0L sY \\ 0mg]N 0 ,{Nz 0 0 b N*NsNv tS 0r q\\ eQ q\\m Y <wMRSmSm Q~ bwSdke NSvR S_0RmceN QLReMb/f fzfKN>N 0S/fI{N Ne*gce",
      "frequency": 1,
      "context": "Arabic letters Alef-Lam-Lam-He-Semicolon-Zero-L-S-Y-Backslash-Zero-M-G-Bracket-N-Zero-Comma-CurlyBrace-N-Z-Zero-Zero-B-N-Asterisk-N-s-N-v-T-S-Zero-r-q-Backslash-Backslash-e-Q-q-Backslash-Backslash-m-Y-Less-W-M-R-S-m-S-m-Q-Tilde-b-w-S-d-k-e-N-S-v-R-S-Underscore-Zero-R-m-c-e-N-Q-L-R-e-M-b-Fslash-f-z-f-K-N-Greater-N-Zero-S-Fslash-I-CurlyBrace-N-N-e-Asterisk-g-c-e, appearing in the context of potentially garbled text."
    },
    {
      "name": "الله،؛0L sY \\ 0mg]N 0 ,{Nz 0 0 b N*NsNv tS 0r q\\ eQ q\\m Y <wMRSmSm Q~ bwSdke NSvR S_0RmceN QLReMb/f fzfKN>N 0S/fI{N Ne*gce NZSm",
      "frequency": 1,
      "context": "Arabic letters Alef-Lam-Lam-He-Semicolon-Zero-L-S-Y-Backslash-Zero-M-G-Bracket-N-Zero-Comma-CurlyBrace-N-Z-Zero-Zero-B-N-Asterisk-N-s-N-v-T-S-Zero-r-q-Backslash-Backslash-e-Q-q-Backslash-Backslash-m-Y-Less-W-M-R-S-m-S-m-Q-Tilde-b-w-S-d-k-e-N-S-v-R-S-Underscore-Zero-R-m-c-e-N-Q-L-R-e-M-b-Fslash-f-z-f-K-N-Greater-N-Zero-S-Fslash-I-CurlyBrace-N-N-e-Asterisk-g-c-e-N-Z-S-m, appearing in the context of potentially garbled text."
    },
    {
      "name": "الله،؛0L sY \\ 0mg]N 0 ,{Nz 0 0 b N*NsNv tS 0r q\\ eQ q\\m Y <wMRSmSm Q~ bwSdke NSvR S_0RmceN QLReMb/f fzfKN>N 0S/fI{N Ne*gce NZSm SI{NN",
      "frequency": 1,
      "context": "Arabic letters Alef-Lam-Lam-He-Semicolon-Zero-L-S-Y-Backslash-Zero-M-G-Bracket-N-Zero-Comma-CurlyBrace-N-Z-Zero-Zero-B-N-Asterisk-N-s-N-v-T-S-Zero-r-q-Backslash-Backslash-e-Q-q-Backslash-Backslash-m-Y-Less-W-M-R-S-m-S-m-Q-Tilde-b-w-S-d-k-e-N-S-v-R-S-Underscore-Zero-R-m-c-e-N-Q-L-R-e-M-b-Fslash-f-z-f-K-N-Greater-N-Zero-S-Fslash-I-CurlyBrace-N-N-e-Asterisk-g-c-e-N-Z-S-m-S-I-CurlyBrace-N-N, appearing in the context of potentially garbled text."
    },
    {
      "name": "الله،؛0L sY \\ 0mg]N 0 ,{Nz 0 0 b N*NsNv tS 0r q\\ eQ q\\m Y <wMRSmSm Q~ bwSdke NSvR S_0RmceN QLReMb/f fzfKN>N 0S/fI{N Ne*gce NZSm SI{NN)Y",
      "frequency": 1,
      "context": "Arabic letters Alef-Lam-Lam-He-Semicolon-Zero-L-S-Y-Backslash-Zero-M-G-Bracket-N-Zero-Comma-CurlyBrace-N-Z-Zero-Zero-B-N-Asterisk-N-s-N-v-T-S-Zero-r-q-Backslash-Backslash-e-Q-q-Backslash-Backslash-m-Y-Less-W-M-R-S-m-S-m-Q-Tilde-b-w-S-d-k-e-N-S-v-R-S-Underscore-Zero-R-m-c-e-N-Q-L-R-e-M-b-Fslash-f-z-f-K-N-Greater-N-Zero-S-Fslash-I-CurlyBrace-N-N-e-Asterisk-g-c-e-N-Z-S-m-S-I-CurlyBrace-N-N-Y, appearing in the context of potentially garbled text."
    },
    {
      "name": "الله،؛0L sY \\ 0mg]N 0 ,{Nz 0 0 b N*NsNv tS 0r q\\ eQ q\\m Y <wMRSmSm Q~ bwSdke NSvR S_0RmceN QLReMb/f fzfKN>N 0S/fI{N Ne*gce NZSm SI{NN)Y OeYdk",
      "frequency": 1,
      "context": "Arabic letters Alef-Lam-Lam-He-Semicolon-Zero-L-S-Y-Backslash-Zero-M-G-Bracket-N-Zero-Comma-CurlyBrace-N-Z-Zero-Zero-B-N-Asterisk-N-s-N-v-T-S-Zero-r-q-Backslash-Backslash-e-Q-q-Backslash-Backslash-m-Y-Less-W-M-R-S-m-S-m-Q-Tilde-b-w-S-d-k-e-N-S-v-R-S-Underscore-Zero-R-m-c-e-N-Q-L-R-e-M-b-Fslash-f-z-f-K-N-Greater-N-Zero-S-Fslash-I-CurlyBrace-N-N-e-Asterisk-g-c-e-N-Z-S-m-S-I-CurlyBrace-N-N-Y-O-e-Y-d-k, appearing in the context of potentially garbled text."
    },
    {
      "name": "الله،؛0L sY \\ 0mg]N 0 ,{Nz 0 0 b N*NsNv tS 0r q\\ eQ q\\m Y <wMRSmSm Q~ bwSdke NSvR S_0RmceN QLReMb/f fzfKN>N 0S/fI{N Ne*gce NZSm SI{NN)Y OeYdk _-N_N",
      "frequency": 1,
      "context": "Arabic letters Alef-Lam-Lam-He-Semicolon-Zero-L-S-Y-Backslash-Zero-M-G-Bracket-N-Zero-Comma-CurlyBrace-N-Z-Zero-Zero-B-N-Asterisk-N-s-N-v-T-S-Zero-r-q-Backslash-Backslash-e-Q-q-Backslash-Backslash-m-Y-Less-W-M-R-S-m-S-m-Q-Tilde-b-w-S-d-k-e-N-S-v-R-S-Underscore-Zero-R-m-c-e-N-Q-L-R-e-M-b-Fslash-f-z-f-K-N-Greater-N-Zero-S-Fslash-I-CurlyBrace-N-N-e-Asterisk-g-c-e-N-Z-S-m-S-I-CurlyBrace-N-N-Y-O-e-Y-d-k-Underscore-Hyphen-N-Underscore-N, appearing in the context of potentially garbled text."
    },
    {
      "name": "الله،؛0L sY \\ 0mg]N 0 ,{Nz 0 0 b N*NsNv tS 0r q\\ eQ q\\m Y <wMRSmSm Q~ bwSdke NSvR S_0RmceN QLReMb/f fzfKN>N 0S/fI{N Ne*gce NZSm SI{NN)Y OeYdk _-N_N N?aBlc",
      "frequency": 1,
      "context": "Arabic letters Alef-Lam-Lam-He-Semicolon-Zero-L-S-Y-Backslash-Zero-M-G-Bracket-N-Zero-Comma-CurlyBrace-N-Z-Zero-Zero-B-N-Asterisk-N-s-N-v-T-S-Zero-r-q-Backslash-Backslash-e-Q-q-Backslash-Backslash-m-Y-Less-W-M-R-S-m-S-m-Q-Tilde-b-w-S-d-k-e-N-S-v-R-S-Underscore-Zero-R-m-c-e-N-Q-L-R-e-M-b-Fslash-f-z-f-K-N-Greater-N-Zero-S-Fslash-I-CurlyBrace-N-N-e-Asterisk-g-c-e-N-Z-S-m-S-I-CurlyBrace-N-N-Y-O-e-Y-d-k-Underscore-Hyphen-N-Underscore-N-N-QuestionMark-a-B-l-c, appearing in the context of potentially garbled text."
    },
    {
      "name": "الله،؛0L sY \\ 0mg]N 0 ,{Nz 0 0 b N*NsNv tS 0r q\\ eQ q\\m Y <wMRSmSm Q~ bwSdke NSvR S_0RmceN QLReMb/f fzfKN>N 0S/fI{N Ne*gce NZSm SI{NN)Y OeYdk _-N_N N?aBlc N/f",
      "frequency": 1,
      "context": "Arabic letters Alef-Lam-Lam-He-Semicolon-Zero-L-S-Y-Backslash-Zero-M-G-Bracket-N-Zero-Comma-CurlyBrace-N-Z-Zero-Zero-B-N-Asterisk-N-s-N-v-T-S-Zero-r-q-Backslash-Backslash-e-Q-q-Backslash-Backslash-m-Y-Less-W-M-R-S-m-S-m-Q-Tilde-b-w-S-d-k-e-N-S-v-R-S-Underscore-Zero-R-m-c-e-N-Q-L-R-e-M-b-Fslash-f-z-f-K-N-Greater-N-Zero-S-Fslash-I-CurlyBrace-N-N-e-Asterisk-g-c-e-N-Z-S-m-S-I-CurlyBrace-N-N-Y-O-e-Y-d-k-Underscore-Hyphen-N-Underscore-N-N-QuestionMark-a-B-l-c-N-Fslash, appearing in the context of potentially garbled text."
    },
    {
      "name": "الله،؛0L sY \\ 0mg]N 0 ,{Nz 0 0 b N*NsNv tS 0r q\\ eQ q\\m Y <wMRSmSm Q~ bwSdke NSvR S_0RmceN QLReMb/f fzfKN>N 0S/fI{N Ne*gce NZSm SI{NN)Y OeYdk _-N_N N?aBlc N/f P@wKb5u",
      "frequency": 1,
      "context": "Arabic letters Alef-Lam-Lam-He-Semicolon-Zero-L-S-Y-Backslash-Zero-M-G-Bracket-N-Zero-Comma-CurlyBrace-N-Z-Zero-Zero-B-N-Asterisk-N-s-N-v-T-S-Zero-r-q-Backslash-Backslash-e-Q-q-Backslash-Backslash-m-Y-Less-W-M-R-S-m-S-m-Q-Tilde-b-w-S-d-k-e-N-S-v-R-S-Underscore-Zero-R-m-c-e-N-Q-L-R-e-M-b-Fslash-f-z-f-K-N-Greater-N-Zero-S-Fslash-I-CurlyBrace-N-N-e-Asterisk-g-c-e-N-Z-S-m-S-I-CurlyBrace-N-N-Y-O-e-Y-d-k-Underscore-Hyphen-N-Underscore-N-N-QuestionMark-a-B-l-c-N-Fslash-P-At-w-K-b-5-u, appearing in the context of potentially garbled text."
    },
    {
      "name": "الله،؛0L sY \\ 0mg]N 0 ,{Nz 0 0 b N*NsNv tS 0r q\\ eQ q\\m Y <wMRSmSm Q~ bwSdke NSvR S_0RmceN QLReMb/f fzfKN>N 0S/fI{N Ne*gce NZSm SI{NN)Y OeYdk _-N_N N?aBlc N/f P@wKb5u SԏV",
      "frequency": 1,
      "context": "Arabic letters Alef-Lam-Lam-He-Semicolon-Zero-L-S-Y-Backslash-Zero-M-G-Bracket-N-Zero-Comma-CurlyBrace-N-Z-Zero-Zero-B-N-Asterisk-N-s-N-v-T-S-Zero-r-q-Backslash-Backslash-e-Q-q-Backslash-Backslash-m-Y-Less-W-M-R-S-m-S-m-Q-Tilde-b-w-S-d-k-e-N-S-v-R-S-Underscore-Zero-R-m-c-e-N-Q-L-R-e-M-b-Fslash-f-z-f-K-N-Greater-N-Zero-S-Fslash-I-CurlyBrace-N-N-e-Asterisk-g-c-e-N-Z-S-m-S-I-CurlyBrace-N-N-Y-O-e-Y-d-k-Underscore-Hyphen-N-Underscore-N-N-QuestionMark-a-B-l-c-N-Fslash-P-At-w-K-b-5-u-S-CircumflexAccent-V, appearing in the context of potentially garbled text."
    },
    {
      "name": "الله،؛0L sY \\ 0mg]N 0 ,{Nz 0 0 b N*NsNv tS 0r q\\ eQ q\\m Y <wMRSmSm Q~ bwSdke NSvR S_0RmceN QLReMb/f fzfKN>N 0S/fI{N Ne*gce NZSm SI{NN)Y OeYdk _-N_N N?aBlc N/f P@wKb5u SԏV 0}6q_-N^8^Wa",
      "frequency": 1,
      "context": "Arabic letters Alef-Lam-Lam-He-Semicolon-Zero-L-S-Y-Backslash-Zero-M-G-Bracket-N-Zero-Comma-CurlyBrace-N-Z-Zero-Zero-B-N-Asterisk-N-s-N-v-T-S-Zero-r-q-Backslash-Backslash-e-Q-q-Backslash-Backslash-m-Y-Less-W-M-R-S-m-S-m-Q-Tilde-b-w-S-d-k-e-N-S-v-R-S-Underscore-Zero-R-m-c-e-N-Q-L-R-e-M-b-Fslash-f-z-f-K-N-Greater-N-Zero-S-Fslash-I-CurlyBrace-N-N-e-Asterisk-g-c-e-N-Z-S-m-S-I-CurlyBrace-N-N-Y-O-e-Y-d-k-Underscore-Hyphen-N-Underscore-N-N-QuestionMark-a-B-l-c-N-Fslash-P-At-w-K-b-5-u-S-CircumflexAccent-V-Zero-CurlyBrace-6-q-Underscore-Hyphen-N-Caret-8-Caret-W-a, appearing in the context of potentially garbled text."
    },
    {
      "name": "1",
      "frequency": 7,
      "context": "Numerical character, appears in various sequences."
    },
    {
      "name": "com",
      "frequency": 1,
      "context": "Appears in a URL-like string: '1 1 d r e a m . c o m / ? u = 1 8 0 4 3 4'."
    },
    {
      "name": "dream",
      "frequency": 1,
      "context": "Appears in a URL-like string: '1 1 d r e a m . c o m / ? u = 1 8 0 4 3 4'."
    },
    {
      "name": "url",
      "frequency": 1,
      "context": "Implied by the structure of '1 1 d r e a m . c o m / ? u = 1 8 0 4 3 4'."
    },
    {
      "name": "180434",
      "frequency": 1,
      "context": "Appears in a URL-like string: '1 1 d r e a m . c o m / ? u = 1 8 0 4 3 4'."
    },
    {
      "name": "BG",
      "frequency": 1,
      "context": "Appears as 'BGv' in the text."
    },
    {
      "name": "Shakespear",
      "frequency": 1,
      "context": "Implied by the Hamlet quote: 'To be, or not to be: that is the question:'."
    },
    {
      "name": "Hamlet",
      "frequency": 1,
      "context": "Implied by the famous quote within the text."
    },
    {
      "name": "To be or not to be",
      "frequency": 1,
      "context": "Direct quote from Hamlet."
    },
    {
      "name": "question",
      "frequency": 1,
      "context": "Part of the Hamlet quote."
    },
    {
      "name": "noble",
      "frequency": 1,
      "context": "Part of the Hamlet quote."
    },
    {
      "name": "mind",
      "frequency": 1,
      "context": "Part of the Hamlet quote."
    },
    {
      "name": "suffer",
      "frequency": 1,
      "context": "Part of the Hamlet quote."
    },
    {
      "name": "slings",
      "frequency": 1,
      "context": "Part of the Hamlet quote."
    },
    {
      "name": "arrows",
      "frequency": 1,
      "context": "Part of the Hamlet quote."
    },
    {
      "name": "fortune",
      "frequency": 1,
      "context": "Part of the Hamlet quote."
    },
    {
      "name": "take arms",
      "frequency": 1,
      "context": "Part of the Hamlet quote."
    },
    {
      "name": "sea of troubles",
      "frequency": 1,
      "context": "Part of the Hamlet quote."
    },
    {
      "name": "opposing",
      "frequency": 1,
      "context": "Part of the Hamlet quote."
    },
    {
      "name": "end them",
      "frequency": 1,
      "context": "Part of the Hamlet quote."
    },
    {
      "name": "die",
      "frequency": 3,
      "context": "Part of the Hamlet quote."
    },
    {
      "name": "sleep",
      "frequency": 3,
      "context": "Part of the Hamlet quote."
    },
    {
      "name": "heart-ache",
      "frequency": 1,
      "context": "Part of the Hamlet quote."
    },
    {
      "name": "shocks",
      "frequency": 1,
      "context": "Part of the Hamlet quote."
    },
    {
      "name": "flesh",
      "frequency": 1,
      "context": "Part of the Hamlet quote."
    },
    {
      "name": "consummation",
      "frequency": 1,
      "context": "Part of the Hamlet quote."
    },
    {
      "name": "devoutly to be wished",
      "frequency": 1,
      "context": "Part of the Hamlet quote."
    },
    {
      "name": "natural shocks",
      "frequency": 1,
      "context": "Part of the Hamlet quote."
    },
    {
      "name": "heir",
      "frequency": 1,
      "context": "Part of the Hamlet quote."
    },
    {
      "name": "natural shocks that flesh is heir to",
      "frequency": 1,
      "context": "Part of the Hamlet quote."
    },
    {
      "name": "consummation devoutly to be wished",
      "frequency": 1,
      "context": "Part of the Hamlet quote."
    },
    {
      "name": "heart-ache and the thousand natural shocks",
      "frequency": 1,
      "context": "Part of the Hamlet quote."
    },
    {
      "name": "dream",
      "frequency": 1,
      "context": "Appears in the Hamlet quote: 'by a sleep to say we end / The heart-ache and the thousand natural shocks / That flesh is heir to, 't is a consummation / Devoutly to be wish'd. To die, to sleep; & &'"
    },
    {
      "name": "unidentified script",
      "frequency": 100,
      "context": "The majority of the content appears to be composed of characters that do not form recognizable words in any common script, suggesting it might be placeholder text, corrupted data, or an unreadable encoding."
    },
    {
      "name": "noise characters",
      "frequency": 100,
      "context": "The text contains a significant amount of seemingly random characters and sequences that do not form coherent linguistic units."
    },
    {
      "name": "placeholder text",
      "frequency": 100,
      "context": "The prevalence of unusual character combinations and repetition suggests that a large portion of the document might be filler or placeholder content."
    },
    {
      "name": "corrupted data",
      "frequency": 100,
      "context": "The unusual character sequences could indicate that the document has been corrupted during transmission or storage."
    },
    {
      "name": "unreadable encoding",
      "frequency": 100,
      "context": "The text might be encoded in a way that is not currently decipherable, leading to the appearance of random characters."
    }
  ],
  "relations": [],
  "hierarchy": {
    "main_topics": [
      "行路 (Title)",
      "序言 (Section)",
      "第一章 (Section)"
    ],
    "structure": "The document has a main title '行路' with a subtitle '女尊'. It then outlines two sections: '序言' and '第一章'. The content under '第一章' is overwhelmingly composed of unreadable characters and sequences, with some interspersed numerical and symbolic characters. A recognizable quote from Shakespeare's Hamlet is also present within this section."
  }
}