{
  "propositions": [
    {
      "id": "1",
      "text": "The story of the \"Stryles Manor Case\" is being recounted to refute rumors.",
      "level": 1
    },
    {
      "id": "1.1",
      "text": "The narrator, Hastings, is requested by his friend Poirot and the Cavendish family to write the full story.",
      "level": 2
    },
    {
      "id": "2",
      "text": "Hastings is on sick leave after being sent home from the front lines.",
      "level": 1
    },
    {
      "id": "2.1",
      "text": "He is recovering in a rather depressing convalescent home.",
      "level": 2
    },
    {
      "id": "3",
      "text": "Hastings encounters John Cavendish, whom he hasn't seen in years.",
      "level": 1
    },
    {
      "id": "3.1",
      "text": "He barely knows John, who is fifteen years older than him.",
      "level": 2
    },
    {
      "id": "3.2",
      "text": "Hastings used to visit Styles Court, his mother's country estate, as a child.",
      "level": 2
    },
    {
      "id": "4",
      "text": "John invites Hastings to Styles Court for his vacation.",
      "level": 1
    },
    {
      "id": "4.1",
      "text": "John mentions his mother would be happy to see him after so many years.",
      "level": 2
    },
    {
      "id": "5",
      "text": "John reveals his mother has remarried.",
      "level": 1
    },
    {
      "id": "5.1",
      "text": "Hastings expresses visible surprise.",
      "level": 2
    },
    {
      "id": "5.2",
      "text": "He remembers John's mother as a dignified, middle-aged woman, likely over seventy now.",
      "level": 2
    },
    {
      "id": "5.3",
      "text": "She was energetic, decisive, fond of charity work, and played the role of a 'busy' lady.",
      "level": 2
    },
    {
      "id": "5.4",
      "text": "She was also a generous woman with considerable personal wealth.",
      "level": 2
    },
    {
      "id": "6",
      "text": "Styles Court was purchased by Mr. Cavendish before their marriage.",
      "level": 1
    },
    {
      "id": "6.1",
      "text": "He was completely under his wife's control, and the estate was left to her for life upon his death.",
      "level": 2
    },
    {
      "id": "6.2",
      "text": "Most of her income also went to her.",
      "level": 2
    },
    {
      "id": "6.3",
      "text": "This arrangement was unfair to his two sons.",
      "level": 2
    },
    {
      "id": "6.4",
      "text": "However, their stepmother was very generous to them.",
      "level": 2
    },
    {
      "id": "6.5",
      "text": "They considered her their own mother as they were young when their father remarried.",
      "level": 2
    },
    {
      "id": "7",
      "text": "Lawrence, the younger brother, is an educated man.",
      "level": 1
    },
    {
      "id": "7.1",
      "text": "He had qualified as a doctor but abandoned the profession to pursue literary ambitions.",
      "level": 2
    },
    {
      "id": "7.2",
      "text": "His poetry never achieved significant recognition.",
      "level": 2
    },
    {
      "id": "8",
      "text": "John worked as a barrister for a while but eventually adopted a more comfortable country gentleman's life.",
      "level": 1
    },
    {
      "id": "8.1",
      "text": "He married two years prior and lives at Styles with his wife.",
      "level": 2
    },
    {
      "id": "8.2",
      "text": "Hastings feels John would prefer more financial support from his mother to have his own home.",
      "level": 2
    },
    {
      "id": "8.3",
      "text": "The old lady is autocratic and wants her arrangements followed, holding the financial power.",
      "level": 2
    },
    {
      "id": "9",
      "text": "John expresses his distaste for his mother's new husband, Alfred.",
      "level": 1
    },
    {
      "id": "9.1",
      "text": "He calls him a \"vile, disgusting cad.\"",
      "level": 2
    },
    {
      "id": "9.2",
      "text": "He states it makes their lives difficult.",
      "level": 2
    },
    {
      "id": "10",
      "text": "Evelyn, the mother's housekeeper and companion, is also mentioned.",
      "level": 1
    },
    {
      "id": "10.1",
      "text": "She is described as an \"all-around person\" and a \"great flirt.\"",
      "level": 2
    },
    {
      "id": "10.2",
      "text": "She is neither young nor beautiful, and people mock them.",
      "level": 2
    },
    {
      "id": "11",
      "text": "Alfred, Evelyn's supposed distant cousin, appeared and was hired as secretary by the mother.",
      "level": 1
    },
    {
      "id": "11.1",
      "text": "Alfred is a vulgar man with a large black beard and wears patent leather boots regardless of the weather.",
      "level": 2
    },
    {
      "id": "11.2",
      "text": "The mother immediately took a liking to him.",
      "level": 2
    },
    {
      "id": "11.3",
      "text": "She manages hundreds of social organizations.",
      "level": 2
    },
    {
      "id": "12",
      "text": "The mother announced her engagement to Alfred three months prior.",
      "level": 1
    },
    {
      "id": "12.1",
      "text": "Alfred is at least twenty years younger than her.",
      "level": 2
    },
    {
      "id": "12.2",
      "text": "It was an obvious pursuit of a rich woman.",
      "level": 2
    },
    {
      "id": "12.3",
      "text": "She married him due to her autocratic nature.",
      "level": 2
    },
    {
      "id": "13",
      "text": "Hastings arrives at Styles station.",
      "level": 1
    },
    {
      "id": "13.1",
      "text": "It's a small, unremarkable station surrounded by green fields.",
      "level": 2
    },
    {
      "id": "13.2",
      "text": "John Cavendish meets him and leads him to the car.",
      "level": 2
    },
    {
      "id": "14",
      "text": "John mentions they managed to get some petrol thanks to his mother's efforts.",
      "level": 1
    },
    {
      "id": "15",
      "text": "Styles village is about two miles from the station.",
      "level": 1
    },
    {
      "id": "15.1",
      "text": "Styles Court is a mile in the opposite direction.",
      "level": 2
    },
    {
      "id": "16",
      "text": "It's a peaceful, warm day in early July.",
      "level": 1
    },
    {
      "id": "16.1",
      "text": "The Essex countryside appears verdant and tranquil under the afternoon sun.",
      "level": 2
    },
    {
      "id": "16.2",
      "text": "It's hard to believe a war is underway not far away.",
      "level": 2
    },
    {
      "id": "16.3",
      "text": "Hastings feels transported to another world.",
      "level": 2
    },
    {
      "id": "17",
      "text": "John expresses concern that Hastings might find Styles too quiet.",
      "level": 1
    },
    {
      "id": "18",
      "text": "Hastings states that quiet is exactly what he needs.",
      "level": 1
    },
    {
      "id": "19",
      "text": "John describes his own life: twice-weekly drills with volunteers, helping on the farm, and his wife doing farm work.",
      "level": 1
    },
    {
      "id": "19.1",
      "text": "His wife gets up at five every morning to milk cows until lunch.",
      "level": 2
    },
    {
      "id": "19.2",
      "text": "He adds that life would be idyllic if not for Alfred Inglethorp.",
      "level": 2
    },
    {
      "id": "20",
      "text": "John mentions they might not have time to pick up Cynthia.",
      "level": 1
    },
    {
      "id": "21",
      "text": "Hastings asks if Cynthia is John's wife.",
      "level": 1
    },
    {
      "id": "22",
      "text": "John clarifies that Cynthia is his mother's adopted daughter.",
      "level": 1
    },
    {
      "id": "22.1",
      "text": "She is the daughter of an old school friend of his mother's who married a scoundrel and became penniless.",
      "level": 2
    },
    {
      "id": "22.2",
      "text": "His mother rescued her.",
      "level": 2
    },
    {
      "id": "22.3",
      "text": "Cynthia has been with them for nearly two years.",
      "level": 2
    },
    {
      "id": "22.4",
      "text": "She works at the Red Cross hospital in Tarminst, seven miles away.",
      "level": 2
    },
    {
      "id": "23",
      "text": "They arrive at a tall, old-fashioned house.",
      "level": 1
    },
    {
      "id": "23.1",
      "text": "A woman in a wide tweed skirt is tending flowerbeds and straightens up upon their arrival.",
      "level": 2
    },
    {
      "id": "24",
      "text": "John introduces her as Miss Howard, the housekeeper.",
      "level": 1
    },
    {
      "id": "25",
      "text": "Miss Howard greets Hastings warmly.",
      "level": 1
    },
    {
      "id": "25.1",
      "text": "She has a strong handshake that almost hurts Hastings.",
      "level": 2
    },
    {
      "id": "25.2",
      "text": "She has sun-tanned skin and bright blue eyes.",
      "level": 2
    },
    {
      "id": "25.3",
      "text": "She is a pleasing woman of about forty, with a deep, resonant voice, almost like a man's.",
      "level": 2
    },
    {
      "id": "25.4",
      "text": "She has a broad, sturdy build and wears sturdy boots.",
      "level": 2
    },
    {
      "id": "25.5",
      "text": "Her speech is concise.",
      "level": 2
    },
    {
      "id": "26",
      "text": "Miss Howard makes a remark about weeds growing like wildfire and the need to keep them down.",
      "level": 1
    },
    {
      "id": "27",
      "text": "Hastings replies that he would be glad to be useful.",
      "level": 1
    },
    {
      "id": "28",
      "text": "Miss Howard dismisses his statement, saying \"Never say that. I hope you never will.\"",
      "level": 1
    },
    {
      "id": "29",
      "text": "John laughs and asks Miss Howard where they will have tea, inside or out.",
      "level": 1
    },
    {
      "id": "30",
      "text": "Miss Howard chooses outside, given the good weather.",
      "level": 1
    },
    {
      "id": "31",
      "text": "John tells her she has done enough gardening for the day and should rest, quoting 'the labourer is worthy of his hire.'",
      "level": 1
    },
    {
      "id": "32",
      "text": "Miss Howard agrees and leads the way to the tea spot under a large maple tree.",
      "level": 1
    },
    {
      "id": "33",
      "text": "A man stands up from a wicker chair and approaches them.",
      "level": 1
    },
    {
      "id": "34",
      "text": "John introduces him as his wife, Mary Cavendish.",
      "level": 1
    },
    {
      "id": "35",
      "text": "Hastings will never forget his first impression of Mary Cavendish.",
      "level": 1
    },
    {
      "id": "35.1",
      "text": "She is tall and slender, with graceful lines in the bright sunlight.",
      "level": 2
    },
    {
      "id": "35.2",
      "text": "Her vivacious expression seems to be found only in her striking brown eyes.",
      "level": 2
    },
    {
      "id": "35.3",
      "text": "She possesses a silent, extraordinary charm, and a wild, unrestrained passion beneath her calm, elegant demeanor.",
      "level": 2
    },
    {
      "id": "36",
      "text": "She welcomes Hastings warmly in a soft, clear voice.",
      "level": 1
    },
    {
      "id": "37",
      "text": "Hastings sits in a wicker chair, pleased to have accepted John's invitation.",
      "level": 1
    },
    {
      "id": "38",
      "text": "Mary Cavendish serves him tea, and her few elegant words reinforce his initial impression of her as a captivating woman.",
      "level": 1
    },
    {
      "id": "39",
      "text": "Hastings recounts amusing anecdotes from the convalescent home in a humorous tone, greatly amusing his hostess.",
      "level": 1
    },
    {
      "id": "40",
      "text": "He feels quite pleased with himself.",
      "level": 1
    },
    {
      "id": "41",
      "text": "John, while a good fellow, is not a brilliant conversationalist.",
      "level": 1
    },
    {
      "id": "42",
      "text": "An unforgettable voice drifts from an open French window.",
      "level": 1
    },
    {
      "id": "42.1",
      "text": "It's Mrs. Inglethorp, asking Alfred if he's writing to the princess after tea, or if they should wait for the princess's reply.",
      "level": 2
    },
    {
      "id": "42.2",
      "text": "She mentions other ladies who might visit if the princess doesn't agree.",
      "level": 2
    },
    {
      "id": "43",
      "text": "A muffled male voice responds, followed by Mrs. Inglethorp's reply.",
      "level": 1
    },
    {
      "id": "44",
      "text": "The French window opens wider, and a dignified, white-haired old lady with a commanding face emerges onto the lawn.",
      "level": 1
    },
    {
      "id": "44.1",
      "text": "A man, looking submissive, follows her.",
      "level": 2
    },
    {
      "id": "45",
      "text": "Mrs. Inglethorp warmly welcomes Hastings.",
      "level": 1
    },
    {
      "id": "45.1",
      "text": "She expresses her joy at seeing him again after so many years.",
      "level": 2
    },
    {
      "id": "45.2",
      "text": "She introduces Alfred as her husband.",
      "level": 2
    },
    {
      "id": "46",
      "text": "Hastings observes Alfred Inglethorp with curiosity.",
      "level": 1
    },
    {
      "id": "46.1",
      "text": "He finds him rather out of place and understands John's dislike for his full beard.",
      "level": 2
    },
    {
      "id": "46.2",
      "text": "Alfred has one of the longest and darkest beards Hastings has ever seen.",
      "level": 2
    },
    {
      "id": "46.3",
      "text": "He wears gold-rimmed pince-nez and has an inscrutable, indifferent expression.",
      "level": 2
    },
    {
      "id": "46.4",
      "text": "He seems more suited to the stage than to real life.",
      "level": 2
    },
    {
      "id": "46.5",
      "text": "His voice is oily and falsely solicitous.",
      "level": 2
    },
    {
      "id": "47",
      "text": "Alfred offers Hastings his hand, saying, \"A distinct honour, Mr. Hastings.\"",
      "level": 1
    },
    {
      "id": "48",
      "text": "He then turns to his wife and comments that a cushion is damp.",
      "level": 1
    },
    {
      "id": "49",
      "text": "Mrs. Inglethorp smiles at him affectionately as he carefully adjusts a cushion.",
      "level": 1
    },
    {
      "id": "49.1",
      "text": "Hastings observes the strange infatuation of an intelligent woman.",
      "level": 2
    },
    {
      "id": "50",
      "text": "Due to Mrs. Inglethorp's presence, a strained atmosphere and hidden hostility are palpable.",
      "level": 1
    },
    {
      "id": "50.1",
      "text": "Miss Howard particularly tries to conceal her emotions.",
      "level": 2
    },
    {
      "id": "50.2",
      "text": "Mrs. Inglethorp, however, seems oblivious to any abnormality.",
      "level": 2
    },
    {
      "id": "51",
      "text": "Mrs. Inglethorp's once remarkable volubility remains undiminished.",
      "level": 1
    },
    {
      "id": "51.1",
      "text": "She talks incessantly about the upcoming charity bazaar she is organizing.",
      "level": 2
    },
    {
      "id": "51.2",
      "text": "She occasionally inquires about dates and times from her husband.",
      "level": 2
    },
    {
      "id": "51.3",
      "text": "His attentive and careful attitude never wavers.",
      "level": 2
    },
    {
      "id": "52",
      "text": "Hastings feels an immediate and ingrained dislike for Alfred.",
      "level": 1
    },
    {
      "id": "52.1",
      "text": "He believes his first impressions are usually accurate.",
      "level": 2
    },
    {
      "id": "53",
      "text": "Mrs. Inglethorp turns to Evelyn Howard to give instructions regarding some letters.",
      "level": 1
    },
    {
      "id": "54",
      "text": "Her husband then engages Hastings in conversation with his painstaking voice.",
      "level": 1
    },
    {
      "id": "55",
      "text": "Alfred asks Hastings if his profession is military.",
      "level": 1
    },
    {
      "id": "56",
      "text": "Hastings replies that before the war he was with the Lloyd's Underwriting Association.",
      "level": 1
    },
    {
      "id": "57",
      "text": "Alfred asks if he plans to return after the war.",
      "level": 1
    },
    {
      "id": "58",
      "text": "Hastings says perhaps, either returning there or finding a new job.",
      "level": 1
    },
    {
      "id": "59",
      "text": "Mary Cavendish leans forward and asks what profession Hastings would choose if he considered only his preferences.",
      "level": 1
    },
    {
      "id": "60",
      "text": "Hastings replies it would depend on the circumstances.",
      "level": 1
    },
    {
      "id": "61",
      "text": "Mary asks if he has any secret hobbies and what attracts him, stating everyone is drawn to something amusing.",
      "level": 1
    },
    {
      "id": "62",
      "text": "Hastings hesitates, saying she would laugh at him.",
      "level": 1
    },
    {
      "id": "63",
      "text": "Mary laughs and says perhaps she would.",
      "level": 1
    },
    {
      "id": "64",
      "text": "Hastings confesses he has secretly longed to be a detective.",
      "level": 1
    },
    {
      "id": "65",
      "text": "Mary asks if he means Scotland Yard or Sherlock Holmes.",
      "level": 1
    },
    {
      "id": "66",
      "text": "Hastings clarifies he aspires to be like Sherlock Holmes.",
      "level": 1
    },
    {
      "id": "66.1",
      "text": "He was inspired by a famous detective he met in Belgium.",
      "level": 2
    },
    {
      "id": "66.2",
      "text": "This detective believed that all good detective work is a matter of method.",
      "level": 2
    },
    {
      "id": "66.3",
      "text": "Hastings' own system is based on this, though further developed.",
      "level": 2
    },
    {
      "id": "66.4",
      "text": "The detective was a very amusing little man, a dandy, but astonishingly sharp.",
      "level": 2
    },
    {
      "id": "67",
      "text": "Miss Howard comments that she likes good detective novels but finds them full of nonsense.",
      "level": 1
    },
    {
      "id": "67.1",
      "text": "The criminal is revealed in the last chapter, astonishing everyone.",
      "level": 2
    },
    {
      "id": "67.2",
      "text": "She believes real criminal acts are discovered quickly.",
      "level": 2
    },
    {
      "id": "68",
      "text": "Hastings disagrees, stating that many criminal acts go undiscovered.",
      "level": 1
    },
    {
      "id": "69",
      "text": "Miss Howard clarifies she means not by the police, but by the people involved, the family; they will know.",
      "level": 1
    },
    {
      "id": "70",
      "text": "Hastings asks if she believes she could identify a murderer if involved in a crime.",
      "level": 1
    },
    {
      "id": "71",
      "text": "Miss Howard confidently states she would know, even feeling it through her fingertips if the culprit approached her.",
      "level": 1
    },
    {
      "id": "72",
      "text": "Hastings reminds her it could be a 'she'.",
      "level": 1
    },
    {
      "id": "73",
      "text": "Miss Howard suggests murder is a violent crime, more often committed by men.",
      "level": 1
    },
    {
      "id": "74",
      "text": "Mary Cavendish interjects that poisoning is different.",
      "level": 1
    },
    {
      "id": "74.1",
      "text": "She mentions Dr. Boastin said that the medical profession's general ignorance of rare poisons could allow many poisoning cases to go unsuspected.",
      "level": 2
    },
    {
      "id": "75",
      "text": "Mrs. Inglethorp exclaims how dreadful and chilling Mary's words are.",
      "level": 1
    },
    {
      "id": "75.1",
      "text": "She then announces Cynthia has arrived.",
      "level": 2
    },
    {
      "id": "76",
      "text": "A young girl in an patriotic nurse's uniform runs across the lawn.",
      "level": 1
    },
    {
      "id": "77",
      "text": "Mrs. Inglethorp introduces Hastings to Miss Cynthia Mudock.",
      "level": 1
    },
    {
      "id": "78",
      "text": "Cynthia Mudock is a healthy, energetic young woman.",
      "level": 1
    },
    {
      "id": "78.1",
      "text": "She removes her small nurse's cap, revealing astonishingly loose chestnut curls.",
      "level": 2
    },
    {
      "id": "78.2",
      "text": "She takes a tea cup with a fair, delicate hand.",
      "level": 2
    },
    {
      "id": "78.3",
      "text": "With dark eyes and lashes, she would be a beauty.",
      "level": 2
    },
    {
      "id": "79",
      "text": "She sits on the grass next to John.",
      "level": 1
    },
    {
      "id": "80",
      "text": "She smiles at Hastings as he offers her a plate of sandwiches.",
      "level": 1
    },
    {
      "id": "81",
      "text": "She suggests sitting on the grass for more comfort.",
      "level": 1
    },
    {
      "id": "82",
      "text": "Hastings complies.",
      "level": 1
    },
    {
      "id": "83",
      "text": "Hastings asks Miss Mudock if she works in Tarminst.",
      "level": 1
    },
    {
      "id": "84",
      "text": "She nods, calling it \"a hell of a life.\"",
      "level": 1
    },
    {
      "id": "85",
      "text": "Hastings playfully asks if they bully her.",
      "level": 1
    },
    {
      "id": "86",
      "text": "Cynthia exclaims she wishes they would.",
      "level": 1
    },
    {
      "id": "87",
      "text": "Hastings mentions his cousin is a nurse and is terrified of the \"sisters.\"",
      "level": 1
    },
    {
      "id": "88",
      "text": "Cynthia states it's no wonder, as that's how head nurses are.",
      "level": 1
    },
    {
      "id": "88.1",
      "text": "She is grateful she is not a nurse but works in the pharmacy.",
      "level": 2
    },
    {
      "id": "89",
      "text": "Hastings jokingly asks how many people she has poisoned.",
      "level": 1
    },
    {
      "id": "90",
      "text": "Cynthia laughs and says \"hundreds!\"",
      "level": 1
    },
    {
      "id": "91",
      "text": "Mrs. Inglethorp calls to Cynthia, asking if she can write some notes for her.",
      "level": 1
    },
    {
      "id": "92",
      "text": "Cynthia readily agrees.",
      "level": 1
    },
    {
      "id": "93",
      "text": "Her movements suggest she is in a subordinate position, despite Mrs. Inglethorp's general kindness.",
      "level": 1
    },
    {
      "id": "94",
      "text": "Mrs. Inglethorp tells Hastings that John will show him his room and that dinner is at 7:30.",
      "level": 1
    },
    {
      "id": "94.1",
      "text": "They no longer have a proper dinner in the evenings.",
      "level": 2
    },
    {
      "id": "94.2",
      "text": "She mentions Mrs. Tarminst, the wife of an MP, agrees with her about being a model of economy.",
      "level": 2
    },
    {
      "id": "94.3",
      "text": "They are a wartime family, wasting nothing, even saving scrap paper.",
      "level": 2
    },
    {
      "id": "95",
      "text": "Hastings expresses his appreciation.",
      "level": 1
    },
    {
      "id": "96",
      "text": "John leads Hastings to his room, which is on the left wing, overlooking the garden.",
      "level": 1
    },
    {
      "id": "97",
      "text": "After John leaves, Hastings sees him walking with Cynthia on the lawn.",
      "level": 1
    },
    {
      "id": "98",
      "text": "He then hears Mrs. Inglethorp urgently calling \"Cynthia!\"",
      "level": 1
    },
    {
      "id": "99",
      "text": "The girl runs back towards the house, startled.",
      "level": 1
    },
    {
      "id": "100",
      "text": "A man emerges from the shade and walks towards the house.",
      "level": 1
    },
    {
      "id": "100.1",
      "text": "He is about forty, dark-skinned, clean-shaven, and looks melancholic, as if controlled by a strong emotion.",
      "level": 2
    },
    {
      "id": "100.2",
      "text": "He looks up as he passes Hastings' window.",
      "level": 2
    },
    {
      "id": "100.3",
      "text": "Hastings recognizes him as John's brother, Lawrence Cavendish, despite the fifteen years that have passed.",
      "level": 2
    },
    {
      "id": "100.4",
      "text": "He wonders about Lawrence's unusual expression.",
      "level": 2
    },
    {
      "id": "101",
      "text": "Hastings then focuses on his own affairs.",
      "level": 1
    },
    {
      "id": "102",
      "text": "The evening passes pleasantly.",
      "level": 1
    },
    {
      "id": "102.1",
      "text": "That night, Hastings dreams of Mary Cavendish.",
      "level": 2
    },
    {
      "id": "103",
      "text": "The next morning is bright, and Hastings anticipates a pleasant excursion.",
      "level": 1
    },
    {
      "id": "104",
      "text": "Hastings doesn't see Mrs. Cavendish until lunch.",
      "level": 1
    },
    {
      "id": "105",
      "text": "She offers to accompany him for a walk, and they spend a delightful afternoon in the woods, returning around five.",
      "level": 1
    },
    {
      "id": "106",
      "text": "Upon entering the house, John calls them to the smoking room.",
      "level": 1
    },
    {
      "id": "107",
      "text": "Hastings immediately notices something is wrong from John's expression.",
      "level": 1
    },
    {
      "id": "108",
      "text": "John closes the door after they enter and declares, \"Well! Mary, it's a regular mix-up. Eve and Alfred have had a row, and she's off.\"",
      "level": 1
    },
    {
      "id": "109",
      "text": "Hastings asks, \"Eve? Off?\"",
      "level": 1
    },
    {
      "id": "110",
      "text": "John nods grimly and confirms Eve is going to her mother.",
      "level": 1
    },
    {
      "id": "111",
      "text": "Miss Howard enters, lips tight, carrying a small suitcase, looking determined and defensive.",
      "level": 1
    },
    {
      "id": "112",
      "text": "She declares, \"In any case, I've said what I think!\"",
      "level": 1
    },
    {
      "id": "113",
      "text": "Mary Cavendish asks, \"Dear Eve, is it true?\"",
      "level": 1
    },
    {
      "id": "114",
      "text": "Miss Howard nods coldly.",
      "level": 1
    },
    {
      "id": "115",
      "text": "She explains she told Emily something she likely won't forget or forgive.",
      "level": 1
    },
    {
      "id": "115.1",
      "text": "She told Emily she's an old woman and a fool for not seeing that Alfred, who is twenty years younger, is marrying her for her money.",
      "level": 2
    },
    {
      "id": "115.2",
      "text": "She warned Emily about Alfred spending time with Rex's young and beautiful wife.",
      "level": 2
    },
    {
      "id": "115.3",
      "text": "She called Alfred a villain who wants to murder her in her bed.",
      "level": 2
    },
    {
      "id": "116",
      "text": "Mary asks how Emily responded.",
      "level": 1
    },
    {
      "id": "117",
      "text": "Miss Howard makes a significant grimace.",
      "level": 1
    },
    {
      "id": "117.1",
      "text": "Emily called it malicious slander, infamous lies, and accused her of falsely accusing her 'dear Alfred'.",
      "level": 2
    },
    {
      "id": "117.2",
      "text": "Miss Howard decided it's best to leave her house.",
      "level": 2
    },
    {
      "id": "118",
      "text": "John asks if she's leaving now.",
      "level": 1
    },
    {
      "id": "119",
      "text": "Miss Howard confirms, \"Now!\"",
      "level": 1
    },
    {
      "id": "120",
      "text": "They stare at her.",
      "level": 1
    },
    {
      "id": "121",
      "text": "John checks the train timetable, his persuasion having failed.",
      "level": 1
    },
    {
      "id": "122",
      "text": "Mary leaves, muttering that Mrs. Inglethorp should reconsider.",
      "level": 1
    },
    {
      "id": "123",
      "text": "Once Mary leaves, Miss Howard's demeanor changes.",
      "level": 1
    },
    {
      "id": "124",
      "text": "She eagerly approaches Hastings and asks if she can trust him as an honest man.",
      "level": 1
    },
    {
      "id": "125",
      "text": "She puts her hand on his arm and whispers that he should look after her \"poor Emily.\"",
      "level": 1
    },
    {
      "id": "125.1",
      "text": "She claims they are all swindlers, desperate to get money from Emily.",
      "level": 2
    },
    {
      "id": "125.2",
      "text": "She feels she has done her best to protect Emily and now they can take advantage of her.",
      "level": 2
    },
    {
      "id": "126",
      "text": "Hastings assures her he will do his best but believes she is too agitated and overthinking.",
      "level": 1
    },
    {
      "id": "127",
      "text": "She interrupts him, stating she has lived longer and advises him to keep his eyes open.",
      "level": 1
    },
    {
      "id": "128",
      "text": "The sound of a car approaching is heard from the open window.",
      "level": 1
    },
    {
      "id": "129",
      "text": "Miss Howard stands and looks towards the door.",
      "level": 1
    },
    {
      "id": "130",
      "text": "She calls out a farewell, emphasizing to watch out for \"that villain – her husband!\"",
      "level": 1
    },
    {
      "id": "131",
      "text": "The Inglethorps do not appear.",
      "level": 1
    },
    {
      "id": "132",
      "text": "As the car drives away, Mary Cavendish leaves the group and walks towards a tall, bearded man approaching the house.",
      "level": 1
    },
    {
      "id": "133",
      "text": "He is Dr. Boastin.",
      "level": 1
    },
    {
      "id": "134",
      "text": "Hastings asks who he is.",
      "level": 1
    },
    {
      "id": "135",
      "text": "John explains Dr. Boastin is undergoing rest cure in the village for nervous exhaustion and is a talented toxicologist.",
      "level": 1
    },
    {
      "id": "136",
      "text": "Cynthia adds that he is Mary's close friend.",
      "level": 1
    },
    {
      "id": "137",
      "text": "John changes the subject, suggesting a walk and calling Eve Howard a \"most loyal and dependable friend.\"",
      "level": 1
    },
    {
      "id": "138",
      "text": "They walk through the woods towards the village.",
      "level": 1
    },
    {
      "id": "139",
      "text": "They encounter a pretty, gypsy-like young woman who smiles at them.",
      "level": 1
    },
    {
      "id": "140",
      "text": "Hastings comments on her beauty.",
      "level": 1
    },
    {
      "id": "141",
      "text": "John's face darkens, and he says, \"That's Mrs. Rex.\"",
      "level": 1
    },
    {
      "id": "142",
      "text": "Hastings realizes she is the one Miss Howard mentioned.",
      "level": 1
    },
    {
      "id": "143",
      "text": "Hastings has a vague premonition of dread, thinking of the old lady and Mrs. Rex's face.",
      "level": 1
    },
    {
      "id": "144",
      "text": "He remarks on the grandeur of Styles Court.",
      "level": 1
    },
    {
      "id": "145",
      "text": "John agrees it's a fine property that should have been his with a proper will.",
      "level": 1
    },
    {
      "id": "145.1",
      "text": "He admits to being very hard-pressed for money.",
      "level": 2
    },
    {
      "id": "146",
      "text": "He states that Lawrence spends all his money on publishing his messy poems.",
      "level": 1
    },
    {
      "id": "146.1",
      "text": "He says they are all broke.",
      "level": 2
    },
    {
      "id": "147",
      "text": "He concedes his mother has been good to them until her marriage.",
      "level": 1
    },
    {
      "id": "148",
      "text": "Hastings feels that with Evelyn Howard's departure, something intangible has been lost, and security has vanished.",
      "level": 1
    },
    {
      "id": "148.1",
      "text": "Suspicion seems to fill the air.",
      "level": 2
    },
    {
      "id": "148.2",
      "text": "Dr. Boastin's face reappears, causing unease.",
      "level": 2
    },
    {
      "id": "148.3",
      "text": "Hastings is filled with vague suspicion.",
      "level": 2
    },
    {
      "id": "149",
      "text": "Hastings arrived at Styles on July 5th and will now recount events of July 16th and 17th.",
      "level": 1
    },
    {
      "id": "149.1",
      "text": "These events were later clarified through lengthy interrogations.",
      "level": 2
    },
    {
      "id": "150",
      "text": "A few days after Evelyn Howard left, Hastings received a letter from her.",
      "level": 1
    },
    {
      "id": "150.1",
      "text": "She is working as a nurse in a large hospital in Middleham, fifteen or sixteen miles away.",
      "level": 2
    },
    {
      "id": "150.2",
      "text": "She asked Hastings to inform her if Mrs. Inglethorp wished to reconcile.",
      "level": 2
    },
    {
      "id": "151",
      "text": "The only drawback to Hastings' peaceful days is Mrs. Cavendish's peculiar and incomprehensible favoritism towards Dr. Boastin.",
      "level": 1
    },
    {
      "id": "151.1",
      "text": "He cannot imagine what attracts her to him.",
      "level": 2
    },
    {
      "id": "151.2",
      "text": "She constantly invites him to the house and goes on long trips with him.",
      "level": 2
    },
    {
      "id": "152",
      "text": "July 16th is a Monday, a chaotic day.",
      "level": 1
    },
    {
      "id": "152.1",
      "text": "A famous bazaar opened the previous Saturday.",
      "level": 2
    },
    {
      "id": "152.2",
      "text": "An entertainment evening for the same charity is scheduled for that night.",
      "level": 2
    },
    {
      "id": "152.3",
      "text": "Mrs. Inglethorp will recite a war poem.",
      "level": 2
    },
    {
      "id": "152.4",
      "text": "Everyone is busy preparing the village hall for the evening.",
      "level": 2
    },
    {
      "id": "152.5",
      "text": "Lunch is late, and the afternoon is spent resting in the garden.",
      "level": 2
    },
    {
      "id": "152.6",
      "text": "Hastings notices John's agitated demeanor.",
      "level": 2
    },
    {
      "id": "153",
      "text": "After tea, Mrs. Inglethorp goes to rest, as she has a performance that evening.",
      "level": 1
    },
    {
      "id": "154",
      "text": "Hastings challenges Mary Cavendish to a singles tennis match.",
      "level": 1
    },
    {
      "id": "155",
      "text": "Around six-thirty, Mrs. Inglethorp calls them, warning they will be late for an early dinner.",
      "level": 1
    },
    {
      "id": "156",
      "text": "They stop abruptly to prepare.",
      "level": 1
    },
    {
      "id": "157",
      "text": "The car is waiting at the door before dinner is finished.",
      "level": 1
    },
    {
      "id": "158",
      "text": "The evening entertainment is successful.",
      "level": 1
    },
    {
      "id": "158.1",
      "text": "Mrs. Inglethorp's recitation receives enthusiastic applause.",
      "level": 2
    },
    {
      "id": "158.2",
      "text": "There are also tableaux, in which Cynthia participates.",
      "level": 2
    },
    {
      "id": "158.3",
      "text": "She does not return home with them but accepts an invitation to a dinner party with her fellow performers.",
      "level": 2
    },
    {
      "id": "159",
      "text": "The next morning, Mrs. Inglethorp has breakfast in bed, feeling somewhat fatigued.",
      "level": 1
    },
    {
      "id": "160",
      "text": "Around 12:30, she appears refreshed and insists on taking Lawrence and Hastings to a luncheon party.",
      "level": 1
    },
    {
      "id": "160.1",
      "text": "It's an invitation from Mrs. Lawreston, sister of Mrs. Tarminst, and a member of an ancient family.",
      "level": 2
    },
    {
      "id": "161",
      "text": "Mary excuses herself, having an appointment with Dr. Boastin.",
      "level": 1
    },
    {
      "id": "162",
      "text": "They have a pleasant lunch.",
      "level": 1
    },
    {
      "id": "163",
      "text": "As they drive away, Lawrence suggests returning via Tarminst to visit Cynthia at her pharmacy.",
      "level": 1
    },
    {
      "id": "164",
      "text": "Mrs. Inglethorp agrees it's a good idea but needs to write letters and will leave them to return with Cynthia by trap.",
      "level": 1
    },
    {
      "id": "165",
      "text": "They are stopped by a hospital porter due to suspicion until Cynthia vouches for them.",
      "level": 1
    },
    {
      "id": "166",
      "text": "Cynthia, wearing a white coat, appears calm and gentle.",
      "level": 1
    },
    {
      "id": "167",
      "text": "She introduces them to her colleague, a rather formidable pharmacist whom she calls 'Nibs'.",
      "level": 1
    },
    {
      "id": "168",
      "text": "Hastings exclaims at the number of bottles and asks if she knows what's in them.",
      "level": 1
    },
    {
      "id": "169",
      "text": "Cynthia sighs, saying everyone says \"So many bottles!\" and anticipates Hastings' next question: \"How many people have you poisoned?\"",
      "level": 1
    },
    {
      "id": "170",
      "text": "Hastings feels guilty, smiling.",
      "level": 1
    },
    {
      "id": "171",
      "text": "Cynthia remarks they wouldn't joke if they knew how easy it was to poison someone.",
      "level": 1
    },
    {
      "id": "171.1",
      "text": "She suggests they have tea and assures them they know the secrets of the cabinet.",
      "level": 2
    },
    {
      "id": "171.2",
      "text": "She clarifies that the cabinet referred to is the poison cabinet.",
      "level": 2
    },
    {
      "id": "172",
      "text": "They enjoy tea and help Cynthia wash the teacups.",
      "level": 1
    },
    {
      "id": "173",
      "text": "A knock is heard at the door.",
      "level": 1
    },
    {
      "id": "174",
      "text": "Cynthia and Nibs' expressions become serious.",
      "level": 1
    },
    {
      "id": "175",
      "text": "Cynthia, in a professional tone, says, \"Come in.\"",
      "level": 1
    },
    {
      "id": "176",
      "text": "A slightly flustered young nurse appears with a bottle.",
      "level": 1
    },
    {
      "id": "177",
      "text": "Nibs hands the bottle to Cynthia, saying something cryptic about not being truly present today.",
      "level": 1
    },
    {
      "id": "178",
      "text": "Cynthia examines the bottle strictly, like a judge.",
      "level": 1
    },
    {
      "id": "179",
      "text": "She states it should have been collected that morning.",
      "level": 1
    },
    {
      "id": "180",
      "text": "The nurse apologizes, saying the head nurse forgot.",
      "level": 1
    },
    {
      "id": "181",
      "text": "Cynthia suggests the head nurse should read the regulations outside.",
      "level": 1
    },
    {
      "id": "182",
      "text": "Hastings infers the nurse wouldn't dare deliver such a message to the formidable 'sister'.",
      "level": 1
    },
    {
      "id": "183",
      "text": "Cynthia says it can be collected tomorrow.",
      "level": 1
    },
    {
      "id": "184",
      "text": "The nurse asks if it's possible to have it tonight.",
      "level": 1
    },
    {
      "id": "185",
      "text": "Cynthia generously agrees to fill it if they have time.",
      "level": 1
    },
    {
      "id": "186",
      "text": "The nurse leaves.",
      "level": 1
    },
    {
      "id": "187",
      "text": "Cynthia takes a large bottle from a shelf and fills the returned bottle, placing it on a table outside.",
      "level": 1
    },
    {
      "id": "188",
      "text": "Hastings laughs, asking if \"discipline must be maintained?\"",
      "level": 1
    },
    {
      "id": "189",
      "text": "Cynthia agrees and invites them to the balcony overlooking the wards.",
      "level": 1
    },
    {
      "id": "190",
      "text": "Lawrence remains inside.",
      "level": 1
    },
    {
      "id": "191",
      "text": "Cynthia calls Lawrence out to join them.",
      "level": 1
    },
    {
      "id": "192",
      "text": "Cynthia checks her watch and asks Nibs if everything is alright.",
      "level": 1
    },
    {
      "id": "193",
      "text": "Nibs confirms it is.",
      "level": 1
    },
    {
      "id": "194",
      "text": "Cynthia says they can lock up and leave.",
      "level": 1
    },
    {
      "id": "195",
      "text": "Hastings' opinion of Lawrence changes; he finds him shy and reserved but with likable qualities.",
      "level": 1
    },
    {
      "id": "195.1",
      "text": "He had previously found Lawrence's demeanor towards Cynthia unnatural, and her response shy.",
      "level": 2
    },
    {
      "id": "195.2",
      "text": "That afternoon, they are both cheerful and converse animatedly, like children.",
      "level": 2
    },
    {
      "id": "196",
      "text": "While driving through the woods, Hastings remembers needing stamps and they stop at the post office.",
      "level": 1
    },
    {
      "id": "197",
      "text": "Hastings bumps into a small man exiting the post office.",
      "level": 1
    },
    {
      "id": "198",
      "text": "The man exclaims, hugs him tightly, and kisses him passionately, calling him \"Dear Hastings!\"",
      "level": 1
    },
    {
      "id": "199",
      "text": "Hastings recognizes him as Poirot.",
      "level": 1
    },
    {
      "id": "200",
      "text": "Hastings introduces Poirot to Cynthia as his old friend.",
      "level": 1
    },
    {
      "id": "201",
      "text": "Cynthia happily states they know Monsieur Poirot and is surprised he is Hastings' friend.",
      "level": 1
    },
    {
      "id": "202",
      "text": "Poirot explains he knows Miss Cynthia and that he is here due to the kindness of Mrs. Inglethorp.",
      "level": 1
    },
    {
      "id": "202.1",
      "text": "She kindly entertained him and seven other compatriots, refugees from their homeland.",
      "level": 2
    },
    {
      "id": "202.2",
      "text": "He states Belgians will always remember her with gratitude.",
      "level": 2
    },
    {
      "id": "203",
      "text": "Poirot is described as a diminutive man, barely five feet four inches, but of very dignified bearing.",
      "level": 1
    },
    {
      "id": "203.1",
      "text": "His head is egg-shaped, and he habitually tilts it.",
      "level": 2
    },
    {
      "id": "203.2",
      "text": "His stiff, upturned mustache is military-like.",
      "level": 2
    },
    {
      "id": "203.3",
      "text": "His attire is impeccably neat; he would be more distressed by a speck of dust than a bullet wound.",
      "level": 2
    },
    {
      "id": "203.4",
      "text": "He was one of the most famous members of the Belgian police force, possessing extraordinary talent as a detective and solving many difficult cases.",
      "level": 2
    },
    {
      "id": "204",
      "text": "Poirot points out his cottage, and Hastings promises to visit soon.",
      "level": 1
    },
    {
      "id": "205",
      "text": "He nods theatrically to Cynthia and they leave.",
      "level": 1
    },
    {
      "id": "206",
      "text": "Cynthia calls Poirot a \"charming little man\" and is surprised Hastings knows him.",
      "level": 1
    },
    {
      "id": "207",
      "text": "Hastings replies they are unknowingly entertaining a celebrity.",
      "level": 1
    },
    {
      "id": "208",
      "text": "On the way home, Hastings recounts Poirot's achievements.",
      "level": 1
    },
    {
      "id": "209",
      "text": "They return home joyfully.",
      "level": 1
    },
    {
      "id": "210",
      "text": "As they enter the hall, Mrs. Inglethorp emerges from her boudoir, looking agitated.",
      "level": 1
    },
    {
      "id": "211",
      "text": "She exclaims, \"Oh, it's you.\"",
      "level": 1
    },
    {
      "id": "212",
      "text": "Cynthia asks what's wrong.",
      "level": 1
    },
    {
      "id": "213",
      "text": "Mrs. Inglethorp says, \"Nothing,\" but then asks the maid, Dorcas, for stamps.",
      "level": 1
    },
    {
      "id": "214",
      "text": "Dorcas hesitates and suggests Mrs. Inglethorp should go to bed.",
      "level": 1
    },
    {
      "id": "215",
      "text": "Mrs. Inglethorp agrees she is tired but needs to write letters and asks if the fire is lit in her room.",
      "level": 1
    },
    {
      "id": "216",
      "text": "She re-enters her room, and Cynthia watches her, wondering what happened.",
      "level": 1
    },
    {
      "id": "217",
      "text": "Lawrence seems not to hear and walks out.",
      "level": 1
    },
    {
      "id": "218",
      "text": "Hastings suggests a quick tennis match with Cynthia before dinner.",
      "level": 1
    },
    {
      "id": "219",
      "text": "As Hastings goes to fetch his racket, Mrs. Cavendish comes downstairs, appearing peculiar and distracted.",
      "level": 1
    },
    {
      "id": "220",
      "text": "Hastings casually asks if she went for a walk with Dr. Boastin.",
      "level": 1
    },
    {
      "id": "221",
      "text": "She replies curtly \"No,\" and asks where Mrs. Inglethorp is.",
      "level": 1
    },
    {
      "id": "222",
      "text": "Mary grips the banister and hurries towards the boudoir, closing the door behind her.",
      "level": 1
    },
    {
      "id": "223",
      "text": "Hastings passes the open boudoir window and overhears fragments of a conversation.",
      "level": 1
    },
    {
      "id": "223.1",
      "text": "Mary Cavendish asks Mrs. Inglethorp if she can see something.",
      "level": 2
    },
    {
      "id": "223.2",
      "text": "Mrs. Inglethorp replies it's nothing.",
      "level": 2
    },
    {
      "id": "223.3",
      "text": "Mary insists.",
      "level": 2
    },
    {
      "id": "223.4",
      "text": "Mrs. Inglethorp denies it's as Mary thinks and it doesn't concern her.",
      "level": 2
    },
    {
      "id": "223.5",
      "text": "Mary says sadly that she knew Mrs. Inglethorp would defend him.",
      "level": 2
    },
    {
      "id": "224",
      "text": "Cynthia eagerly greets Hastings, announcing they've had a big row, and she's heard all about it from Dorcas.",
      "level": 1
    },
    {
      "id": "225",
      "text": "Hastings asks who argued.",
      "level": 1
    },
    {
      "id": "226",
      "text": "Cynthia says Emily and 'him', wishing Emily would see through him.",
      "level": 1
    },
    {
      "id": "227",
      "text": "Hastings asks if Dorcas was present.",
      "level": 1
    },
    {
      "id": "228",
      "text": "Cynthia says no, just happened to be at the door. She describes it as a \"complete breakdown\" and wishes she knew all the details.",
      "level": 1
    },
    {
      "id": "229",
      "text": "Hastings recalls Mrs. Rex and Evelyn Howard's warning but wisely remains silent.",
      "level": 1
    },
    {
      "id": "229.1",
      "text": "Cynthia speculates excitedly that 'Aunt Emily' will kick him out and never speak to him again.",
      "level": 2
    },
    {
      "id": "230",
      "text": "Hastings is eager to see John but cannot find him, sensing something serious happened.",
      "level": 1
    },
    {
      "id": "231",
      "text": "He tries to dismiss the overheard words but can't shake them from his mind.",
      "level": 1
    },
    {
      "id": "231.1",
      "text": "He wonders what Mary Cavendish was concerned about.",
      "level": 2
    },
    {
      "id": "232",
      "text": "Mr. Inglethorp is sitting in the drawing-room when Hastings comes down for dinner.",
      "level": 1
    },
    {
      "id": "232.1",
      "text": "His expression is as indifferent as ever, reinforcing Hastings' dislike of his unpleasant hypocrisy.",
      "level": 2
    },
    {
      "id": "233",
      "text": "Mrs. Inglethorp is the last to arrive, still looking agitated.",
      "level": 1
    },
    {
      "id": "234",
      "text": "There is a tense silence during dinner.",
      "level": 1
    },
    {
      "id": "234.1",
      "text": "Inglethorp is calm, playing the role of a devoted husband by attending to his wife.",
      "level": 2
    },
    {
      "id": "235",
      "text": "After dinner, Mrs. Inglethorp immediately returns to her boudoir.",
      "level": 1
    },
    {
      "id": "236",
      "text": "She calls for her coffee, needing to send it before the post closes.",
      "level": 1
    },
    {
      "id": "237",
      "text": "Hastings and Cynthia sit by the open drawing-room window.",
      "level": 1
    },
    {
      "id": "238",
      "text": "Mary Cavendish brings them coffee, appearing somewhat excited.",
      "level": 1
    },
    {
      "id": "239",
      "text": "She asks if they prefer lights or twilight.",
      "level": 1
    },
    {
      "id": "240",
      "text": "She asks Cynthia to take Mrs. Inglethorp's coffee to her.",
      "level": 1
    },
    {
      "id": "241",
      "text": "Alfred says he will take it.",
      "level": 1
    },
    {
      "id": "242",
      "text": "He pours a cup and leaves the room with it.",
      "level": 1
    },
    {
      "id": "243",
      "text": "Lawrence also leaves.",
      "level": 1
    },
    {
      "id": "244",
      "text": "Mary Cavendish sits beside Hastings and Cynthia.",
      "level": 1
    },
    {
      "id": "245",
      "text": "They sit in silence; it's a pleasant, quiet, and hot evening.",
      "level": 1
    },
    {
      "id": "246",
      "text": "Mary fans herself with a palm-leaf fan, muttering about an impending thunderstorm.",
      "level": 1
    },
    {
      "id": "247",
      "text": "The pleasant evening is shattered by the familiar, unpleasant voice from the hall.",
      "level": 1
    },
    {
      "id": "248",
      "text": "Cynthia exclaims, \"Dr. Boastin! How strange, at this hour.\"",
      "level": 1
    },
    {
      "id": "249",
      "text": "Mary Cavendish appears composed, her pale cheeks unchanged.",
      "level": 1
    },
    {
      "id": "250",
      "text": "Alfred Inglethorp brings the doctor in, who is laughing and claims he is unfit to be seen.",
      "level": 1
    },
    {
      "id": "250.1",
      "text": "He is covered in mud.",
      "level": 2
    },
    {
      "id": "251",
      "text": "Mary asks what he's doing.",
      "level": 1
    },
    {
      "id": "252",
      "text": "Dr. Boastin explains he didn't intend to come in but Mr. Inglethorp insisted.",
      "level": 1
    },
    {
      "id": "253",
      "text": "John joins them and suggests the doctor have some coffee and explain his predicament.",
      "level": 1
    },
    {
      "id": "254",
      "text": "The doctor explains he fell into a pond while trying to collect a rare fern.",
      "level": 1
    },
    {
      "id": "254.1",
      "text": "His clothes dried quickly, but he fears he lost face.",
      "level": 2
    },
    {
      "id": "255",
      "text": "Mrs. Inglethorp calls for Cynthia from the corridor.",
      "level": 1
    },
    {
      "id": "256",
      "text": "She asks for her brief-case as she plans to sleep.",
      "level": 1
    },
    {
      "id": "257",
      "text": "Hastings and John are present when Cynthia retrieves the case.",
      "level": 1
    },
    {
      "id": "258",
      "text": "Three witnesses confirm Mrs. Inglethorp was holding her coffee and had not yet drunk it.",
      "level": 1
    },
    {
      "id": "259",
      "text": "Dr. Boastin's appearance ruined Hastings' evening.",
      "level": 1
    },
    {
      "id": "260",
      "text": "He finally leaves, much to Hastings' relief.",
      "level": 1
    },
    {
      "id": "261",
      "text": "Mr. Inglethorp offers to walk with the doctor to the village, stating he needs to see his real estate agent and will take the front door key.",
      "level": 1
    },
    {
      "id": "262",
      "text": "A floor plan of the second story of Styles Court is provided.",
      "level": 1
    },
    {
      "id": "263",
      "text": "The door 'b' leads to the servants' rooms, not connected to the right wing where the Inglethorps' rooms are.",
      "level": 1
    },
    {
      "id": "264",
      "text": "She has locked herself in.",
      "level": 1
    },
    {
      "id": "265",
      "text": "Hastings jumps out of bed and follows Lawrence down the corridor and long gallery to the right side of the house.",
      "level": 1
    },
    {
      "id": "266",
      "text": "John Cavendish arrives, along with some servants, looking awed and excited.",
      "level": 1
    },
    {
      "id": "267",
      "text": "Lawrence asks John what they should do.",
      "level": 1
    },
    {
      "id": "268",
      "text": "John tries the handle of Mrs. Inglethorp's door but to no avail; it's locked from the inside.",
      "level": 1
    },
    {
      "id": "269",
      "text": "The whole household is awakened by terrifying sounds from the room.",
      "level": 1
    },
    {
      "id": "270",
      "text": "Dorcas suggests trying through Mr. Inglethorp's room.",
      "level": 1
    },
    {
      "id": "271",
      "text": "John opens Inglethorp's door; the room is dark.",
      "level": 1
    },
    {
      "id": "272",
      "text": "Lawrence enters with a candle, and they see the bed has not been slept in and there are no signs of anyone having been there.",
      "level": 1
    },
    {
      "id": "273",
      "text": "They approach the door connecting to the adjoining room, but it is also locked.",
      "level": 1
    },
    {
      "id": "274",
      "text": "Dorcas exclaims in distress.",
      "level": 1
    },
    {
      "id": "275",
      "text": "Hastings suggests they must force the door.",
      "level": 1
    },
    {
      "id": "276",
      "text": "He asks for a maid to wake Bailey to fetch Dr. Wilkins.",
      "level": 1
    },
    {
      "id": "277",
      "text": "He asks if there isn't a door to Miss Cynthia's room.",
      "level": 1
    },
    {
      "id": "278",
      "text": "A maid confirms there is, but it's always locked and has never been opened.",
      "level": 1
    },
    {
      "id": "279",
      "text": "John rushes to Cynthia's room where Mary Cavendish is trying to wake her.",
      "level": 1
    },
    {
      "id": "280",
      "text": "He returns saying the door is also locked and they must break it down.",
      "level": 1
    },
    {
      "id": "281",
      "text": "They ram the door, but the frame is strong and they struggle to break in.",
      "level": 1
    }
  ],
  "concepts": [
    {
      "name": "Styles Court",
      "frequency": 11,
      "context": "The country estate of Mrs. Inglethorp and the Cavendish family, the setting for the main events of the story."
    },
    {
      "name": "Hastings",
      "frequency": 17,
      "context": "The narrator of the story, an injured soldier recuperating at Styles."
    },
    {
      "name": "John Cavendish",
      "frequency": 15,
      "context": "Eldest son of Mrs. Cavendish, who lives at Styles Court with his wife Mary."
    },
    {
      "name": "Mary Cavendish",
      "frequency": 11,
      "context": "Wife of John Cavendish, described as charming and enigmatic."
    },
    {
      "name": "Mrs. Inglethorp",
      "frequency": 12,
      "context": "The wealthy matriarch of Styles Court, who has remarried to a much younger man, Alfred Inglethorp."
    },
    {
      "name": "Alfred Inglethorp",
      "frequency": 11,
      "context": "Mrs. Inglethorp's much younger second husband, described as vulgar and unpleasant."
    },
    {
      "name": "Evelyn Howard",
      "frequency": 8,
      "context": "Mrs. Inglethorp's companion and housekeeper, who strongly disapproves of Alfred Inglethorp."
    },
    {
      "name": "Lawrence Cavendish",
      "frequency": 5,
      "context": "Younger son of Mrs. Cavendish, a doctor who abandoned his practice for literary pursuits."
    },
    {
      "name": "Cynthia Mudock",
      "frequency": 9,
      "context": "Mrs. Inglethorp's adopted daughter, who works as a nurse and has a connection to the pharmacy."
    },
    {
      "name": "Poirot",
      "frequency": 4,
      "context": "Hastings' friend and a famous detective, who makes an appearance."
    },
    {
      "name": "Dr. Boastin",
      "frequency": 5,
      "context": "A doctor and toxicologist, a friend of Mary Cavendish, who appears in an unusual state."
    },
    {
      "name": "Detective",
      "frequency": 2,
      "context": "Hastings expresses a secret desire to be a detective, inspired by Poirot."
    },
    {
      "name": "Poison",
      "frequency": 2,
      "context": "Mentioned in the context of medical ignorance and the ease of committing poisoning."
    },
    {
      "name": "War",
      "frequency": 3,
      "context": "Hastings is on sick leave from the war, and the war effort is indirectly referenced."
    },
    {
      "name": "Charity bazaar",
      "frequency": 2,
      "context": "An event organized by Mrs. Inglethorp, highlighting her social activities."
    }
  ],
  "relations": [
    {
      "source": "Hastings",
      "target": "Styles Court",
      "type": "visits"
    },
    {
      "source": "John Cavendish",
      "target": "Styles Court",
      "type": "resides_at"
    },
    {
      "source": "Mary Cavendish",
      "target": "John Cavendish",
      "type": "is_wife_of"
    },
    {
      "source": "Mrs. Inglethorp",
      "target": "Styles Court",
      "type": "owns"
    },
    {
      "source": "Alfred Inglethorp",
      "target": "Mrs. Inglethorp",
      "type": "is_husband_of"
    },
    {
      "source": "Evelyn Howard",
      "target": "Mrs. Inglethorp",
      "type": "is_companion_of"
    },
    {
      "source": "Evelyn Howard",
      "target": "Alfred Inglethorp",
      "type": "disapproves_of"
    },
    {
      "source": "Lawrence Cavendish",
      "target": "Mrs. Inglethorp",
      "type": "is_son_of"
    },
    {
      "source": "Cynthia Mudock",
      "target": "Mrs. Inglethorp",
      "type": "is_adopted_daughter_of"
    },
    {
      "source": "Poirot",
      "target": "Hastings",
      "type": "is_friend_of"
    },
    {
      "source": "Dr. Boastin",
      "target": "Mary Cavendish",
      "type": "is_friend_of"
    },
    {
      "source": "Hastings",
      "target": "Detective",
      "type": "aspires_to_be"
    },
    {
      "source": "Mary Cavendish",
      "target": "Dr. Boastin",
      "type": "shows_favoritism_towards"
    },
    {
      "source": "Alfred Inglethorp",
      "target": "Mrs. Rex",
      "type": "alleged_affair_with"
    },
    {
      "source": "Mrs. Inglethorp",
      "target": "Alfred Inglethorp",
      "type": "married_to"
    },
    {
      "source": "Cynthia Mudock",
      "target": "Pharmacy",
      "type": "works_at"
    },
    {
      "source": "Mrs. Inglethorp",
      "target": "Charity bazaar",
      "type": "organizes"
    }
  ],
  "hierarchy": {
    "main_topics": [
      "Introduction and Arrival at Styles",
      "Family Dynamics and Tensions",
      "The Departure of Evelyn Howard",
      "Daily Life and Events",
      "The Poisoning Incident Preparations",
      "The Tragic Night and Discovery"
    ],
    "structure": "The document follows a chronological narrative, introducing characters and the setting, then detailing events leading up to a significant incident, with the initial chapters focusing on character introductions and the build-up of atmosphere, and later chapters delving into specific timelines and the unfolding mystery. The structure is divided into chapters indicated by headings."
  }
}