{
  "propositions": [
    {
      "id": "1",
      "text": "Anyone surprised by a recurrence of past experiences or emotions?",
      "level": 1
    },
    {
      "id": "1.1",
      "text": "The phrase \"It happened before...\" shakes the soul.",
      "level": 2
    },
    {
      "id": "1.1.1",
      "text": "Why does it shake the soul?",
      "level": 3
    },
    {
      "id": "2",
      "text": "The narrator, Arthur Hastings, reflects on his life while looking out the train window at the Essex landscape.",
      "level": 1
    },
    {
      "id": "2.1",
      "text": "He believes his life's peak is over.",
      "level": 2
    },
    {
      "id": "2.2",
      "text": "He recalls being wounded in the Great War.",
      "level": 2
    },
    {
      "id": "2.3",
      "text": "The war remains a central memory, even with the Second World War looming.",
      "level": 2
    },
    {
      "id": "3",
      "text": "In 1916, a young Hastings felt mature.",
      "level": 1
    },
    {
      "id": "3.1",
      "text": "He did not expect his life to truly begin then.",
      "level": 2
    },
    {
      "id": "4",
      "text": "At the end of a trip, he met an influential person.",
      "level": 1
    },
    {
      "id": "4.1",
      "text": "He intended to visit his friend John Cade, whose mother owned Styles Court.",
      "level": 2
    },
    {
      "id": "4.1.1",
      "text": "His intention was to reminisce with his old friend.",
      "level": 3
    },
    {
      "id": "4.1.2",
      "text": "Unexpectedly, he became involved in a bizarre murder case.",
      "level": 3
    },
    {
      "id": "5",
      "text": "At Styles Court, he reunited with Hercule Poirot.",
      "level": 1
    },
    {
      "id": "5.1",
      "text": "Poirot was a short, mustachioed man he had met in Belgium.",
      "level": 2
    },
    {
      "id": "5.1.1",
      "text": "Hastings was surprised to see Poirot walking with a limp.",
      "level": 3
    },
    {
      "id": "5.2",
      "text": "Poirot became Hastings' closest friend and mentor.",
      "level": 2
    },
    {
      "id": "5.2.1",
      "text": "Later, while investigating another murder with Poirot, Hastings met his lifelong companion.",
      "level": 3
    },
    {
      "id": "6",
      "text": "His wife, his lifelong companion, is now buried in Argentina.",
      "level": 1
    },
    {
      "id": "6.1",
      "text": "She died as she wished, without prolonged suffering or aging.",
      "level": 2
    },
    {
      "id": "6.1.1",
      "text": "Her death left him alone and unhappy.",
      "level": 3
    },
    {
      "id": "7",
      "text": "If time could turn back to that day in 1916, much would have changed.",
      "level": 1
    },
    {
      "id": "7.1",
      "text": "Many familiar faces are forgotten.",
      "level": 2
    },
    {
      "id": "7.2",
      "text": "Styles Court no longer belongs to the Cade family.",
      "level": 2
    },
    {
      "id": "7.2.1",
      "text": "John Cade has died.",
      "level": 3
    },
    {
      "id": "7.2.2",
      "text": "Mrs. Mary Cade, a captivating and mysterious beauty, still lives in Devonshire.",
      "level": 3
    },
    {
      "id": "7.2.3",
      "text": "Lawrence and his wife have moved to South Africa.",
      "level": 3
    },
    {
      "id": "7.2.4",
      "text": "Everything has changed.",
      "level": 3
    },
    {
      "id": "8",
      "text": "Yet, one thing remains the same: Hastings is going to Styles Court to visit Hercule Poirot.",
      "level": 1
    },
    {
      "id": "9",
      "text": "Hastings was delighted to receive a letter from Poirot, postmarked from Styles Court, Essex.",
      "level": 1
    },
    {
      "id": "9.1",
      "text": "He hadn't seen Poirot in nearly a year.",
      "level": 2
    },
    {
      "id": "9.1.1",
      "text": "The letter brought him a surge of emotion.",
      "level": 3
    },
    {
      "id": "9.2",
      "text": "Poirot mentioned his advanced age and suffering from arthritis.",
      "level": 2
    },
    {
      "id": "9.2.1",
      "text": "He had gone to Egypt for treatment, but his condition worsened, forcing his return.",
      "level": 3
    },
    {
      "id": "9.2.2",
      "text": "Despite his ailments, Poirot's letter was full of brightness and cheer.",
      "level": 3
    },
    {
      "id": "10",
      "text": "Poirot's letter inquired if the return address sparked curiosity and nostalgia.",
      "level": 1
    },
    {
      "id": "10.1",
      "text": "He confirmed he was at Styles Court, which had been converted into a \"high-class hotel.\"",
      "level": 2
    },
    {
      "id": "10.1.1",
      "text": "The hotel was run by a retired Colonel, a \"public school\" man from India.",
      "level": 3
    },
    {
      "id": "10.1.2",
      "text": "However, his wife managed the establishment effectively but was sharp-tongued.",
      "level": 3
    },
    {
      "id": "10.1.2.1",
      "text": "Poirot joked he wouldn't put up with such treatment.",
      "level": 4
    },
    {
      "id": "10.2",
      "text": "Poirot had seen an advertisement for the hotel, which evoked a desire to revisit the place of his first stay in England.",
      "level": 2
    },
    {
      "id": "10.3",
      "text": "He found pleasure in revisiting past memories at his age.",
      "level": 2
    },
    {
      "id": "11",
      "text": "Poirot had arrived at Styles Court and discovered a friend of Mrs. Cade's, a Baronet, was also staying there.",
      "level": 1
    },
    {
      "id": "11.1",
      "text": "This reminded him of a plan.",
      "level": 2
    },
    {
      "id": "11.1.1",
      "text": "The Baronet intended to invite his friends, the Franklins, for a summer holiday.",
      "level": 3
    },
    {
      "id": "11.1.2",
      "text": "Poirot decided to invite Hastings to join them, suggesting a happy reunion of old friends.",
      "level": 3
    },
    {
      "id": "11.1.3",
      "text": "He urged Hastings to come quickly.",
      "level": 4
    },
    {
      "id": "11.1.3.1",
      "text": "Poirot had secured a room with a bathroom for Hastings, which had been modernized.",
      "level": 5
    },
    {
      "id": "11.1.3.2",
      "text": "He and Mrs. Raikswell had negotiated a significant discount on the rent.",
      "level": 5
    },
    {
      "id": "11.1.4",
      "text": "The Franklins and their daughter had already arrived.",
      "level": 4
    },
    {
      "id": "11.1.5",
      "text": "Everything was arranged for Hastings to arrive with a clear mind.",
      "level": 4
    },
    {
      "id": "12",
      "text": "Hastings considered the invitation and accepted.",
      "level": 1
    },
    {
      "id": "12.1",
      "text": "He had no encumbrances or fixed family ties.",
      "level": 2
    },
    {
      "id": "12.1.1",
      "text": "His son was in the navy.",
      "level": 3
    },
    {
      "id": "12.1.2",
      "text": "Another son was married and ran a farm in Argentina.",
      "level": 3
    },
    {
      "id": "12.1.3",
      "text": "His daughter Grace was married to a soldier and lived in India.",
      "level": 3
    },
    {
      "id": "12.1.4",
      "text": "Only Judith remained with him.",
      "level": 3
    },
    {
      "id": "12.1.4.1",
      "text": "He privately doted on her, though he didn't show it.",
      "level": 4
    },
    {
      "id": "12.1.4.2",
      "text": "He found Judith enigmatic and couldn't understand her thoughts.",
      "level": 4
    },
    {
      "id": "12.1.4.3",
      "text": "This often caused him frustration and distress.",
      "level": 4
    },
    {
      "id": "12.1.4.4",
      "text": "His wife understood Judith better, attributing her reserve to excessive self-control rather than a lack of trust.",
      "level": 4
    },
    {
      "id": "12.1.4.5",
      "text": "However, his wife also worried about Judith's volatile emotions, intense focus, and secretive nature, which could lead to a lack of security.",
      "level": 4
    },
    {
      "id": "12.1.4.6",
      "text": "Judith had a tendency towards inexplicable, profound contemplation or even blind acts of passion and sorrow.",
      "level": 4
    },
    {
      "id": "12.1.4.7",
      "text": "She was the most intelligent of his children.",
      "level": 4
    },
    {
      "id": "12.1.4.8",
      "text": "He and his wife were pleased when she decided to go to university.",
      "level": 4
    },
    {
      "id": "12.1.4.9",
      "text": "She obtained a BSc about a year ago and was hired as an assistant to a physician researching tropical diseases.",
      "level": 4
    },
    {
      "id": "12.1.4.10",
      "text": "The physician's wife was frail and often ill.",
      "level": 4
    },
    {
      "id": "12.1.4.11",
      "text": "Hastings worried she might be in love with her employer, but was relieved to learn their relationship was purely professional.",
      "level": 4
    },
    {
      "id": "12.1.4.12",
      "text": "He felt Judith loved him but rarely showed it, and he suspected she disdained his sentimentality and old-fashioned views.",
      "level": 4
    },
    {
      "id": "13",
      "text": "His thoughts were interrupted as the train arrived at St. Mary's Mead station.",
      "level": 1
    },
    {
      "id": "13.1",
      "text": "The station itself seemed unchanged by time.",
      "level": 2
    },
    {
      "id": "13.1.1",
      "text": "Even the solitary stones in the field appeared the same.",
      "level": 3
    },
    {
      "id": "13.2",
      "text": "However, as the taxi drove through the town, Hastings felt the impact of time.",
      "level": 2
    },
    {
      "id": "13.2.1",
      "text": "St. Mary's Mead had transformed, with gas stations, cinemas, two new hotels, and neat rows of council houses.",
      "level": 3
    },
    {
      "id": "14",
      "text": "Upon arriving at Styles Court, Hastings felt as if he had traveled back in time.",
      "level": 1
    },
    {
      "id": "14.1",
      "text": "The expansive grounds were as he remembered.",
      "level": 2
    },
    {
      "id": "14.1.1",
      "text": "However, the driveway was overgrown with weeds.",
      "level": 3
    },
    {
      "id": "14.2",
      "text": "The house itself looked the same externally but clearly needed redecoration.",
      "level": 2
    },
    {
      "id": "15",
      "text": "A lady was tending to the flowerbeds, as had Evelyn Howard twenty years prior.",
      "level": 1
    },
    {
      "id": "15.1",
      "text": "Hastings was startled, then amused to see her approach.",
      "level": 2
    },
    {
      "id": "15.1.1",
      "text": "She was a stark contrast to the robust Evelyn Howard.",
      "level": 3
    },
    {
      "id": "15.2",
      "text": "The lady was a slender, middle-aged woman with graying curly hair, rosy cheeks, and indifferent blue eyes.",
      "level": 2
    },
    {
      "id": "16",
      "text": "\"Captain Hastings?\" she asked, introducing herself as Mrs. Raikswell.",
      "level": 1
    },
    {
      "id": "16.1",
      "text": "She apologized for her muddy hands.",
      "level": 2
    },
    {
      "id": "16.1.1",
      "text": "She welcomed him, admitting she and her husband had struggled to run the hotel, never expecting to become innkeepers.",
      "level": 3
    },
    {
      "id": "16.1.2",
      "text": "She warned that she was business-minded and would add extra charges where possible.",
      "level": 3
    },
    {
      "id": "16.2",
      "text": "They laughed, but Hastings sensed the truth in her words.",
      "level": 2
    },
    {
      "id": "16.2.1",
      "text": "He perceived a hardness beneath her pleasant exterior.",
      "level": 3
    },
    {
      "id": "16.3",
      "text": "Her accent suggested she was not Irish, despite the brogue.",
      "level": 2
    },
    {
      "id": "17",
      "text": "Hastings inquired about Poirot.",
      "level": 1
    },
    {
      "id": "17.1",
      "text": "Mrs. Raikswell said Poirot was eagerly awaiting him and that his condition was moving.",
      "level": 2
    },
    {
      "id": "18",
      "text": "As they walked towards the house, she removed her gardening gloves.",
      "level": 1
    },
    {
      "id": "18.1",
      "text": "She commented on Hastings' daughter, Judith.",
      "level": 2
    },
    {
      "id": "18.1.1",
      "text": "She called Judith a pretty girl and a topic of conversation.",
      "level": 3
    },
    {
      "id": "18.1.2",
      "text": "Mrs. Raikswell felt a girl of Judith's beauty should be attending parties and dancing, not performing scientific work like dissecting rabbits or working with microscopes.",
      "level": 3
    },
    {
      "id": "18.1.3",
      "text": "She questioned why other young girls couldn't do such work.",
      "level": 4
    },
    {
      "id": "19",
      "text": "\"Judith... where is she?\" Hastings asked. \"Is she nearby?\"",
      "level": 1
    },
    {
      "id": "19.1",
      "text": "Mrs. Raikswell made a childish face.",
      "level": 2
    },
    {
      "id": "19.1.1",
      "text": "She said Judith was confined to a laboratory at the far end of the grounds.",
      "level": 3
    },
    {
      "id": "19.1.2",
      "text": "The laboratory was rented from them by Dr. Franklin and was fully equipped with cages for various animals.",
      "level": 3
    },
    {
      "id": "19.1.3",
      "text": "Mrs. Raikswell expressed her dislike for science.",
      "level": 3
    },
    {
      "id": "19.1.4",
      "text": "She announced her husband's arrival.",
      "level": 3
    },
    {
      "id": "20",
      "text": "Colonel Raikswell approached from the corner of the house.",
      "level": 1
    },
    {
      "id": "20.1",
      "text": "He was tall and thin, with gentle blue eyes and a wispy white mustache.",
      "level": 2
    },
    {
      "id": "20.2",
      "text": "His demeanor lacked decisiveness and composure.",
      "level": 2
    },
    {
      "id": "21",
      "text": "\"George, Captain Hastings is here,\" Mrs. Raikswell said.",
      "level": 1
    },
    {
      "id": "21.1",
      "text": "Colonel Raikswell shook Hastings' hand, confirming his arrival time.",
      "level": 2
    },
    {
      "id": "22",
      "text": "Mrs. Raikswell curtly instructed George to entertain Hastings, offering tea or immediate access to Poirot.",
      "level": 1
    },
    {
      "id": "22.1",
      "text": "Hastings preferred to see Poirot first.",
      "level": 2
    },
    {
      "id": "23",
      "text": "Mrs. Raikswell told George it was his job to escort Hastings, as she was busy with the gardens.",
      "level": 1
    },
    {
      "id": "23.1",
      "text": "George agreed.",
      "level": 2
    },
    {
      "id": "24",
      "text": "As Hastings followed Colonel Raikswell, a thin man with graying hair and binoculars rushed out, speaking excitedly about bird nests.",
      "level": 1
    },
    {
      "id": "24.1",
      "text": "He was identified as Norton, an eccentric bird enthusiast.",
      "level": 2
    },
    {
      "id": "25",
      "text": "Inside the hall, a large man was by the table, ending a phone call.",
      "level": 1
    },
    {
      "id": "25.1",
      "text": "He complained angrily about contractors and builders.",
      "level": 2
    },
    {
      "id": "25.2",
      "text": "Despite his anger, his comical frustration made Hastings and the Colonel laugh.",
      "level": 2
    },
    {
      "id": "25.3",
      "text": "Hastings was struck by the man's appearance: over fifty, still dapper, tanned from outdoor life, and possessing a rare, frank, and outdoorsy demeanor.",
      "level": 2
    },
    {
      "id": "26",
      "text": "Colonel Raikswell introduced him as William Pott Carrington, a former provincial governor in India known for his administrative skills, excellent shot, and renowned hunter.",
      "level": 1
    },
    {
      "id": "26.1",
      "text": "Hastings felt a sense of melancholy that such men were becoming rare in the current degenerate era.",
      "level": 2
    },
    {
      "id": "27",
      "text": "Carrington expressed his pleasure at meeting Hastings, mentioning Poirot had spoken of him and his beautiful daughter.",
      "level": 1
    },
    {
      "id": "27.1",
      "text": "Hastings smiled, suggesting Judith rarely mentioned him.",
      "level": 2
    },
    {
      "id": "27.2",
      "text": "Carrington countered that modern young women might resist acknowledging their relationship with parents.",
      "level": 2
    },
    {
      "id": "27.2.1",
      "text": "He joked that parents could be seen as embarrassing.",
      "level": 3
    },
    {
      "id": "27.3",
      "text": "Carrington expressed concern that Judith, while beautiful, was over-educated and perhaps too refined.",
      "level": 2
    },
    {
      "id": "27.4",
      "text": "He then returned to the phone, apologizing for tying up the switchboard.",
      "level": 2
    },
    {
      "id": "28",
      "text": "Colonel Raikswell agreed to the call.",
      "level": 1
    },
    {
      "id": "29",
      "text": "Hastings followed Carrington upstairs to the furthest room on the left, which Poirot had booked for him.",
      "level": 1
    },
    {
      "id": "29.1",
      "text": "He noticed changes in the corridor, with former large bedrooms divided into smaller ones.",
      "level": 2
    },
    {
      "id": "29.2",
      "text": "His room was small, equipped with modern amenities, but furnished with cheap modern furniture that he found unappealing.",
      "level": 2
    },
    {
      "id": "29.2.1",
      "text": "He would have preferred furniture that harmonized with the house's style.",
      "level": 3
    },
    {
      "id": "30",
      "text": "His luggage was already there.",
      "level": 1
    },
    {
      "id": "30.1",
      "text": "Colonel Raikswell informed him Poirot's room was opposite.",
      "level": 2
    },
    {
      "id": "30.2",
      "text": "As Colonel Raikswell was about to escort him, Mrs. Raikswell's sharp voice called \"George!\" from downstairs.",
      "level": 2
    },
    {
      "id": "30.3",
      "text": "Colonel Raikswell apologized and hurried away.",
      "level": 2
    },
    {
      "id": "31",
      "text": "Hastings' heart quickened as he crossed the corridor and knocked on Poirot's door.",
      "level": 1
    },
    {
      "id": "32",
      "text": "The first chapter ends with Hastings about to meet Poirot.",
      "level": 1
    },
    {
      "id": "33",
      "text": "Chapter Two begins with Hastings observing the sad decline of old age.",
      "level": 1
    },
    {
      "id": "33.1",
      "text": "He recalls Poirot's former appearance and contrasts it with his current state.",
      "level": 2
    },
    {
      "id": "34",
      "text": "Poirot is now confined to a wheelchair due to arthritis.",
      "level": 1
    },
    {
      "id": "34.1",
      "text": "His once plump body is now thin and frail.",
      "level": 2
    },
    {
      "id": "34.2",
      "text": "His face is covered in wrinkles.",
      "level": 2
    },
    {
      "id": "34.3",
      "text": "His mustache and hair are still black, but Hastings notes that dyed black hair can make one look pitiable.",
      "level": 2
    },
    {
      "id": "34.3.1",
      "text": "He was surprised to learn Poirot used hair dye.",
      "level": 3
    },
    {
      "id": "34.3.2",
      "text": "The effect was unnatural, making others suspect a wig or a false mustache.",
      "level": 3
    },
    {
      "id": "34.4",
      "text": "Only Poirot's eyes remain unchanged, bright and now moist with emotion.",
      "level": 2
    },
    {
      "id": "35",
      "text": "\"Oh, Hastings, Hastings!\" Poirot exclaims, embracing him warmly.",
      "level": 1
    },
    {
      "id": "36",
      "text": "Poirot sits back, scrutinizing Hastings.",
      "level": 1
    },
    {
      "id": "36.1",
      "text": "\"You haven't changed at all,\" he observes, noting Hastings' posture and broad shoulders, \"still strong in old age.\"",
      "level": 2
    },
    {
      "id": "36.2",
      "text": "He jokingly asks if ladies still pursue Hastings.",
      "level": 2
    },
    {
      "id": "37",
      "text": "Hastings retorts, \"And you, Poirot?\"",
      "level": 1
    },
    {
      "id": "37.1",
      "text": "Poirot describes himself as like a corpse: unable to walk, bent over, dependent on others for everything except eating.",
      "level": 2
    },
    {
      "id": "37.1.1",
      "text": "He likens his state to that of an infant.",
      "level": 3
    },
    {
      "id": "37.2",
      "text": "He adds, \"Externally dilapidated, but internally full.\"",
      "level": 2
    },
    {
      "id": "38",
      "text": "Hastings agrees, \"Externally strong, internally sound. Heart is still good.\"",
      "level": 1
    },
    {
      "id": "38.1",
      "text": "Poirot clarifies he means his mind, not his heart, is still sharp.",
      "level": 2
    },
    {
      "id": "39",
      "text": "Hastings understands Poirot's mind has not declined.",
      "level": 1
    },
    {
      "id": "40",
      "text": "\"Do you like it here?\" Hastings asks.",
      "level": 1
    },
    {
      "id": "40.1",
      "text": "Poirot shrugs, stating he has no complaints, though it's not the Ritz.",
      "level": 2
    },
    {
      "id": "40.2",
      "text": "He criticizes the food, calling it a compilation of the worst British cuisine.",
      "level": 2
    },
    {
      "id": "40.2.1",
      "text": "He finds Brussels sprouts tough and overcooked potatoes bland.",
      "level": 3
    },
    {
      "id": "40.2.2",
      "text": "He complains about the lack of seasoning in vegetables.",
      "level": 3
    },
    {
      "id": "40.3",
      "text": "He further laments the modernized bathrooms, with only lukewarm water and thin, clingy towels.",
      "level": 2
    },
    {
      "id": "41",
      "text": "Hastings wistfully recalls the luxurious bathrooms of the old Styles Court, with its mahogany tub, steaming hot water, large towels, and a shining brass kettle.",
      "level": 1
    },
    {
      "id": "42",
      "text": "Poirot states he has good reason to endure the discomforts.",
      "level": 1
    },
    {
      "id": "43",
      "text": "Hastings, concerned, asks if Poirot is in financial trouble, mentioning the stock market crash after the war.",
      "level": 1
    },
    {
      "id": "43.1",
      "text": "Poirot immediately dismisses the idea, asserting he is well-off and not there to save money.",
      "level": 2
    },
    {
      "id": "44",
      "text": "Hastings expresses understanding of the desire to recapture past feelings.",
      "level": 1
    },
    {
      "id": "44.1",
      "text": "He admits returning to this place evokes complex emotions.",
      "level": 2
    },
    {
      "id": "45",
      "text": "Poirot states he feels no such thing.",
      "level": 1
    },
    {
      "id": "46",
      "text": "\"It was a colorful time,\" Hastings says sadly.",
      "level": 1
    },
    {
      "id": "47",
      "text": "Poirot recounts his own arrival in England as a refugee, a time of sorrow and hardship, not happiness.",
      "level": 1
    },
    {
      "id": "47.1",
      "text": "He never expected England to become his second home.",
      "level": 2
    },
    {
      "id": "48",
      "text": "Hastings confesses he had forgotten that.",
      "level": 1
    },
    {
      "id": "49",
      "text": "Poirot observes that people tend to project their own experiences onto others, believing Hastings was happy.",
      "level": 1
    },
    {
      "id": "49.1",
      "text": "He reminds Hastings of his own difficult time: recovering from a serious injury, anxiety about returning to the front, and deep despondency.",
      "level": 2
    },
    {
      "id": "49.2",
      "text": "He also recalls Hastings being involved with two women simultaneously.",
      "level": 2
    },
    {
      "id": "50",
      "text": "Hastings blushes and laughs, impressed by Poirot's memory.",
      "level": 1
    },
    {
      "id": "51",
      "text": "Poirot reminds Hastings of his laments about the two women, and his advice to cheer up, hinting at future investigations together.",
      "level": 1
    },
    {
      "id": "51.1",
      "text": "Hastings interrupts, recalling they did meet another woman when investigating a murder in France.",
      "level": 2
    },
    {
      "id": "52",
      "text": "Poirot gently pats Hastings' arm, telling him to let go of the past and focus on the future.",
      "level": 1
    },
    {
      "id": "53",
      "text": "Hastings expresses doubt about a future worth looking towards.",
      "level": 1
    },
    {
      "id": "54",
      "text": "\"But... there is work waiting for you,\" Poirot says.",
      "level": 1
    },
    {
      "id": "55",
      "text": "\"Work? Where?\" Hastings asks.",
      "level": 1
    },
    {
      "id": "56",
      "text": "\"Right here.\" Poirot replies.",
      "level": 1
    },
    {
      "id": "57",
      "text": "Hastings stares, astonished.",
      "level": 1
    },
    {
      "id": "57.1",
      "text": "He realizes Poirot never answered why he came to Styles Court.",
      "level": 2
    },
    {
      "id": "57.2",
      "text": "Poirot explains he is investigating a murder.",
      "level": 2
    },
    {
      "id": "58",
      "text": "Hastings is further surprised and initially thinks Poirot is joking.",
      "level": 1
    },
    {
      "id": "59",
      "text": "\"Are you serious?\" he asks.",
      "level": 1
    },
    {
      "id": "60",
      "text": "Poirot confirms he is, and that this is why he urgently summoned Hastings.",
      "level": 1
    },
    {
      "id": "60.1",
      "text": "He reiterates his mind is still sharp, though his physical abilities are limited.",
      "level": 2
    },
    {
      "id": "60.2",
      "text": "He states he can only think and strategize, and needs Hastings for the action.",
      "level": 2
    },
    {
      "id": "61",
      "text": "Hastings, breathless, asks if Poirot is telling the truth.",
      "level": 1
    },
    {
      "id": "62",
      "text": "Poirot confirms it, stating they will be partners in hunting a murderer again.",
      "level": 1
    },
    {
      "id": "63",
      "text": "Hastings slowly accepts the reality of Poirot's words.",
      "level": 1
    },
    {
      "id": "64",
      "text": "Poirot asks if Hastings thought he had gone senile.",
      "level": 1
    },
    {
      "id": "65",
      "text": "Hastings, flustered, denies this but expresses surprise at the location.",
      "level": 1
    },
    {
      "id": "66",
      "text": "Poirot asks who he has met.",
      "level": 1
    },
    {
      "id": "66.1",
      "text": "Hastings lists the Raikswells, Norton, and Mr. Pott Carrington, on whom he has a good impression.",
      "level": 2
    },
    {
      "id": "67",
      "text": "Poirot nods, saying that even if Hastings met everyone else, he would still find the situation unexpected.",
      "level": 1
    },
    {
      "id": "68",
      "text": "Hastings asks about the other guests.",
      "level": 1
    },
    {
      "id": "69",
      "text": "Poirot lists the Franklins (doctor and wife), their nurse, Hastings' daughter Judith, a man named Allerton (a womanizer), and a Miss Curlow (around thirty).",
      "level": 1
    },
    {
      "id": "69.1",
      "text": "He describes them all as generally good people.",
      "level": 2
    },
    {
      "id": "70",
      "text": "\"And you say one of them is the murderer?\" Hastings asks.",
      "level": 1
    },
    {
      "id": "71",
      "text": "\"Yes, one of them is the murderer!\" Poirot confirms.",
      "level": 1
    },
    {
      "id": "72",
      "text": "Hastings asks why Poirot suspects this.",
      "level": 1
    },
    {
      "id": "73",
      "text": "Poirot asks Hastings to remain calm and to hand him a small box and a key from the table.",
      "level": 1
    },
    {
      "id": "74",
      "text": "Poirot opens the briefcase and takes out typed documents and newspaper clippings.",
      "level": 1
    },
    {
      "id": "74.1",
      "text": "He suggests Hastings study them when he has time.",
      "level": 2
    },
    {
      "id": "74.2",
      "text": "He advises starting with a summary he prepared, which should help grasp the key points of the cases.",
      "level": 2
    },
    {
      "id": "75",
      "text": "Hastings takes the summary, intrigued.",
      "level": 1
    },
    {
      "id": "76",
      "text": "**Case A: Mrs. Reginald Ashley**",
      "level": 1
    },
    {
      "id": "76.1",
      "text": "Mrs. Ashley had a young, beautiful wife who was unhappy in their marriage.",
      "level": 2
    },
    {
      "id": "76.2",
      "text": "Reginald Ashley died, initially suspected of food poisoning.",
      "level": 2
    },
    {
      "id": "76.3",
      "text": "Autopsy revealed arsenic poisoning.",
      "level": 2
    },
    {
      "id": "76.4",
      "text": "There was old weed killer in the house.",
      "level": 2
    },
    {
      "id": "76.5",
      "text": "Mrs. Ashley was arrested, accused of murder.",
      "level": 2
    },
    {
      "id": "76.6",
      "text": "She had been close to a civil servant returning from India.",
      "level": 2
    },
    {
      "id": "76.7",
      "text": "Evidence against her included the lack of other suspects and the improbability of accidental death.",
      "level": 2
    },
    {
      "id": "76.8",
      "text": "The jury was sympathetic due to her husband's character and the abuse she suffered.",
      "level": 2
    },
    {
      "id": "76.9",
      "text": "Mrs. Ashley was acquitted, but public opinion still condemned her.",
      "level": 2
    },
    {
      "id": "76.10",
      "text": "She died two years later from an overdose of sleeping pills, ruled an accidental death.",
      "level": 2
    },
    {
      "id": "77",
      "text": "**Case B: Miss Shapland**",
      "level": 1
    },
    {
      "id": "77.1",
      "text": "Miss Shapland, a middle-aged spinster, was suffering greatly and became disagreeable.",
      "level": 2
    },
    {
      "id": "77.2",
      "text": "She was cared for by her niece, Frieda Crewe.",
      "level": 2
    },
    {
      "id": "77.3",
      "text": "Miss Shapland died from an overdose of morphine.",
      "level": 2
    },
    {
      "id": "77.4",
      "text": "Frieda Crewe admitted to administering more morphine than usual, to alleviate her aunt's suffering.",
      "level": 2
    },
    {
      "id": "77.5",
      "text": "Authorities believed it was deliberate murder, but lacked sufficient evidence for a prosecution.",
      "level": 2
    },
    {
      "id": "78",
      "text": "**Case C: Edward Lymes**",
      "level": 1
    },
    {
      "id": "78.1",
      "text": "Farmer Lymes suspected his wife of an affair with their lodger, Benn Grahame.",
      "level": 2
    },
    {
      "id": "78.2",
      "text": "Both Mrs. Lymes and Grahame were found shot, killed by Lymes' gun.",
      "level": 2
    },
    {
      "id": "78.3",
      "text": "Lymes surrendered, admitting he might have shot them but claimed no memory of the act, stating he was in a state of mental confusion.",
      "level": 2
    },
    {
      "id": "78.4",
      "text": "He was initially sentenced to death but later commuted to life imprisonment.",
      "level": 2
    },
    {
      "id": "79",
      "text": "**Case D: Derek Bradley**",
      "level": 1
    },
    {
      "id": "79.1",
      "text": "Derek Bradley was having an affair with a young woman.",
      "level": 2
    },
    {
      "id": "79.2",
      "text": "Mrs. Bradley had threatened to kill her husband.",
      "level": 2
    },
    {
      "id": "79.3",
      "text": "Derek Bradley died of cyanide poisoning in his beer.",
      "level": 2
    },
    {
      "id": "79.4",
      "text": "Mrs. Bradley was arrested and charged with murder, eventually confessing and sentenced to death.",
      "level": 2
    },
    {
      "id": "80",
      "text": "**Case E: Marsham Siffleet**",
      "level": 1
    },
    {
      "id": "80.1",
      "text": "Marsham Siffleet was an elderly tyrant who denied his four daughters any entertainment or pocket money.",
      "level": 2
    },
    {
      "id": "80.2",
      "text": "One evening, he was found murdered at the side door, a fatal blow to the head.",
      "level": 2
    },
    {
      "id": "80.3",
      "text": "His eldest daughter, Marjorie, confessed to the crime, stating she did it to ensure her three sisters had happy lives.",
      "level": 2
    },
    {
      "id": "80.4",
      "text": "The sisters inherited a large fortune.",
      "level": 2
    },
    {
      "id": "80.5",
      "text": "Marjorie Siffleet was deemed mentally unsound and confined to a psychiatric hospital, where she soon died.",
      "level": 2
    },
    {
      "id": "81",
      "text": "Hastings, increasingly confused, put down the report and looked at Poirot with doubt.",
      "level": 1
    },
    {
      "id": "82",
      "text": "\"What do you think, my friend?\" Poirot asks.",
      "level": 1
    },
    {
      "id": "83",
      "text": "Hastings admits he remembers the Bradley case from the newspapers, noting Mrs. Bradley was beautiful.",
      "level": 1
    },
    {
      "id": "84",
      "text": "He asks Poirot what these five cases have in common.",
      "level": 1
    },
    {
      "id": "85",
      "text": "Poirot asks for Hastings' opinion first.",
      "level": 1
    },
    {
      "id": "86",
      "text": "Hastings finds it difficult to identify a common thread.",
      "level": 1
    },
    {
      "id": "86.1",
      "text": "He notes the varied locations, social statuses, and backgrounds of the victims.",
      "level": 2
    },
    {
      "id": "86.2",
      "text": "He lists potential motives for each case: jealousy, escape from a husband, financial gain, lack of self-preservation, and a drunken act.",
      "level": 2
    },
    {
      "id": "86.3",
      "text": "He hesitantly asks if he has overlooked a common point.",
      "level": 2
    },
    {
      "id": "87",
      "text": "Poirot confirms Hastings' assessment but adds one crucial point: in each case, there was no doubt about the suspect.",
      "level": 1
    },
    {
      "id": "87.1",
      "text": "He explains that even when acquitted, the public still believed Mrs. Ashley was guilty.",
      "level": 2
    },
    {
      "id": "87.2",
      "text": "Frieda Crewe was also seen as the likely culprit, even if not formally accused.",
      "level": 2
    },
    {
      "id": "87.3",
      "text": "Lymes was the only plausible suspect for his wife's and her lover's deaths.",
      "level": 2
    },
    {
      "id": "87.4",
      "text": "Marjorie Siffleet confessed to her father's murder.",
      "level": 2
    },
    {
      "id": "87.5",
      "text": "In each case, there was only one unquestionable suspect.",
      "level": 2
    },
    {
      "id": "88",
      "text": "Hastings frowns, acknowledging the accuracy but not understanding the conclusion.",
      "level": 1
    },
    {
      "id": "89",
      "text": "Poirot urges him to listen carefully, as he is about to reveal something unknown.",
      "level": 1
    },
    {
      "id": "90",
      "text": "He poses a hypothetical: if there were a person, 'X', who had no apparent motive in any of the cases and was physically distant during one crime, but still had connections to all the victims.",
      "level": 1
    },
    {
      "id": "90.1",
      "text": "Poirot lists these connections: close to Ashley, lived in the same village as Lymes, acquainted with Mrs. Bradley, photographed walking with Frieda Crewe, and near Siffleet's residence at the time of his death.",
      "level": 2
    },
    {
      "id": "91",
      "text": "Hastings observes that five coincidences are too many to be accidental.",
      "level": 1
    },
    {
      "id": "91.1",
      "text": "He concludes that these individual murders must be connected.",
      "level": 2
    },
    {
      "id": "92",
      "text": "Poirot asks if Hastings shares his thought.",
      "level": 1
    },
    {
      "id": "93",
      "text": "Hastings agrees, assuming 'X' is the true murderer.",
      "level": 1
    },
    {
      "id": "94",
      "text": "Poirot reveals that 'X' is living in Styles Court.",
      "level": 1
    },
    {
      "id": "95",
      "text": "\"Here? In Styles Court?\" Hastings exclaims.",
      "level": 1
    },
    {
      "id": "96",
      "text": "Poirot confirms this and asks what Hastings can deduce from this fact.",
      "level": 1
    },
    {
      "id": "97",
      "text": "Hastings responds with a question, \"Then what do you have to say?\"",
      "level": 1
    },
    {
      "id": "98",
      "text": "Poirot solemnly states, \"A murder will happen here soon - right here.\"",
      "level": 1
    },
    {
      "id": "99",
      "text": "Chapter Three begins with Hastings' immediate shock at Poirot's prediction.",
      "level": 1
    },
    {
      "id": "99.1",
      "text": "He quickly recovers, asserting that with Poirot there, it won't happen.",
      "level": 2
    },
    {
      "id": "100",
      "text": "Poirot expresses his happiness at Hastings' trust but fears he may disappoint him this time.",
      "level": 1
    },
    {
      "id": "101",
      "text": "Hastings dismisses this, confident Poirot can prevent it.",
      "level": 1
    },
    {
      "id": "102",
      "text": "Poirot explains the difficulty: he can catch the murderer, but how can he prevent the murder from occurring in the first place?",
      "level": 1
    },
    {
      "id": "103",
      "text": "Hastings realizes the complexity of the problem and trails off.",
      "level": 1
    },
    {
      "id": "104",
      "text": "Poirot outlines three methods of prevention:",
      "level": 1
    },
    {
      "id": "104.1",
      "text": "Warning the intended victim: This is difficult because people may not believe they are in danger, especially from someone close.",
      "level": 2
    },
    {
      "id": "104.2",
      "text": "Warning the murderer: This is often more successful but still has a risk of failure, as murderers tend to be arrogant and believe they are cleverer than anyone else.",
      "level": 2
    },
    {
      "id": "104.3",
      "text": "Precisely predicting the timing and method of the murder and intervening at the exact moment, even if it means catching the murderer in the act.",
      "level": 2
    },
    {
      "id": "104.3.1",
      "text": "Poirot admits this method is extremely difficult and requires meticulous planning, with no guarantee of success.",
      "level": 3
    },
    {
      "id": "105",
      "text": "Poirot states he has tried warning murderers twice before in Egypt and elsewhere, but neither changed their minds, and he expects the same this time.",
      "level": 1
    },
    {
      "id": "106",
      "text": "Hastings asks about the third method.",
      "level": 1
    },
    {
      "id": "107",
      "text": "Hastings believes the first method (warning the victim) is the simplest.",
      "level": 1
    },
    {
      "id": "108",
      "text": "Poirot explains the difficulty: he doesn't know who the victim will be.",
      "level": 1
    },
    {
      "id": "109",
      "text": "Hastings is astonished, realizing the gravity of the situation.",
      "level": 1
    },
    {
      "id": "109.1",
      "text": "He understands there is a connection between the serial murders but doesn't know what it is or the motive.",
      "level": 2
    },
    {
      "id": "110",
      "text": "Poirot acknowledges Hastings' understanding of the difficulty.",
      "level": 1
    },
    {
      "id": "111",
      "text": "Hastings questions if Poirot has identified the connection between the cases.",
      "level": 1
    },
    {
      "id": "112",
      "text": "Poirot replies, \"Not at all.\"",
      "level": 1
    },
    {
      "id": "113",
      "text": "Hastings reflects on the ABC Murders, where deciphering the alphabetical clue was essential.",
      "level": 1
    },
    {
      "id": "114",
      "text": "He asks Poirot if he is certain there is no financial motive, similar to the Ashley case.",
      "level": 1
    },
    {
      "id": "115",
      "text": "Poirot confirms he considered financial gain first.",
      "level": 1
    },
    {
      "id": "116",
      "text": "Hastings wonders if it's revenge, but that still lacks a connecting clue.",
      "level": 1
    },
    {
      "id": "117",
      "text": "He recalls a news report about a serial murderer who targeted jurors, with the motive being revenge from a previously convicted man.",
      "level": 1
    },
    {
      "id": "117.1",
      "text": "He keeps this thought to himself, unsure if it's relevant or helpful.",
      "level": 2
    },
    {
      "id": "118",
      "text": "Hastings asks Poirot who 'X' is.",
      "level": 1
    },
    {
      "id": "119",
      "text": "Poirot refuses to tell him, stating he cannot yet.",
      "level": 1
    },
    {
      "id": "120",
      "text": "Poirot explains that Hastings' face is too expressive, and he might reveal his suspicions to 'X' unintentionally.",
      "level": 1
    },
    {
      "id": "121",
      "text": "Hastings protests, claiming he can feign ignorance.",
      "level": 1
    },
    {
      "id": "122",
      "text": "Poirot insists they must operate discreetly and then act decisively.",
      "level": 1
    },
    {
      "id": "123",
      "text": "Someone knocks on the door, interrupting Hastings.",
      "level": 1
    },
    {
      "id": "124",
      "text": "Judith enters, described as tall, proud, with straight black eyebrows, a beautiful face, and a slightly mischievous yet tragic air.",
      "level": 1
    },
    {
      "id": "124.1",
      "text": "She smiles shyly but is happy to see Hastings.",
      "level": 2
    },
    {
      "id": "125",
      "text": "Hastings awkwardly greets her.",
      "level": 1
    },
    {
      "id": "126",
      "text": "Poirot mentions discussing the food.",
      "level": 1
    },
    {
      "id": "127",
      "text": "Judith asks if it's truly bad.",
      "level": 1
    },
    {
      "id": "128",
      "text": "Poirot questions her, knowing her mind is focused on her work (test tubes and microscopes) and that her finger is stained blue.",
      "level": 1
    },
    {
      "id": "129",
      "text": "He suggests she'll have trouble cooking for a husband.",
      "level": 1
    },
    {
      "id": "130",
      "text": "Judith states she doesn't want a husband.",
      "level": 1
    },
    {
      "id": "131",
      "text": "Poirot argues she will have one and that her purpose is to marry.",
      "level": 1
    },
    {
      "id": "132",
      "text": "Judith playfully asks Poirot to introduce a good man she can cook for.",
      "level": 1
    },
    {
      "id": "133",
      "text": "Poirot observes she will soon understand the wisdom of elders.",
      "level": 1
    },
    {
      "id": "134",
      "text": "Another knock, and Dr. Franklin enters.",
      "level": 1
    },
    {
      "id": "134.1",
      "text": "He is described as a tall, thin, determined young man with reddish hair and clear blue eyes.",
      "level": 2
    },
    {
      "id": "134.2",
      "text": "He is clumsy, often lost in thought, and bumps into things.",
      "level": 2
    },
    {
      "id": "135",
      "text": "He bumps into a screen near Poirot's chair and apologizes absentmindedly.",
      "level": 1
    },
    {
      "id": "136",
      "text": "Hastings almost smiles, but notices Judith's lack of amusement, suggesting she's used to it.",
      "level": 1
    },
    {
      "id": "137",
      "text": "Judith introduces Dr. Franklin as her father, whom Hastings remembers.",
      "level": 1
    },
    {
      "id": "138",
      "text": "Dr. Franklin, looking confused, shakes Hastings' hand stiffly, mentioning he heard Hastings was coming.",
      "level": 1
    },
    {
      "id": "138.1",
      "text": "He then turns to Judith and asks if she can't change her methods, requesting more glass slides for his work after dinner.",
      "level": 2
    },
    {
      "id": "139",
      "text": "Judith states she needs to speak to her father.",
      "level": 1
    },
    {
      "id": "140",
      "text": "Dr. Franklin apologizes for his absentmindedness, attributing it to his work.",
      "level": 1
    },
    {
      "id": "141",
      "text": "The clock chimes, and Dr. Franklin rushes out, remembering he promised to read to Barbara before dinner.",
      "level": 1
    },
    {
      "id": "142",
      "text": "He apologizes again, bumping into the doorframe on his way out.",
      "level": 1
    },
    {
      "id": "143",
      "text": "\"How is Mrs. Franklin?\" Hastings asks Judith.",
      "level": 1
    },
    {
      "id": "144",
      "text": "\"As tiresome as ever,\" Judith replies.",
      "level": 1
    },
    {
      "id": "145",
      "text": "Hastings expresses sympathy for her frail health.",
      "level": 1
    },
    {
      "id": "146",
      "text": "Judith remarks that doctors prefer healthy patients.",
      "level": 1
    },
    {
      "id": "147",
      "text": "Hastings calls her heartless.",
      "level": 1
    },
    {
      "id": "148",
      "text": "Judith insists she's just telling the truth.",
      "level": 1
    },
    {
      "id": "149",
      "text": "Poirot interjects that kind doctors would rush to read to their patients.",
      "level": 1
    },
    {
      "id": "150",
      "text": "Judith dismisses this as foolish, suggesting a nurse could read to her instead.",
      "level": 1
    },
    {
      "id": "151",
      "text": "Hastings says people are different.",
      "level": 1
    },
    {
      "id": "152",
      "text": "Judith calls Barbara a \"hopeless fool.\"",
      "level": 1
    },
    {
      "id": "153",
      "text": "Poirot disagrees, stating he doesn't think so.",
      "level": 1
    },
    {
      "id": "154",
      "text": "Judith describes Barbara as only interested in boring novels, not her husband's work, and only talks about her illness.",
      "level": 1
    },
    {
      "id": "155",
      "text": "Poirot maintains his view, suggesting Barbara uses her \"grey cells.\"",
      "level": 1
    },
    {
      "id": "156",
      "text": "Judith asks if Poirot likes \"typical women\" who speak softly.",
      "level": 1
    },
    {
      "id": "157",
      "text": "Hastings jokes that Poirot prefers tall, generous women.",
      "level": 1
    },
    {
      "id": "158",
      "text": "Poirot corrects Hastings, reminding him that his father preferred brunettes, which caused him trouble.",
      "level": 1
    },
    {
      "id": "159",
      "text": "Judith smiles like a child at their banter.",
      "level": 1
    },
    {
      "id": "160",
      "text": "As Judith leaves, Hastings decides to bathe before dinner.",
      "level": 1
    },
    {
      "id": "161",
      "text": "Poirot rings a bell, and a new servant named Cadis enters, as George has gone home due to his father's illness.",
      "level": 1
    },
    {
      "id": "162",
      "text": "Cadis is described as an awkward, foolish-looking man.",
      "level": 1
    },
    {
      "id": "163",
      "text": "As Hastings leaves, he sees Poirot lock the notebook back into its case.",
      "level": 1
    },
    {
      "id": "164",
      "text": "Confused, Hastings returns to his room.",
      "level": 1
    },
    {
      "id": "165",
      "text": "Chapter Four begins with Hastings going to dinner, feeling as if reality has shifted.",
      "level": 1
    },
    {
      "id": "166",
      "text": "While dressing, he entertains the possibility that all of Poirot's deductions are just the fantasies of an aging, unwell man.",
      "level": 1
    },
    {
      "id": "166.1",
      "text": "He questions if Poirot's mind is truly as sharp as he believes.",
      "level": 2
    },
    {
      "id": "166.2",
      "text": "He suggests Poirot might be creating a hypothetical murder out of boredom or frustration from his physical limitations.",
      "level": 2
    },
    {
      "id": "166.3",
      "text": "He considers that the cases Poirot presented might have been exactly as they appeared on the surface, with the suspects being the actual murderers.",
      "level": 2
    },
    {
      "id": "167",
      "text": "His only counter-argument is his deep-seated trust in Poirot's insight.",
      "level": 1
    },
    {
      "id": "168",
      "text": "He concludes that the murder plan is set, and Styles Court will once again be the stage for a crime.",
      "level": 1
    }
  ],
  "concepts": [
    {
      "name": "Hercule Poirot",
      "frequency": 35,
      "context": "The central detective figure, characterized by his short stature, mustache, Belgian origin, keen intellect, and current physical ailments (arthritis, wheelchair-bound)."
    },
    {
      "name": "Arthur Hastings",
      "frequency": 44,
      "context": "The narrator and companion to Poirot, reflecting on his past, his family, and his observations of the current situation."
    },
    {
      "name": "Styles Court",
      "frequency": 20,
      "context": "The location of the story, a grand estate that has been converted into a hotel, holding significant memories for both Poirot and Hastings."
    },
    {
      "name": "Murder",
      "frequency": 24,
      "context": "The central theme and driving force of the plot, with past cases analyzed and a future murder anticipated."
    },
    {
      "name": "Case",
      "frequency": 16,
      "context": "Refers to past murder investigations presented by Poirot for analysis and comparison with the current situation."
    },
    {
      "name": "Suspect",
      "frequency": 11,
      "context": "Individuals believed to have committed murder, particularly in the context of the five presented cases where the suspect was evident."
    },
    {
      "name": "Motive",
      "frequency": 9,
      "context": "The reason behind a murder, which Poirot and Hastings are trying to ascertain for the past cases and the anticipated one."
    },
    {
      "name": "Investigation",
      "frequency": 8,
      "context": "The process of uncovering the truth behind crimes, a key activity for Poirot and his partner Hastings."
    },
    {
      "name": "Judith",
      "frequency": 18,
      "context": "Hastings' enigmatic and intelligent daughter, who is also a guest at Styles Court."
    },
    {
      "name": "Raikswell",
      "frequency": 11,
      "context": "Mr. and Mrs. Raikswell, the owners and managers of the Styles Court hotel, characterized by their business acumen and Mrs. Raikswell's sharp tongue."
    },
    {
      "name": "Franklin",
      "frequency": 12,
      "context": "Dr. Franklin, a researcher and guest at Styles Court, characterized by his absentmindedness and dedication to his work."
    },
    {
      "name": "Time",
      "frequency": 10,
      "context": "The passage of time, its effects on people and places, and the nostalgia or melancholy it evokes."
    },
    {
      "name": "Memory",
      "frequency": 6,
      "context": "Recollections of past events, relationships, and experiences that influence the present."
    },
    {
      "name": "Mind",
      "frequency": 7,
      "context": "Refers to intellect, reasoning, and mental state, particularly Poirot's keen mind despite his physical decline."
    },
    {
      "name": "Danger",
      "frequency": 5,
      "context": "The imminent threat of harm or death that Poirot anticipates."
    },
    {
      "name": "Connection",
      "frequency": 6,
      "context": "The link or commonality between seemingly disparate elements, crucial for solving the overarching mystery."
    },
    {
      "name": "Prevention",
      "frequency": 5,
      "context": "The attempts to stop a crime from occurring, a central dilemma for Poirot."
    },
    {
      "name": "Warning",
      "frequency": 5,
      "context": "The act of informing someone of potential danger or intent, a method Poirot considers for crime prevention."
    },
    {
      "name": "Evidence",
      "frequency": 5,
      "context": "Information or clues used to support or disprove a hypothesis, particularly in legal and investigative contexts."
    },
    {
      "name": "Guest",
      "frequency": 7,
      "context": "Individuals staying at Styles Court, potential suspects or characters involved in the unfolding events."
    }
  ],
  "relations": [
    {
      "source": "Hercule Poirot",
      "target": "Arthur Hastings",
      "type": "is_friend_of"
    },
    {
      "source": "Hercule Poirot",
      "target": "Arthur Hastings",
      "type": "is_mentor_of"
    },
    {
      "source": "Arthur Hastings",
      "target": "Styles Court",
      "type": "visits"
    },
    {
      "source": "Hercule Poirot",
      "target": "Styles Court",
      "type": "resides_in"
    },
    {
      "source": "Murder",
      "target": "Styles Court",
      "type": "will_occur_in"
    },
    {
      "source": "Hercule Poirot",
      "target": "Murder",
      "type": "investigates"
    },
    {
      "source": "Arthur Hastings",
      "target": "Murder",
      "type": "assists_in_investigating"
    },
    {
      "source": "Mrs. Raikswell",
      "target": "Styles Court",
      "type": "manages"
    },
    {
      "source": "Dr. Franklin",
      "target": "Styles Court",
      "type": "is_guest_of"
    },
    {
      "source": "Judith",
      "target": "Arthur Hastings",
      "type": "is_daughter_of"
    },
    {
      "source": "Case A",
      "target": "Mrs. Reginald Ashley",
      "type": "involves"
    },
    {
      "source": "Case B",
      "target": "Miss Shapland",
      "type": "involves"
    },
    {
      "source": "Case C",
      "target": "Edward Lymes",
      "type": "involves"
    },
    {
      "source": "Case D",
      "target": "Derek Bradley",
      "type": "involves"
    },
    {
      "source": "Case E",
      "target": "Marsham Siffleet",
      "type": "involves"
    },
    {
      "source": "Hercule Poirot",
      "target": "Case A",
      "type": "analyzes"
    },
    {
      "source": "Hercule Poirot",
      "target": "Case B",
      "type": "analyzes"
    },
    {
      "source": "Hercule Poirot",
      "target": "Case C",
      "type": "analyzes"
    },
    {
      "source": "Hercule Poirot",
      "target": "Case D",
      "type": "analyzes"
    },
    {
      "source": "Hercule Poirot",
      "target": "Case E",
      "type": "analyzes"
    },
    {
      "source": "Connection",
      "target": "Murder",
      "type": "links"
    },
    {
      "source": "Motive",
      "target": "Murder",
      "type": "underlies"
    },
    {
      "source": "Suspect",
      "target": "Murder",
      "type": "commits"
    },
    {
      "source": "Warning",
      "target": "Murder",
      "type": "attempts_to_prevent"
    },
    {
      "source": "Danger",
      "target": "Victim",
      "type": "is_threatened_by"
    },
    {
      "source": "Arthur Hastings",
      "target": "Judith",
      "type": "is_parent_of"
    },
    {
      "source": "Mrs. Raikswell",
      "target": "Colonel Raikswell",
      "type": "is_spouse_of"
    },
    {
      "source": "Dr. Franklin",
      "target": "Barbara Franklin",
      "type": "is_spouse_of"
    },
    {
      "source": "Dr. Franklin",
      "target": "Judith",
      "type": "is_parent_of"
    }
  ],
  "hierarchy": {
    "main_topics": [
      "The Narrator's Reflection and Return to Styles",
      "The Introduction of Hercule Poirot and the Mystery",
      "Analysis of Past Murder Cases",
      "Poirot's Prediction of a Future Murder at Styles Court",
      "The Dilemma of Crime Prevention"
    ],
    "structure": "The document follows a chronological narrative, beginning with the narrator's journey and reflections, then introducing the central mystery through Poirot's analysis of past cases, and culminating in the prediction of a future crime and the discussion of its prevention. It is divided into chapters, with each chapter building upon the preceding one."
  }
}