{
  "propositions": [
    {
      "id": "1",
      "text": "Three friends, Ah Hao, Chou Yu, and the narrator, are driving and encounter a storm near Mengling.",
      "level": 1
    },
    {
      "id": "1.1",
      "text": "They seek shelter in an abandoned-looking traditional medicine shop.",
      "level": 2
    },
    {
      "id": "1.2",
      "text": "The narrator feels a forgotten memory is troubling him.",
      "level": 2
    },
    {
      "id": "1.3",
      "text": "Ah Hao and Chou Yu dismiss his concerns, prioritizing shelter from the rain.",
      "level": 2
    },
    {
      "id": "1.4",
      "text": "Upon entering, they find the shop ancient, dusty, and lit by faint, old oil lamps.",
      "level": 2
    },
    {
      "id": "1.5",
      "text": "They decide to stay and wait out the storm.",
      "level": 2
    },
    {
      "id": "2",
      "text": "Ah Hao starts a fire to boil water for warmth.",
      "level": 1
    },
    {
      "id": "2.1",
      "text": "Chou Yu searches for tea, sparking a conversation about the philosophy of 'poor but particular'.",
      "level": 2
    },
    {
      "id": "2.2",
      "text": "The narrator jokes about finding women, leading to a boast from Chou Yu about his strength.",
      "level": 2
    },
    {
      "id": "2.3",
      "text": "The narrator counters that modern society values money over brute strength.",
      "level": 2
    },
    {
      "id": "2.4",
      "text": "Chou Yu complains about the difficulty of making money, despite buying lottery tickets.",
      "level": 2
    },
    {
      "id": "3",
      "text": "Ah Hao, inspired by the mention of lottery tickets, decides to tell a scary story to pass the time, but hesitates due to the late hour and location.",
      "level": 1
    },
    {
      "id": "3.1",
      "text": "The narrator and Chou Yu insist on hearing the story.",
      "level": 2
    },
    {
      "id": "3.2",
      "text": "Ah Hao agrees to tell the story, titled 'The Bone Picked Up'.",
      "level": 2
    },
    {
      "id": "4",
      "text": "The story 'The Bone Picked Up' begins, discussing the nature of wealth and the pitfalls of chasing quick riches through lotteries.",
      "level": 1
    },
    {
      "id": "4.1",
      "text": "It describes historical gambling practices like 'Zhi Hua' (flower betting) in Ming and Qing dynasties.",
      "level": 2
    },
    {
      "id": "4.2",
      "text": "The story focuses on a couple, A'er and his wife, who owned a sesame seed cake shop but became addicted to Zhi Hua.",
      "level": 2
    },
    {
      "id": "4.3",
      "text": "They lost their business and eventually their property due to gambling debts.",
      "level": 2
    },
    {
      "id": "4.4",
      "text": "The text details the superstitious practices people employed to predict Zhi Hua outcomes, including consulting spirits and dreams.",
      "level": 2
    },
    {
      "id": "4.5",
      "text": "A'er and his wife sought guidance from a spiritual medium who drew a cryptic character.",
      "level": 2
    },
    {
      "id": "4.6",
      "text": "Despite this, they lost money and resorted to borrowing from loan sharks, facing ruin.",
      "level": 2
    },
    {
      "id": "4.7",
      "text": "Driven by desperation, they decided to employ an ancient, morally corrupt method of 'asking ghosts' by retrieving a bone.",
      "level": 2
    },
    {
      "id": "4.8",
      "text": "They went to a ruined temple graveyard and took a skull from a skeleton.",
      "level": 2
    },
    {
      "id": "4.9",
      "text": "They brought the skull home and prepared to perform a ritual involving boiling it in water.",
      "level": 2
    },
    {
      "id": "5",
      "text": "The story continues with A'er trying to communicate with the skull.",
      "level": 1
    },
    {
      "id": "5.1",
      "text": "His wife, impatient, throws the skull into boiling water.",
      "level": 2
    },
    {
      "id": "5.2",
      "text": "Following the ritual, they expect a prediction for the next day's betting.",
      "level": 2
    },
    {
      "id": "5.3",
      "text": "However, the skull disappears from the pot, and a headless corpse appears outside their door.",
      "level": 2
    },
    {
      "id": "5.4",
      "text": "The next morning, a headless corpse is found dead outside their shop.",
      "level": 2
    },
    {
      "id": "5.5",
      "text": "The couple is cleared of suspicion for the death, but the skull remains missing.",
      "level": 2
    },
    {
      "id": "5.6",
      "text": "Days later, they discover the missing skull in their child's crib, having bitten off the child's genitals, leading to the child's death.",
      "level": 2
    },
    {
      "id": "5.7",
      "text": "A'er commits suicide, and his wife goes mad and dies shortly after.",
      "level": 2
    },
    {
      "id": "5.8",
      "text": "Ah Hao concludes that their greed led to their downfall.",
      "level": 2
    },
    {
      "id": "6",
      "text": "The narrator and Chou Yu are intrigued but want more horror.",
      "level": 1
    },
    {
      "id": "7",
      "text": "Suddenly, there is a knock at the door.",
      "level": 1
    },
    {
      "id": "7.1",
      "text": "Chou Yu jokingly fears it's the headless zombie, but Ah Hao dismisses it.",
      "level": 2
    },
    {
      "id": "7.2",
      "text": "They open the door to find two young women seeking shelter from the rain.",
      "level": 2
    },
    {
      "id": "7.3",
      "text": "The narrator finds the women familiar but can't place them.",
      "level": 2
    },
    {
      "id": "7.4",
      "text": "Chou Yu humorously calls them 'female ghosts'.",
      "level": 2
    },
    {
      "id": "7.5",
      "text": "The women are identified as Teng Mingyue and Lu Yanan, university students.",
      "level": 2
    },
    {
      "id": "7.6",
      "text": "Ah Hao invites them to stay and share warmth and tea.",
      "level": 2
    },
    {
      "id": "7.7",
      "text": "Chou Yu finds better tea and, wanting to impress the women, exaggerates Ah Hao's story and offers to tell an even scarier one.",
      "level": 2
    },
    {
      "id": "7.8",
      "text": "The women are eager to hear another story, 'The Shanyin Baozi'.",
      "level": 2
    },
    {
      "id": "8",
      "text": "The story 'Shanyin Baozi' begins with a poem describing the harsh climate of the border regions.",
      "level": 1
    },
    {
      "id": "8.1",
      "text": "It sets the scene in Shanyin County during a chaotic period of unrest and refugee influx.",
      "level": 2
    },
    {
      "id": "8.2",
      "text": "The story introduces a local landlord, his three sons, and their move to crude sheep pens to rent out their main house.",
      "level": 2
    },
    {
      "id": "8.3",
      "text": "A strange incident occurs: a ewe gives birth to three creatures that are half-sheep, half-human.",
      "level": 2
    },
    {
      "id": "8.4",
      "text": "The creatures' appearance causes fear and superstition, leading to the villagers' departure.",
      "level": 2
    },
    {
      "id": "8.5",
      "text": "The landlord's family is terrified, and the creatures eventually die from lack of sustenance.",
      "level": 2
    },
    {
      "id": "8.6",
      "text": "The landlord's eldest son's wife reveals that the middle son, 'Baozi', had been engaging in bestiality with the ewe, causing the monstrous births.",
      "level": 2
    },
    {
      "id": "8.7",
      "text": "This revelation leads to Baozi's expulsion from the family.",
      "level": 2
    },
    {
      "id": "8.8",
      "text": "Baozi becomes a beggar and eventually joins a band of bandits, becoming their leader and earning the nickname 'Shanyin Baozi'.",
      "level": 2
    },
    {
      "id": "8.9",
      "text": "He later joins the Taiping Rebellion, but after its collapse, he disguises himself as a refugee and becomes a son-in-law to a butcher in Shanyin.",
      "level": 2
    },
    {
      "id": "9",
      "text": "The story continues with Baozi and his wife resorting to grave robbing for survival.",
      "level": 1
    },
    {
      "id": "9.1",
      "text": "They develop a ritual for grave robbing, involving appeasing the spirits and specific roles for handling male and female corpses.",
      "level": 2
    },
    {
      "id": "9.2",
      "text": "They believe that drinking wine can prevent the corpses from animating.",
      "level": 2
    },
    {
      "id": "9.3",
      "text": "They target a richly decorated coffin, expecting valuables.",
      "level": 2
    },
    {
      "id": "9.4",
      "text": "Upon opening the coffin, they encounter a corpse that appears to awaken.",
      "level": 2
    },
    {
      "id": "9.5",
      "text": "The corpse grabs Baozi's wife, who screams and disappears, while Baozi flees, breaks his leg, and is captured.",
      "level": 2
    },
    {
      "id": "9.6",
      "text": "Baozi confesses his crimes, including grave robbing and his association with the bandits, and is executed.",
      "level": 2
    },
    {
      "id": "9.7",
      "text": "Authorities investigate the grave site, finding an open coffin but no body or Baozi's wife, leaving it an unsolved mystery.",
      "level": 2
    },
    {
      "id": "10",
      "text": "During Chou Yu's narration, a gust of wind blows through the room, causing the oil lamp to flicker.",
      "level": 1
    },
    {
      "id": "10.1",
      "text": "The characters are startled but find no source for the wind.",
      "level": 2
    },
    {
      "id": "10.2",
      "text": "Lu Yanan asks about the fate of Baozi's wife and the corpse.",
      "level": 2
    },
    {
      "id": "10.3",
      "text": "Chou Yu speculates that the corpse may have possessed the wife and consumed her.",
      "level": 2
    },
    {
      "id": "10.4",
      "text": "The narrator questions the veracity of Chou Yu's stories.",
      "level": 2
    },
    {
      "id": "10.5",
      "text": "Ah Hao explains that such tales of animated corpses, 'walking shadows' or 'walking corpses', are folklore and not to be taken literally.",
      "level": 2
    }
  ],
  "concepts": [
    {
      "name": "Storm",
      "frequency": 3,
      "context": "The narrative begins with a storm that forces the characters to seek shelter."
    },
    {
      "name": "Medicine shop",
      "frequency": 4,
      "context": "The characters take shelter in a traditional medicine shop."
    },
    {
      "name": "Memory",
      "frequency": 1,
      "context": "The narrator feels a forgotten memory is troubling him."
    },
    {
      "name": "Fear",
      "frequency": 3,
      "context": "Characters express fear or unease at various points in the story."
    },
    {
      "name": "Storytelling",
      "frequency": 8,
      "context": "The narrative is framed by characters telling stories to each other."
    },
    {
      "name": "Gambling",
      "frequency": 5,
      "context": "Lotteries and historical gambling practices are central themes in the stories."
    },
    {
      "name": "Superstition",
      "frequency": 6,
      "context": "Various superstitions are depicted in the stories, influencing character actions."
    },
    {
      "name": "Ghosts",
      "frequency": 4,
      "context": "The concept of ghosts and the supernatural plays a significant role in the stories."
    },
    {
      "name": "Grave robbing",
      "frequency": 5,
      "context": "A key plot element in the story 'Shanyin Baozi'."
    },
    {
      "name": "Monsters",
      "frequency": 3,
      "context": "The story 'Shanyin Baozi' features monstrous births."
    },
    {
      "name": "Deformed births",
      "frequency": 2,
      "context": "The birth of half-sheep, half-human creatures is a significant event."
    },
    {
      "name": "Bestiality",
      "frequency": 1,
      "context": "A cause of the deformed births in 'Shanyin Baozi'."
    },
    {
      "name": "Bandits",
      "frequency": 2,
      "context": "Baozi becomes a bandit leader in 'Shanyin Baozi'."
    },
    {
      "name": "Execution",
      "frequency": 1,
      "context": "Baozi is executed at the end of his story."
    },
    {
      "name": "Unsolved mystery",
      "frequency": 2,
      "context": "Certain events in the stories remain unexplained."
    },
    {
      "name": "Folklore",
      "frequency": 1,
      "context": "The concept of 'walking corpses' is discussed as folklore."
    },
    {
      "name": "Desperation",
      "frequency": 3,
      "context": "Characters are driven to extreme actions by desperation."
    },
    {
      "name": "Greed",
      "frequency": 2,
      "context": "Greed is identified as a motivating factor for characters' downfall."
    }
  ],
  "relations": [
    {
      "source": "Storm",
      "target": "Medicine shop",
      "type": "forces to seek shelter in"
    },
    {
      "source": "Medicine shop",
      "target": "Fear",
      "type": "induces"
    },
    {
      "source": "Storytelling",
      "target": "Gambling",
      "type": "discusses"
    },
    {
      "source": "Storytelling",
      "target": "Superstition",
      "type": "depicts"
    },
    {
      "source": "Storytelling",
      "target": "Ghosts",
      "type": "features"
    },
    {
      "source": "Gambling",
      "target": "Desperation",
      "type": "can lead to"
    },
    {
      "source": "Desperation",
      "target": "Grave robbing",
      "type": "can lead to"
    },
    {
      "source": "Superstition",
      "target": "Monsters",
      "type": "interprets"
    },
    {
      "source": "Monsters",
      "target": "Deformed births",
      "type": "are a result of"
    },
    {
      "source": "Deformed births",
      "target": "Bestiality",
      "type": "caused by"
    },
    {
      "source": "Bestiality",
      "target": "Bandits",
      "type": "can lead to becoming"
    },
    {
      "source": "Bandits",
      "target": "Execution",
      "type": "can lead to"
    },
    {
      "source": "Grave robbing",
      "target": "Unsolved mystery",
      "type": "can result in"
    },
    {
      "source": "Ghosts",
      "target": "Folklore",
      "type": "is part of"
    },
    {
      "source": "Greed",
      "target": "Downfall",
      "type": "causes"
    },
    {
      "source": "Storytelling",
      "target": "Fear",
      "type": "aims to induce"
    }
  ],
  "hierarchy": {
    "main_topics": [
      "Encounter at the Medicine Shop",
      "The Story of the Picked-Up Bone",
      "The Story of Shanyin Baozi"
    ],
    "structure": "The document is structured as a narrative frame where characters seek shelter and tell spooky stories. The stories themselves are embedded within this frame and explore themes of gambling, superstition, the supernatural, and human desperation."
  }
}