{
  "propositions": [
    {
      "id": "1",
      "text": "Lanling's story begins with a mysterious woman arriving in Lanling, sparking curiosity and intrigue.",
      "level": 1
    },
    {
      "id": "1.1",
      "text": "The woman, named Lanling, meets Su Zimo, the county magistrate, initiating a complex relationship.",
      "level": 2
    },
    {
      "id": "1.2",
      "text": "Su Zimo becomes increasingly captivated by Lanling, despite her enigmatic background.",
      "level": 2
    },
    {
      "id": "2",
      "text": "Lanling's true identity as a time-traveler from the future is revealed in the side stories.",
      "level": 1
    },
    {
      "id": "2.1",
      "text": "Her arrival in Lanling is due to an accidental temporal displacement.",
      "level": 2
    },
    {
      "id": "3",
      "text": "The narrative explores themes of love, mystery, and destiny between Lanling and Su Zimo.",
      "level": 1
    },
    {
      "id": "3.1",
      "text": "Su Zimo's affection grows, but Lanling's heart seems tied to someone from her original time.",
      "level": 2
    },
    {
      "id": "4",
      "text": "The story concludes with Lanling choosing to stay in Lanling, finding happiness with Su Zimo.",
      "level": 1
    }
  ],
  "concepts": [
    {
      "name": "Time Travel",
      "frequency": 3,
      "context": "Central to Lanling's origin as a character from the future."
    },
    {
      "name": "Love",
      "frequency": 10,
      "context": "Core theme driving the relationship between Lanling and Su Zimo."
    },
    {
      "name": "Mystery",
      "frequency": 8,
      "context": "Surrounding Lanling's identity and intentions in Lanling."
    },
    {
      "name": "Destiny",
      "frequency": 5,
      "context": "The idea of fated encounters and choices in the narrative."
    }
  ],
  "relations": [
    {
      "source": "Lanling",
      "target": "Su Zimo",
      "type": "romantic_attraction"
    },
    {
      "source": "Lanling",
      "target": "Time Travel",
      "type": "originates_from"
    },
    {
      "source": "Love",
      "target": "Destiny",
      "type": "interlinked_with"
    }
  ],
  "hierarchy": {
    "main_topics": [
      "Lanling's Arrival and Identity",
      "Relationship with Su Zimo",
      "Resolution and Choice"
    ],
    "structure": "The document is structured as a narrative with a main storyline divided into chapters (Introduction, Initial Meeting, Growing Bond, Revelation, and Conclusion) and additional side stories (Fanwai) that provide backstory and closure."
  }
}