{
  "propositions": [
    {
      "id": "1",
      "text": "The story '从晶开始' by E大人 is a fantasy narrative centered on a young girl's journey through time and emotional struggles.",
      "level": 1
    },
    {
      "id": "1.1",
      "text": "The protagonist, an 18-year-old girl, faces a broken family background with distant parents contemplating divorce.",
      "level": 2
    },
    {
      "id": "1.2",
      "text": "She accidentally traverses to a new, unfamiliar world, offering her a chance to start anew.",
      "level": 2
    },
    {
      "id": "2",
      "text": "In the new world, the protagonist encounters '晶 (Jing)', a mysterious and caring character who aids her adaptation.",
      "level": 1
    },
    {
      "id": "2.1",
      "text": "Jing's personality is outwardly cold but inwardly gentle, creating a complex dynamic with the protagonist.",
      "level": 2
    },
    {
      "id": "3",
      "text": "The protagonist explores complex emotional and social themes, including BL (Boy's Love) and NP (polyamorous relationships).",
      "level": 1
    },
    {
      "id": "3.1",
      "text": "BL represents deep emotional bonds and trust, while NP introduces challenges of balancing multiple relationships.",
      "level": 2
    },
    {
      "id": "4",
      "text": "The protagonist undergoes significant personal growth through adventures and challenges in the new world.",
      "level": 1
    },
    {
      "id": "4.1",
      "text": "She learns teamwork and self-awareness, ultimately making a pivotal decision to stay in the new world for a sense of belonging.",
      "level": 2
    }
  ],
  "concepts": [
    {
      "name": "穿越 (Time Travel)",
      "frequency": 3,
      "context": "Central plot device enabling the protagonist's journey to a new world."
    },
    {
      "name": "晶 (Jing)",
      "frequency": 5,
      "context": "Key character with a mysterious background, pivotal to the protagonist's development."
    },
    {
      "name": "BL (Boy's Love)",
      "frequency": 4,
      "context": "Cultural and emotional theme explored by the protagonist in the new world."
    },
    {
      "name": "NP (Polyamory)",
      "frequency": 4,
      "context": "Complex relationship dynamic challenging the protagonist's understanding of love."
    },
    {
      "name": "成长 (Growth)",
      "frequency": 3,
      "context": "Core theme of the protagonist's emotional and personal development."
    }
  ],
  "relations": [
    {
      "source": "穿越 (Time Travel)",
      "target": "New World",
      "type": "enables"
    },
    {
      "source": "晶 (Jing)",
      "target": "Protagonist",
      "type": "supports"
    },
    {
      "source": "BL (Boy's Love)",
      "target": "Emotional Exploration",
      "type": "part_of"
    },
    {
      "source": "NP (Polyamory)",
      "target": "Emotional Conflict",
      "type": "causes"
    },
    {
      "source": "成长 (Growth)",
      "target": "Protagonist",
      "type": "defines"
    }
  ],
  "hierarchy": {
    "main_topics": [
      "Time Travel and New Beginnings",
      "Emotional and Relational Complexity",
      "Personal Growth and Decision-Making"
    ],
    "structure": "The document is structured as a narrative with an introduction, sequential chapters detailing the protagonist's journey, and a conclusive reflection on growth and choices."
  }
}