{
  "propositions": [
    {
      "id": "1",
      "text": "The document describes a belief in a 13,000-year cosmic cycle and an impending major global change around March 20, 2000.",
      "level": 1
    },
    {
      "id": "1.1",
      "text": "This change is viewed with great concern and fear by specialists in various fields.",
      "level": 2
    },
    {
      "id": "2",
      "text": "Key locations, the Pyramids of Giza and the temples of Angkor, are central to this belief.",
      "level": 1
    },
    {
      "id": "2.1",
      "text": "These locations are believed to have astronomical alignments that correspond to celestial configurations from around 10,500 BC.",
      "level": 2
    },
    {
      "id": "2.1.1",
      "text": "Angkor Wat's temple layout aligns with the Draco constellation as it appeared in the morning sky on the spring equinox of 10,500 BC.",
      "level": 3
    },
    {
      "id": "2.1.2",
      "text": "The Pyramids of Giza align with the Orion constellation as it appeared on the spring equinox of 10,500 BC.",
      "level": 3
    },
    {
      "id": "3",
      "text": "The relationship between the Draco and Orion constellations is significant due to precession.",
      "level": 1
    },
    {
      "id": "3.1",
      "text": "These constellations move in opposite directions, like a seesaw, with a full cycle taking approximately 13,000 years.",
      "level": 2
    },
    {
      "id": "3.2",
      "text": "The alignments at Angkor and Giza represent a half-cycle's end point around 10,500 BC.",
      "level": 2
    },
    {
      "id": "3.3",
      "text": "The spring equinox of March 20, 2000, marks the end of another half-cycle, with Draco approaching its lowest point and Orion its highest.",
      "level": 2
    },
    {
      "id": "4",
      "text": "Past cosmic cycles have been associated with catastrophic events and the destruction of prehistoric civilizations.",
      "level": 1
    },
    {
      "id": "4.1",
      "text": "Around 12,400 years ago, Earth experienced significant geological and atmospheric changes, including magnetic field reversals and comet fragment impacts.",
      "level": 2
    },
    {
      "id": "4.2",
      "text": "These events led to tsunamis, earthquakes, species mutations, and the disappearance of advanced prehistoric civilizations.",
      "level": 2
    },
    {
      "id": "5",
      "text": "Current phenomena in 2000 mirror those preceding the ancient catastrophe, raising concerns about imminent disaster.",
      "level": 1
    },
    {
      "id": "5.1",
      "text": "The Earth's magnetic field has been rapidly decaying, with predictions of it reaching zero by 2300, leading to a pole reversal and crustal shifts.",
      "level": 2
    },
    {
      "id": "5.2",
      "text": "The text suggests that humanity faces a potential extinction event similar to that of 12,000 years ago.",
      "level": 2
    },
    {
      "id": "6",
      "text": "There is a hope for salvation, particularly from Eastern civilizations and ancient Chinese wisdom.",
      "level": 1
    },
    {
      "id": "6.1",
      "text": "The \"Save the Earth Foundation\" was established by global elites to address these challenges.",
      "level": 2
    },
    {
      "id": "6.2",
      "text": "The \"I Ching\" (Book of Changes) is seen as a potential source for answers to overcoming future disasters.",
      "level": 2
    },
    {
      "id": "6.3",
      "text": "China is highlighted as the only nation with an unbroken civilization, preserving ancient knowledge.",
      "level": 2
    },
    {
      "id": "7",
      "text": "Ominous celestial signs appeared on the spring equinox of 2000.",
      "level": 1
    },
    {
      "id": "7.1",
      "text": "A mysterious cloud briefly obscured the center of the Draco constellation at Angkor.",
      "level": 2
    },
    {
      "id": "7.2",
      "text": "Simultaneously, a cloud obscured the center of the Orion constellation at Giza.",
      "level": 2
    },
    {
      "id": "7.3",
      "text": "These events were interpreted as a significant, frightening omen.",
      "level": 2
    },
    {
      "id": "8",
      "text": "A glimmer of hope appeared through five faint stars that emerged from the clouds.",
      "level": 1
    },
    {
      "id": "8.1",
      "text": "The stars disappeared shortly after, leaving people with a sense of hope but uncertainty.",
      "level": 2
    },
    {
      "id": "9",
      "text": "Wu Haige, an I Ching scholar and head of the foundation's Southeast Asia branch, received a call from his master, Wu Qian Daochang.",
      "level": 1
    },
    {
      "id": "9.1",
      "text": "Wu Qian Daochang, residing in Wudang Mountain, had foreseen the cycle's dangers and identified the location of the five stars.",
      "level": 2
    },
    {
      "id": "9.2",
      "text": "He announced that disciples would search for these stars, representing hope for overcoming the disasters.",
      "level": 2
    },
    {
      "id": "10",
      "text": "The I Ching and its principles are central to understanding and mitigating cosmic and terrestrial imbalances.",
      "level": 1
    },
    {
      "id": "10.1",
      "text": "Wu Qian Daochang interpreted the cosmic cycle using the Qian and Kun hexagrams, suggesting a period of crisis with underlying hope, particularly linked to the 'Kui' (亢) star of the Azure Dragon.",
      "level": 2
    },
    {
      "id": "10.2",
      "text": "The five stars that appeared were identified as representing the five elements (Gold, Wood, Water, Fire, Earth) from the innate five elements theory.",
      "level": 2
    },
    {
      "id": "10.3",
      "text": "These five children, born on the spring equinox of 2000, are designated as \"Five Element Warriors\" tasked with saving Earth.",
      "level": 2
    },
    {
      "id": "11",
      "text": "The year 2015 experiences extreme heat and drought, with other natural and man-made disasters increasing globally.",
      "level": 1
    },
    {
      "id": "11.1",
      "text": "These events are seen as the unfolding of the cosmic cycle's predicted calamities.",
      "level": 2
    },
    {
      "id": "12",
      "text": "The story introduces Jin Jian, a 15-year-old boy living in Qingdao, whose father is a renowned marine geologist.",
      "level": 1
    },
    {
      "id": "12.1",
      "text": "Jin Jian's father, Jin Qin'nan, is investigating the mysterious disappearance of a friend during a round-the-world sailing race.",
      "level": 2
    },
    {
      "id": "12.2",
      "text": "Jin Jian's mother, Wen Tingzhu, is a botanist researching plant growth in space for future lunar bases.",
      "level": 2
    },
    {
      "id": "13",
      "text": "Jin Jian, a hobbyist robot maker, discovers a secret passage in his villa's basement.",
      "level": 1
    },
    {
      "id": "14",
      "text": "An island in the Yellow Sea hosts the \"Oriental Ark\" research base and command center, established by the Save the Earth Foundation.",
      "level": 1
    },
    {
      "id": "14.1",
      "text": "This base monitors climate anomalies and brings together top scientists.",
      "level": 2
    },
    {
      "id": "14.2",
      "text": "Wu Qian Daochang and his disciples have relocated to this island to oversee the training of the five chosen children.",
      "level": 2
    },
    {
      "id": "15",
      "text": "The core philosophy of Daoism emphasizes the balance of Yin and Yang in the universe and its impact on natural phenomena.",
      "level": 1
    },
    {
      "id": "15.1",
      "text": "The goal is to restore balance to the universe and Earth to avert disaster, analogous to balancing Yin and Yang in traditional Chinese medicine.",
      "level": 2
    },
    {
      "id": "16",
      "text": "The five children, born on the spring equinox of 2000, are Jin Jian, Mu Dun, Tu Gen (boys), and Shui Linglong, Huo Fenghuang (girls).",
      "level": 1
    },
    {
      "id": "16.1",
      "text": "Jin Jian and Mu Dun are close friends, their fathers having been classmates in the US.",
      "level": 2
    },
    {
      "id": "17",
      "text": "Dr. Harry, a scientist at the Oriental Ark base, reveals that abnormal Earth temperatures are caused by a minute change in the angle of sunlight hitting the planet.",
      "level": 1
    },
    {
      "id": "17.1",
      "text": "This change is shifting the equator northward, causing extreme heat in the north and cold in the south, threatening many species.",
      "level": 2
    },
    {
      "id": "17.2",
      "text": "The situation is worsening, with predictions of potential ice cover in the south and submerged northern continents within decades.",
      "level": 2
    },
    {
      "id": "17.3",
      "text": "Evidence of these changes includes melting glaciers, floods, crop failures, and power grid collapses leading to unrest.",
      "level": 2
    },
    {
      "id": "18",
      "text": "Wu Qian Daochang suggests sharing detailed research data with Jin Qin'nan, the marine geologist, believing he might find the answer to the problem.",
      "level": 1
    },
    {
      "id": "19",
      "text": "Despite the dire predictions, Wu Qian Daochang maintains a belief that a solution exists and encourages hope.",
      "level": 1
    }
  ],
  "concepts": [
    {
      "name": "Cosmic Cycle",
      "frequency": 14,
      "context": "A recurring 13,000-year period of planetary and human transformation, marked by celestial alignments and potential cataclysms."
    },
    {
      "name": "Spring Equinox",
      "frequency": 7,
      "context": "A specific date (March 20, 2000, and 10,500 BC) marked by astronomical significance and the start of new cycles or events."
    },
    {
      "name": "Celestial Alignments",
      "frequency": 5,
      "context": "The precise positioning of constellations and stars in the sky at specific times, believed to hold significant meaning and influence."
    },
    {
      "name": "Draco Constellation",
      "frequency": 4,
      "context": "A constellation central to the Angkor Wat alignment, representing a key celestial marker in the cosmic cycle."
    },
    {
      "name": "Orion Constellation",
      "frequency": 4,
      "context": "A constellation central to the Giza Pyramids alignment, representing another key celestial marker."
    },
    {
      "name": "Precession",
      "frequency": 3,
      "context": "The slow wobble of Earth's axis that causes the apparent position of stars to shift over thousands of years, explaining the ancient alignments."
    },
    {
      "all": "10500 BC",
      "frequency": 7,
      "context": "A pivotal year referenced for the astronomical alignments at Angkor and Giza, signifying the end of a previous cosmic half-cycle."
    },
    {
      "name": "Cataclysm",
      "frequency": 6,
      "context": "Destructive events, including natural disasters and potential extinction events, associated with the end of cosmic cycles."
    },
    {
      "name": "Prehistoric Civilization",
      "frequency": 4,
      "context": "Advanced societies from the distant past that were destroyed by past cataclysms."
    },
    {
      "name": "Earth's Magnetic Field",
      "frequency": 3,
      "context": "A crucial geophysical element that is weakening, with predicted reversal and potential for catastrophic geological changes."
    },
    {
      "name": "I Ching",
      "frequency": 6,
      "context": "The ancient Chinese 'Book of Changes,' seen as a source of wisdom and guidance for understanding and overcoming cosmic crises."
    },
    {
      "name": "Five Elements",
      "frequency": 4,
      "context": "The fundamental components (Gold, Wood, Water, Fire, Earth) believed to constitute the universe, central to Daoist philosophy and the salvation plan."
    },
    {
      "name": "Five Element Warriors",
      "frequency": 3,
      "context": "Five children born on the spring equinox of 2000, destined to embody the five elements and save humanity from disaster."
    },
    {
      "name": "Save the Earth Foundation",
      "frequency": 5,
      "context": "A global organization of elites dedicated to addressing impending planetary crises."
    },
    {
      "name": "Oriental Ark",
      "frequency": 3,
      "context": "A research base and command center on an island in the Yellow Sea, focused on monitoring climate anomalies and finding solutions."
    },
    {
      "name": "Yin and Yang",
      "frequency": 3,
      "context": "The fundamental dualistic principle in Daoism, representing opposing but complementary forces whose balance is crucial for cosmic and terrestrial harmony."
    },
    {
      "name": "Climate Anomalies",
      "frequency": 4,
      "context": "Unusual and extreme weather patterns, including extreme heat and drought, observed globally and linked to the cosmic cycle."
    },
    {
      "name": "Wu Qian Daochang",
      "frequency": 5,
      "context": "A revered I Ching master and Daoist priest who foresees the cosmic cycle's dangers and guides the training of the Five Element Warriors."
    },
    {
      "name": "Jin Jian",
      "frequency": 7,
      "context": "A 15-year-old protagonist, one of the Five Element Warriors, with a talent for robotics and a curious nature."
    },
    {
      "name": "Jin Qin'nan",
      "frequency": 4,
      "context": "Jin Jian's father, a prominent marine geologist investigating a friend's disappearance and potentially key to understanding climate shifts."
    },
    {
      "name": "Secret Passage",
      "frequency": 2,
      "context": "A hidden tunnel discovered by Jin Jian in his villa, adding an element of mystery and potential discovery."
    },
    {
      "name": "Sunlight Angle Change",
      "frequency": 2,
      "context": "The identified cause of extreme global warming, a subtle shift in Earth's axial tilt or position relative to the sun."
    }
  ],
  "relations": [
    {
      "source": "Cosmic Cycle",
      "target": "Spring Equinox",
      "type": "associated_with"
    },
    {
      "source": "Cosmic Cycle",
      "target": "Celestial Alignments",
      "type": "explained_by"
    },
    {
      "source": "Cosmic Cycle",
      "target": "Cataclysm",
      "type": "leads_to"
    },
    {
      "source": "Spring Equinox",
      "target": "10500 BC",
      "type": "specific_instance_of"
    },
    {
      "source": "Spring Equinox",
      "target": "March 20, 2000",
      "type": "specific_instance_of"
    },
    {
      "source": "Celestial Alignments",
      "target": "Draco Constellation",
      "type": "involves"
    },
    {
      "source": "Celestial Alignments",
      "target": "Orion Constellation",
      "type": "involves"
    },
    {
      "source": "Celestial Alignments",
      "target": "Angkor Wat",
      "type": "found_at"
    },
    {
      "source": "Celestial Alignments",
      "target": "Pyramids of Giza",
      "type": "found_at"
    },
    {
      "source": "Draco Constellation",
      "target": "Angkor Wat",
      "type": "aligned_with"
    },
    {
      "source": "Orion Constellation",
      "target": "Pyramids of Giza",
      "type": "aligned_with"
    },
    {
      "source": "Precession",
      "target": "Celestial Alignments",
      "type": "explains"
    },
    {
      "source": "Cataclysm",
      "target": "Prehistoric Civilization",
      "type": "destroyed"
    },
    {
      "source": "Cataclysm",
      "target": "Earth's Magnetic Field",
      "type": "associated_with"
    },
    {
      "source": "Earth's Magnetic Field",
      "target": "Global Warming",
      "type": "impacts"
    },
    {
      "source": "I Ching",
      "target": "Wu Qian Daochang",
      "type": "mastered_by"
    },
    {
      "source": "I Ching",
      "target": "Five Element Warriors",
      "type": "guides"
    },
    {
      "source": "Five Elements",
      "target": "Five Element Warriors",
      "type": "constitute"
    },
    {
      "source": "Five Element Warriors",
      "target": "Salvation",
      "type": "provide"
    },
    {
      "source": "Save the Earth Foundation",
      "target": "Global Elites",
      "type": "composed_of"
    },
    {
      "source": "Save the Earth Foundation",
      "target": "Oriental Ark",
      "type": "established"
    },
    {
      "source": "Oriental Ark",
      "target": "Climate Anomalies",
      "type": "monitors"
    },
    {
      "source": "Oriental Ark",
      "target": "Top Scientists",
      "type": "hosts"
    },
    {
      "source": "Yin and Yang",
      "target": "Balance",
      "type": "essential_for"
    },
    {
      "source": "Yin and Yang",
      "target": "Cosmic Harmony",
      "type": "maintains"
    },
    {
      "source": "Yin and Yang",
      "target": "Terrestrial Harmony",
      "type": "maintains"
    },
    {
      "source": "Yin and Yang",
      "target": "Daoism",
      "type": "central_principle_of"
    },
    {
      "source": "Climate Anomalies",
      "target": "Cosmic Cycle",
      "type": "linked_to"
    },
    {
      "source": "Climate Anomalies",
      "target": "Sunlight Angle Change",
      "type": "caused_by"
    },
    {
      "source": "Wu Qian Daochang",
      "target": "Five Element Warriors",
      "type": "trains"
    },
    {
      "source": "Wu Qian Daochang",
      "target": "I Ching",
      "type": "uses"
    },
    {
      "source": "Jin Jian",
      "target": "Five Element Warriors",
      "type": "is_member_of"
    },
    {
      "source": "Jin Jian",
      "target": "Robotics",
      "type": "skilled_in"
    },
    {
      "source": "Jin Jian",
      "target": "Secret Passage",
      "type": "discovers"
    },
    {
      "source": "Jin Qin'nan",
      "target": "Marine Geology",
      "type": "expert_in"
    },
    {
      "source": "Jin Qin'nan",
      "target": "Mysterious Disappearance",
      "type": "investigates"
    },
    {
      "source": "Jin Qin'nan",
      "target": "Sunlight Angle Change",
      "type": "may_solve"
    },
    {
      "source": "Secret Passage",
      "target": "Mystery",
      "type": "adds_element_of"
    },
    {
      "source": "Sunlight Angle Change",
      "target": "Global Warming",
      "type": "causes"
    },
    {
      "source": "Sunlight Angle Change",
      "target": "Equator",
      "type": "shifts"
    }
  ],
  "hierarchy": {
    "main_topics": [
      "Cosmic Cycles and Prophecies",
      "Ancient Civilizations and Astronomical Alignments",
      "Impending Global Catastrophe",
      "Eastern Wisdom and Salvation",
      "The Five Element Warriors",
      "Current Climate Crisis"
    ],
    "structure": "The document begins with a broad introduction to the concept of a cosmic cycle and its associated fear. It then delves into specific locations (Angkor, Giza) and their astronomical significance. The narrative moves to the historical context of past disasters and current warning signs. Hope is introduced through Eastern philosophy and the concept of 'Five Element Warriors.' The story then shifts to contemporary events in 2015, introducing key characters and the unfolding climate crisis, with a scientific explanation for the warming, and a potential avenue for solution involving the main characters and ancient wisdom."
  }
}