{
  "propositions": [
    {
      "id": "1",
      "text": "The jungle suddenly emitted a buzzing sound, causing panic among the explorers.",
      "level": 1
    },
    {
      "id": "1.1",
      "text": "The sound was eerily similar to that of killer bees.",
      "level": 2
    },
    {
      "id": "2",
      "text": "The explorers discovered the source of the sound was giant mosquitoes.",
      "level": 1
    },
    {
      "id": "2.1",
      "text": "These mosquitoes were over a meter long, described as flying monsters.",
      "level": 2
    },
    {
      "id": "2.2",
      "text": "They possessed large, ball-shaped heads, large abdomens, and bodies covered in sharp bristles.",
      "level": 2
    },
    {
      "id": "2.3",
      "text": "Their proboscis was a foot long, resembling a giant syringe needle.",
      "level": 2
    },
    {
      "id": "3",
      "text": "The explorers opened fire on the giant mosquitoes.",
      "level": 1
    },
    {
      "id": "3.1",
      "text": "Fire was an effective deterrent.",
      "level": 2
    },
    {
      "id": "3.2",
      "text": "The mosquitoes' hard hairs and wings were flammable.",
      "level": 2
    },
    {
      "id": "4",
      "text": "Some mosquitoes adapted by flying higher to avoid the fire barrier.",
      "level": 1
    },
    {
      "id": "5",
      "text": "The explorers resorted to more drastic measures to combat the mosquitoes.",
      "level": 1
    },
    {
      "id": "5.1",
      "text": "Gasoline was poured into the fire, significantly increasing its intensity.",
      "level": 2
    },
    {
      "id": "6",
      "text": "The battle against the mosquitoes was chaotic and intense.",
      "level": 1
    },
    {
      "id": "6.1",
      "text": "The fight devolved into close combat with the giant creatures.",
      "level": 2
    },
    {
      "id": "6.2",
      "text": "Even a brush against the mosquitoes' bristles caused injuries.",
      "level": 2
    },
    {
      "id": "6.3",
      "text": "The mosquitoes' proboscis posed a severe threat.",
      "level": 2
    },
    {
      "id": "7",
      "text": "Several explorers were injured by the mosquitoes.",
      "level": 1
    },
    {
      "id": "7.1",
      "text": "Zhuo Muqiangba's leg was scratched by mosquito bristles.",
      "level": 2
    },
    {
      "id": "7.2",
      "text": "Zhuo Muqiangba's arm was pierced by a mosquito's proboscis while protecting Tang Min.",
      "level": 2
    },
    {
      "id": "7.3",
      "text": "Sean was impaled in the buttocks by a mosquito's proboscis.",
      "level": 2
    },
    {
      "id": "8",
      "text": "The explorers found refuge in a water body and used breathing apparatus.",
      "level": 1
    },
    {
      "id": "8.1",
      "text": "They were able to survive underwater due to simple breathing devices.",
      "level": 2
    },
    {
      "id": "9",
      "text": "After the mosquitoes left, the explorers emerged to survey the aftermath.",
      "level": 1
    },
    {
      "id": "9.1",
      "text": "The area resembled a battlefield, with smoke and charred bodies.",
      "level": 2
    },
    {
      "id": "10",
      "text": "Tang Min assessed the injuries.",
      "level": 1
    },
    {
      "id": "10.1",
      "text": "Zhuo Muqiangba's arm injury was manageable.",
      "level": 2
    },
    {
      "id": "10.2",
      "text": "Sean's buttock injury was severe and complex.",
      "level": 2
    },
    {
      "id": "11",
      "text": "Lü Jingnan provided advanced medical treatment to Sean.",
      "level": 1
    },
    {
      "id": "11.1",
      "text": "She used a sterilized glass syringe to clean and treat his wound.",
      "level": 2
    },
    {
      "id": "12",
      "text": "The explorers analyzed the cause of the giant mosquito attack.",
      "level": 1
    },
    {
      "id": "12.1",
      "text": "Sean's theory was that the mosquitoes were attracted by the scent of the recently killed giant lizard.",
      "level": 2
    },
    {
      "id": "13",
      "text": "The battle depleted most of their weapons and ammunition.",
      "level": 1
    },
    {
      "id": "14",
      "text": "Another group of people, Ximi's group, landed in Xiangbalan.",
      "level": 1
    },
    {
      "id": "14.1",
      "text": "Only thirteen out of seventeen successfully landed in Gongbu Village.",
      "level": 2
    },
    {
      "id": "14.2",
      "text": "Four landed on the second platform.",
      "level": 2
    },
    {
      "id": "14.3",
      "text": "Their equipment was also scattered.",
      "level": 2
    },
    {
      "id": "15",
      "text": "The next morning, the explorers continued their journey, hampered by weapon depletion.",
      "level": 1
    },
    {
      "id": "15.1",
      "text": "Zhuo Muqiangba helped the injured Sean by carrying his backpack and providing a walking stick.",
      "level": 2
    },
    {
      "id": "16",
      "text": "Yue Yang and Zhang Li scouted ahead.",
      "level": 1
    },
    {
      "id": "17",
      "text": "They discovered a parachute and a container of special forces supplies.",
      "level": 1
    },
    {
      "id": "17.1",
      "text": "The container was a combination of several smaller alloy steel boxes.",
      "level": 2
    },
    {
      "id": "17.2",
      "text": "This was airdrop material for a small team, containing weapons, medicine, and food.",
      "level": 2
    },
    {
      "id": "18",
      "text": "Zhang Li worked to decipher the lock on the supply boxes.",
      "level": 1
    },
    {
      "id": "19",
      "text": "The first box was opened, revealing its contents.",
      "level": 1
    },
    {
      "id": "19.1",
      "text": "The first layer contained medical supplies, including specialized first-aid kits and injectables.",
      "level": 2
    },
    {
      "id": "19.2",
      "text": "The second layer contained high-energy compressed biscuits with a five-year shelf life.",
      "level": 2
    },
    {
      "id": "19.3",
      "text": "The third layer contained various weapons and ammunition.",
      "level": 2
    },
    {
      "id": "19.4",
      "text": "Beneath the weapon layer was a complete set of outdoor survival gear.",
      "level": 2
    },
    {
      "id": "20",
      "text": "The explorers were impressed by the quality and comprehensiveness of the supplies.",
      "level": 1
    },
    {
      "id": "21",
      "text": "The second box was also opened.",
      "level": 1
    },
    {
      "id": "22",
      "text": "Hu Yang inquired about the absence of water and clothing.",
      "level": 1
    },
    {
      "id": "22.1",
      "text": "Yue Yang explained that special forces typically obtain water locally.",
      "level": 2
    },
    {
      "id": "23",
      "text": "Lü Jingnan warned that this was enemy equipment, and they should remain vigilant.",
      "level": 1
    },
    {
      "id": "24",
      "text": "Eight boxes were opened in total.",
      "level": 1
    },
    {
      "id": "24.1",
      "text": "Seven boxes contained standard equipment.",
      "level": 2
    },
    {
      "id": "24.2",
      "text": "One box contained specialized surgical instruments, a portable ultrasound, an ECG machine, and blood bags.",
      "level": 2
    },
    {
      "id": "24.3",
      "text": "This unique box also contained advanced communication equipment, night vision, and a laser tracker.",
      "level": 2
    },
    {
      "id": "24.4",
      "text": "It also included rocket launchers, a medium machine gun, sniper rifles, and landmines.",
      "level": 2
    },
    {
      "id": "25",
      "text": "Yue Yang analyzed the enemy's configuration, concluding they were highly professional.",
      "level": 1
    },
    {
      "id": "25.1",
      "text": "The enemy likely included a doctor, scouts, snipers, demolition experts, and communications specialists.",
      "level": 2
    },
    {
      "id": "26",
      "text": "Yue Yang found it strange that the enemy lacked basic detection systems for the ancient temple.",
      "level": 1
    },
    {
      "id": "27",
      "text": "Yue Yang hypothesized that the enemy planned to enter Xiangbalan in batches.",
      "level": 1
    },
    {
      "id": "27.1",
      "text": "The current group was likely the first wave, tasked with clearing obstacles and scouting.",
      "level": 2
    },
    {
      "id": "28",
      "text": "Sean asked if he could eat one of the high-energy biscuits.",
      "level": 1
    },
    {
      "id": "29",
      "text": "The biscuits offered various flavors and contained ingredients that enhanced reaction time and judgment.",
      "level": 1
    },
    {
      "id": "30",
      "text": "The biscuits also contained a disguised form of RDX (plastic explosive).",
      "level": 1
    },
    {
      "id": "31",
      "text": "Zhang Li searched for a laser transmitter, noting its absence.",
      "level": 1
    },
    {
      "id": "31.1",
      "text": "The absence suggested the enemy did not intend to communicate externally.",
      "level": 2
    },
    {
      "id": "32",
      "text": "Yue Yang speculated the enemy feared internal betrayal and wanted to prevent discovery.",
      "level": 1
    },
    {
      "id": "33",
      "text": "Zhang Li set up a communication system, assigning roles to the team.",
      "level": 1
    },
    {
      "id": "34",
      "text": "Yue Yang was excited about the advanced reconnaissance equipment.",
      "level": 1
    },
    {
      "id": "35",
      "text": "Zhang Li pointed out that there were only eight backpacks for nine people.",
      "level": 1
    },
    {
      "id": "36",
      "text": "Lü Jingnan suggested they establish a camp, noting the enemy's use of sleeping bags as a potential oversight.",
      "level": 1
    },
    {
      "id": "37",
      "text": "Zhang Li's radar system was set up, capable of detecting moving objects within a ten-kilometer range.",
      "level": 1
    },
    {
      "id": "38",
      "text": "The radar could not distinguish stationary or slow-moving objects from the forest.",
      "level": 1
    },
    {
      "id": "39",
      "text": "The group continued their journey through the wilderness, with Sean being carried on a stretcher.",
      "level": 1
    },
    {
      "id": "40",
      "text": "Sean's buttock injury was not improving, causing concern.",
      "level": 1
    },
    {
      "id": "41",
      "text": "The medical team was perplexed by the lack of improvement and the continued presence of pus.",
      "level": 1
    },
    {
      "id": "42",
      "text": "The team was working to decipher ancient texts and logs from Gongbu Village.",
      "level": 1
    },
    {
      "id": "43",
      "text": "A significant discovery was made regarding the true nature of their location.",
      "level": 1
    },
    {
      "id": "44",
      "text": "The entire rift space was not Xiangbalan, but rather a larger entity.",
      "level": 1
    },
    {
      "id": "45",
      "text": "The three tiered platforms were identified as Sumeru Mountain.",
      "level": 1
    },
    {
      "id": "46",
      "text": "Xiangbalan was a part of this larger Sumeru World.",
      "level": 1
    },
    {
      "id": "47",
      "text": "The ancient Gobar people viewed this rift space as a complete world.",
      "level": 1
    },
    {
      "id": "48",
      "text": "The description of Sumeru Mountain in Buddhist scriptures aligned with the observed geological structure.",
      "level": 1
    },
    {
      "id": "49",
      "text": "The explorers realized their understanding of Xiangbalan was previously flawed.",
      "level": 1
    },
    {
      "id": "50",
      "text": "The 'dark thread' in the 'Xiangbalan Secret Light Treasure Mirror' likely pointed to Xiangbalan within the Sumeru World.",
      "level": 1
    },
    {
      "id": "51",
      "text": "The discovery of a log entry dated near the time of the Gongbu Village massacre was made.",
      "level": 1
    },
    {
      "id": "52",
      "text": "This log entry described a young girl named Magi Ami.",
      "level": 1
    },
    {
      "id": "53",
      "text": "The log described Magi Ami's beauty, bravery, and optimism despite hardship.",
      "level": 1
    },
    {
      "id": "54",
      "text": "Magi Ami's family had died in war and famine, but she held onto hope.",
      "level": 1
    },
    {
      "id": "55",
      "text": "She expressed a desire to find a peaceful land and live in harmony.",
      "level": 1
    },
    {
      "id": "56",
      "text": "The log writer was deeply moved by Magi Ami's spirit.",
      "level": 1
    },
    {
      "id": "57",
      "text": "The mention of 'war' in the log raised questions about the cause of the Gongbu Village massacre.",
      "level": 1
    }
  ],
  "concepts": [
    {
      "name": "Giant Mosquitoes",
      "frequency": 17,
      "context": "The primary antagonists in the initial part of the document, described as over a meter long with formidable physical characteristics."
    },
    {
      "name": "Explorers",
      "frequency": 15,
      "context": "The main group of protagonists facing various dangers and making discoveries."
    },
    {
      "name": "Fire",
      "frequency": 7,
      "context": "Used as a weapon and deterrent against the giant mosquitoes."
    },
    {
      "name": "Weapons",
      "frequency": 10,
      "context": "Crucial for survival and defense, their depletion is a significant plot point."
    },
    {
      "name": "Injuries",
      "frequency": 10,
      "context": "Sustained by several characters during encounters with dangerous creatures and environments."
    },
    {
      "name": "Medical Supplies/Treatment",
      "frequency": 7,
      "context": "Essential for tending to injuries, with varying levels of effectiveness and sophistication."
    },
    {
      "name": "Special Forces Equipment",
      "frequency": 11,
      "context": "Discovered and analyzed, providing significant advantages to the explorers."
    },
    {
      "name": "Xiangbalan",
      "frequency": 14,
      "context": "The ultimate destination, its true nature and location are gradually revealed."
    },
    {
      "name": "Sumeru Mountain",
      "frequency": 7,
      "context": "Identified as the true geographical and cosmological location of the story, previously misunderstood."
    },
    {
      "name": "Gongbu Village",
      "frequency": 5,
      "context": "A significant location with historical logs and a past massacre."
    },
    {
      "name": "Logs/Texts",
      "frequency": 6,
      "context": "Provide historical information and clues to the explorers."
    },
    {
      "name": "Magi Ami",
      "frequency": 7,
      "context": "A young girl from Gongbu Village, whose story is found in a log, representing innocence and hope."
    },
    {
      "name": "Sean",
      "frequency": 12,
      "context": "An explorer who sustains a severe injury and becomes a focus of medical attention and suspicion."
    },
    {
      "name": "Zhuo Muqiangba",
      "frequency": 10,
      "context": "A key leader of the exploration team, often involved in direct action and decision-making."
    },
    {
      "name": "Yue Yang",
      "frequency": 11,
      "context": "A talented scout, analytical and observant, contributing significantly to understanding the environment and enemy."
    },
    {
      "name": "Lü Jingnan",
      "frequency": 8,
      "context": "A capable medical professional and observer, providing advanced treatment and warnings."
    },
    {
      "name": "Zhang Li",
      "frequency": 10,
      "context": "A character involved in deciphering locks, analyzing technology, and operating equipment."
    },
    {
      "name": "Tang Min",
      "frequency": 6,
      "context": "A medical character who assists in treating injuries."
    },
    {
      "name": "Basang",
      "frequency": 7,
      "context": "A character who assists in combat and rescues, and is suspicious of Sean."
    },
    {
      "name": "Hu Yang",
      "frequency": 7,
      "context": "A captain figure, involved in leadership and discussions about ancient texts."
    },
    {
      "name": "Yala Master",
      "frequency": 8,
      "context": "A spiritual figure involved in translating ancient texts and understanding the cosmological aspects of the discoveries."
    }
  ],
  "relations": [
    {
      "source": "Giant Mosquitoes",
      "target": "Explorers",
      "type": "attacks"
    },
    {
      "source": "Explorers",
      "target": "Fire",
      "type": "uses"
    },
    {
      "source": "Fire",
      "target": "Giant Mosquitoes",
      "type": "damages"
    },
    {
      "source": "Explorers",
      "target": "Weapons",
      "type": "uses"
    },
    {
      "source": "Weapons",
      "target": "Giant Mosquitoes",
      "type": "damages"
    },
    {
      "source": "Explorers",
      "target": "Injuries",
      "type": "sustains"
    },
    {
      "source": "Injuries",
      "target": "Medical Supplies/Treatment",
      "type": "treated_by"
    },
    {
      "source": "Explorers",
      "target": "Special Forces Equipment",
      "type": "discovers"
    },
    {
      "source": "Special Forces Equipment",
      "target": "Explorers",
      "type": "aids"
    },
    {
      "source": "Explorers",
      "target": "Xiangbalan",
      "type": "seeks"
    },
    {
      "source": "Xiangbalan",
      "target": "Sumeru Mountain",
      "type": "is_part_of"
    },
    {
      "source": "Sumeru Mountain",
      "target": "Gongbu Village",
      "type": "contains"
    },
    {
      "source": "Logs/Texts",
      "target": "Gongbu Village",
      "type": "describes"
    },
    {
      "source": "Logs/Texts",
      "target": "Magi Ami",
      "type": "describes"
    },
    {
      "source": "Sean",
      "target": "Injuries",
      "type": "sustains"
    },
    {
      "source": "Zhuo Muqiangba",
      "target": "Explorers",
      "type": "leads"
    },
    {
      "source": "Yue Yang",
      "target": "Analysis",
      "type": "performs"
    },
    {
      "source": "Lü Jingnan",
      "target": "Medical Treatment",
      "type": "provides"
    },
    {
      "source": "Zhang Li",
      "target": "Technology",
      "type": "operates"
    },
    {
      "source": "Yala Master",
      "target": "Ancient Texts",
      "type": "translates"
    },
    {
      "source": "Hu Yang",
      "target": "Leadership",
      "type": "exercises"
    },
    {
      "source": "Magi Ami",
      "target": "Optimism",
      "type": "exhibits"
    },
    {
      "source": "Gongbu Village",
      "target": "Massacre",
      "type": "experienced"
    }
  ],
  "hierarchy": {
    "main_topics": [
      "Encounter with Giant Mosquitoes",
      "Discovery of Special Forces Supplies",
      "Revelation of Sumeru Mountain and Xiangbalan's True Nature",
      "Analysis of Gongbu Village Massacre and Magi Ami's Story"
    ],
    "structure": "The document is structured as a narrative, progressing chronologically through a series of encounters, discoveries, and revelations. It begins with an action-heavy scene, transitions to exploration and resource acquisition, then delves into cosmological and historical mysteries, and concludes with the introduction of a significant character from the past. The chapters ('斗蚊', '新装备', '须弥山', '玛吉阿米') clearly delineate these shifts in focus."
  }
}