{
  "propositions": [
    {
      "id": "1",
      "text": "The story begins at six o'clock, with the accounting department head still absent from the director's office. The accounting department is illuminated and the staff are weary.",
      "level": 1
    },
    {
      "id": "1.1",
      "text": "The deputy head, Akiaki Ryūo, dismisses the staff but decides to wait for the department head.",
      "level": 2
    },
    {
      "id": "1.2",
      "text": "The department head, Sekino Tokuichirō, is struggling to secure 60 million yen to cover a maturing bill and payroll, facing difficulties with banks.",
      "level": 2
    },
    {
      "id": "1.3",
      "text": "Ryūo feels sympathetic towards Sekino and decides to wait further.",
      "level": 2
    },
    {
      "id": "1.4",
      "text": "Sekino returns, appearing to have made progress, and invites Ryūo to accompany him to meet someone at Tokyo Station at 8 PM.",
      "level": 2
    },
    {
      "id": "1.5",
      "text": "They go to a bar where Sekino hints that the situation is mostly resolved but remains tense.",
      "level": 2
    },
    {
      "id": "1.6",
      "text": "At Tokyo Station, Sekino waits for someone in the first and second-class waiting room.",
      "level": 2
    },
    {
      "id": "1.7",
      "text": "Ryūo observes Sekino meeting two men, one of whom is described with a red face and gold-rimmed glasses.",
      "level": 2
    },
    {
      "id": "1.8",
      "text": "Ryūo notices a stylish woman outside the waiting room peering in.",
      "level": 2
    },
    {
      "id": "2",
      "text": "The next morning, Sekino receives a call from Mr. Horiguchi, who arranges a meeting at the T Hall West Restaurant.",
      "level": 1
    },
    {
      "id": "2.1",
      "text": "Sekino instructs Ryūo to prepare to withdraw cash, and they plan to go to R Mutual Bank.",
      "level": 2
    },
    {
      "id": "2.2",
      "text": "Sekino meets with the director, who expresses concern about the situation.",
      "level": 2
    },
    {
      "id": "2.3",
      "text": "At the T Hall, Sekino meets Horiguchi, who he met the previous night.",
      "level": 2
    },
    {
      "id": "2.4",
      "text": "Horiguchi assures Sekino that the matter is settled and will take about twenty minutes.",
      "level": 2
    },
    {
      "id": "2.5",
      "text": "Horiguchi confirms that the 200,000 yen kickback will be paid, and mentions the difficulty in convincing Mr. Oyama to allocate funds.",
      "level": 2
    },
    {
      "id": "2.6",
      "text": "Sekino and Horiguchi go to R Mutual Bank, where they are met by a young employee who leads them to a meeting room.",
      "level": 2
    },
    {
      "id": "2.7",
      "text": "Mr. Oyama, the executive director, enters and speaks briefly with Horiguchi before leaving to arrange the transaction.",
      "level": 2
    },
    {
      "id": "2.8",
      "text": "The 30 million yen transaction is quickly completed.",
      "level": 2
    },
    {
      "id": "2.9",
      "text": "Horiguchi takes the check to have it cashed. Sekino calls Ryūo to prepare for the cash withdrawal.",
      "level": 2
    },
    {
      "id": "2.10",
      "text": "Sekino waits anxiously for the cash, but after half an hour, he goes to inquire and is told that Director Oyama is on a business trip to Hokkaido.",
      "level": 2
    },
    {
      "id": "2.11",
      "text": "Sekino realizes he has been deceived and that the descriptions of Oyama provided by the bank staff do not match the person he met.",
      "level": 2
    },
    {
      "id": "3",
      "text": "A meeting is held at the company with the manager, managing director, senior managing director, and legal advisor, discussing the 30 million yen check fraud.",
      "level": 1
    },
    {
      "id": "3.1",
      "text": "Sekino recounts the events, appearing distraught and unable to comprehend the ease with which he was defrauded.",
      "level": 2
    },
    {
      "id": "3.2",
      "text": "The legal advisor explains that the check, as a negotiable instrument, is valid even if obtained through fraud, once transferred to a bona fide third party.",
      "level": 2
    },
    {
      "id": "3.3",
      "text": "Legal options like public announcements or legal seizure are deemed ineffective or damaging to the company's reputation.",
      "level": 2
    },
    {
      "id": "3.4",
      "text": "The manager, Sekino, and the managing director investigate how the meeting room was borrowed.",
      "level": 2
    },
    {
      "id": "3.5",
      "text": "The branch manager explains that a man claiming to be meeting with a Diet member, Mr. Iwao, borrowed the room.",
      "level": 2
    },
    {
      "id": "3.6",
      "text": "The legal advisor confirms that Mr. Iwao is on leave and likely unaware of his name being used.",
      "level": 2
    },
    {
      "id": "3.7",
      "text": "The manager reveals Sekino's involvement with Yamasugi Kitatarō, a loan shark, as the source of Horiguchi's introduction.",
      "level": 2
    },
    {
      "id": "3.8",
      "text": "Yamasugi claims he is not responsible, stating that Horiguchi was just a visitor and he never conducted business with him.",
      "level": 2
    },
    {
      "id": "3.9",
      "text": "The managing director apologizes for the mistake, but the manager insists on finding a solution for the lost 30 million yen.",
      "level": 2
    },
    {
      "id": "3.10",
      "text": "The senior managing director suggests pursuing legal action, but the lawyer advises against it due to reputational damage.",
      "level": 2
    },
    {
      "id": "3.11",
      "text": "The decision is made to keep the incident secret to protect the company's reputation.",
      "level": 2
    },
    {
      "id": "3.12",
      "text": "The manager holds Sekino fully responsible for the significant loss.",
      "level": 2
    },
    {
      "id": "3.13",
      "text": "Sekino leaves the office and walks through Ginza, feeling isolated and despairing.",
      "level": 2
    },
    {
      "id": "3.14",
      "text": "He takes a taxi to Azabu, intending to confront Yamasugi.",
      "level": 2
    },
    {
      "id": "3.15",
      "text": "Yamasugi is out of town, and his secretary, Ms. Uesaki, is also unavailable.",
      "level": 2
    },
    {
      "id": "3.16",
      "text": "Sekino calls his wife, Chiyoko, telling her he cannot come home.",
      "level": 2
    },
    {
      "id": "3.17",
      "text": "He takes a train to Yumoto, checks into a hotel, and writes letters to his wife, the manager, the managing director, and Ryūo.",
      "level": 2
    },
    {
      "id": "3.18",
      "text": "He leaves the letters and money for postage, then walks into the mountains as dawn breaks.",
      "level": 2
    },
    {
      "id": "4",
      "text": "Ryūo visits Yamasugi Shoji Company in Azabu to discuss a loan.",
      "level": 1
    },
    {
      "id": "4.1",
      "text": "He is led to a reception room and meets a staff member who is to handle his loan application.",
      "level": 2
    }
  ],
  "concepts": [
    {
      "name": "Sekino Tokuichirō",
      "frequency": 15,
      "context": "Accounting department head who is the central figure in the check fraud."
    },
    {
      "name": "Akizaki Ryūo",
      "frequency": 8,
      "context": "Deputy head of the accounting department, acts as an observer and confidant."
    },
    {
      "name": "Horiguchi",
      "frequency": 6,
      "context": "The individual who orchestrates the check fraud."
    },
    {
      "name": "Yamasugi Kitatarō",
      "frequency": 6,
      "context": "A loan shark and financier, through whom Horiguchi is introduced."
    },
    {
      "name": "R Mutual Bank",
      "frequency": 7,
      "context": "The bank where the fraudulent transaction takes place."
    },
    {
      "name": "Oyama",
      "frequency": 5,
      "context": "Executive director at R Mutual Bank, impersonated by a fraudster."
    },
    {
      "name": "Check Fraud",
      "frequency": 5,
      "context": "The central criminal act in the story."
    },
    {
      "name": "Company Reputation",
      "frequency": 5,
      "context": "A major concern for the company's leadership, influencing their decisions."
    },
    {
      "name": "Negotiable Instrument",
      "frequency": 4,
      "context": "Legal concept explaining the validity of checks."
    },
    {
      "name": "Tokyo Station",
      "frequency": 4,
      "context": "Location of the initial meeting between Sekino and Horiguchi."
    },
    {
      "name": "Uesaki",
      "frequency": 3,
      "context": "Yamasugi's female secretary who acted as an intermediary."
    },
    {
      "name": "Manager",
      "frequency": 4,
      "context": "Head of the company, involved in the crisis meeting."
    },
    {
      "name": "Managing Director",
      "frequency": 3,
      "context": "A senior figure in the company, involved in the crisis meeting."
    },
    {
      "name": "Legal Advisor",
      "frequency": 4,
      "context": "Provides legal counsel regarding the check fraud."
    },
    {
      "name": "Chiyoko",
      "frequency": 2,
      "context": "Sekino's wife."
    },
    {
      "name": "Iwao",
      "frequency": 2,
      "context": "A Diet member whose name was used by the fraudsters."
    }
  ],
  "relations": [
    {
      "source": "Sekino Tokuichirō",
      "target": "Akizaki Ryūo",
      "type": "superior_of"
    },
    {
      "source": "Sekino Tokuichirō",
      "target": "Check Fraud",
      "type": "victim_of"
    },
    {
      "source": "Akizaki Ryūo",
      "target": "Sekino Tokuichirō",
      "type": "subordinate_of"
    },
    {
      "source": "Horiguchi",
      "target": "Check Fraud",
      "type": "perpetrator_of"
    },
    {
      "source": "Horiguchi",
      "target": "Yamasugi Kitatarō",
      "type": "introduced_by"
    },
    {
      "source": "Yamasugi Kitatarō",
      "target": "Uesaki",
      "type": "employs"
    },
    {
      "source": "Horiguchi",
      "target": "R Mutual Bank",
      "type": "involved_with"
    },
    {
      "source": "Oyama",
      "target": "R Mutual Bank",
      "type": "executive_director_of"
    },
    {
      "source": "Oyama",
      "target": "Horiguchi",
      "type": "impersonated_by"
    },
    {
      "source": "Check Fraud",
      "target": "Company Reputation",
      "type": "threatens"
    },
    {
      "source": "Negotiable Instrument",
      "target": "Check Fraud",
      "type": "legal_concept_related_to"
    },
    {
      "source": "Tokyo Station",
      "target": "Sekino Tokuichirō",
      "type": "location_of_meeting_with"
    },
    {
      "source": "Tokyo Station",
      "target": "Horiguchi",
      "type": "location_of_meeting_with"
    },
    {
      "source": "Manager",
      "target": "Company Reputation",
      "type": "prioritizes"
    },
    {
      "source": "Legal Advisor",
      "target": "Negotiable Instrument",
      "type": "explains"
    },
    {
      "source": "Legal Advisor",
      "target": "Company Reputation",
      "type": "advises_to_protect"
    },
    {
      "source": "Sekino Tokuichirō",
      "target": "Chiyoko",
      "type": "husband_of"
    },
    {
      "source": "Uesaki",
      "target": "Yamasugi Kitatarō",
      "type": "secretary_of"
    },
    {
      "source": "Iwao",
      "target": "Diet Member",
      "type": "is_a"
    },
    {
      "source": "Horiguchi",
      "target": "Iwao",
      "type": "uses_name_of"
    }
  ],
  "hierarchy": {
    "main_topics": [
      "The financial struggles of Showa Electric Manufacturing Company",
      "A sophisticated check fraud scheme",
      "The investigation and aftermath of the fraud",
      "The personal despair and suicide of Sekino Tokuichirō"
    ],
    "structure": "The document is structured chronologically, detailing events leading up to the fraud, the execution of the fraud, the company's reaction, and the tragic end of the accounting department head. It is divided into three main sections: '隔墙有眼' (The Walls Have Ears), '自杀之行' (Journey to Suicide), and further subsections within the latter."
  }
}