{
  "propositions": [
    {
      "id": "1",
      "text": "The document is structured into parts and chapters, with the first part titled '杰米 1883～1906' and containing a prologue and a first chapter.",
      "level": 1
    },
    {
      "id": "1.1",
      "text": "The prologue is further divided into sections, including one in 1982 featuring Kate Blackwell and another that mirrors the opening of the first chapter with a storm.",
      "level": 2
    },
    {
      "id": "1.2",
      "text": "The first chapter details Jamie McGregor's journey to South Africa in search of diamonds.",
      "level": 2
    },
    {
      "id": "2",
      "text": "Kate Blackwell celebrates her 90th birthday, surrounded by family and the 'ghosts' of her past.",
      "level": 1
    },
    {
      "id": "2.1",
      "text": "She reflects on her life, her family, and the passage of time.",
      "level": 2
    },
    {
      "id": "2.2",
      "text": "Her great-grandson, Robert, plays the piano, showcasing his talent.",
      "level": 2
    },
    {
      "id": "2.3",
      "text": "A formal dinner and speeches celebrate Kate's achievements and philanthropy.",
      "level": 2
    },
    {
      "id": "2.4",
      "text": "Kate privately dismisses the accolades, remembering her difficult past.",
      "level": 2
    },
    {
      "id": "3",
      "text": "Jamie McGregor, a young man from Scotland, dreams of becoming wealthy through diamond mining in South Africa.",
      "level": 1
    },
    {
      "id": "3.1",
      "text": "He leaves his family farm to embark on this journey.",
      "level": 2
    },
    {
      "id": "3.2",
      "text": "His journey involves travel to Edinburgh, London, and finally Cape Town.",
      "level": 2
    },
    {
      "id": "3.3",
      "text": "Cape Town is depicted as a diverse and chaotic port city.",
      "level": 2
    },
    {
      "id": "3.4",
      "text": "Jamie faces hardships and finds work to earn money for his journey to the diamond fields.",
      "level": 2
    },
    {
      "id": "3.5",
      "text": "He travels by mail coach to Klerksdorp, a rough and unglamorous diamond mining settlement.",
      "level": 2
    },
    {
      "id": "3.6",
      "text": "Upon arrival, he encounters the harsh realities of the mining town and its inhabitants.",
      "level": 2
    },
    {
      "id": "4",
      "text": "The harsh weather conditions are described, including a violent thunderstorm.",
      "level": 1
    },
    {
      "id": "4.1",
      "text": "The storm is presented as a powerful natural force, affecting the landscape and structures.",
      "level": 2
    },
    {
      "id": "5",
      "text": "Klerksdorp is characterized as a makeshift town of tents and shacks, populated by fortune seekers.",
      "level": 1
    },
    {
      "id": "5.1",
      "text": "The primary attraction of Klerksdorp is the pursuit of diamonds.",
      "level": 2
    },
    {
      "id": "6",
      "text": "Jamie McGregor is portrayed as a handsome, optimistic, and pure-hearted young man.",
      "level": 1
    },
    {
      "id": "6.1",
      "text": "He is driven by a dream of wealth and a desire to improve his circumstances and those of his family.",
      "level": 2
    },
    {
      "id": "7",
      "text": "The document includes historical and literary epigraphs that provide context and thematic resonance.",
      "level": 1
    },
    {
      "id": "7.1",
      "text": "The epigraphs quote Alexander Pope and Pliny the Elder, touching upon themes of passion, nature's forces, and the resilience of materials.",
      "level": 2
    },
    {
      "id": "8",
      "text": "There is a contrast between the past and the present, with characters existing in different time periods but influencing each other.",
      "level": 1
    },
    {
      "id": "8.1",
      "text": "Kate Blackwell in 1982 interacts with the memories and 'ghosts' of people from her past.",
      "level": 2
    },
    {
      "id": "8.2",
      "text": "Jamie McGregor's journey is set in 1883, establishing a historical backdrop.",
      "level": 2
    },
    {
      "id": "9",
      "text": "The descriptions of places like London and Cape Town highlight their bustling nature and the diverse populations they contain.",
      "level": 1
    },
    {
      "id": "9.1",
      "text": "Technological advancements of the time, such as the telephone, are mentioned.",
      "level": 2
    },
    {
      "id": "10",
      "text": "The economic conditions of the time, including economic crisis and unemployment in London, are noted.",
      "level": 1
    },
    {
      "id": "11",
      "text": "The pursuit of wealth through diamond mining is a central motivation for many characters.",
      "level": 1
    },
    {
      "id": "11.1",
      "text": "The descriptions of the diamond fields emphasize the arduous labor and the speculative nature of the pursuit.",
      "level": 2
    },
    {
      "id": "12",
      "text": "Family relationships and their importance are illustrated through Jamie's interactions with his parents, siblings, and mother's support.",
      "level": 1
    },
    {
      "id": "13",
      "text": "The character of Kate Blackwell is presented as a powerful and enigmatic figure with a hidden, more complex past.",
      "level": 1
    },
    {
      "id": "13.1",
      "text": "Her public image contrasts sharply with her private thoughts about her origins and experiences.",
      "level": 2
    },
    {
      "id": "14",
      "text": "The narrative uses vivid sensory details to describe the environments and experiences of the characters.",
      "level": 1
    },
    {
      "id": "15",
      "text": "The story explores themes of ambition, resilience, the passage of time, and the contrast between appearance and reality.",
      "level": 1
    },
    {
      "id": "16",
      "text": "The concept of 'ghosts' in Kate's birthday celebration symbolizes memories and the enduring impact of past individuals and events.",
      "level": 1
    },
    {
      "id": "17",
      "text": "Jamie's journey is marked by a series of challenges and encounters that shape his character and prepare him for the diamond fields.",
      "level": 1
    },
    {
      "id": "18",
      "text": "The introduction of Margaret Van Der Merwe in the general store suggests a potential new significant relationship or interaction for Jamie.",
      "level": 1
    },
    {
      "id": "19",
      "text": "The character of Banda, a Black man from the Barolong tribe, is introduced with a description of his proud demeanor.",
      "level": 1
    },
    {
      "id": "20",
      "text": "The document hints at the multifaceted nature of success and the sacrifices involved in achieving one's goals.",
      "level": 1
    }
  ],
  "concepts": [
    {
      "name": "Diamond",
      "frequency": 16,
      "context": "Central object of pursuit for Jamie and other characters in South Africa; symbolic of wealth and fortune."
    },
    {
      "name": "Jamie McGregor",
      "frequency": 22,
      "context": "Protagonist of the first part of the story, a young Scottish man seeking wealth in South Africa."
    },
    {
      "name": "Kate Blackwell",
      "frequency": 9,
      "context": "Elderly woman celebrating her 90th birthday, reflecting on her life and past."
    },
    {
      "name": "South Africa",
      "frequency": 14,
      "context": "Setting for the diamond rush, a land of opportunity and hardship."
    },
    {
      "name": "Klerksdorp",
      "frequency": 9,
      "context": "The rough diamond mining settlement where Jamie arrives; depicted as chaotic and unsanitary."
    },
    {
      "name": "Journey",
      "frequency": 11,
      "context": "Jamie's arduous travel from Scotland to South Africa, involving multiple stages and challenges."
    },
    {
      "name": "Wealth",
      "frequency": 8,
      "context": "The primary motivation for Jamie and many others in the pursuit of diamonds."
    },
    {
      "name": "Family",
      "frequency": 8,
      "context": "Jamie's family in Scotland, their support, and Kate Blackwell's descendants in 1982."
    },
    {
      "name": "Storm",
      "frequency": 5,
      "context": "A prominent natural event, described as a violent thunderstorm, impacting the narrative and environment."
    },
    {
      "name": "Past",
      "frequency": 6,
      "context": "A significant theme, represented by Kate's memories and the 'ghosts' of her life, and Jamie's past life in Scotland."
    },
    {
      "name": "Future",
      "frequency": 2,
      "context": "Represented by characters like Robert, Kate's great-grandson, and Jamie's aspirations."
    },
    {
      "name": "Memory",
      "frequency": 3,
      "context": "Key to Kate Blackwell's experience of her birthday and her reflections."
    },
    {
      "name": "Hardship",
      "frequency": 4,
      "context": "Experienced by Jamie during his journey and upon arrival in Klerksdorp; also alluded to in Kate's past."
    },
    {
      "name": "Opportunity",
      "frequency": 3,
      "context": "The allure of South Africa and diamond mining as a chance for a better life."
    },
    {
      "name": "London",
      "frequency": 3,
      "context": "A city Jamie passes through, described as large, bustling, and experiencing economic difficulties."
    },
    {
      "name": "Cape Town",
      "frequency": 3,
      "context": "The port city where Jamie arrives in South Africa, characterized by its diversity and chaos."
    },
    {
      "name": "Pursuit",
      "frequency": 3,
      "context": "The central action for many characters, particularly Jamie's pursuit of diamonds and wealth."
    },
    {
      "name": "Youth",
      "frequency": 4,
      "context": "Describing Jamie's character and the young age of some individuals in the story."
    },
    {
      "name": "Dirt",
      "frequency": 1,
      "context": "Describing the streets of Klerksdorp and the general unsanitary conditions."
    },
    {
      "name": "Flies",
      "frequency": 3,
      "context": "A nuisance encountered by Jamie in Cape Town and Klerksdorp, symbolizing unpleasant conditions."
    },
    {
      "name": "Sanitation",
      "frequency": 2,
      "context": "The poor state of sanitation in Cape Town and Klerksdorp, a significant hardship."
    },
    {
      "name": "Hope",
      "frequency": 2,
      "context": "A driving force for Jamie in his pursuit of diamonds and a better future."
    },
    {
      "name": "Adventure",
      "frequency": 1,
      "context": "The implicit nature of Jamie's journey and his move to South Africa."
    },
    {
      "name": "Character",
      "frequency": 4,
      "context": "Descriptions of Jamie, Kate, Banda, and other individuals highlight their personalities and backgrounds."
    },
    {
      "name": "Setting",
      "frequency": 5,
      "context": "The descriptions of Scotland, London, Cape Town, and Klerksdorp establish the physical and atmospheric context of the narrative."
    },
    {
      "name": "Epigraph",
      "frequency": 2,
      "context": "Quotations at the beginning of sections that provide thematic context."
    },
    {
      "name": "Music",
      "frequency": 2,
      "context": "Robert's piano playing is a significant moment in Kate's birthday celebration."
    },
    {
      "name": "Philanthropy",
      "frequency": 1,
      "context": "A characteristic attributed to Kate Blackwell during the celebratory speeches."
    },
    {
      "name": "Past Trauma",
      "frequency": 1,
      "context": "Hinted at by Kate's private thoughts about her origins and 'gunshots'."
    },
    {
      "name": "Social Class",
      "frequency": 1,
      "context": "Implied in the descriptions of wealthy residences in Cape Town and the diverse people in the streets."
    },
    {
      "name": "Labor",
      "frequency": 3,
      "context": "Jamie's willingness to endure hard labor for the sake of wealth; the arduous work in the diamond fields."
    },
    {
      "name": "Isolation",
      "frequency": 1,
      "context": "Jamie's feeling of loneliness in the unfamiliar land of South Africa."
    },
    {
      "name": "Ambition",
      "frequency": 2,
      "context": "The driving force behind Jamie's decision to seek his fortune in South Africa."
    },
    {
      "name": "Appearance vs. Reality",
      "frequency": 2,
      "context": "Contrasted in Kate's public image versus her private self, and in the idealized dream of diamond wealth versus the harsh reality of Klerksdorp."
    },
    {
      "name": "Relationships",
      "frequency": 3,
      "context": "Family ties and potential new connections like Jamie and Margaret."
    },
    {
      "name": "Story Structure",
      "frequency": 1,
      "context": "The organization of the document into parts, chapters, and prologues."
    },
    {
      "name": "Proverbs/Sayings",
      "frequency": 1,
      "context": "The literary device used in the epigraphs and character dialogues."
    },
    {
      "name": "Cultural Diversity",
      "frequency": 2,
      "context": "Evident in the descriptions of Cape Town and its inhabitants."
    },
    {
      "name": "Transformation",
      "frequency": 1,
      "context": "Implied in Jamie's journey and the potential changes he will undergo."
    },
    {
      "name": "Survival",
      "frequency": 1,
      "context": "A core aspect of life in Klerksdorp, as warned by others."
    },
    {
      "name": "Commercialism",
      "frequency": 1,
      "context": "The bustling marketplace and the prices charged in Klerksdorp."
    },
    {
      "name": "Race",
      "frequency": 1,
      "context": "Mentioned in the context of Banda and the attitudes of some settlers."
    },
    {
      "name": "Gender",
      "frequency": 1,
      "context": "Depicted in the roles and descriptions of female characters like Kate and Margaret."
    }
  ],
  "relations": [
    {
      "source": "Jamie McGregor",
      "target": "South Africa",
      "type": "travels_to"
    },
    {
      "source": "Jamie McGregor",
      "target": "Diamond",
      "type": "seeks"
    },
    {
      "source": "Diamond",
      "target": "Wealth",
      "type": "symbolizes"
    },
    {
      "source": "Klerksdorp",
      "target": "Diamond",
      "type": "location_of"
    },
    {
      "source": "Kate Blackwell",
      "target": "Memory",
      "type": "engages_with"
    },
    {
      "source": "Kate Blackwell",
      "target": "Past",
      "type": "reflects_on"
    },
    {
      "source": "Jamie McGregor",
      "target": "Family",
      "type": "leaves"
    },
    {
      "source": "Jamie McGregor",
      "target": "Journey",
      "type": "undertakes"
    },
    {
      "source": "Journey",
      "target": "Hardship",
      "type": "involves"
    },
    {
      "source": "Storm",
      "target": "Environment",
      "type": "affects"
    },
    {
      "source": "Cape Town",
      "target": "Diversity",
      "type": "characterized_by"
    },
    {
      "source": "Klerksdorp",
      "target": "Hardship",
      "type": "embodies"
    },
    {
      "source": "Ambition",
      "target": "Jamie McGregor",
      "type": "drives"
    },
    {
      "source": "Appearance vs. Reality",
      "target": "Kate Blackwell",
      "type": "applies_to"
    },
    {
      "source": "Appearance vs. Reality",
      "target": "Diamond",
      "type": "applies_to"
    },
    {
      "source": "Opportunity",
      "target": "South Africa",
      "type": "offered_by"
    },
    {
      "source": "Character",
      "target": "Jamie McGregor",
      "type": "describes"
    },
    {
      "source": "Character",
      "target": "Kate Blackwell",
      "type": "describes"
    },
    {
      "source": "Setting",
      "target": "Klerksdorp",
      "type": "describes"
    },
    {
      "source": "Setting",
      "target": "Cape Town",
      "type": "describes"
    },
    {
      "source": "Epigraph",
      "target": "Theme",
      "type": "introduces"
    },
    {
      "source": "Music",
      "target": "Robert",
      "type": "performed_by"
    },
    {
      "source": "Relationships",
      "target": "Jamie McGregor",
      "type": "involves"
    },
    {
      "source": "Relationships",
      "target": "Margaret Van Der Merwe",
      "type": "involves"
    },
    {
      "source": "Race",
      "target": "Banda",
      "type": "describes"
    },
    {
      "source": "Sanitation",
      "target": "Klerksdorp",
      "type": "poor_in"
    },
    {
      "source": "Flies",
      "target": "Klerksdorp",
      "type": "present_in"
    },
    {
      "source": "Future",
      "target": "Robert",
      "type": "represented_by"
    },
    {
      "source": "Past",
      "target": "Kate Blackwell",
      "type": "haunts"
    },
    {
      "source": "Labor",
      "target": "Diamond mining",
      "type": "required_for"
    },
    {
      "source": "Ambition",
      "target": "Jamie McGregor",
      "type": "fueled_by"
    },
    {
      "source": "Character",
      "target": "Banda",
      "type": "describes"
    },
    {
      "source": "Transformation",
      "target": "Jamie McGregor",
      "type": "potential_for"
    },
    {
      "source": "Survival",
      "target": "Klerksdorp",
      "type": "dependent_on"
    },
    {
      "source": "Commercialism",
      "target": "Klerksdorp",
      "type": "evident_in"
    },
    {
      "source": "Historical context",
      "target": "South Africa",
      "type": "relates_to"
    },
    {
      "source": "Literary context",
      "target": "Epigraphs",
      "type": "provided_by"
    }
  ],
  "hierarchy": {
    "main_topics": [
      "Narrative Structure and Chapters",
      "Kate Blackwell's Birthday Celebration",
      "Jamie McGregor's Journey to South Africa",
      "The Diamond Rush and Klerksdorp",
      "Themes and Concepts"
    ],
    "structure": "The document is divided into main parts and chapters. Part One, '杰米 1883～1906', contains a Prologue and Chapter One. The Prologue itself includes sections with different time references (1982 and a storm narrative similar to Chapter One). The content alternates between Kate Blackwell's present-day birthday celebration and Jamie McGregor's historical journey to the diamond fields of South Africa."
  }
}