{
  "propositions": [
    {
      "id": "1",
      "text": "The narrator wakes up to the sound of rain.",
      "level": 1
    },
    {
      "id": "1.1",
      "text": "He observes the dark room and the wet柿子树 outside.",
      "level": 2
    },
    {
      "id": "2",
      "text": "He is sweating profusely and his bedding is damp.",
      "level": 1
    },
    {
      "id": "3",
      "text": "He sees his two shirts, hung to dry, are soaked and dripping.",
      "level": 1
    },
    {
      "id": "4",
      "text": "The landlady of the tobacco shop downstairs has not collected his shirts.",
      "level": 1
    },
    {
      "id": "5",
      "text": "It is past three o'clock, and he feels groggy.",
      "level": 1
    },
    {
      "id": "6",
      "text": "He slept at eight in the morning after spending the entire night writing an art review for a magazine to earn his rent.",
      "level": 1
    },
    {
      "id": "7",
      "text": "He feels drained and lost.",
      "level": 1
    },
    {
      "id": "8",
      "text": "He decides to take a bath.",
      "level": 1
    },
    {
      "id": "9",
      "text": "He glances at his wet shirts as he leaves the house, holding a wobbly umbrella.",
      "level": 1
    },
    {
      "id": "10",
      "text": "The men's bathhouse is sparsely populated during the day.",
      "level": 1
    },
    {
      "id": "11",
      "text": "The hot water helps to clear his head.",
      "level": 1
    },
    {
      "id": "12",
      "text": "The light in the bathhouse is weak, making it seem like dusk.",
      "level": 1
    },
    {
      "id": "13",
      "text": "He had intended to visit Minako.",
      "level": 1
    },
    {
      "id": "14",
      "text": "He realizes it is almost four o'clock and she might be at work.",
      "level": 1
    },
    {
      "id": "15",
      "text": "He decides to call her shop later.",
      "level": 1
    },
    {
      "id": "16",
      "text": "He needs to lend her five thousand yen for a two-thousand yen debt.",
      "level": 1
    },
    {
      "id": "17",
      "text": "This leaves him with only four thousand yen, which will not last ten days.",
      "level": 1
    },
    {
      "id": "18",
      "text": "He needs to figure out his next source of income.",
      "level": 1
    },
    {
      "id": "19",
      "text": "His best option is to urge the magazine to pay him for the article submitted that morning.",
      "level": 1
    },
    {
      "id": "20",
      "text": "He squats in front of the mirror to shave.",
      "level": 1
    },
    {
      "id": "21",
      "text": "It is dark outside due to the rain, and no lights are on.",
      "level": 1
    },
    {
      "id": "22",
      "text": "His reflection is unclear, but his white hairs catch the dull light with an 'artistic' sheen.",
      "level": 1
    },
    {
      "id": "23",
      "text": "His naked body is a dark silhouette, with only his messy hair, prominent cheekbones, thin neck, and emaciated body and arms outlined.",
      "level": 1
    },
    {
      "id": "24",
      "text": "He stares at his body for a long time.",
      "level": 1
    },
    {
      "id": "25",
      "text": "He looks almost sixty years old.",
      "level": 1
    },
    {
      "id": "26",
      "text": "He tires easily and finds it difficult to lift things recently.",
      "level": 1
    },
    {
      "id": "27",
      "text": "He feels their relationship with Minako might not last much longer due to these signs.",
      "level": 1
    },
    {
      "id": "28",
      "text": "He feels like a candle in the wind when looking at his body in the mirror.",
      "level": 1
    },
    {
      "id": "29",
      "text": "Upon returning from the bathhouse, he finds a new pair of clogs at the bottom of the back steps.",
      "level": 1
    },
    {
      "id": "30",
      "text": "He assumes a visitor is present, as is common.",
      "level": 1
    },
    {
      "id": "31",
      "text": "The visitor greets him: \"Hello, Mr. Taketa.\"",
      "level": 1
    },
    {
      "id": "32",
      "text": "The visitor is sitting in a corner of his cluttered six-tatami room.",
      "level": 1
    },
    {
      "id": "33",
      "text": "\"Oh, it's you!\"",
      "level": 1
    },
    {
      "id": "34",
      "text": "He hangs his wet towel on a nail, thinking it's been a long time since he last saw this person.",
      "level": 1
    },
    {
      "id": "35",
      "text": "The man's real name is Kadosura Kōzō, and he calls himself Gakudō.",
      "level": 1
    },
    {
      "id": "36",
      "text": "\"It's been a long time since I visited. I came unannounced today and entered since you weren't here.\"",
      "level": 1
    },
    {
      "id": "37",
      "text": "Gakudō Kadosura sits up straight and bows respectfully.",
      "level": 1
    },
    {
      "id": "38",
      "text": "He has a large bald spot on his head, with a ring of long, curly hair around the sides.",
      "level": 1
    },
    {
      "id": "39",
      "text": "Despite his appearance, his head and plump body give him a somewhat imposing presence.",
      "level": 1
    },
    {
      "id": "40",
      "text": "Kadosura is not a painter but an antique appraiser who distributes business cards as the \"Secretary of the Eastern Art Club\".",
      "level": 1
    },
    {
      "id": "41",
      "text": "He advertises in local newspapers, stays in local inns, and waits for people to bring him items for appraisal.",
      "level": 1
    },
    {
      "id": "42",
      "text": "The name \"Eastern Art Club\" sounds grand, but his title \"Secretary\" instead of \"President\" is a marketing tactic.",
      "level": 1
    },
    {
      "id": "43",
      "text": "This makes the organization appear large and implies that the president wouldn't personally handle local appraisals.",
      "level": 1
    },
    {
      "id": "44",
      "text": "The business card includes the club's address and phone number, which are not fictitious.",
      "level": 1
    },
    {
      "id": "45",
      "text": "The address is a used bookstore near Ueno.",
      "level": 1
    },
    {
      "id": "46",
      "text": "The \"Eastern Art Club\" rents a room on the second floor, and the phone is borrowed from downstairs.",
      "level": 1
    },
    {
      "id": "47",
      "text": "Kadosura has a female employee, his wife's sister, a thirty-year-old divorced woman who lives with her parents.",
      "level": 1
    },
    {
      "id": "48",
      "text": "There are rumors of an inappropriate relationship between Kadosura and his sister-in-law, leading to constant arguments with his wife.",
      "level": 1
    },
    {
      "id": "49",
      "text": "The narrator rarely interacts with Kadosura.",
      "level": 1
    },
    {
      "id": "50",
      "text": "Kadosura likely sees the narrator as a difficult person: knowledgeable, discerning, and capable of writing about ancient art.",
      "level": 1
    },
    {
      "id": "51",
      "text": "Despite this, Kadosura visits once or twice a year, seemingly on impulse, to have items appraised.",
      "level": 1
    },
    {
      "id": "52",
      "text": "Kadosura himself travels frequently and rarely stays in Tokyo.",
      "level": 1
    },
    {
      "id": "53",
      "text": "\"How is business?\"",
      "level": 1
    },
    {
      "id": "54",
      "text": "The narrator, smoking, sits opposite Kadosura.",
      "level": 1
    },
    {
      "id": "55",
      "text": "He notices two packages beside Kadosura: a box of gifts and a long, narrow box, likely for a scroll.",
      "level": 1
    },
    {
      "id": "56",
      "text": "He suspects Kadosura wants an appraisal.",
      "level": 1
    },
    {
      "id": "57",
      "text": "\"Thanks to you, it's okay, just enough to get by.\"",
      "level": 1
    },
    {
      "id": "58",
      "text": "Kadosura scratches his bald head, his fingers bending, with a feigned expression.",
      "level": 1
    },
    {
      "id": "59",
      "text": "He smiles with thick lips, revealing uneven yellow teeth.",
      "level": 1
    },
    {
      "id": "60",
      "text": "\"Where have you been recently?\"",
      "level": 1
    },
    {
      "id": "61",
      "text": "\"I went to Kyushu.\"",
      "level": 1
    },
    {
      "id": "62",
      "text": "Kadosura uncovers the gift box and presents it to the narrator: a box of sea urchin paste.",
      "level": 1
    },
    {
      "id": "63",
      "text": "\"Kyushu? Did you have many people asking for appraisals?\"",
      "level": 1
    },
    {
      "id": "64",
      "text": "\"Everywhere is the same.\"",
      "level": 1
    },
    {
      "id": "65",
      "text": "\"What's the going rate for appraisals lately?\"",
      "level": 1
    },
    {
      "id": "66",
      "text": "\"A written appraisal is one thousand yen, double for inscriptions. If it's too cheap, they don't believe it; if it's too expensive, they don't ask. This price is just right.\"",
      "level": 1
    },
    {
      "id": "67",
      "text": "Kadosura laughs.",
      "level": 1
    },
    {
      "id": "68",
      "text": "Kadosura has a basic eye for antiques, sufficient for impressing people in the countryside.",
      "level": 1
    },
    {
      "id": "69",
      "text": "This skill was developed twenty years ago while working at a museum as an employee.",
      "level": 1
    },
    {
      "id": "70",
      "text": "Through assisting with exhibit changes and displays, he naturally developed an interest in ancient art.",
      "level": 1
    },
    {
      "id": "71",
      "text": "Although he lacked formal education in this area, the skills learned under the technical staff's guidance surpassed those of an ordinary antique dealer.",
      "level": 1
    },
    {
      "id": "72",
      "text": "However, he soon resigned from the museum, or was possibly fired.",
      "level": 1
    },
    {
      "id": "73",
      "text": "It is speculated he was involved in the theft or attempted theft of small items in collusion with antique dealers, for undeniably illicit reasons.",
      "level": 1
    },
    {
      "id": "74",
      "text": "This suggests Kadosura harbors dark secrets within his plump body.",
      "level": 1
    },
    {
      "id": "75",
      "text": "\"So, you make quite a bit of money, then.\"",
      "level": 1
    },
    {
      "id": "76",
      "text": "The narrator says this, observing Kadosura's thin black kimono, which makes him look like a Japanese painter.",
      "level": 1
    },
    {
      "id": "77",
      "text": "\"Not at all. Travel expenses are high, and advertising in local newspapers is costly. Sometimes I return empty-handed.\"",
      "level": 1
    },
    {
      "id": "78",
      "text": "Despite his words, his expression suggests otherwise, and his subservient eyes carry a hint of arrogance, looking down on the narrator's simple attire.",
      "level": 1
    },
    {
      "id": "79",
      "text": "\"What kind of items are more common in Kyushu?\"",
      "level": 1
    },
    {
      "id": "80",
      "text": "The narrator says this, puffing out his thin shoulders.",
      "level": 1
    },
    {
      "id": "81",
      "text": "\"Paintings, mainly by Takeda ①. His works are overwhelmingly numerous, as this is his hometown.\"",
      "level": 1
    },
    {
      "id": "82",
      "text": "Kadosura says this, wiping sweat from his brow.",
      "level": 1
    },
    {
      "id": "83",
      "text": "\"Besides those signed by disciples, there are some with his own seal and inscription, which are considered high quality. Others are not.\"",
      "level": 1
    },
    {
      "id": "84",
      "text": "\"Also, there are quite a few works by Taiga ② and Tessai ③.\"",
      "level": 1
    },
    {
      "id": "85",
      "text": "\"Do you appraise all of these?\"",
      "level": 1
    },
    {
      "id": "86",
      "text": "\"It's my livelihood, what can I do?\"",
      "level": 1
    },
    {
      "id": "87",
      "text": "Kadosura smiles.",
      "level": 1
    },
    {
      "id": "88",
      "text": "\"It's not always just me. Some cases have two or even three appraisal certificates. The clients are very careful, preparing for potential sales of their assets.\"",
      "level": 1
    },
    {
      "id": "89",
      "text": "\"Truly a regrettable situation.\"",
      "level": 1
    },
    {
      "id": "90",
      "text": "The narrator extinguishes his cigarette butt in the ashtray and yawns.",
      "level": 1
    },
    {
      "id": "91",
      "text": "Seeing this, Kadosura seems flustered and quickly says:",
      "level": 1
    },
    {
      "id": "92",
      "text": "\"Sir, actually, regarding the Takeda matter I mentioned earlier, there are some items I'd like you to appraise.\"",
      "level": 1
    },
    {
      "id": "93",
      "text": "\"Is this it?\"",
      "level": 1
    },
    {
      "id": "94",
      "text": "The narrator glances at the long package.",
      "level": 1
    },
    {
      "id": "95",
      "text": "\"Yes, here, please take a look.\"",
      "level": 1
    },
    {
      "id": "96",
      "text": "Kadosura unties the package, revealing a paulownia wood box. He opens the lid to expose a beautifully crafted scroll.",
      "level": 1
    },
    {
      "id": "97",
      "text": "He takes it out and unrolls it before the narrator.",
      "level": 1
    },
    {
      "id": "98",
      "text": "It is a vividly colored painting of peonies, exuding an ancient aura.",
      "level": 1
    },
    {
      "id": "99",
      "text": "In the narrator's slightly blurry vision, it initially captures his attention.",
      "level": 1
    },
    {
      "id": "100",
      "text": "Kadosura peeks at the narrator's expression.",
      "level": 1
    },
    {
      "id": "101",
      "text": "\"Tell me, whose possession was this?\"",
      "level": 1
    },
    {
      "id": "102",
      "text": "The narrator asks this, observing the painting closely, sometimes from a distance.",
      "level": 1
    },
    {
      "id": "103",
      "text": "\"It belonged to a coal mine owner in Northern Kyushu. When I inquired about its origin, I was told it came from a prominent family in Bungo.\"",
      "level": 1
    },
    {
      "id": "104",
      "text": "\"Have you purchased it now?\"",
      "level": 1
    },
    {
      "id": "105",
      "text": "\"Ah, well, yes.\"",
      "level": 1
    },
    {
      "id": "106",
      "text": "Kadosura's tone is vague.",
      "level": 1
    },
    {
      "id": "107",
      "text": "He likely believes he has discovered something significant and wants to profit greatly from it, hence bringing it for appraisal.",
      "level": 1
    },
    {
      "id": "108",
      "text": "He seems extremely nervous, as if swallowing with difficulty.",
      "level": 1
    },
    {
      "id": "109",
      "text": "\"Sir, what do you think?\"",
      "level": 1
    },
    {
      "id": "110",
      "text": "He says this, leaning in to examine the painting with the narrator.",
      "level": 1
    },
    {
      "id": "111",
      "text": "\"You're asking me what I think? Can't you see for yourself?\"",
      "level": 1
    },
    {
      "id": "112",
      "text": "\"Oh, really, oh, honestly, when I first got it, I was genuinely startled. So many Takeda forgeries I've seen before.\"",
      "level": 1
    },
    {
      "id": "113",
      "text": "\"So, you mean this one might be genuine.\"",
      "level": 1
    },
    {
      "id": "114",
      "text": "\"Is that not possible, sir?\"",
      "level": 1
    },
    {
      "id": "115",
      "text": "Kadosura asks timidly.",
      "level": 1
    },
    {
      "id": "116",
      "text": "\"It's not possible!\"",
      "level": 1
    },
    {
      "id": "117",
      "text": "The narrator says this as he looks away.",
      "level": 1
    },
    {
      "id": "118",
      "text": "Kadosura mutters to himself, \"Hmm, as expected...\" and leans in close to the paper again, examining it as if to devour the painting.",
      "level": 1
    },
    {
      "id": "119",
      "text": "A few sparse hairs grow on his bald head.",
      "level": 1
    },
    {
      "id": "120",
      "text": "His disappointed expression reveals how much he had hoped for this item.",
      "level": 1
    },
    {
      "id": "121",
      "text": "Kadosura has always trusted the narrator's appraisal skills.",
      "level": 1
    },
    {
      "id": "122",
      "text": "\"It's not entirely your fault for being deceived.\"",
      "level": 1
    },
    {
      "id": "123",
      "text": "The narrator says this with a slightly troubled expression.",
      "level": 1
    },
    {
      "id": "124",
      "text": "\"This is completely different from items from Ueno and Kanda ①. And it doesn't resemble Kyoto pieces. It's an entirely different system of forgery.\"",
      "level": 1
    },
    {
      "id": "125",
      "text": "\"The artist who created such a convincing fake certainly had skill. If it were in Iwano's hands, he might have been fooled. Kaneshi-kun might have even made a plate of it and written an explanation in an art magazine.\"",
      "level": 1
    },
    {
      "id": "126",
      "text": "The narrator says this mockingly.",
      "level": 1
    },
    {
      "id": "127",
      "text": "In fact, these last few sentences have been a tiny fishbone, pricking at his heart.",
      "level": 1
    },
    {
      "id": "128",
      "text": "Kadosura leaves at six o'clock.",
      "level": 1
    },
    {
      "id": "129",
      "text": "In an envelope he insisted on leaving, there are two one-thousand-yen bills, presumably for the appraisal fee.",
      "level": 1
    },
    {
      "id": "130",
      "text": "This two-thousand yen is an unexpected income.",
      "level": 1
    },
    {
      "id": "131",
      "text": "There is still plenty of time before Minako finishes work.",
      "level": 1
    },
    {
      "id": "132",
      "text": "He decides to walk to the hotel where Minako works.",
      "level": 1
    },
    {
      "id": "133",
      "text": "He changes his clothes.",
      "level": 1
    },
    {
      "id": "134",
      "text": "Outside, the rain has stopped.",
      "level": 1
    },
    {
      "id": "135",
      "text": "The wet shirts still hanging are faintly white in the dim light.",
      "level": 1
    },
    {
      "id": "136",
      "text": "He walks two blocks to the municipal train station.",
      "level": 1
    },
    {
      "id": "137",
      "text": "He suddenly wonders if Minako is working tonight.",
      "level": 1
    },
    {
      "id": "138",
      "text": "Despite a train arriving, he doesn't board it.",
      "level": 1
    },
    {
      "id": "139",
      "text": "He goes to a public phone booth to call Minako's hotel.",
      "level": 1
    },
    {
      "id": "140",
      "text": "\"Min-sister? She's resting at home tonight.\"",
      "level": 1
    },
    {
      "id": "141",
      "text": "A waitress, recognizing his voice, answers the phone.",
      "level": 1
    },
    {
      "id": "142",
      "text": "\"She was very drunk last night, so she called today saying she felt unwell and wouldn't come to work.\"",
      "level": 1
    },
    {
      "id": "143",
      "text": "He hangs up and buys a pack of cigarettes.",
      "level": 1
    },
    {
      "id": "144",
      "text": "He walks in the opposite direction to catch a bus.",
      "level": 1
    },
    {
      "id": "145",
      "text": "He passes through the bustling main street of Gotanda and walks two or three blocks down a side street.",
      "level": 1
    },
    {
      "id": "146",
      "text": "He turns into a quiet alley.",
      "level": 1
    },
    {
      "id": "147",
      "text": "He enters through the back door of a small apartment building; Minako's place is the last room.",
      "level": 1
    },
    {
      "id": "148",
      "text": "He walks quietly across the concrete floor, suppressing the sound of his clogs.",
      "level": 1
    },
    {
      "id": "149",
      "text": "He sees a glass door with a pink curtain inside, and light shines from within.",
      "level": 1
    },
    {
      "id": "150",
      "text": "She is home.",
      "level": 1
    },
    {
      "id": "151",
      "text": "He taps the glass door two or three times with his fingertips.",
      "level": 1
    },
    {
      "id": "152",
      "text": "Minako's figure moves behind the curtain, and the door opens slightly.",
      "level": 1
    },
    {
      "id": "153",
      "text": "\"Did you call the shop?\"",
      "level": 1
    },
    {
      "id": "154",
      "text": "Minako, without makeup, smiles, revealing her gums.",
      "level": 1
    },
    {
      "id": "155",
      "text": "A thin futon is spread on the floor, with an ashtray, teacups, and old magazines scattered near the pillow.",
      "level": 1
    },
    {
      "id": "156",
      "text": "\"I heard you drank too much last night?\"",
      "level": 1
    },
    {
      "id": "157",
      "text": "The narrator says this, sitting at the usual low, lacquered table.",
      "level": 1
    },
    {
      "id": "158",
      "text": "Minako takes two teacups from a small shelf and places them on the table.",
      "level": 1
    },
    {
      "id": "159",
      "text": "\"Yes. Three regular customers came, and I mixed various drinks. I was completely drunk. Sumiko called a car to take me home.\"",
      "level": 1
    },
    {
      "id": "160",
      "text": "Indeed, her eyelids are slightly puffy beneath her faint eyebrows.",
      "level": 1
    },
    {
      "id": "161",
      "text": "Her dark complexion is a sallow gray, lacking its usual vibrancy.",
      "level": 1
    },
    {
      "id": "162",
      "text": "He thinks to himself that perhaps Sumiko wasn't the only one who took her home, but he lets it go.",
      "level": 1
    },
    {
      "id": "163",
      "text": "He doesn't pursue the topic further.",
      "level": 1
    },
    {
      "id": "164",
      "text": "\"Two thousand yen isn't easy to come by, here, take this for now.\"",
      "level": 1
    },
    {
      "id": "165",
      "text": "He hands her five one-thousand-yen bills.",
      "level": 1
    },
    {
      "id": "166",
      "text": "\"I'm so sorry to trouble you.\"",
      "level": 1
    },
    {
      "id": "167",
      "text": "Minako, with an expression of thanks and acceptance, tucks the money into her pocket.",
      "level": 1
    },
    {
      "id": "168",
      "text": "They then engage in small talk: her thirteen-year-old son in the countryside with a lung ailment, her aging father unable to work.",
      "level": 1
    },
    {
      "id": "169",
      "text": "He has heard these stories many times and responds vaguely while yawning.",
      "level": 1
    },
    {
      "id": "170",
      "text": "\"Oh, are you tired?\"",
      "level": 1
    },
    {
      "id": "171",
      "text": "\"Mm, I worked until eight this morning and just went to sleep.\"",
      "level": 1
    },
    {
      "id": "172",
      "text": "\"I see. Then, lie down for a while.\"",
      "level": 1
    },
    {
      "id": "173",
      "text": "Minako rearranges the futon and goes to the glass door, locking it from the inside.",
      "level": 1
    },
    {
      "id": "174",
      "text": "She then retrieves a freshly starched yukata for him from the closet.",
      "level": 1
    },
    {
      "id": "175",
      "text": "Minako also changes into a towel-cloth nightgown and lies down, switching off the light.",
      "level": 1
    },
    {
      "id": "176",
      "text": "The room is bathed in the blue light of a small lamp.",
      "level": 1
    },
    {
      "id": "177",
      "text": "With Minako's plump body lying beside him, he feels a sense of suffocation and weakness.",
      "level": 1
    },
    {
      "id": "178",
      "text": "He pictures the two wet white shirts hanging under the eaves.",
      "level": 1
    },
    {
      "id": "179",
      "text": "He opens his eyes, and the room is as bright as before.",
      "level": 1
    },
    {
      "id": "180",
      "text": "Minako has changed into a yukata and is applying makeup in front of the mirror.",
      "level": 1
    },
    {
      "id": "181",
      "text": "\"You slept soundly, you were even snoring,\" Minako says, powdering her face.",
      "level": 1
    },
    {
      "id": "182",
      "text": "Her curly hair is thinner, and her face looks larger.",
      "level": 1
    },
    {
      "id": "183",
      "text": "He stares at her as if discovering this for the first time.",
      "level": 1
    },
    {
      "id": "184",
      "text": "\"You've been working very hard lately, haven't you?\"",
      "level": 1
    },
    {
      "id": "185",
      "text": "Minako's large mouth cracks into a faint smile.",
      "level": 1
    },
    {
      "id": "186",
      "text": "\"What time is it now?\"",
      "level": 1
    },
    {
      "id": "187",
      "text": "\"Eight thirty. Are you up? Are you leaving?\"",
      "level": 1
    },
    {
      "id": "188",
      "text": "\"Mm.\"",
      "level": 1
    },
    {
      "id": "189",
      "text": "\"So busy?\"",
      "level": 1
    },
    {
      "id": "190",
      "text": "He neither confirms he has plans nor denies it, but gets up and leaves.",
      "level": 1
    },
    {
      "id": "191",
      "text": "He feels no attachment, like dry paper.",
      "level": 1
    },
    {
      "id": "192",
      "text": "Deep down, he feels restless, perhaps due to the cramped room, a lazy, humid air fills his nostrils.",
      "level": 1
    },
    {
      "id": "193",
      "text": "Minako doesn't try to detain him.",
      "level": 1
    },
    {
      "id": "194",
      "text": "She bends down to place his clogs for him and opens the door.",
      "level": 1
    },
    {
      "id": "195",
      "text": "\"When will you come again?\"",
      "level": 1
    },
    {
      "id": "196",
      "text": "She asks softly, leaning against the latticed door.",
      "level": 1
    },
    {
      "id": "197",
      "text": "\"Oh, in about two weeks.\"",
      "level": 1
    },
    {
      "id": "198",
      "text": "He says this, but thinks to himself that he will soon break up with this woman.",
      "level": 1
    },
    {
      "id": "199",
      "text": "Minako's flabby face shows a smile, but she likely shares the same sentiment.",
      "level": 1
    },
    {
      "id": "200",
      "text": "He suppresses the sound of his clogs and leaves the apartment's back door.",
      "level": 1
    },
    {
      "id": "201",
      "text": "In the narrow sky between the black rooftops, a few stars are visible.",
      "level": 1
    },
    {
      "id": "202",
      "text": "Three men stand in the back street, all looking at him.",
      "level": 1
    },
    {
      "id": "203",
      "text": "He feels their gaze following him until he reaches the main road, drawn by the sound of his clogs.",
      "level": 1
    },
    {
      "id": "204",
      "text": "He wonders what they might be thinking about a thin, gray-haired man in his fifties emerging from an apartment after visiting a woman.",
      "level": 1
    },
    {
      "id": "205",
      "text": "A cool breeze greets him on the main road, blowing straight into his heart.",
      "level": 1
    },
    {
      "id": "206",
      "text": "The stars in the sky are becoming more numerous.",
      "level": 1
    },
    {
      "id": "207",
      "text": "The feeling of emptiness he had just experienced begins to fade.",
      "level": 1
    },
    {
      "id": "208",
      "text": "What had become loose seems to be solidifying under the cool breeze.",
      "level": 1
    },
    {
      "id": "209",
      "text": "One side of the road is lined with low houses, the other with stone cliffs.",
      "level": 1
    },
    {
      "id": "210",
      "text": "Higher up, well-lit mansions are situated side by side.",
      "level": 1
    },
    {
      "id": "211",
      "text": "Few people walk on this road.",
      "level": 1
    },
    {
      "id": "212",
      "text": "He walks, thinking that breaking up with Minako is for the best.",
      "level": 1
    },
    {
      "id": "213",
      "text": "He emerges from the lonely road onto a bustling main street.",
      "level": 1
    },
    {
      "id": "214",
      "text": "Shops are still open, and the people inside are still and silent.",
      "level": 1
    },
    {
      "id": "215",
      "text": "He walks, stepping on the shadows cast by the streetlights.",
      "level": 1
    },
    {
      "id": "216",
      "text": "Everyone seems to be living better than him, yet everyone looks as melancholic as he feels.",
      "level": 1
    },
    {
      "id": "217",
      "text": "Walking on this street, he feels as if he's on a familiar road, perhaps in Seoul, Korea, or some street in the Sanyo region.",
      "level": 1
    },
    {
      "id": "218",
      "text": "Suddenly, he spots a fairly large used bookstore on the right side of the street.",
      "level": 1
    },
    {
      "id": "219",
      "text": "Near the entrance, piles of used books, like \"Collected Works,\" resemble small mountains.",
      "level": 1
    },
    {
      "id": "220",
      "text": "Through the wide bookshelves, one can see all the way to the back.",
      "level": 1
    },
    {
      "id": "221",
      "text": "He saunters into the bookstore.",
      "level": 1
    },
    {
      "id": "222",
      "text": "He hasn't visited a used bookstore in a long time.",
      "level": 1
    },
    {
      "id": "223",
      "text": "His target is clear: the shelves containing art books.",
      "level": 1
    },
    {
      "id": "224",
      "text": "In any bookstore, these books are usually placed in the back, near the counter.",
      "level": 1
    },
    {
      "id": "225",
      "text": "As soon as he stops, the proprietress sitting nearby scrutinizes him with wide eyes.",
      "level": 1
    },
    {
      "id": "226",
      "text": "This store has a considerable collection of art books, but nothing particularly exceptional.",
      "level": 1
    },
    {
      "id": "227",
      "text": "However, when faced with these books, his mood shifts.",
      "level": 1
    },
    {
      "id": "228",
      "text": "This can be considered his nature, the habit of a scholar.",
      "level": 1
    },
    {
      "id": "229",
      "text": "Most of the books are inexpensive.",
      "level": 1
    },
    {
      "id": "230",
      "text": "However, there are five works by Hon'ura Jōji, whose owner sold them.",
      "level": 1
    },
    {
      "id": "231",
      "text": "The titles on the spines are faded but in the same font: \"Discussions on Ancient Art,\" \"Overview of Southern Song Painting,\" \"Hon'ura Tansui-an's Art Treatises,\" \"Research on Japanese Ancient Paintings,\" \"Essays on Art.\"",
      "level": 1
    },
    {
      "id": "232",
      "text": "If there were only one or two, he might have dismissed them as usual without a second glance.",
      "level": 1
    },
    {
      "id": "233",
      "text": "But the fact that five of Hon'ura Jōji's works were arranged together immediately caught his attention.",
      "level": 1
    },
    {
      "id": "234",
      "text": "Whose collection was it, and why was it sold to a used bookstore are not his concerns.",
      "level": 1
    },
    {
      "id": "235",
      "text": "The fact that Hon'ura Jōji's achievements are left to gather dust in a used bookstore, subjected to the cold glances of customers, is what truly interests him.",
      "level": 1
    },
    {
      "id": "236",
      "text": "He pulls out \"Discussions on Ancient Art\" from one of the books and holds it heavily, flipping through the pages.",
      "level": 1
    },
    {
      "id": "237",
      "text": "There is almost no trace of it having been read.",
      "level": 1
    },
    {
      "id": "238",
      "text": "Although the original collector may not have read it, he seems to have memorized the content of every page.",
      "level": 1
    },
    {
      "id": "239",
      "text": "Within each line of type, the figure of a short old man seems to appear: small eyes emitting a cold light, and beneath a beautiful white beard, a perpetually sarcastic smile.",
      "level": 1
    },
    {
      "id": "240",
      "text": "On the inside of the last page is an author's introduction:",
      "level": 1
    },
    {
      "id": "241",
      "text": "\"Born in Meiji 11, graduated from Imperial University. Specialized in Oriental art. Doctor of Literature, Professor at Tokyo Imperial University. Professor at Tokyo School of Fine Arts, authority on Japanese art history. Member of the Imperial Academy, committee member of the Association for the Preservation of Ancient Shrines and Temples, and the Association for the Preservation of National Treasures. Author of 'Overview of Southern Song Painting' and many other works on Japanese art history. Alias: Tansui-an. Has written numerous essays.\"",
      "level": 1
    },
    {
      "id": "242",
      "text": "This single page, with about a hundred words, is filled with the brilliant career of Tansui-an Hon'ura Jōji.",
      "level": 1
    },
    {
      "id": "243",
      "text": "However, this book was published during his lifetime, so it omits one fact: \"Died in Showa 18 ②.\"",
      "level": 1
    },
    {
      "id": "244",
      "text": "It should also include: \"The Supreme Ruler of the Japanese Art World spanning Taisho and Showa eras.\"",
      "level": 1
    },
    {
      "id": "245",
      "text": "Furthermore, at least in his eyes, it must add: \"The person who kept Taketa Isaku ① locked out of the art world.\"",
      "level": 1
    },
    {
      "id": "246",
      "text": "His life, one might say, was buried by this man.",
      "level": 1
    },
    {
      "id": "247",
      "text": "Messy hair, a wrinkled single layer kimono, a pair of clogs – the reason he is in such a sorry state is due to the author of this book, Doctor of Literature Hon'ura Jōji.",
      "level": 1
    },
    {
      "id": "248",
      "text": "If he had not incurred Professor Hon'ura Jōji's displeasure, he would likely be lecturing at a university somewhere, and have written many books.",
      "level": 1
    },
    {
      "id": "249",
      "text": "If he had gained Professor Hon'ura's favor, he might have already replaced Iwano Yūshi and become a head professor at Tokyo Imperial University or the School of Fine Arts, becoming an authority in the art world.",
      "level": 1
    },
    {
      "id": "250",
      "text": "Iwane and he were classmates in the art department of Tokyo Imperial University.",
      "level": 1
    },
    {
      "id": "251",
      "text": "He doesn't brag when he says he doesn't know how much higher his academic performance was than Iwane's.",
      "level": 1
    },
    {
      "id": "252",
      "text": "Even Professor Hon'ura himself admitted this.",
      "level": 1
    },
    {
      "id": "253",
      "text": "At that time, he was still a student, but he was already in love with a woman and living with her.",
      "level": 1
    },
    {
      "id": "254",
      "text": "Professor Hon'ura was very displeased about this.",
      "level": 1
    },
    {
      "id": "255",
      "text": "\"This kind of degenerate fellow is hopeless.\"",
      "level": 1
    },
    {
      "id": "256",
      "text": "It is said that Professor Hon'ura spoke these words to others.",
      "level": 1
    },
    {
      "id": "257",
      "text": "From then on, he distanced himself from him.",
      "level": 1
    },
    {
      "id": "258",
      "text": "But can this truly be considered such an immoral act that it could be a reason for his distancing?",
      "level": 1
    },
    {
      "id": "259",
      "text": "He genuinely loved the woman and intended to marry her.",
      "level": 1
    },
    {
      "id": "260",
      "text": "The professor himself was the immoral one; he took a geisha from Akasaka as a concubine.",
      "level": 1
    },
    {
      "id": "261",
      "text": "Upon graduating from university, he hoped to remain as an assistant at Tokyo University and continue his research in art history as an apprentice.",
      "level": 1
    },
    {
      "id": "262",
      "text": "However, he was not accepted.",
      "level": 1
    },
    {
      "id": "263",
      "text": "But Iwane Kotsushi was retained immediately.",
      "level": 1
    },
    {
      "id": "264",
      "text": "Kyoto Imperial University, Tohoku Imperial University, Kyushu Imperial University – all rejected him.",
      "level": 1
    },
    {
      "id": "265",
      "text": "With no other options, he volunteered to be a probationary inspector at a museum, or even just an employee if necessary.",
      "level": 1
    },
    {
      "id": "266",
      "text": "However, neither Tokyo nor Nara would accept him; he was shut out of all government-affiliated institutions.",
      "level": 1
    },
    {
      "id": "267",
      "text": "Hon'ura Jōji's sphere of influence extended beyond the Ministry of Education and the Ministry of the Imperial Household, encompassing almost all national institutions.",
      "level": 1
    },
    {
      "id": "268",
      "text": "Not only in government-run systems, but even in private universities, he had planted his disciples and followers.",
      "level": 1
    },
    {
      "id": "269",
      "text": "If one incurred the hatred of Hon'ura Jōji, there was absolutely no prospect of success in academia; he experienced this iron law as soon as he left school.",
      "level": 1
    },
    {
      "id": "270",
      "text": "Why did Hon'ura Jōji wield such great power? This is not difficult to explain.",
      "level": 1
    },
    {
      "id": "271",
      "text": "Most collectors of ancient art were feudal lords and aristocrats who inherited their collections, and these aristocrats often held political power.",
      "level": 1
    },
    {
      "id": "272",
      "text": "Additionally, there were financial magnates and professional politicians.",
      "level": 1
    },
    {
      "id": "273",
      "text": "These influential figures considered the authority on ancient art, committee member of the National Treasures Preservation Committee, Hon'ura Jōji, a great treasure.",
      "level": 1
    },
    {
      "id": "274",
      "text": "And Hon'ura Jōji fully utilized this opportunity, resulting in his current position, which is only natural.",
      "level": 1
    },
    {
      "id": "275",
      "text": "He was the supreme ruler of art administration, and even within the Ministry of Education, those who opposed him had no room to maneuver.",
      "level": 1
    },
    {
      "id": "276",
      "text": "The appointment and dismissal of art professors, assistant professors, and lecturers at various schools could not be realized without his consent.",
      "level": 1
    },
    {
      "id": "277",
      "text": "To put it slightly hyperbolically, he was equivalent to the Minister of Education in this regard.",
      "level": 1
    },
    {
      "id": "278",
      "text": "Why did this Hon'ura Jōji reject a minor young scholar like him?",
      "level": 1
    },
    {
      "id": "279",
      "text": "Needless to say, the so-called cohabitation with a woman was merely an excuse.",
      "level": 1
    },
    {
      "id": "280",
      "text": "In fact, he had approached Professor Tsuyama Kōzō, whom Hon'ura disliked, thus touching his sore spot.",
      "level": 1
    },
    {
      "id": "281",
      "text": "It was precisely for this reason that he had to wander in Korea, and after returning to Japan, he could only move between towns in the countryside, leading him to be a consultant for antique dealers and edit supplementary promotional materials for \"Collected Works on Art\" for second-rate publishers, create explanations for exhibition items, or write essays to make a living, even though he is over fifty.",
      "level": 1
    },
    {
      "id": "282",
      "text": "The fundamental reason for his life being reduced to such a pathetic state is this Hon'ura Jōji.",
      "level": 1
    },
    {
      "id": "283",
      "text": "He puts the book back on the shelf and shuffles out of the used bookstore, clogs slapping.",
      "level": 1
    },
    {
      "id": "284",
      "text": "Seeing Hon'ura Jōji's five works, he feels an excitement he hasn't experienced in a long time.",
      "level": 1
    },
    {
      "id": "285",
      "text": "He doesn't even bother with the train and walks back along the road.",
      "level": 1
    },
    {
      "id": "286",
      "text": "A thin old man shuffles along the road, appearing as if drunk, and pedestrians seem to avoid him as they pass.",
      "level": 1
    },
    {
      "id": "287",
      "text": "As he walks, he thinks that although his misfortune began with approaching Mr. Tsuyama Kōzō, he has no regrets about gaining Mr. Tsuyama's favor.",
      "level": 1
    },
    {
      "id": "288",
      "text": "He learned valuable knowledge from Mr. Tsuyama that cannot be learned from any book.",
      "level": 1
    },
    {
      "id": "289",
      "text": "In fact, Mr. Tsuyama himself never wrote a book; scholars with such a lack of published works are very rare.",
      "level": 1
    },
    {
      "id": "290",
      "text": "Mr. Tsuyama was a scholar who emphasized empirical evidence.",
      "level": 1
    },
    {
      "id": "291",
      "text": "As a national treasure inspector, he traveled to almost all the ancient shrines, temples, and old aristocratic families nationwide for the Ministry of Education's ancient shrine and temple preservation projects.",
      "level": 1
    },
    {
      "id": "292",
      "text": "There is no scholar with deeper experience in appraising ancient artifacts than him.",
      "level": 1
    },
    {
      "id": "293",
      "text": "His extensive knowledge in this field was entirely the product of a life of hardship, living off of packed lunches and straw sandals.",
      "level": 1
    },
    {
      "id": "294",
      "text": "Moreover, Mr. Tsuyama avoided all authority and special interests.",
      "level": 1
    },
    {
      "id": "295",
      "text": "It can be imagined that on certain occasions, the other party would first extend a hand to approach Mr. Tsuyama.",
      "level": 1
    },
    {
      "id": "296",
      "text": "Especially, many nobles who enjoyed art found Dr. Hon'ura's tendency to attach himself to power distasteful.",
      "level": 1
    },
    {
      "id": "297",
      "text": "For example, Marquis Matsudaira Keimei and Count Kida Narisada, who were considered new aristocrats.",
      "level": 1
    },
    {
      "id": "298",
      "text": "However, Mr. Tsuyama only thanked them for their goodwill and did not seek to associate with them.",
      "level": 1
    },
    {
      "id": "299",
      "text": "This might have been out of consideration for Dr. Hon'ura.",
      "level": 1
    },
    {
      "id": "300",
      "text": "According to popular belief, Dr. Hon'ura was jealous of Mr. Tsuyama.",
      "level": 1
    },
    {
      "id": "301",
      "text": "He must have been afraid that the goodwill shown to Mr. Tsuyama by some upper-class individuals would mean a division of his sphere of influence.",
      "level": 1
    },
    {
      "id": "302",
      "text": "No, he was unwilling to share the goodwill of customers with anyone else. This is the kind of person Dr. Hon'ura was.",
      "level": 1
    },
    {
      "id": "303",
      "text": "Mr. Tsuyama seemed to look down on Dr. Hon'ura.",
      "level": 1
    },
    {
      "id": "304",
      "text": "Not only because Dr. Hon'ura abused his power but also because his appraisal skills for ancient art were poor.",
      "level": 1
    },
    {
      "id": "305",
      "text": "It is true that Hon'ura Jōji's achievements are notable in the establishment and prosperous development of the field of Japanese art history.",
      "level": 1
    },
    {
      "id": "306",
      "text": "However, even without Hon'ura Jōji, someone would have achieved success in this area sooner or later.",
      "level": 1
    },
    {
      "id": "307",
      "text": "Arranging existing ancient art pieces and formulating a theoretical system through deduction is indeed commendable.",
      "level": 1
    },
    {
      "id": "308",
      "text": "Unfortunately, the accumulation of empirical evidence is extremely superficial.",
      "level": 1
    },
    {
      "id": "309",
      "text": "In fact, Hon'ura's writings on art history are very crude and lack a solid theoretical foundation.",
      "level": 1
    },
    {
      "id": "310",
      "text": "This deficiency arises, first and foremost, from his lack of appraisal skills, and is therefore unavoidable.",
      "level": 1
    },
    {
      "id": "311",
      "text": "The generalizations adorned with scholarly constructs may appear beautiful and dazzling for a time, but if errors are made in the selection of materials, the theories built upon them will naturally be untenable.",
      "level": 1
    },
    {
      "id": "312",
      "text": "For example, \"Research on Japanese Ancient Paintings\" is the most fundamental work forming Hon'ura's system.",
      "level": 1
    },
    {
      "id": "313",
      "text": "However, approximately half of the materials cited in this book are clearly not genuine.",
      "level": 1
    },
    {
      "id": "314",
      "text": "Dr. Hon'ura, however, without doubt, reproduced these forgeries in his work.",
      "level": 1
    },
    {
      "id": "315",
      "text": "Of course, at the time of Dr. Hon'ura, textual criticism was not as developed as it is today.",
      "level": 1
    },
    {
      "id": "316",
      "text": "Such an expert, unable to distinguish between forgeries, copies, and later reproductions.",
      "level": 1
    },
    {
      "id": "317",
      "text": "When he first began studying under Mr. Tsuyama and saw him examining one or two pieces of material from \"Research on Japanese Ancient Paintings,\" Mr. Tsuyama only showed a slight, curious smile on his cold, pale face.",
      "level": 1
    },
    {
      "id": "318",
      "text": "Later, under Mr. Tsuyama's guidance, accompanying him on investigations in Nara, Kyoto, and even San'in, after a long period of such mentor-disciple relationship, he finally heard him express disappointment for the first time, revealing the secret of \"Research on Japanese Ancient Paintings\" and other materials:",
      "level": 1
    },
    {
      "id": "319",
      "text": "\"In this book, at least two-thirds of it is unusable.\"",
      "level": 1
    },
    {
      "id": "320",
      "text": "Two-thirds? Hearing this, he was astonished.",
      "level": 1
    },
    {
      "id": "321",
      "text": "This was almost a complete negation of Dr. Hon'ura.",
      "level": 1
    },
    {
      "id": "322",
      "text": "However, he later realized that if the book were examined more strictly, far more than two-thirds would be unusable.",
      "level": 1
    },
    {
      "id": "323",
      "text": "\"No, you must never speak of this matter while Hon'ura-sensei is alive. It's a matter of academic courtesy. Besides, Hon'ura-sensei also has his own ideas.\"",
      "level": 1
    },
    {
      "id": "324",
      "text": "Mr. Tsuyama also told him this.",
      "level": 1
    },
    {
      "id": "325",
      "text": "Thinking back today, Mr. Tsuyama's words have two meanings:",
      "level": 1
    },
    {
      "id": "326",
      "text": "First, Mr. Tsuyama's adherence to \"academic courtesy.\"",
      "level": 1
    },
    {
      "id": "327",
      "text": "Mr. Tsuyama never wrote a book in his life. If he had intended to write, he would likely not have engaged with the materials that served as theoretical basis for Hon'ura's work.",
      "level": 1
    },
    {
      "id": "328",
      "text": "This would be equivalent to negating Hon'ura's work.",
      "level": 1
    },
    {
      "id": "329",
      "text": "If Mr. Tsuyama had lived longer than Dr. Hon'ura, he would certainly have published works.",
      "level": 1
    },
    {
      "id": "330",
      "text": "He couldn't write because Dr. Hon'ura was still alive, but the idea of waiting until Hon'ura's death to write was certainly not because he feared Hon'ura Jōji, the supreme ruler.",
      "level": 1
    },
    {
      "id": "331",
      "text": "It was his courtesy to Dr. Hon'ura, who had established the academic field of Japanese art history and made it flourish.",
      "level": 1
    },
    {
      "id": "332",
      "text": "Even if he didn't feel respect, he should have maintained courtesy towards a predecessor.",
      "level": 1
    },
    {
      "id": "333",
      "text": "How much Mr. Tsuyama wanted to write is unknown.",
      "level": 1
    },
    {
      "id": "334",
      "text": "However, judging from the speculation of someone like himself, perhaps he was waiting for Dr. Hon'ura's death.",
      "level": 1
    },
    {
      "id": "335",
      "text": "But Mr. Tsuyama passed away at the age of fifty.",
      "level": 1
    },
    {
      "id": "336",
      "text": "Dr. Hon'ura lived fifteen years longer, dying at sixty-seven.",
      "level": 1
    },
    {
      "id": "337",
      "text": "This is the reason why Mr. Tsuyama, who possessed such profound empirical knowledge of Japanese art history, never wrote a single book.",
      "level": 1
    },
    {
      "id": "338",
      "text": "The other point – which he discovered later – was the issue of Mr. Tsuyama's statement, \"Hon'ura also has his own ideas.\"",
      "level": 1
    },
    {
      "id": "339",
      "text": "Does this sentence imply that when Dr. Hon'ura selected materials for his own works, he had a specific intention in mind?",
      "level": 1
    },
    {
      "id": "340",
      "text": "The collectors of these materials were mostly powerful and wealthy individuals, and the nature of the works was, of course, objective.",
      "level": 1
    },
    {
      "id": "341",
      "text": "However, some consciousness might have been active in Dr. Hon'ura's mind: intentionally including questionable items could be a way to gain favor with collectors.",
      "level": 1
    },
    {
      "id": "342",
      "text": "Dr. Hon'ura's appraisal skills were poor, but it's not to say they were entirely absent.",
      "level": 1
    },
    {
      "id": "343",
      "text": "Even if Dr. Hon'ura himself felt doubt, even if the items were indeed unusable, he deliberately included them in his authoritative works.",
      "level": 1
    },
    {
      "id": "344",
      "text": "This is the secret to how Dr. Hon'ura was able to build his influence by relying on the backing of powerful families.",
      "level": 1
    },
    {
      "id": "345",
      "text": "Mr. Tsuyama saw through this.",
      "level": 1
    },
    {
      "id": "346",
      "text": "This is the true meaning of his words, \"Hon'ura's own ideas.\"",
      "level": 1
    },
    {
      "id": "347",
      "text": "No one knows Mr. Tsuyama's capabilities better than Dr. Hon'ura.",
      "level": 1
    },
    {
      "id": "348",
      "text": "At the same time, he was well aware of his own weaknesses.",
      "level": 1
    },
    {
      "id": "349",
      "text": "The doctor adopted a distant attitude towards Mr. Tsuyama.",
      "level": 1
    },
    {
      "id": "350",
      "text": "He must have felt inferior to Mr. Tsuyama.",
      "level": 1
    },
    {
      "id": "351",
      "text": "Despite his naturally arrogant demeanor, he must have feared Mr. Tsuyama deep down.",
      "level": 1
    },
    {
      "id": "352",
      "text": "This feeling turned into insidious hostility towards Mr. Tsuyama, and thus he also intensely hated Mr. Tsuyama's disciple – himself.",
      "level": 1
    },
    {
      "id": "353",
      "text": "Dr. Hon'ura said behind his back:",
      "level": 1
    },
    {
      "id": "354",
      "text": "\"Tuyama-kun's view of works is entirely that of an antique dealer; it's merely the skill of a professional.\"",
      "level": 1
    },
    {
      "id": "355",
      "text": "But when appraising a work, how can one distinguish between authenticity and falsehood solely with a scholar's clumsy eyesight?",
      "level": 1
    },
    {
      "id": "356",
      "text": "Since it's called appraisal, it must be concrete.",
      "level": 1
    },
    {
      "id": "357",
      "text": "To achieve this, one must possess rich appraisal experience and a rigorously trained eye.",
      "level": 1
    },
    {
      "id": "358",
      "text": "It's easy to speak based on intuition, but the question is, what is the basis for this intuition?",
      "level": 1
    },
    {
      "id": "359",
      "text": "This certainly cannot be conceptual learning; ultimately, empirical evidence is tangible and must rely on professional skills.",
      "level": 1
    },
    {
      "id": "360",
      "text": "Thus, he feels that Dr. Hon'ura's slander accurately exposes his own incompetence in this area.",
      "level": 1
    },
    {
      "id": "361",
      "text": "Fortunately, Mr. Tsuyama taught him all of this \"professional\" appraisal technique.",
      "level": 1
    },
    {
      "id": "362",
      "text": "This is knowledge more precious than anything, knowledge that cannot be learned from any scholar's writings.",
      "level": 1
    },
    {
      "id": "363",
      "text": "Compared to extremely hollow academic theories, it is profoundly substantial.",
      "level": 1
    },
    {
      "id": "364",
      "text": "Under Dr. Hon'ura's discrimination, he could find no place to settle, but Mr. Tsuyama found him a temporary position at the Government-General of Chosen Museum.",
      "level": 1
    },
    {
      "id": "365",
      "text": "\"I have an acquaintance at the Ministry of Colonial Affairs, and it was through him that I found this. It might not be ideal, but endure it for now. Later, when there's an opening domestically, I'll call you.\"",
      "level": 1
    },
    {
      "id": "366",
      "text": "Mr. Tsuyama says this, blinking his small eyes, with great concern.",
      "level": 1
    },
    {
      "id": "367",
      "text": "Unlike Hon'ura Jōji, Mr. Tsuyama had no connections in administrative circles.",
      "level": 1
    },
    {
      "id": "368",
      "text": "Such a man, disregarding his own weakness in this area, went to great lengths to find him a job, which shows how much he cared for him.",
      "level": 1
    },
    {
      "id": "369",
      "text": "Of course, he was also well aware that the reason he was hated by Dr. Hon'ura and could find no employment was because he was his disciple, which perhaps further stirred his sense of responsibility.",
      "level": 1
    },
    {
      "id": "370",
      "text": "To be honest, at that time, he harbored a fervent desire to go abroad.",
      "level": 1
    },
    {
      "id": "371",
      "text": "How could he complain about the job itself?",
      "level": 1
    },
    {
      "id": "372",
      "text": "He expressed his gratitude for Mr. Tsuyama's concern and accepted the recommendation without a word.",
      "level": 1
    },
    {
      "id": "373",
      "text": "The Government-General of Chosen was neither under the influence of the Ministry of the Imperial Household nor the Ministry of Education, and being abroad, Dr. Hon'ura's influence would not extend there.",
      "level": 1
    },
    {
      "id": "374",
      "text": "The job was introduced by Mr. Tsuyama, and it was not a formal position but a contracted status.",
      "level": 1
    },
    {
      "id": "375",
      "text": "Perhaps Hon'ura's influence spared him.",
      "level": 1
    },
    {
      "id": "376",
      "text": "He endured thirteen years in Korea.",
      "level": 1
    },
    {
      "id": "377",
      "text": "There was never any promotion; he remained a temporary employee indefinitely.",
      "level": 1
    },
    {
      "id": "378",
      "text": "During this period, Mr. Tsuyama passed away.",
      "level": 1
    },
    {
      "id": "379",
      "text": "He only shed tears twice in his life: once when his mother died in childhood, and the second time upon receiving the news of Mr. Tsuyama's death.",
      "level": 1
    },
    {
      "id": "380",
      "text": "He apologizes to Mr. Tsuyama, but he lived a dissolute life in Korea.",
      "level": 1
    },
    {
      "id": "381",
      "text": "Anyone seeing him today would guess he is over sixty, perhaps a result of how life in Korea physically affected him.",
      "level": 1
    },
    {
      "id": "382",
      "text": "He once had a woman he could call his wife, but they parted soon after.",
      "level": 1
    },
    {
      "id": "383",
      "text": "After that, he cohabited with various women repeatedly, but none lasted long.",
      "level": 1
    },
    {
      "id": "384",
      "text": "He was consumed by inner turmoil, anxiety, and despair, yearning for peace.",
      "level": 1
    },
    {
      "id": "385",
      "text": "However, living with any woman failed to bring him peace.",
      "level": 1
    },
    {
      "id": "386",
      "text": "Like a madman, he would inexplicably become angry and act violently at any moment, something no woman living with him could endure.",
      "level": 1
    },
    {
      "id": "387",
      "text": "After Mr. Tsuyama left this world, his illusion of returning to Japan at an appropriate time was completely shattered.",
      "level": 1
    },
    {
      "id": "388",
      "text": "Dr. Hon'ura Jōji retired from school upon reaching retirement age, but his position of supreme authority remained unchanged.",
      "level": 1
    },
    {
      "id": "389",
      "text": "His students and followers were spread throughout major universities, specialized schools, and museums, preventing outsiders from infiltrating their sphere of influence like ants.",
      "level": 1
    },
    {
      "id": "390",
      "text": "The collusion among the upper echelons intensified, and their political influence never waned.",
      "level": 1
    },
    {
      "id": "391",
      "text": "However, his inner anxiety was not solely due to his inability to return to Japan.",
      "level": 1
    },
    {
      "id": "392",
      "text": "His classmate Iwane Yūshi achieved great success, rising from assistant professor to professor, and finally inheriting Hon'ura Jōji's mantle, occupying the position of head professor in the Faculty of Literature at Imperial University, where he established a lecture series.",
      "level": 1
    },
    {
      "id": "393",
      "text": "This was a heavy blow to him.",
      "level": 1
    },
    {
      "id": "394",
      "text": "Confined to a corner of Korea, he watched with humiliation as Iwane steadily climbed to this position.",
      "level": 1
    },
    {
      "id": "395",
      "text": "Iwane Yūshi's mind was very clumsy; he knew this well from his student days and was fully confident in saying so.",
      "level": 1
    },
    {
      "id": "396",
      "text": "However, he was the disciple of a famous family. His elder brother was a minor daimyo family of some sort – now a Baron inheriting the family headship.",
      "level": 1
    },
    {
      "id": "397",
      "text": "In his youth, Iwane was indeed a handsome man, with a refined and aristocratic demeanor.",
      "level": 1
    },
    {
      "id": "398",
      "text": "This appearance was precisely what Hon'ura Jōji favored most.",
      "level": 1
    },
    {
      "id": "399",
      "text": "Iwane Yūshi himself knew his intellect was not exceptional, so he devoted himself to flattering Dr. Hon'ura, serving him like a slave.",
      "level": 1
    },
    {
      "id": "400",
      "text": "According to rumors, half of Iwane's vast landholdings were spent on this; the truth, of course, is unknown.",
      "level": 1
    },
    {
      "id": "401",
      "text": "Additionally, there were other similar rumors. Whether true or false, they likely contained some factual basis.",
      "level": 1
    },
    {
      "id": "402",
      "text": "Such dedicated service naturally earned him Dr. Hon'ura's utmost favor, leading him to decide to pass on his legacy to this beloved disciple, Iwane Yūshi.",
      "level": 1
    },
    {
      "id": "403",
      "text": "Is it possible that such things happen in the world of academia?",
      "level": 1
    },
    {
      "id": "404",
      "text": "If anyone were to be indignant about this, it would be foolish.",
      "level": 1
    },
    {
      "id": "405",
      "text": "The so-called scholasticism is precisely this kind of thing; he realized this much later.",
      "level": 1
    },
    {
      "id": "406",
      "text": "However, he was young and impulsive then. Seeing someone like Iwane Yūshi occupy such a lofty position, he couldn't help but feel anger towards this unjust situation, despising and envying him with hatred.",
      "level": 1
    },
    {
      "id": "407",
      "text": "He thought to himself: Even if government-affiliated universities and museums invited me, I wouldn't go.",
      "level": 1
    },
    {
      "id": "408",
      "text": "Although he resided in Seoul, he could only drown his sorrows in drink, wandering through the impoverished alleys of Korea for countless nights.",
      "level": 1
    },
    {
      "id": "409",
      "text": "Even today, he often sees those rows of impoverished, dim houses in his dreams.",
      "level": 1
    },
    {
      "id": "410",
      "text": "In Tap-gol Park, he even slept on the ground all night.",
      "level": 1
    },
    {
      "id": "411",
      "text": "But in Korea, there was also another person whose inner troubles Hon'ura Jōji and Iwane Yūshi would never know.",
      "level": 1
    },
    {
      "id": "412",
      "text": "There was a distance as vast as heaven and earth between them.",
      "level": 1
    },
    {
      "id": "413",
      "text": "They had probably already forgotten the name Taketa Isaku.",
      "level": 1
    },
    {
      "id": "414",
      "text": "He later learned that this assumption was entirely wrong.",
      "level": 1
    },
    {
      "id": "415",
      "text": "It was around Showa 15 or 16 ①, with the help of someone, he finally ended his twelve years of life in Korea and returned to Japan, working as a special contracted staff member at the K Museum in H Prefecture.",
      "level": 1
    },
    {
      "id": "416",
      "text": "This was a nationally renowned private art museum, a foundation that exclusively exhibited the collection of the K conglomerate.",
      "level": 1
    },
    {
      "id": "417",
      "text": "Among the exhibits were many Japanese ancient paintings collected by Mr. K.",
      "level": 1
    },
    {
      "id": "418",
      "text": "\"This is great!\" he thought to himself.",
      "level": 1
    },
    {
      "id": "419",
      "text": "If he could stay here, he wouldn't even need to go to Tokyo.",
      "level": 1
    },
    {
      "id": "420",
      "text": "Mr. K was indeed an art enthusiast.",
      "level": 1
    },
    {
      "id": "421",
      "text": "Using his financial resources to the fullest, he collected only excellent pieces, which refreshed his eyes and his spirit.",
      "level": 1
    },
    {
      "id": "422",
      "text": "Mr. Tsuyama's education for him had never been more useful.",
      "level": 1
    },
    {
      "id": "423",
      "text": "When he faced these collected ancient paintings, he felt as if Mr. Tsuyama was silently guiding and encouraging him.",
      "level": 1
    },
    {
      "id": "424",
      "text": "He felt a surge of courage, as if the youthful drive from his student days had returned.",
      "level": 1
    },
    {
      "id": "425",
      "text": "He was ready to compete with others on these ancient paintings, and thus completely change the aimless life of the past twelve years in Korea.",
      "level": 1
    },
    {
      "id": "426",
      "text": "Oh, wait, the museum in Korea also had many precious East Asian art treasures, so it wasn't entirely aimless.",
      "level": 1
    },
    {
      "id": "427",
      "text": "However, at least to overcome the long-term spiritual exhaustion, he seriously resumed his research.",
      "level": 1
    },
    {
      "id": "428",
      "text": "Mr. Tsuyama had taught him everything concretely, not only profound knowledge but also detailed and in-depth techniques, leaving no detail overlooked, like a physician's clinical lecture, extremely precise in its validation.",
      "level": 1
    },
    {
      "id": "429",
      "text": "This was the professional technique that Dr. Hon'ura despised.",
      "level": 1
    },
    {
      "id": "430",
      "text": "If he was right, then the value of this professional technique was several times greater than any of Hon'ura Tansui-an's abstract essay collections.",
      "level": 1
    },
    {
      "id": "431",
      "text": "Perhaps due to his efforts, the K Museum attracted the attention of many connoisseurs.",
      "level": 1
    },
    {
      "id": "432",
      "text": "However, after two years, he was suddenly fired.",
      "level": 1
    },
    {
      "id": "433",
      "text": "\"It was temporary in nature, so we can terminate the contract at any time.\"",
      "level": 1
    },
    {
      "id": "434",
      "text": "He understood, and there was nothing he could do.",
      "level": 1
    },
    {
      "id": "435",
      "text": "The directors did not provide a reason when announcing his dismissal.",
      "level": 1
    },
    {
      "id": "436",
      "text": "However, someone later quietly informed him that it was because a director had visited Tokyo to meet with Dr. Hon'ura, and Iwane Yūshi was also present.",
      "level": 1
    },
    {
      "id": "437",
      "text": "The two of them said in unison:",
      "level": 1
    },
    {
      "id": "438",
      "text": "\"In your museum, there is said to be a peculiar individual.\"",
      "level": 1
    },
    {
      "id": "439",
      "text": "The director returned and discussed it with Director K, and the decision was made to expel him.",
      "level": 1
    },
    {
      "id": "440",
      "text": "It seems that the K Museum at that time also considered that defying the will of Hon'ura Jōji and Iwane Yūshi would lead to trouble.",
      "level": 1
    },
    {
      "id": "441",
      "text": "Whether it was Hon'ura Jōji or Iwane Yūshi, they still firmly remembered the name Taketa Isaku.",
      "level": 1
    },
    {
      "id": "442",
      "text": "A year after that, Tokyo University Honorary Professor Hon'ura Jōji died.",
      "level": 1
    },
    {
      "id": "443",
      "text": "There were an innumerable number of distinguished scholars attending his funeral, and the newspapers reported it.",
      "level": 1
    },
    {
      "id": "444",
      "text": "At that time, he secretly rejoiced in his heart at his death.",
      "level": 1
    },
    {
      "id": "445",
      "text": "He returned home, and it was already half-past nine.",
      "level": 1
    },
    {
      "id": "446",
      "text": "The main gate was closed, and quiet conversation could still be heard from inside the house.",
      "level": 1
    },
    {
      "id": "447",
      "text": "He hung up his clothes by the back door and felt his way to the dark second floor.",
      "level": 1
    },
    {
      "id": "448",
      "text": "The futon, the scattered manuscript papers on the desk, everything was as it was when he left.",
      "level": 1
    },
    {
      "id": "449",
      "text": "The clothes hanging under the eaves were heavy with rainwater, dangling from the bamboo pole.",
      "level": 1
    },
    {
      "id": "450",
      "text": "The box of sea urchin paste that Kadosura left was still in its original place.",
      "level": 1
    },
    {
      "id": "451",
      "text": "Seeing this gift made him recall the fake Takeda painting Kadosura had shown him.",
      "level": 1
    },
    {
      "id": "452",
      "text": "It was indeed painted very well.",
      "level": 1
    },
    {
      "id": "453",
      "text": "Kadosura might have thought it was genuine, and it's not his fault; the artist who painted this forgery was truly remarkable.",
      "level": 1
    },
    {
      "id": "454",
      "text": "\"If it were Iwano or Kaneshi, they might have actually been fooled.\"",
      "level": 1
    },
    {
      "id": "455",
      "text": "He remembered saying that to Kadosura.",
      "level": 1
    },
    {
      "id": "456",
      "text": "That is indeed true.",
      "level": 1
    },
    {
      "id": "457",
      "text": "Iwane Yūshi, who inherited Hon'ura Jōji's legacy, in his \"General Overview of Japanese Art,\" expounded theories identical to his master's, with the same structure and method of explanation.",
      "level": 1
    },
    {
      "id": "458",
      "text": "This is not inheritance, but simply a mediocre repetition of Hon'ura's work; there is no trace of originality, no development, and in fact, it could be considered a regression.",
      "level": 1
    },
    {
      "id": "459",
      "text": "Hon'ura at least had some sharp insights, while Iwane possesses nothing but regression and dullness.",
      "level": 1
    },
    {
      "id": "460",
      "text": "His lack of discernment is even below that of his master, Professor Hon'ura.",
      "level": 1
    },
    {
      "id": "461",
      "text": "Iwane imitated his master and also researched Southern Song painting, publishing works such as \"Research on Literati Painting\" and \"Research on the Southern Song.\"",
      "level": 1
    },
    {
      "id": "462",
      "text": "In reality, these were merely expansions of Hon'ura's writings.",
      "level": 1
    },
    {
      "id": "463",
      "text": "Just adding water.",
      "level": 1
    },
    {
      "id": "464",
      "text": "First, the illustrations he used were almost entirely unusable.",
      "level": 1
    },
    {
      "id": "465",
      "text": "His eyesight is worse than Hon'ura's.",
      "level": 1
    },
    {
      "id": "466",
      "text": "These works perfectly expose his ignorance, making them incredibly comical to read.",
      "level": 1
    },
    {
      "id": "467",
      "text": "However, because the public is unaware of this situation, when Iwane Yūshi is mentioned, he is still considered an authority in Southern painting research ①.",
      "level": 1
    },
    {
      "id": "468",
      "text": "No wonder he lectures on art history at Tokyo University and the University of the Arts.",
      "level": 1
    },
    {
      "id": "469",
      "text": "Although not reaching Hon'ura Jōji's level, he is still a significant supreme ruler, and has published many works.",
      "level": 1
    },
    {
      "id": "470",
      "text": "This has led to his overestimation, but it is unavoidable; the title of authority was derived from his street reputation.",
      "level": 1
    },
    {
      "id": "471",
      "text": "He is very interested in how Iwane Yūshi appraises works.",
      "level": 1
    },
    {
      "id": "472",
      "text": "He inquired through others and later learned how it works.",
      "level": 1
    },
    {
      "id": "473",
      "text": "When presented with a painting for appraisal, he reportedly stares at it silently, occasionally emitting sounds like \"Hmm... Hmm...\" from his mouth.",
      "level": 1
    },
    {
      "id": "474",
      "text": "He continues to gaze silently for thirty to forty minutes, not saying a word, just humming \"Hmm... Hmm...\"",
      "level": 1
    },
    {
      "id": "475",
      "text": "At this point, if his disciples Kaneshi or Tomita say something like:",
      "level": 1
    },
    {
      "id": "476",
      "text": "\"Sir, this is probably not good, is it?\"",
      "level": 1
    },
    {
      "id": "477",
      "text": "Then he makes his judgment: \"Yes, it's not good.\"",
      "level": 1
    },
    {
      "id": "478",
      "text": "If a disciple says:",
      "level": 1
    },
    {
      "id": "479",
      "text": "\"Sir, isn't this very good?\"",
      "level": 1
    },
    {
      "id": "480",
      "text": "Then he follows up with: \"It's very good.\"",
      "level": 1
    },
    {
      "id": "481",
      "text": "Thus, without hearing suggestions from others, he makes no pronouncements, and may even gaze silently for an hour.",
      "level": 1
    },
    {
      "id": "482",
      "text": "At first, he didn't believe it, but reportedly it is indeed true, and upon hearing this, he couldn't help but burst out laughing.",
      "level": 1
    }
  ],
  "concepts": [
    {
      "name": "Rain",
      "frequency": 3,
      "context": "The story begins with the narrator waking up to the sound of rain, and rain is mentioned as a constant presence affecting the environment and the narrator's mood."
    },
    {
      "name": "Wetness/Dampness",
      "frequency": 3,
      "context": "The narrator's bedding and clothes are described as wet from the rain, emphasizing his discomfort and the bleak atmosphere."
    },
    {
      "name": "Time",
      "frequency": 4,
      "context": "Specific times (three o'clock, four o'clock, eight o'clock, eight thirty) are mentioned, often highlighting the narrator's disorientation or the progression of events."
    },
    {
      "name": "Work/Writing",
      "frequency": 3,
      "context": "The narrator writes an art review to earn rent, and his current financial struggles are linked to his income from writing."
    },
    {
      "name": "Money/Rent",
      "frequency": 3,
      "context": "The narrator needs to earn money for rent and is concerned about his limited funds after lending money to Minako."
    },
    {
      "name": "Fatigue/Weakness",
      "frequency": 3,
      "context": "The narrator feels physically drained, tires easily, and experiences a sense of weakness, contributing to his reflections on aging and his relationships."
    },
    {
      "name": "Bath/Bathing",
      "frequency": 2,
      "context": "The narrator takes a bath to clear his head, and the experience in the dimly lit bathhouse is described."
    },
    {
      "name": "Reflection/Mirror",
      "frequency": 2,
      "context": "The narrator shaves and looks at his reflection, leading to self-examination about his appearance and aging."
    },
    {
      "name": "Minako",
      "frequency": 8,
      "context": "Minako is a woman the narrator has a complicated relationship with, involving financial support and a potential breakup."
    },
    {
      "name": "Kadosura Kōzō / Gakudō",
      "frequency": 13,
      "context": "An antique appraiser who visits the narrator, bringing a potential fake painting and acting as a foil for the narrator's own profession."
    },
    {
      "name": "Art/Painting",
      "frequency": 6,
      "context": "The story revolves around art appreciation, appraisal, and the art world, with specific mentions of Takeda, Taiga, and Tessai."
    },
    {
      "name": "Appraisal/Authenticity",
      "frequency": 6,
      "context": "The core of the interaction with Kadosura and the narrator's profession involves appraising art and discerning genuine pieces from fakes."
    },
    {
      "name": "Forgery/Fake",
      "frequency": 5,
      "context": "The painting Kadosura presents is a forgery, and the discussion of art often touches upon the prevalence and skill of forgers."
    },
    {
      "name": "Hon'ura Jōji",
      "frequency": 13,
      "context": "A deceased, influential figure in Japanese art history whose legacy and perceived misjudgments significantly impacted the narrator's life and career."
    },
    {
      "name": "Taketa Isaku (Narrator)",
      "frequency": 8,
      "context": "The first-person narrator, an art historian and appraiser, whose life has been shaped by his academic failures and struggles."
    },
    {
      "name": "Tsuyama Kōzō",
      "frequency": 11,
      "context": "A respected scholar and mentor to the narrator, who emphasized empirical knowledge and physical experience in art appraisal."
    },
    {
      "name": "Iwane Yūshi",
      "frequency": 10,
      "context": "A former classmate of the narrator who achieved academic success and inherited the influence of Hon'ura Jōji, representing what the narrator feels he was denied."
    },
    {
      "name": "Academic/Scholarship",
      "frequency": 9,
      "context": "The narrative delves into the world of academia, including university positions, professorships, and the methods and politics involved."
    },
    {
      "name": "Influence/Power",
      "frequency": 6,
      "context": "The text highlights the power dynamics within the art world, particularly the influence of figures like Hon'ura Jōji and the political connections involved."
    },
    {
      "name": "Career/Profession",
      "frequency": 7,
      "context": "The narrator's struggles in establishing and maintaining his career as an art historian and appraiser are a central theme."
    },
    {
      "name": "Discrimination/Rejection",
      "frequency": 4,
      "context": "The narrator recounts numerous instances of being rejected from academic and museum positions, attributing it to Hon'ura Jōji's influence."
    },
    {
      "name": "Experience/Observation",
      "frequency": 4,
      "context": "The narrative contrasts theoretical scholarship with practical, empirical experience in art appraisal, favoring the latter."
    },
    {
      "name": "Memory/Past",
      "frequency": 3,
      "context": "The narrator frequently reflects on past events, relationships, and academic slights that have shaped his present circumstances."
    },
    {
      "name": "Relationship (Romantic/Complicated)",
      "frequency": 3,
      "context": "The narrator's relationships, particularly with Minako and his past romantic involvement that affected his career, are explored."
    },
    {
      "name": "Disappointment/Frustration",
      "frequency": 3,
      "context": "The narrator expresses consistent feelings of disappointment and frustration regarding his career and life choices."
    },
    {
      "name": "Art World Politics",
      "frequency": 4,
      "context": "The story exposes the behind-the-scenes machinations, rivalries, and power plays within the Japanese art establishment."
    },
    {
      "name": "Humiliation/Degradation",
      "frequency": 3,
      "context": "The narrator describes feeling humiliated by his current circumstances and past rejections."
    },
    {
      "name": "Seoul, Korea",
      "frequency": 2,
      "context": "Mentioned as a place the narrator might have walked through before, suggesting a past experience or connection to the region."
    },
    {
      "name": "Used Bookstore",
      "frequency": 3,
      "context": "The setting where the narrator finds Hon'ura Jōji's books, triggering a significant internal monologue."
    },
    {
      "name": "Scholarship vs. Practical Skill",
      "frequency": 4,
      "context": "A recurring theme contrasting theoretical academic knowledge with the practical, hands-on skills of appraisal and connoisseurship."
    }
  ],
  "relations": [
    {
      "source": "Rain",
      "target": "Wetness/Dampness",
      "type": "causes"
    },
    {
      "source": "Rain",
      "target": "Fatigue/Weakness",
      "type": "contributes_to_mood"
    },
    {
      "source": "Work/Writing",
      "target": "Money/Rent",
      "type": "source_of"
    },
    {
      "source": "Money/Rent",
      "target": "Minako",
      "type": "concern_for"
    },
    {
      "source": "Fatigue/Weakness",
      "target": "Reflection/Mirror",
      "type": "leads_to_observation"
    },
    {
      "source": "Fatigue/Weakness",
      "target": "Relationship (Romantic/Complicated)",
      "type": "impacts"
    },
    {
      "source": "Bath/Bathing",
      "target": "Time",
      "type": "occurs_at"
    },
    {
      "source": "Reflection/Mirror",
      "target": "Fatigue/Weakness",
      "type": "reveals"
    },
    {
      "source": "Minako",
      "target": "Money/Rent",
      "type": "receives_from"
    },
    {
      "source": "Minako",
      "target": "Relationship (Romantic/Complicated)",
      "type": "is_part_of"
    },
    {
      "source": "Kadosura Kōzō / Gakudō",
      "target": "Art/Painting",
      "type": "deals_in"
    },
    {
      "source": "Kadosura Kōzō / Gakudō",
      "target": "Appraisal/Authenticity",
      "type": "performs"
    },
    {
      "source": "Kadosura Kōzō / Gakudō",
      "target": "Forgery/Fake",
      "type": "presents"
    },
    {
      "source": "Kadosura Kōzō / Gakudō",
      "target": "Taketa Isaku (Narrator)",
      "type": "seeks_opinion_from"
    },
    {
      "source": "Art/Painting",
      "target": "Appraisal/Authenticity",
      "type": "subject_of"
    },
    {
      "source": "Art/Painting",
      "target": "Forgery/Fake",
      "type": "can_be"
    },
    {
      "source": "Appraisal/Authenticity",
      "target": "Scholarship vs. Practical Skill",
      "type": "requires"
    },
    {
      "source": "Hon'ura Jōji",
      "target": "Academic/Scholarship",
      "type": "dominated"
    },
    {
      "source": "Hon'ura Jōji",
      "target": "Influence/Power",
      "type": "possessed"
    },
    {
      "source": "Hon'ura Jōji",
      "target": "Career/Profession",
      "type": "hindered"
    },
    {
      "source": "Hon'ura Jōji",
      "target": "Discrimination/Rejection",
      "type": "caused"
    },
    {
      "source": "Hon'ura Jōji",
      "target": "Art World Politics",
      "type": "participated_in"
    },
    {
      "source": "Hon'ura Jōji",
      "target": "Humiliation/Degradation",
      "type": "inflicted_upon"
    },
    {
      "source": "Taketa Isaku (Narrator)",
      "target": "Career/Profession",
      "type": "struggles_in"
    },
    {
      "source": "Taketa Isaku (Narrator)",
      "target": "Hon'ura Jōji",
      "type": "was_affected_by"
    },
    {
      "source": "Taketa Isaku (Narrator)",
      "target": "Tsuyama Kōzō",
      "type": "mentored_by"
    },
    {
      "source": "Taketa Isaku (Narrator)",
      "target": "Discrimination/Rejection",
      "type": "experienced"
    },
    {
      "source": "Taketa Isaku (Narrator)",
      "target": "Scholarship vs. Practical Skill",
      "type": "values"
    },
    {
      "source": "Tsuyama Kōzō",
      "target": "Academic/Scholarship",
      "type": "embodied"
    },
    {
      "source": "Tsuyama Kōzō",
      "target": "Experience/Observation",
      "type": "emphasized"
    },
    {
      "source": "Tsuyama Kōzō",
      "target": "Taketa Isaku (Narrator)",
      "type": "guided"
    },
    {
      "source": "Tsuyama Kōzō",
      "target": "Hon'ura Jōji",
      "type": "disliked_by"
    },
    {
      "source": "Iwane Yūshi",
      "target": "Hon'ura Jōji",
      "type": "inherited_influence_from"
    },
    {
      "source": "Iwane Yūshi",
      "target": "Taketa Isaku (Narrator)",
      "type": "contrasted_with"
    },
    {
      "source": "Iwane Yūshi",
      "target": "Academic/Scholarship",
      "type": "achieved_success_in"
    },
    {
      "source": "Academic/Scholarship",
      "target": "Art World Politics",
      "type": "influenced_by"
    },
    {
      "source": "Academic/Scholarship",
      "target": "Career/Profession",
      "type": "determines"
    },
    {
      "source": "Influence/Power",
      "target": "Art World Politics",
      "type": "is_part_of"
    },
    {
      "source": "Career/Profession",
      "target": "Discrimination/Rejection",
      "type": "affected_by"
    },
    {
      "source": "Discrimination/Rejection",
      "target": "Humiliation/Degradation",
      "type": "causes"
    },
    {
      "source": "Experience/Observation",
      "target": "Scholarship vs. Practical Skill",
      "type": "represents"
    },
    {
      "source": "Memory/Past",
      "target": "Discrimination/Rejection",
      "type": "recalls"
    },
    {
      "source": "Relationship (Romantic/Complicated)",
      "target": "Career/Profession",
      "type": "impacted"
    },
    {
      "source": "Disappointment/Frustration",
      "target": "Career/Profession",
      "type": "results_from"
    },
    {
      "source": "Art World Politics",
      "target": "Career/Profession",
      "type": "hinders"
    },
    {
      "source": "Humiliation/Degradation",
      "target": "Disappointment/Frustration",
      "type": "intensifies"
    },
    {
      "source": "Seoul, Korea",
      "target": "Memory/Past",
      "type": "recalls"
    },
    {
      "source": "Used Bookstore",
      "target": "Memory/Past",
      "type": "triggers_reflection_on"
    },
    {
      "source": "Scholarship vs. Practical Skill",
      "target": "Appraisal/Authenticity",
      "type": "influences_method_of"
    }
  ],
  "hierarchy": {
    "main_topics": [
      "The Narrator's Life and Struggles",
      "The Art World and Its Politics",
      "Academic Rivalries and Betrayal"
    ],
    "structure": "The document follows a chronological structure, interspersed with extensive flashbacks and internal monologues, presenting a fragmented narrative of the narrator's life and career, framed by his current observations and interactions."
  }
}