{
  "propositions": [
    {
      "id": "1",
      "text": "The story is set in the context of the 'Tibetan Code 5: Snow Mountain Servant'.",
      "level": 1
    },
    {
      "id": "1.1",
      "text": "Protagonist Zhuo Muqiangba has personal worries.",
      "level": 2
    },
    {
      "id": "1.1.1",
      "text": "Professor Fang Xin's leg injury has fully recovered.",
      "level": 3
    },
    {
      "id": "1.1.2",
      "text": "Captain Hu Yang has joined the team and gets along well with everyone.",
      "level": 3
    },
    {
      "id": "1.1.3",
      "text": "Captain Hu Yang is talkative, good-natured, and skilled in physical fitness, firearms, and explosives.",
      "level": 4
    },
    {
      "id": "1.1.4",
      "text": "Hu Yang also possesses extensive knowledge of polar climates and environments.",
      "level": 4
    },
    {
      "id": "1.2",
      "text": "As the special training nears its end, anticipation grows, but Yue Yang senses unease.",
      "level": 2
    },
    {
      "id": "1.2.1",
      "text": "The instructor's demeanor shifts from excitement to worry as departure approaches.",
      "level": 3
    },
    {
      "id": "1.2.2",
      "text": "Yue Yang shares his observations about the instructor's anxiety with Zhang Li and Hu Yang.",
      "level": 3
    },
    {
      "id": "1.3",
      "text": "With one day left in training, the team prepares to move to the snow mountain area.",
      "level": 2
    },
    {
      "id": "1.3.1",
      "text": "Zhang Li and Hu Yang discuss their concerns about the instructor's urgency and the possibility of the mission being terminated.",
      "level": 3
    },
    {
      "id": "1.3.2",
      "text": "They rule out the possibility of the team disbanding due to external reasons, assuming it might be related to someone's health.",
      "level": 4
    },
    {
      "id": "1.3.3",
      "text": "They consider and dismiss the health of elderly members like Master Yala and Professor Fang.",
      "level": 4
    },
    {
      "id": "1.3.4",
      "text": "Hu Yang speculates that the issue might be with the team members, but replacements could be made.",
      "level": 4
    },
    {
      "id": "1.3.5",
      "text": "Hu Yang ultimately suspects Lü Jingnan might be the one facing health issues.",
      "level": 4
    },
    {
      "id": "1.4",
      "text": "Yue Yang arrives with crucial information.",
      "level": 2
    },
    {
      "id": "1.4.1",
      "text": "The upper leadership has set a deadline: if Pabalha is not found this time, the team will be disbanded.",
      "level": 3
    },
    {
      "id": "1.4.2",
      "text": "The team is experimental and has been active for over two years without significant discoveries.",
      "level": 3
    },
    {
      "id": "1.5",
      "text": "The provided map only allows for image comparison of mountains, not for specific routes.",
      "level": 2
    },
    {
      "id": "1.5.1",
      "text": "The probability of successfully finding Pabalha is estimated to be less than fifty percent.",
      "level": 3
    },
    {
      "id": "1.5.2",
      "text": "Information about the mountain will be unfavorable.",
      "level": 3
    },
    {
      "id": "1.6",
      "text": "If nothing is found on the snow mountain, the team will disperse.",
      "level": 2
    },
    {
      "id": "1.7",
      "text": "Zhang Li expresses concern for Zhuo Muqiangba, who seems to be aware of the situation and is preoccupied.",
      "level": 2
    },
    {
      "id": "1.8",
      "text": "Zhuo Muqiangba joins the conversation, revealing his personal worries.",
      "level": 2
    },
    {
      "id": "1.8.1",
      "text": "He mentions that his daughter's eighteenth birthday is approaching.",
      "level": 3
    },
    {
      "id": "1.8.2",
      "text": "He expresses longing for his daughter and ex-wife, hesitating to call due to potential awkwardness with his ex-wife's new husband.",
      "level": 3
    },
    {
      "id": "1.8.3",
      "text": "Captain Hu Yang encourages him to call, emphasizing that true love would not be easily disrupted.",
      "level": 4
    },
    {
      "id": "1.9",
      "text": "Zhuo Muqiangba reflects on his past marriage, admitting he failed to be a present husband.",
      "level": 2
    },
    {
      "id": "1.9.1",
      "text": "His focus on work led to him being a stranger to his daughter.",
      "level": 3
    },
    {
      "id": "1.9.2",
      "text": "He believes his marriage was a mistake, driven by parental wishes and his ex-wife's professional prominence.",
      "level": 3
    },
    {
      "id": "1.9.3",
      "text": "His ex-wife found true love elsewhere, leading to a quiet divorce.",
      "level": 3
    },
    {
      "id": "1.9.4",
      "text": "He confesses to significant emotional pain and a period of self-destruction after the divorce.",
      "level": 4
    },
    {
      "id": "1.10",
      "text": "Yue Yang tries to lighten the mood by asking about Zhuo Muqiangba's relationship with Miss Minmin.",
      "level": 2
    },
    {
      "id": "1.11",
      "text": "Zhuo Muqiangba recalls his first encounter with Tang Min in the United States.",
      "level": 2
    },
    {
      "id": "1.11.1",
      "text": "He felt an immediate, inexplicable attraction to her.",
      "level": 3
    },
    {
      "id": "1.11.2",
      "text": "He invited her to lunch to learn more about her brother.",
      "level": 3
    },
    {
      "id": "1.12",
      "text": "During lunch, Tang Min's appearance and demeanor evoked a deep, forgotten memory in Zhuo Muqiangba.",
      "level": 2
    },
    {
      "id": "1.12.1",
      "text": "He saw a resemblance to his deceased younger sister.",
      "level": 3
    },
    {
      "id": "1.12.2",
      "text": "This realization brought overwhelming sadness and painful memories to the surface.",
      "level": 3
    },
    {
      "id": "1.13",
      "text": "Zhuo Muqiangba becomes emotional, explaining to Tang Min that she reminds him of his sister.",
      "level": 2
    },
    {
      "id": "1.13.1",
      "text": "He recounts the story of his sister's abduction when she was young.",
      "level": 3
    },
    {
      "id": "1.14",
      "text": "Tang Min also shares her own feelings of loss and the importance of having a brother.",
      "level": 2
    },
    {
      "id": "1.15",
      "text": "Professor Fang Xin arrives and comforts Zhuo Muqiangba, urging him to let go of the past.",
      "level": 2
    },
    {
      "id": "1.15.1",
      "text": "He advises Zhuo Muqiangba to cherish those around him and respect Tang Min's choices.",
      "level": 3
    },
    {
      "id": "1.16",
      "text": "Professor Fang reveals his initial dislike for Tang Min, which was based on his assessment of her potential for infidelity due to her captivating eyes and age difference with Zhuo Muqiangba.",
      "level": 2
    },
    {
      "id": "1.16.1",
      "text": "He apologizes, admitting he was wrong.",
      "level": 3
    },
    {
      "id": "1.17",
      "text": "Professor Fang explains that Tang Min won him over through her devoted care for him, Master Yala, and the others after their hospital stay, demonstrating her deep love for Zhuo Muqiangba.",
      "level": 2
    },
    {
      "id": "1.17.1",
      "text": "He highlights her meticulous attention to detail in her caregiving.",
      "level": 3
    },
    {
      "id": "1.18",
      "text": "Yue Yang and Zhang Li exchange knowing glances, recognizing Zhuo Muqiangba's charm.",
      "level": 2
    },
    {
      "id": "1.19",
      "text": "Professor Fang teases Zhuo Muqiangba about his initial suspicion that he was interested in Tang Min.",
      "level": 2
    },
    {
      "id": "1.20",
      "text": "The team departs the training camp for the snow mountain.",
      "level": 2
    },
    {
      "id": "1.20.1",
      "text": "Their feelings are a complex mix of anticipation, reluctance, nervousness, and excitement.",
      "level": 3
    },
    {
      "id": "1.21",
      "text": "They board a helicopter, carrying dreams and heading towards the sky.",
      "level": 2
    },
    {
      "id": "1.22",
      "text": "Zhuo Muqiangba feels a sense of returning to a fated starting point.",
      "level": 2
    },
    {
      "id": "1.22.1",
      "text": "The destination is a cursed land described by Uncle Laba, shrouded in ominous clouds and evil aura.",
      "level": 3
    },
    {
      "id": "1.23",
      "text": "The team is heading towards Goddess Spijemo, an unconquered snow mountain in the Himalayas.",
      "level": 2
    },
    {
      "id": "1.23.1",
      "text": "It is not the highest but is considered the most dangerous, part of the 'Death West Wind Belt'.",
      "level": 3
    },
    {
      "id": "1.23.2",
      "text": "The mountain has extreme weather conditions: high winds, low temperatures, and low oxygen saturation.",
      "level": 4
    },
    {
      "id": "1.23.3",
      "text": "The terrain is treacherous with steep slopes, snow avalanches, glaciers, crevasses, and frequent ice and snow collapses.",
      "level": 4
    },
    {
      "id": "1.23.4",
      "text": "Even Sherpas avoid this mountain, believing it's a place of no return.",
      "level": 4
    },
    {
      "id": "1.23.5",
      "text": "Their objective is likely a mountain hollow between two peaks, accessible only by climbing to the summit.",
      "level": 4
    },
    {
      "id": "1.24",
      "text": "The name 'Spijemo' translates to 'God of Death'.",
      "level": 2
    },
    {
      "id": "1.25",
      "text": "The helicopter flies southwest along a vast valley, heading towards Damu County.",
      "level": 2
    },
    {
      "id": "1.25.1",
      "text": "Damu County is located in the mid-Himalayas, bordering China, India, and Nepal.",
      "level": 3
    },
    {
      "id": "1.25.2",
      "text": "It is characterized by high altitude, snowy mountains, and a moist climate influenced by the Indian Ocean.",
      "level": 3
    },
    {
      "id": "1.25.3",
      "text": "The area boasts dense forests and challenging roads carved into cliffs, similar to Motuo.",
      "level": 3
    },
    {
      "id": "1.25.4",
      "text": "Damu is known for producing fierce and loyal mastiffs.",
      "level": 4
    },
    {
      "id": "1.25.5",
      "text": "Ancient cliff inscriptions mention 'Tianzhu' and 'Aozhou' (獒州), indicating Damu's historical significance as a strategic location.",
      "level": 4
    },
    {
      "id": "1.25.6",
      "text": "Zhuo Muqiangba and Professor Fang had previously researched Damu but found nothing conclusive, especially regarding the mastiffs.",
      "level": 4
    },
    {
      "id": "1.26",
      "text": "The helicopter lands near Nala, a village at an altitude of 4000-5000 meters, serving as a forward outpost.",
      "level": 2
    },
    {
      "id": "1.26.1",
      "text": "Nala is a valley settlement amidst snow mountains, resembling a 'Moon Bay' in the desert.",
      "level": 3
    },
    {
      "id": "1.26.2",
      "text": "Despite the harsh surrounding climate, the valley is warm and humid due to mountain barriers.",
      "level": 3
    },
    {
      "id": "1.26.3",
      "text": "The landscape features lush grasslands, lakes formed by melting snow, and a river connecting them.",
      "level": 3
    },
    {
      "id": "1.26.4",
      "text": "The village houses are low-lying and built with stone or wood, often near water sources.",
      "level": 4
    },
    {
      "id": "1.26.5",
      "text": "Yue Yang envies the seemingly idyllic life of the villagers.",
      "level": 4
    },
    {
      "id": "1.27",
      "text": "Upon disembarking, the team experiences the dry, cold climate.",
      "level": 2
    },
    {
      "id": "1.28",
      "text": "The villagers, led by an elder named Mabo (village chief), welcome them warmly.",
      "level": 2
    },
    {
      "id": "1.28.1",
      "text": "Mabo offers assistance with accommodation and sustenance.",
      "level": 3
    },
    {
      "id": "1.29",
      "text": "Yue Yang and others struggle to understand Mabo's language.",
      "level": 2
    },
    {
      "id": "1.30",
      "text": "Master Yala explains it's a Tibetan dialect with different pronunciation.",
      "level": 2
    },
    {
      "id": "1.31",
      "text": "Lü Jingnan outlines the plan: a few days of acclimatization, waiting for favorable weather for the ascent, and scouting routes from three directions.",
      "level": 2
    },
    {
      "id": "1.31.1",
      "text": "Zhuo Muqiangba, Hu Yang, and Yue Yang are assigned to the east.",
      "level": 3
    },
    {
      "id": "1.31.2",
      "text": "Master Yala, Basang, and Zhang Li are assigned to the south.",
      "level": 3
    },
    {
      "id": "1.31.3",
      "text": "Professor Fang, Lü Jingnan, and Minmin are assigned to the north.",
      "level": 3
    },
    {
      "id": "1.31.4",
      "text": "They request three guides from Mabo.",
      "level": 3
    },
    {
      "id": "1.32",
      "text": "Lü Jingnan emphasizes the importance of adapting to carrying equipment in this environment.",
      "level": 2
    },
    {
      "id": "1.33",
      "text": "The team under Zhuo Muqiangba is tasked with exploring the valley between the southeast peak (Duo Jie Yu Zhong Ma) and the main peak.",
      "level": 2
    },
    {
      "id": "1.33.1",
      "text": "Mabo guides them, revealing that their village is a self-formed settlement of herders.",
      "level": 3
    },
    {
      "id": "1.33.2",
      "text": "The Dama people are descendants of migrants from Nepal who settled in the Himalayas, believing in their Tibetan heritage.",
      "level": 4
    },
    {
      "id": "1.33.3",
      "text": "They lack a written language and historically lived a primitive lifestyle.",
      "level": 4
    },
    {
      "id": "1.33.4",
      "text": "They maintain connections with relatives in Nepal but choose to reside in China, believing in its future prosperity.",
      "level": 4
    },
    {
      "id": "1.33.5",
      "text": "Their religious practices include Bon, with a reversed direction for rituals.",
      "level": 4
    },
    {
      "id": "1.34",
      "text": "Mabo recounts past expeditions to the snow mountain, highlighting the high mortality rates.",
      "level": 2
    },
    {
      "id": "1.34.1",
      "text": "He emphasizes that Goddess Spijemo is far more dangerous than Mount Everest.",
      "level": 3
    },
    {
      "id": "1.35",
      "text": "Hu Yang deems their route impassable due to harsh climate, complex terrain, and steep slopes.",
      "level": 2
    },
    {
      "id": "1.36",
      "text": "Mabo describes Duo Jie Yu Zhong Ma as a beautiful white goddess who can transform into a fearsome black-faced deity when angered.",
      "level": 2
    },
    {
      "id": "1.37",
      "text": "Hu Yang is concerned about the perpetual fog at the summit, making ascent a 'suicidal climb' with difficulty exceeding Everest and Nanga Parbat.",
      "level": 2
    },
    {
      "id": "1.38",
      "text": "Mabo suggests that only 'Gangri Pupa', the servant of the snow mountain, knows the way up.",
      "level": 2
    },
    {
      "id": "1.39",
      "text": "Gangri Pupa's wife previously led a failed expedition.",
      "level": 2
    },
    {
      "id": "1.40",
      "text": "Hu Yang recalls hearing about Gangri Pupa in the Tibet Glacier Survey Team, as he refused to guide expeditions to a specific snow mountain.",
      "level": 2
    },
    {
      "id": "1.41",
      "text": "Gangri Pupa's ancestors settled in the area before the Dama people.",
      "level": 2
    },
    {
      "id": "1.42",
      "text": "Gangri Pupa now lives alone in a remote, less hospitable area.",
      "level": 2
    },
    {
      "id": "1.43",
      "text": "The team decides to seek out Gangri Pupa.",
      "level": 2
    },
    {
      "id": "1.44",
      "text": "Mabo warns them about Gangri Pupa's fierce dog, Gangla.",
      "level": 2
    },
    {
      "id": "1.45",
      "text": "Zhuo Muqiangba recognizes the names and reveals he lived with Gangri Pupa for six months.",
      "level": 2
    },
    {
      "id": "1.45.1",
      "text": "He previously encountered Gangri Pupa's rare Azure Sea Beast mastiff, Gangla Meiduo.",
      "level": 3
    },
    {
      "id": "1.45.2",
      "text": "He called Gangri Pupa 'A'guo' (Big Brother).",
      "level": 3
    },
    {
      "id": "1.46",
      "text": "Zhuo Muqiangba excitedly tells Hu Yang and Yue Yang about the Azure Sea Beast.",
      "level": 2
    },
    {
      "id": "1.46.1",
      "text": "He describes its unique blue fur and legendary abilities.",
      "level": 3
    },
    {
      "id": "1.46.2",
      "text": "He recalls telling Professor Fang that the existence of the Azure Sea Beast proves the possibility of the Purple Qilin.",
      "level": 3
    },
    {
      "id": "1.47",
      "text": "Mabo agrees to lead them to Gangri Pupa.",
      "level": 2
    },
    {
      "id": "1.48",
      "text": "They discuss the Azure Sea Beast, a rare breed of Tibetan Mastiff.",
      "level": 2
    },
    {
      "id": "1.49",
      "text": "Mabo describes Gangri Pupa as a good but eccentric person who has helped villagers and occasionally ventures into the mountains alone.",
      "level": 2
    },
    {
      "id": "1.50",
      "text": "Yue Yang expresses concern about Gangri Pupa's solitary life.",
      "level": 2
    },
    {
      "id": "1.51",
      "text": "They observe geological evidence of past glaciation.",
      "level": 2
    },
    {
      "id": "1.52",
      "text": "They spot cave dwellings on a mountainside, identified as potential Paleolithic human settlements.",
      "level": 2
    }
  ],
  "concepts": [
    {
      "name": "Zhuo Muqiangba",
      "frequency": 21,
      "context": "Protagonist, experiencing personal worries and reflecting on his past."
    },
    {
      "name": "Captain Hu Yang",
      "frequency": 16,
      "context": "New team member, talkative, skilled, and knowledgeable."
    },
    {
      "name": "Professor Fang Xin",
      "frequency": 10,
      "context": "Mentor figure, recovering from injury, supportive of Zhuo Muqiangba."
    },
    {
      "name": "Yue Yang",
      "frequency": 13,
      "context": "Team member, observant, concerned, and sometimes naive."
    },
    {
      "name": "Zhang Li",
      "frequency": 7,
      "context": "Team member, concerned about the mission and Zhuo Muqiangba."
    },
    {
      "name": "Lü Jingnan",
      "frequency": 5,
      "context": "Instructor, exhibiting signs of worry and organizing the expedition."
    },
    {
      "name": "Master Yala",
      "frequency": 3,
      "context": "Elderly member, provides linguistic clarification."
    },
    {
      "name": "Tang Min (Minmin)",
      "frequency": 7,
      "context": "Zhuo Muqiangba's love interest, reminds him of his sister."
    },
    {
      "name": "Pabalha",
      "frequency": 2,
      "context": "The objective of the mission."
    },
    {
      "name": "Snow Mountain",
      "frequency": 19,
      "context": "The primary setting and challenge for the expedition."
    },
    {
      "name": "Goddess Spijemo",
      "frequency": 4,
      "context": "The name of the dangerous snow mountain."
    },
    {
      "name": "Damu County",
      "frequency": 6,
      "context": "A key geographical location with historical significance."
    },
    {
      "name": "Mastiff (Tibetan Mastiff)",
      "frequency": 9,
      "context": "A breed of dog, central to the lore of Damu and associated with loyalty and ferocity."
    },
    {
      "name": "Gangri Pupa",
      "frequency": 6,
      "context": "A mysterious individual who knows the way up the snow mountain."
    },
    {
      "name": "Gangla",
      "frequency": 2,
      "context": "Gangri Pupa's fierce dog."
    },
    {
      "name": "Azure Sea Beast",
      "frequency": 4,
      "context": "A rare and legendary breed of mastiff, connected to Gangri Pupa."
    },
    {
      "name": "Mabo",
      "frequency": 7,
      "context": "Village elder and guide from Nala."
    },
    {
      "name": "Nala",
      "frequency": 3,
      "context": "A village serving as a forward outpost for the expedition."
    },
    {
      "name": "Sister",
      "frequency": 3,
      "context": "Zhuo Muqiangba's deceased sister, whose memory is evoked by Tang Min."
    },
    {
      "name": "Mission",
      "frequency": 8,
      "context": "The overarching goal of the expedition to find Pabalha."
    },
    {
      "name": "Death West Wind Belt",
      "frequency": 2,
      "context": "A dangerous region encompassing the snow mountain."
    },
    {
      "name": "Memory",
      "frequency": 5,
      "context": "A recurring theme, particularly for Zhuo Muqiangba."
    },
    {
      "name": "Past",
      "frequency": 5,
      "context": "A significant influence on the characters' present actions and emotions."
    },
    {
      "name": "Family",
      "frequency": 5,
      "context": "Themes of strained family relationships and longing."
    },
    {
      "name": "Destiny/Fate",
      "frequency": 3,
      "context": "A sense of predestination and returning to a starting point."
    }
  ],
  "relations": [
    {
      "source": "Zhuo Muqiangba",
      "target": "Tang Min",
      "type": "has feelings for"
    },
    {
      "source": "Zhuo Muqiangba",
      "target": "Sister",
      "type": "reminds of"
    },
    {
      "source": "Professor Fang Xin",
      "target": "Zhuo Muqiangba",
      "type": "mentor of"
    },
    {
      "source": "Captain Hu Yang",
      "target": "Zhuo Muqiangba",
      "type": "colleague of"
    },
    {
      "source": "Zhang Li",
      "target": "Zhuo Muqiangba",
      "type": "colleague of"
    },
    {
      "source": "Yue Yang",
      "target": "Zhuo Muqiangba",
      "type": "colleague of"
    },
    {
      "source": "Lü Jingnan",
      "target": "Mission",
      "type": "leads"
    },
    {
      "source": "Gangri Pupa",
      "target": "Snow Mountain",
      "type": "knows route to"
    },
    {
      "source": "Gangla",
      "target": "Gangri Pupa",
      "type": "owned by"
    },
    {
      "source": "Gangla Meiduo",
      "target": "Azure Sea Beast",
      "type": "is a"
    },
    {
      "source": "Azure Sea Beast",
      "target": "Mastiff",
      "type": "is a type of"
    },
    {
      "source": "Mabo",
      "target": "Nala",
      "type": "leader of"
    },
    {
      "source": "Mabo",
      "target": "Gangri Pupa",
      "type": "knows of"
    },
    {
      "source": "Goddess Spijemo",
      "target": "Snow Mountain",
      "type": "is the name of"
    },
    {
      "source": "Death West Wind Belt",
      "target": "Snow Mountain",
      "type": "surrounds"
    },
    {
      "source": "Damu County",
      "target": "Mastiff",
      "type": "known for producing"
    },
    {
      "source": "Mission",
      "target": "Pabalha",
      "type": "aims to find"
    },
    {
      "source": "Zhuo Muqiangba",
      "target": "Past",
      "type": "is haunted by"
    },
    {
      "source": "Tang Min",
      "target": "Sister",
      "type": "resembles"
    }
  ],
  "hierarchy": {
    "main_topics": [
      "Zhuo Muqiangba's Personal Struggles",
      "The Impending Mission and its Challenges",
      "The Journey to the Snow Mountain",
      "The Mystery of Gangri Pupa and the Snow Mountain",
      "Reflections on Past Relationships and Memories"
    ],
    "structure": "The document follows a narrative structure, starting with team dynamics and pre-mission anxieties. It then delves into Zhuo Muqiangba's personal history and his developing relationship with Tang Min. The narrative shifts to the expedition's journey and the introduction of the formidable snow mountain, culminating in the introduction of Gangri Pupa as a key figure. The structure interweaves character development with plot progression and exposition about the challenging environment and local lore."
  }
}