{
  "propositions": [
    {
      "id": "1",
      "text": "Life in Jiaping Palace is trivial and delicate, centered around daily routines and personal reflections.",
      "level": 1
    },
    {
      "id": "1.1",
      "text": "Zifu, a central figure, engages in refined activities like ink grinding and reading, embodying elegance and melancholy.",
      "level": 2
    },
    {
      "id": "1.2",
      "text": "Zifu's environment, including her secluded study and the autumnal courtyard, mirrors her inner solitude and nostalgia.",
      "level": 2
    },
    {
      "id": "1.3",
      "text": "Interactions with servants reveal Zifu's reserved nature and hidden emotional depth.",
      "level": 2
    },
    {
      "id": "2",
      "text": "Zifu's past is marked by family tragedy and loss, shaping her current isolated existence.",
      "level": 1
    },
    {
      "id": "2.1",
      "text": "A significant event ten years prior led to her father's demotion and mother's death, leaving Zifu alone.",
      "level": 2
    },
    {
      "id": "2.2",
      "text": "Despite her circumstances, Zifu maintains a stoic outlook, finding solace in routine and simplicity.",
      "level": 2
    },
    {
      "id": "3",
      "text": "External perceptions and gossip about Zifu's family history continue to affect her emotionally.",
      "level": 1
    },
    {
      "id": "3.1",
      "text": "Servants' whispers about her father's past mistakes evoke pain and a defensive response from Zifu.",
      "level": 2
    }
  ],
  "concepts": [
    {
      "name": "Zifu",
      "frequency": 20,
      "context": "Central character, embodying elegance, solitude, and melancholy."
    },
    {
      "name": "Autumn",
      "frequency": 10,
      "context": "Seasonal motif reflecting decay, nostalgia, and emotional coldness."
    },
    {
      "name": "Ink Grinding",
      "frequency": 5,
      "context": "Symbolic activity representing Zifu's refinement and focus."
    },
    {
      "name": "Courtyard",
      "frequency": 8,
      "context": "Physical space symbolizing isolation and introspection."
    },
    {
      "name": "Family Tragedy",
      "frequency": 6,
      "context": "Past events shaping Zifu's current emotional state."
    }
  ],
  "relations": [
    {
      "source": "Zifu",
      "target": "Autumn",
      "type": "reflects"
    },
    {
      "source": "Zifu",
      "target": "Ink Grinding",
      "type": "embodies"
    },
    {
      "source": "Zifu",
      "target": "Courtyard",
      "type": "inhabits"
    },
    {
      "source": "Zifu",
      "target": "Family Tragedy",
      "type": "shaped_by"
    },
    {
      "source": "Autumn",
      "target": "Courtyard",
      "type": "characterizes"
    }
  ],
  "hierarchy": {
    "main_topics": [
      "Daily Life in Jiaping Palace",
      "Zifu's Personal History and Emotional State"
    ],
    "structure": "The document is divided into chapters focusing on mundane activities and personal reflections, interwoven with past tragedies and their lingering impact on the protagonist."
  }
}