{
  "propositions": [
    {
      "id": "1",
      "text": "Shirley Yang visits the narrator to return money and discuss future arrangements.",
      "level": 1
    },
    {
      "id": "1.1",
      "text": "Shirley Yang intends to take Professor Chen abroad for treatment.",
      "level": 2
    },
    {
      "id": "1.2",
      "text": "Shirley Yang needs to investigate some matters before leaving.",
      "level": 2
    },
    {
      "id": "1.3",
      "text": "Shirley Yang offers the narrator money, but asks him to promise something in return.",
      "level": 2
    },
    {
      "id": "2",
      "text": "Shirley Yang hopes the narrator will stop '倒斗' (tomb raiding) activities.",
      "level": 1
    },
    {
      "id": "2.1",
      "text": "She believes '摸金校尉' (tomb raider profession) is harmful to one's karma.",
      "level": 2
    },
    {
      "id": "3",
      "text": "The narrator argues for his continued involvement in '倒斗'.",
      "level": 1
    },
    {
      "id": "3.1",
      "text": "He believes in the dialectical materialism of things having two sides.",
      "level": 2
    },
    {
      "id": "3.2",
      "text": "He avoids protected or discovered ancient tombs.",
      "level": 2
    },
    {
      "id": "3.3",
      "text": "He believes ancient tombs and treasures would remain undiscovered without '倒斗'.",
      "level": 2
    },
    {
      "id": "3.4",
      "text": "He expresses concern for the threat posed by environmental changes to ancient tombs.",
      "level": 2
    },
    {
      "id": "4",
      "text": "Shirley Yang is impressed by the narrator's conviction and withdraws her request.",
      "level": 1
    },
    {
      "id": "5",
      "text": "The narrator asks to borrow the money instead.",
      "level": 1
    },
    {
      "id": "6",
      "text": "The narrator and Fatty discuss the money and their future plans.",
      "level": 1
    },
    {
      "id": "6.1",
      "text": "Fatty suggests they leave and hide from Shirley Yang.",
      "level": 2
    },
    {
      "id": "6.2",
      "text": "The narrator believes the money is capital for future ventures.",
      "level": 2
    },
    {
      "id": "6.3",
      "text": "They decide to use the money for new equipment and plan a major '倒斗' expedition.",
      "level": 2
    },
    {
      "id": "7",
      "text": "The narrator and Fatty decide to engage in the antique business as a more stable income source.",
      "level": 1
    },
    {
      "id": "7.1",
      "text": "They consider opening a shop to sell antiques.",
      "level": 2
    },
    {
      "id": "7.2",
      "text": "They decide to start by setting up a stall in Panjiayuan.",
      "level": 2
    },
    {
      "id": "8",
      "text": "Their initial antique business is unsuccessful, resulting in financial losses.",
      "level": 1
    },
    {
      "id": "8.1",
      "text": "They purchase inexpensive items from the suburbs based on Da Jin Ya's advice.",
      "level": 2
    },
    {
      "id": "8.2",
      "text": "The narrator misjudges the value of items, buying worthless ones and selling valuable ones cheaply.",
      "level": 2
    },
    {
      "id": "8.3",
      "text": "They use this as an opportunity to learn and improve their appraisal skills.",
      "level": 2
    },
    {
      "id": "9",
      "text": "A man named Li Chunlai approaches their stall with a potential antique.",
      "level": 1
    },
    {
      "id": "9.1",
      "text": "Li Chunlai is a rustic-looking farmer who is hesitant and secretive.",
      "level": 2
    },
    {
      "id": "9.2",
      "text": "He asks if they buy antiques and is invited to speak privately.",
      "level": 2
    },
    {
      "id": "10",
      "text": "Li Chunlai reveals he has an ancient embroidered shoe.",
      "level": 1
    },
    {
      "id": "10.1",
      "text": "He is initially reluctant to show it, fearing judgment.",
      "level": 2
    },
    {
      "id": "11",
      "text": "The narrator takes Li Chunlai to a dumpling restaurant to discuss the shoe.",
      "level": 1
    },
    {
      "id": "11.1",
      "text": "Li Chunlai is lured by the prospect of eating lamb dumplings.",
      "level": 2
    },
    {
      "id": "12",
      "text": "The narrator examines the embroidered shoe.",
      "level": 1
    },
    {
      "id": "12.1",
      "text": "He identifies it as a Ming Dynasty item, a 'three-inch golden lotus' shoe.",
      "level": 2
    },
    {
      "id": "12.2",
      "text": "He notes its exquisite craftsmanship and potential collection value.",
      "level": 2
    },
    {
      "id": "13",
      "text": "Li Chunlai recounts the story of how he obtained the shoe.",
      "level": 1
    },
    {
      "id": "13.1",
      "text": "His village was suffering from a severe drought.",
      "level": 2
    },
    {
      "id": "13.2",
      "text": "A blind fortune-teller claimed the drought was caused by a '旱魃' (drought demon).",
      "level": 2
    },
    {
      "id": "13.3",
      "text": "A shepherd boy reported seeing a green creature enter an abandoned, unburied coffin in a graveyard.",
      "level": 2
    },
    {
      "id": "13.4",
      "text": "The fortune-teller identified the creature as the 旱魃.",
      "level": 2
    },
    {
      "id": "13.5",
      "text": "Villagers opened the coffin, revealing a well-preserved ancient female corpse and a small, green, monkey-like creature on its head.",
      "level": 2
    },
    {
      "id": "13.6",
      "text": "The villagers killed and burned the creature as instructed by the fortune-teller.",
      "level": 2
    },
    {
      "id": "13.7",
      "text": "The fortune-teller advised burning the coffin and its contents.",
      "level": 2
    },
    {
      "id": "13.8",
      "text": "As Li Chunlai was tasked with burning the coffin, a lightning strike extinguished the fire due to heavy rain.",
      "level": 2
    },
    {
      "id": "13.9",
      "text": "Li Chunlai, motivated by greed, opened the coffin again to retrieve treasures.",
      "level": 2
    },
    {
      "id": "13.10",
      "text": "He encountered Ma Shun, who had also returned for the treasures.",
      "level": 2
    },
    {
      "id": "13.11",
      "text": "Ma Shun took the valuable items and gave Li Chunlai a single shoe as a bribe to keep silent.",
      "level": 2
    },
    {
      "id": "13.12",
      "text": "They buried the coffin.",
      "level": 2
    },
    {
      "id": "13.13",
      "text": "The villagers were told the coffin and corpse were burned, and the fortune-teller explained it as a '子母凶' (mother-child evil) phenomenon.",
      "level": 2
    },
    {
      "id": "13.14",
      "text": "The next morning, Ma Shun's family was struck by lightning and died.",
      "level": 2
    },
    {
      "id": "13.15",
      "text": "The village discovered the stolen treasures at Ma Shun's house, leading to the truth being revealed.",
      "level": 2
    },
    {
      "id": "13.16",
      "text": "Li Chunlai, fearing punishment, blamed Ma Shun and kept the shoe a secret.",
      "level": 2
    },
    {
      "id": "13.17",
      "text": "He brought the shoe to Beijing to sell it and fund his marriage.",
      "level": 2
    },
    {
      "id": "14",
      "text": "The narrator negotiates the price of the shoe with Li Chunlai.",
      "level": 1
    },
    {
      "id": "14.1",
      "text": "He offers 600 yuan, later increasing it to 650 yuan.",
      "level": 2
    },
    {
      "id": "14.2",
      "text": "Li Chunlai is surprised and agrees to the sale.",
      "level": 2
    },
    {
      "id": "15",
      "text": "Li Chunlai provides information about ancient tombs in his hometown and surrounding areas in Shaanxi.",
      "level": 1
    },
    {
      "id": "15.1",
      "text": "He mentions the abundance of ancient tombs in Longxiang County, with some areas having multiple tombs layered upon each other.",
      "level": 2
    },
    {
      "id": "15.2",
      "text": "He speaks of valuable Tang Dynasty artifacts found there and the prevalence of tomb raiding by locals and outside buyers.",
      "level": 2
    },
    {
      "id": "15.3",
      "text": "He mentions the Qinling Mountains as an area with many large tombs, though difficult to find.",
      "level": 2
    },
    {
      "id": "16",
      "text": "The narrator, Fatty, and Da Jin Ya discuss the value of the shoe and plan a trip to Shaanxi.",
      "level": 1
    },
    {
      "id": "16.1",
      "text": "Da Jin Ya estimates the shoe's market value to be at least 2,000 yuan, with a pair potentially worth much more.",
      "level": 2
    },
    {
      "id": "16.2",
      "text": "The narrator decides to return to Li Chunlai's hometown to compensate him further.",
      "level": 2
    },
    {
      "id": "16.3",
      "text": "They agree to travel to Shaanxi together for antique collection and exploration.",
      "level": 2
    },
    {
      "id": "17",
      "text": "The discussion shifts to the prevalence of zombies and geomancy in Shaanxi.",
      "level": 1
    },
    {
      "id": "17.1",
      "text": "Fatty mentions the need for 'black donkey hooves' due to the reported prevalence of zombies.",
      "level": 2
    },
    {
      "id": "17.2",
      "text": "The narrator explains the concept of 'black fierce' and 'white fierce' in geomancy, referring to different types of zombie transformations.",
      "level": 2
    },
    {
      "id": "18",
      "text": "The narrator explains the concept of '入土不安' (unease after burial) leading to zombies.",
      "level": 1
    },
    {
      "id": "18.1",
      "text": "This occurs when a burial site has unfavorable geomancy ('形' and '势' are in conflict).",
      "level": 2
    },
    {
      "id": "18.2",
      "text": "This can result in the deceased becoming a zombie, causing harm to others.",
      "level": 2
    },
    {
      "id": "19",
      "text": "Da Jin Ya questions the efficacy of geomancy in determining the fate of dynasties, citing Qin Shi Huang's empire.",
      "level": 1
    },
    {
      "id": "20",
      "text": "The narrator suggests that while geomancy has natural principles, human history is not solely determined by it.",
      "level": 1
    },
    {
      "id": "20.1",
      "text": "Natural disasters and geological changes can alter the geomantic potential of a site over time.",
      "level": 2
    },
    {
      "id": "21",
      "text": "The group decides to postpone their trip to Shaanxi due to news of severe flooding in the Yellow River area.",
      "level": 1
    },
    {
      "id": "21.1",
      "text": "The flooding has exposed ancient tombs near Zhuangling.",
      "level": 2
    },
    {
      "id": "22",
      "text": "The group travels to the Yellow River and is dropped off at a remote location by a bus driver.",
      "level": 1
    },
    {
      "id": "23",
      "text": "They encounter difficulty finding a boat to cross the river.",
      "level": 1
    },
    {
      "id": "24",
      "text": "The Yellow River is described as wide, turbulent, and muddy due to heavy rains.",
      "level": 1
    },
    {
      "id": "25",
      "text": "While waiting for a boat, the narrator, Fatty, and Da Jin Ya drink and sing.",
      "level": 1
    },
    {
      "id": "26",
      "text": "A boat eventually appears, but the captain is hesitant to stop due to their location and cargo.",
      "level": 1
    },
    {
      "id": "27",
      "text": "Fatty bribes the captain with money, and they agree to be transported across.",
      "level": 1
    },
    {
      "id": "28",
      "text": "The boat is transporting machine parts and is heading for repairs.",
      "level": 1
    },
    {
      "id": "29",
      "text": "While crossing the river, the boat collides with a massive, unseen object in the water.",
      "level": 1
    },
    {
      "id": "29.1",
      "text": "The impact causes the boat to lurch violently, and the occupants are thrown around.",
      "level": 2
    },
    {
      "id": "29.2",
      "text": "The boat appears to be stuck or blocked by the object.",
      "level": 2
    },
    {
      "id": "30",
      "text": "The captain believes the object is a '河神老爷' (river god) manifesting and threatening their vessel.",
      "level": 1
    },
    {
      "id": "31",
      "text": "Fatty describes the object as 'black and huge, like a truck,' resembling a giant turtle.",
      "level": 1
    },
    {
      "id": "32",
      "text": "The narrator and Fatty arm themselves with a folding engineer's shovel to confront the object.",
      "level": 1
    },
    {
      "id": "33",
      "text": "Visibility is poor due to the darkness and heavy rain.",
      "level": 1
    },
    {
      "id": "34",
      "text": "Through flashes of lightning, they glimpse a colossal, mountain-like entity in the water, partially submerged.",
      "level": 1
    },
    {
      "id": "35",
      "text": "The object is moving against the current and repeatedly colliding with the boat.",
      "level": 1
    },
    {
      "id": "36",
      "text": "The narrator attempts to attack the object with the shovel but is unable to reach it.",
      "level": 1
    },
    {
      "id": "37",
      "text": "The narrator is almost thrown into the river but is saved by Fatty.",
      "level": 1
    },
    {
      "id": "38",
      "text": "The narrator urges the captain to maneuver the boat to avoid further collisions.",
      "level": 1
    }
  ],
  "concepts": [
    {
      "name": "Shirley Yang",
      "frequency": 3,
      "context": "Visits narrator, discusses money and future plans, believes in karma and stopping tomb raiding."
    },
    {
      "name": "Professor Chen",
      "frequency": 1,
      "context": "Needs to be taken abroad for treatment."
    },
    {
      "name": "倒斗",
      "frequency": 6,
      "context": "Tomb raiding activity that the narrator is involved in and Shirley Yang wants him to stop."
    },
    {
      "name": "摸金校尉",
      "frequency": 1,
      "context": "The profession of tomb raiding, considered by Shirley Yang to be harmful to karma."
    },
    {
      "name": "辩证唯物主义",
      "frequency": 1,
      "context": "Philosophical concept used by the narrator to justify his actions."
    },
    {
      "name": "古墓",
      "frequency": 5,
      "context": "Ancient tombs that are subjects of interest for exploration and treasure hunting."
    },
    {
      "name": "Fatty",
      "frequency": 10,
      "context": "Narrator's companion, discusses money, plans business, and joins the expedition. Has a pragmatic outlook."
    },
    {
      "name": "Da Jin Ya",
      "frequency": 7,
      "context": "Antique dealer, advises on business, joins the expedition, and discusses the value of antiques and geomancy."
    },
    {
      "name": "Antique business",
      "frequency": 5,
      "context": "The narrator and Fatty's attempt to make money by selling antiques."
    },
    {
      "name": "Panjiayuan",
      "frequency": 2,
      "context": "A market where the narrator and Fatty set up their antique stall."
    },
    {
      "name": "Li Chunlai",
      "frequency": 14,
      "context": "A man from Shaanxi who brings an ancient embroidered shoe to sell. He recounts a story about a drought, a coffin, and a '旱魃'."
    },
    {
      "name": "Embroidered shoe",
      "frequency": 11,
      "context": "The antique object that Li Chunlai possesses and sells. It has significant historical and collection value."
    },
    {
      "name": "旱魃",
      "frequency": 4,
      "context": "A mythical creature believed to cause drought, central to Li Chunlai's story."
    },
    {
      "name": "Coffin",
      "frequency": 6,
      "context": "An abandoned coffin found in a graveyard that contained a corpse and a '旱魃'."
    },
    {
      "name": "Ancient corpse",
      "frequency": 4,
      "context": "A well-preserved female corpse found in the coffin, believed to be over a thousand years old."
    },
    {
      "name": "Ma Shun",
      "frequency": 3,
      "context": "A villager who stole treasures from the coffin and was later killed by lightning."
    },
    {
      "name": "Shaanxi",
      "frequency": 7,
      "context": "Li Chunlai's hometown and the planned destination for the expedition, known for its numerous ancient tombs."
    },
    {
      "name": "Longxiang County",
      "frequency": 2,
      "context": "An area in Shaanxi with a high concentration of ancient tombs."
    },
    {
      "name": "Qinling Mountains",
      "frequency": 2,
      "context": "A mountain range rumored to contain many large ancient tombs."
    },
    {
      "name": "Geomancy",
      "frequency": 6,
      "context": "The art of arranging buildings and graves to achieve harmony with the spirit of the land; discussed in relation to burial sites and dragon脉."
    },
    {
      "name": "Dragon脉",
      "frequency": 3,
      "context": "Lines of energy in the landscape considered auspicious for burials, originating from Kunlun Mountain."
    },
    {
      "name": "Yellow River",
      "frequency": 6,
      "context": "The location of the group's perilous river crossing, characterized by high water levels and turbulent currents."
    },
    {
      "name": "Flooding",
      "frequency": 2,
      "context": "Severe flooding of the Yellow River exposes ancient tombs."
    },
    {
      "name": "River crossing",
      "frequency": 6,
      "context": "The dangerous journey across the Yellow River by boat."
    },
    {
      "name": "Giant unseen object",
      "frequency": 8,
      "context": "A massive, mysterious entity encountered in the Yellow River that causes significant disruption to the boat."
    },
    {
      "name": "Zombie",
      "frequency": 4,
      "context": "Undead beings, often discussed in the context of geomancy and folklore."
    },
    {
      "name": "Engineer's shovel",
      "frequency": 2,
      "context": "The tool the narrator and Fatty use to defend themselves against the object in the river."
    }
  ],
  "relations": [
    {
      "source": "Shirley Yang",
      "target": "Narrator",
      "type": "interacts_with"
    },
    {
      "source": "Shirley Yang",
      "target": "倒斗",
      "type": "discourages"
    },
    {
      "source": "Narrator",
      "target": "辩证唯物主义",
      "type": "applies"
    },
    {
      "source": "Narrator",
      "target": "古墓",
      "type": "explores"
    },
    {
      "source": "Narrator",
      "target": "Fatty",
      "type": "collaborates_with"
    },
    {
      "source": "Narrator",
      "target": "Da Jin Ya",
      "type": "collaborates_with"
    },
    {
      "source": "Fatty",
      "target": "Antique business",
      "type": "engages_in"
    },
    {
      "source": "Narrator",
      "target": "Antique business",
      "type": "engages_in"
    },
    {
      "source": "Li Chunlai",
      "target": "Embroidered shoe",
      "type": "possesses"
    },
    {
      "source": "Li Chunlai",
      "target": "Narrator",
      "type": "sells_to"
    },
    {
      "source": "Li Chunlai",
      "target": "旱魃",
      "type": "tells_story_about"
    },
    {
      "source": "旱魃",
      "target": "Ancient corpse",
      "type": "found_with"
    },
    {
      "source": "Ma Shun",
      "target": "Treasures",
      "type": "steals"
    },
    {
      "source": "Ma Shun",
      "target": "Li Chunlai",
      "type": "bribes"
    },
    {
      "source": "Embroidered shoe",
      "target": "Shaanxi",
      "type": "originates_from"
    },
    {
      "source": "Shaanxi",
      "target": "古墓",
      "type": "rich_in"
    },
    {
      "source": "Narrator",
      "target": "Shaanxi",
      "type": "plans_to_visit"
    },
    {
      "source": "Fatty",
      "target": "Shaanxi",
      "type": "plans_to_visit"
    },
    {
      "source": "Da Jin Ya",
      "target": "Shaanxi",
      "type": "plans_to_visit"
    },
    {
      "source": "Geomancy",
      "target": "Zombie",
      "type": "explains_origin_of"
    },
    {
      "source": "Dragon脉",
      "target": "Geomancy",
      "type": "key_element_of"
    },
    {
      "source": "Yellow River",
      "target": "Flooding",
      "type": "affected_by"
    },
    {
      "source": "Flooding",
      "target": "古墓",
      "type": "exposes"
    },
    {
      "source": "Narrator",
      "target": "River crossing",
      "type": "undertakes"
    },
    {
      "source": "Fatty",
      "target": "River crossing",
      "type": "undertakes"
    },
    {
      "source": "Da Jin Ya",
      "target": "River crossing",
      "type": "undertakes"
    },
    {
      "source": "Boat",
      "target": "Giant unseen object",
      "type": "collides_with"
    },
    {
      "source": "Giant unseen object",
      "target": "River",
      "type": "located_in"
    },
    {
      "source": "Captain",
      "target": "Giant unseen object",
      "type": "interprets_as"
    },
    {
      "source": "Narrator",
      "target": "Engineer's shovel",
      "type": "uses"
    },
    {
      "source": "Fatty",
      "target": "Engineer's shovel",
      "type": "uses"
    }
  ],
  "hierarchy": {
    "main_topics": [
      "Narrator's financial situation and future plans",
      "Narrator's involvement in tomb raiding",
      "Antique business venture",
      "Encounter with Li Chunlai and the ancient shoe",
      "The legend of the '旱魃' and its aftermath",
      "Expedition planning to Shaanxi",
      "Geomancy and folklore related to Shaanxi",
      "Perilous journey across the Yellow River",
      "Encounter with a mysterious object in the river"
    ],
    "structure": "The document follows a narrative structure, beginning with character interactions and financial matters, transitioning to a business venture, then to a significant discovery and a detailed personal account, leading to expedition planning. The latter part describes a journey with an unexpected and perilous encounter. The narrative is interspersed with explanations of folklore, history, and concepts like geomancy."
  }
}