{
  "propositions": [
    {
      "id": "1",
      "text": "这是一个诡异得让人无法置信的故事。",
      "level": 1
    },
    {
      "id": "1.1",
      "text": "故事起源于一件关于黄河的奇闻。",
      "level": 2
    },
    {
      "id": "1.1.1",
      "text": "很多在黄河边生活的，如我这样年纪的人，大多会从老人那里，听到很多关于黄河的奇闻逸事。",
      "level": 3
    },
    {
      "id": "1.1.1.1",
      "text": "我们大多数人都是通过这些故事，体验到这一条母亲河的强大，多变和神秘，从而使我们在懵懂中，种下了对黄河的敬畏。",
      "level": 4
    },
    {
      "id": "1.1.2",
      "text": "但这一件奇闻，却和其他的故事性的传说不同。",
      "level": 2
    },
    {
      "id": "1.1.3",
      "text": "我第一次听到这到这件奇闻，是在十三年前的夏天，说故事的人是我已经过世的姥姥。",
      "level": 2
    },
    {
      "id": "1.1.3.1",
      "text": "我听完之后，问姥姥这个故事是真是假，姥姥笑着和我说了一句话，可惜这一句话，我并没有记住。",
      "level": 3
    },
    {
      "id": "1.1.4",
      "text": "事情发生的时候，是在解放前的一个干旱之年。",
      "level": 2
    },
    {
      "id": "1.1.5",
      "text": "在黄河的中下游，有一个不起眼的小村子，村子里没有什么田地和特产，整个村子的人，都靠倒卖黄河黄沙为生。",
      "level": 2
    },
    {
      "id": "1.1.5.1",
      "text": "村子里的人，大多数从几代之前，就从事这种工作，工人将黄河底下的黄沙泥用沙斗挖上来，然后过滤出较细的沙粒，卖到其他地方，这样一方面可以赚钱；另一方面也可以为黄河清淤，减少汛期黄河决堤的危险。",
      "level": 3
    },
    {
      "id": "1.1.6",
      "text": "和盐帮，碳帮一样，倒卖黄沙的，到了一定的规模，也形成了自己的利益集团，这种倒卖黄沙的村庄，那时候叫做黄沙厂。",
      "level": 2
    },
    {
      "id": "1.1.7",
      "text": "每年有一段时间是黄河的枯水期，黄河里一段一段的断流，很多地方都露出了河底，这段时间是挖沙子最好的时候。",
      "level": 2
    },
    {
      "id": "1.1.7.1",
      "text": "也是黄沙厂最忙碌的时候。",
      "level": 3
    },
    {
      "id": "1.1.8",
      "text": "所有断流的河流，都会形成这样一种现象，就是一条大河，河底并不平坦，断流之后，河的水位下降，会形成很多的小湖泊和池塘。",
      "level": 2
    },
    {
      "id": "1.1.8.1",
      "text": "这时候，其实河流并没有完全断流，水流还是在沙层下面向下游渗透，但是上面的小湖泊却是静止的。",
      "level": 3
    },
    {
      "id": "1.1.9",
      "text": "这个黄沙厂所负责的河段，就是这样一个情形，那里黄河河道很宽，断水之后，河道的中间会出现一个很大的断水湖，这个湖几<bos>来一直没有干涸，水可以维持到下一眼黄河汛期到来的时候，传说有一个风水先生说过，这湖就是黄河的眼睛，所以当地人叫这湖为\"黄河眼\"。",
      "level": 2
    },
    {
      "id": "1.1.9.1",
      "text": "\"黄河眼\"几千年来，一直没有干涸过，无论天气再旱，上游断流断得再厉害，\"黄河眼\"也一直清澈如镜，所以这个黄沙厂，自古以来就不缺水用。",
      "level": 3
    },
    {
      "id": "1.1.9.1.1",
      "text": "老人都说湖底有龙，所以水是不会干的。",
      "level": 4
    },
    {
      "id": "1.1.9.1.2",
      "text": "村里人也从来没有存水的习惯。",
      "level": 4
    },
    {
      "id": "1.1.10",
      "text": "然而有一年夏天，村里突然来了一个陌生穿绿棉袄的小孩子，到处叫，说黄河眼要干了，要大家存水，当时谁也没信他，只是觉得奇怪，这小孩子从来没见过，不知道是谁家的。",
      "level": 2
    },
    {
      "id": "1.1.10.1",
      "text": "后来那小孩子就不见了，大家想可能给大人领回去了，事情也就不了了之，谁也没放心里。",
      "level": 3
    },
    {
      "id": "1.1.11",
      "text": "过了几个月，很多人都听到晴天\"啪\"的一声巨响，从黄河眼的方向传出来，跑去一看，只见一直非常清澈的黄河眼里，竟然一片浑浊，当时有老人一听，就说坏了，黄河眼里的龙飞走了。",
      "level": 2
    },
    {
      "id": "1.1.12",
      "text": "果然，第二年黄河断流的时候，几千年来从没干涸过的黄河眼，逐渐见底了。",
      "level": 2
    },
    {
      "id": "1.1.13",
      "text": "村里人都非常惶恐，不知道自己做错了什么事情，请了几个风水先生一算，风水先生也说不出个所以然来。",
      "level": 2
    },
    {
      "id": "1.1.13.1",
      "text": "就眼看着黄河眼逐渐变成了一块干地。",
      "level": 3
    },
    {
      "id": "1.1.14",
      "text": "\"黄河眼\"从来没有干过，河底的情形大家都没有见过，所以黄河眼快见底的那几天，老人们诚慌诚恐，在黄河眼岸上烧香祭奠，希望龙再回来，但是更多年轻人都来看热闹，看看河底是不是真的有龙生活过的痕迹。",
      "level": 2
    },
    {
      "id": "1.1.15",
      "text": "在黄河眼的底下，自然不会有什么龙，但是奇怪的是，水干了之后，在河底淤泥里，竟然出现了一座半人高，半埋在沙子里的石台。",
      "level": 2
    },
    {
      "id": "1.1.15.1",
      "text": "石台大概有一个篮球场这么大，胆子大的人跑下河底一看，发现不知用什么材料修筑的，似乎没有一丝缝隙，犹如一个整体，上面雕满了类似于鸟的奇怪的图案。",
      "level": 3
    },
    {
      "id": "1.1.15.2",
      "text": "最奇特的是，这石头在阳光下，呈现一种羊脂一样的半透明，透过这种透明，他们可以看到里面有一黑色的影子，摸着那石台地方，就是暖的，但是摸着那影子透出的地方，就是冰凉刺骨的，似乎那黑色的影子，能吸收热量。",
      "level": 3
    },
    {
      "id": "1.1.16",
      "text": "在黄河中下游生活的人，都知道黄河经常会挖到东西，各地乱七八糟的传说很多，民国的时候，听说在河南和甘肃，都挖出过一种水晶棺材，里面都放着死人，十分奇怪，但是挖出这么大一个半透明的石台，谁也没听说过。",
      "level": 2
    },
    {
      "id": "1.1.17",
      "text": "当地老人迷信，就说这东西是龙棺，这石台里面的黑色影子，就是已经死了的龙的尸体，但是影子太模糊了，根本不能分辨是什么，很多人说似乎是个人，也有人说，这影子不是人，是条大鱼。",
      "level": 2
    },
    {
      "id": "1.1.18",
      "text": "最离奇的是，几个眼睛尖的人就发现，这石台里的影子，每天都在变，一开始似乎是一椭圆形的，后来竟然开始长出手脚的样子来了。",
      "level": 2
    },
    {
      "id": "1.1.19",
      "text": "以前遇到这种事情，村里都会找风水先生，但是那时候村子很穷，好的风水先生开价都很高，剩下的大部分都是招摇撞骗的，一时间也找不到人，就找到村里一资格最老的老头，这老头，已经有九十多岁了，听说以前做过南爬子（盗墓贼），有点看风水的本事，那老头给人抬到那石台边上。",
      "level": 2
    },
    {
      "id": "1.1.19.1",
      "text": "老头干瘦干瘦，犹如一个骷髅，和他同辈的和他下一辈的人，都已经死了，老人平时也几乎不动，整天在屋前坐着，过着等死一样日子，所以谁也不了解他的来历。",
      "level": 3
    },
    {
      "id": "1.1.19.2",
      "text": "老头的眼睛不好，听说是以前盗墓的时候，给尸气熏过，所以大部分的时候，他的眼睛都是睁不开的。",
      "level": 3
    },
    {
      "id": "1.1.20",
      "text": "但是一把他带到这石台边上，大家就看到，这老头子眼睛突然睁得很大，还没等其他人开口，他就已经坐直了，好像预感到了什么东西。",
      "level": 2
    },
    {
      "id": "1.1.21",
      "text": "那村长就说：\"老人家，你见多识广，你给看看这是怎么回事情，这东西是应福还是应祸？\"",
      "level": 2
    },
    {
      "id": "1.1.22",
      "text": "老头点点头就给人搀扶着下地了，然而他第一眼看的却不是这石头台子，而是去看四周的山。",
      "level": 2
    },
    {
      "id": "1.1.23",
      "text": "看了一圈之后，他的表情就变得很奇怪，自言自语了一句：\"怎么会是这样？\"",
      "level": 2
    },
    {
      "id": "1.1.23.1",
      "text": "这才去看那石台子，可是才看了一眼，他就马上把眼睛移了开去，大叫刺眼。",
      "level": 3
    },
    {
      "id": "1.1.24",
      "text": "当时很多人都在场看着那石台子，没人觉得有任何光线从石台里射出来，只有那老头就是说刺眼，用手去挡眼睛，其他人给他弄得直冒凉气。",
      "level": 2
    },
    {
      "id": "1.1.25",
      "text": "村长就找人弄了副圆片儿墨镜，给那老头带上，老头这才能睁眼睛。",
      "level": 2
    },
    {
      "id": "1.1.25.1",
      "text": "他围着这石台子看了一圈，期间也是不停地用手去遮眼睛，似乎光线还是很强。",
      "level": 3
    },
    {
      "id": "1.1.26",
      "text": "看完之后，他的脸色就更怪了，又说了一句：\"怎么会是在这里？\"",
      "level": 2
    },
    {
      "id": "1.1.27",
      "text": "村长就问了，这到底是什么东西？",
      "level": 2
    },
    {
      "id": "1.1.28",
      "text": "老头子摆手让他别问，自己哆哆嗦嗦地从怀里拿出一只奇怪的算盘，人家的算盘是方的，他那只算盘是圆的，这么拨了几拨，脸色就沉了下来，他转头，突然对村长说了一句话。",
      "level": 2
    },
    {
      "id": "1.1.29",
      "text": "他说：\"把我放到这石台上面去。\"",
      "level": 2
    },
    {
      "id": "1.1.30",
      "text": "几个人都觉得奇怪，但是看老头的表情，白得可怕，谁也没敢问，于是就让几个小伙子把老头抬到了石台之上。",
      "level": 2
    },
    {
      "id": "1.1.31",
      "text": "老头子上了石台后，就盘坐在那里，不再说话，似乎是在闭目养神起来。",
      "level": 2
    },
    {
      "id": "1.1.32",
      "text": "这一坐，就坐了将近一天时间，一群人围在一边等着看着，等着等着，有些人不耐烦了，陆续就有人回去，天也逐渐暗下来，到了傍晚的时候，围观的人基本上走光了。",
      "level": 2
    },
    {
      "id": "1.1.33",
      "text": "村长看这一坐也不知道要坐到什么时候，留了几个工人在这里看着，自己也先回去了。",
      "level": 2
    },
    {
      "id": "1.1.33.1",
      "text": "那时候军阀混战，今天这个村子归你管，明天这个村子归他管，所以当个村长是很忙的，他回到家里，一忙就忙到了很晚，就没有再去黄沙厂子。",
      "level": 3
    },
    {
      "id": "1.1.34",
      "text": "没想到第二天天还没亮，那几个留在那里的工人就跑到村长家里，把村长叫醒了，村长一问干什么，几个工人说：\"那老头不见了！\"",
      "level": 2
    },
    {
      "id": "1.1.35",
      "text": "具体一问，才知道所有人走了之后，那个老头一直坐在石台上，一动也不动，那几个小青年就在边上赌钱喝酒，后来天全黑了，黄河里没有灯，他们几个什么没看见，靠着黄沙就睡着了，醒过来的时候，天已经蒙蒙亮，他们爬起来一看，石台上空空如也，哪里还有那老头的影子。",
      "level": 2
    },
    {
      "id": "1.1.36",
      "text": "村长一听，马上带着几个人跑回黄河眼一看，果然，老头子不见了，一开始以为他自己回家了，派人去找了，找了一圈，也没找着，这时候那几个眼尖的就大叫了起来：\"在里面！\"",
      "level": 2
    },
    {
      "id": "1.1.37",
      "text": "大家一看，原来那半透明的石台里面，不知道何时，竟然多出了一个干瘦干瘦的黑色影子！两个影子抱在一起，诡异异常！",
      "level": 2
    },
    {
      "id": "1.1.38",
      "text": "村里人吓坏了，都不敢再靠近这个石头台子。",
      "level": 2
    },
    {
      "id": "1.1.39",
      "text": "后来这个事情给附近一个军阀知道了，就派了一队军队过来，想把这石台挖出来，没想到才挖了几下，石台下面突然开始冒水，水冒得飞快，而且水冰凉，围观的人争相逃命，逃上了黄河眼的岸上，很快，涌出的水就把整个黄河眼填满了，那石台和里面的黑色影子，又隐藏到了这断水湖的深处。",
      "level": 2
    },
    {
      "id": "1.1.40",
      "text": "当天晚上，村里很多人都梦见那老头，在对他们做手势，好像是在说六十一，六十一。",
      "level": 2
    },
    {
      "id": "1.1.40.1",
      "text": "但是当时，谁也不知道这六十一，是个什么意思。",
      "level": 3
    },
    {
      "id": "1.1.40.2",
      "text": "大家只知道从此以后，那个老头子，再也没有在村里出现过，似乎是真的跑到那石台里面去了。",
      "level": 3
    },
    {
      "id": "1.1.41",
      "text": "那石台肯定是一个整体，连一条缝隙也没有，这老头是怎么进去的？",
      "level": 2
    },
    {
      "id": "1.1.41.1",
      "text": "石台里另一个影子是什么？",
      "level": 3
    },
    {
      "id": "1.1.41.2",
      "text": "那石台子到底是干什么用的？",
      "level": 3
    },
    {
      "id": "1.1.41.3",
      "text": "为什么出现在黄河的底部？",
      "level": 3
    },
    {
      "id": "1.1.41.4",
      "text": "都没有人能说得上来。",
      "level": 4
    },
    {
      "id": "2",
      "text": "在黄河边的童年并没有持续多少时间，我就跟随回乡的父亲回到了城市，姥姥的这个故事，也随着我新生活的展开，逐渐在我的记忆里模糊，最后完全淡忘。",
      "level": 1
    },
    {
      "id": "2.1",
      "text": "我的生活也变得和很多小说里的主人公一样，典型但是不特别。",
      "level": 2
    },
    {
      "id": "3",
      "text": "成年后，经历了不少职业，最后我成为了一个普通的古董商人，在上海是以给一些民间企业家收购和鉴别古董为生，生活平淡，但是还算滋润。",
      "level": 1
    },
    {
      "id": "4",
      "text": "我大学里学的，和分配的工作是电力工程，也就是设计国家电网和发电站，与现在的职业毫不相干。",
      "level": 1
    },
    {
      "id": "4.1",
      "text": "之所以进入古董这个所谓的偏门买卖，是因为我的前妻。",
      "level": 2
    },
    {
      "id": "4.1.1",
      "text": "我的前妻是藏汉混血，我的老丈人是藏人，妻子从小接受两种教育，有非常良好的语言天赋，成年后，她在国家机关里做藏语翻译，老丈人就是做古董生意的，对于古董相当有一套，我整天拍他马屁，也逐渐对这些东西发生了兴趣。",
      "level": 3
    },
    {
      "id": "4.1.1.1",
      "text": "凡是人一旦接触到古董，就很难不被其里面的高价值，高风险，高回报所吸引，于是我就在工作的闲暇，也做起一些关于古董的小生意。",
      "level": 4
    },
    {
      "id": "4.1.2",
      "text": "然而天不从人愿，在我们结婚的第二年，我前妻随着一领导班子勘探中蒙边境，两边分居了三年，我等了她三年，最后她却没回来，听说是和她那边一领导好上了，前年给我寄来一离婚通知书，就再没有消息。",
      "level": 3
    },
    {
      "id": "4.1.3",
      "text": "后来单位改制，我那几个月因为感情问题，连续旷工喝酒，什么都不管，就被踢了下来，把我下到了基层。",
      "level": 3
    },
    {
      "id": "4.1.3.1",
      "text": "我一琢磨，那里都是我的徒弟啊，我下去给他们管，我能过得舒服吗？索性就下了海了。",
      "level": 4
    },
    {
      "id": "4.1.3.1.1",
      "text": "那时候生意也不好做，亏了不少生意，最后干脆做生不如做熟，就进了古董这一行。",
      "level": 5
    },
    {
      "id": "4.1.4",
      "text": "看古董的手艺是我祖传了一点，我老丈人教了一点，勉强够用，解放前我家里是有名的晋商，开牙行的，不过\"大革命\"的时候，我的几个长辈都被斗得很惨，我老爷子心灰意冷，不想我再干这一行了，所以才送我去读大学，但是最后我还是没办法，逃不了这宿命。",
      "level": 3
    },
    {
      "id": "4.1.5",
      "text": "所以说有时候，命运这个东西，还真不能不去敬畏他。",
      "level": 3
    },
    {
      "id": "5",
      "text": "整件事情的开始是在1997年7月的太原南宫古玩市场。",
      "level": 1
    },
    {
      "id": "5.1",
      "text": "那时候南宫已经有了很大的规模，人山人海，几百个摊位，琳琅满目的瓷器、青铜器、木器充斥着视野。",
      "level": 2
    },
    {
      "id": "5.2",
      "text": "天气热得让人窒息，我一个人在人群里面挤来挤去，心里老大不痛快。",
      "level": 2
    },
    {
      "id": "5.3",
      "text": "那时候，我来山西已经有一个多月了，每天都在南宫逛着，也不知道是怎么回事情，特别不顺，连一件上眼的东西都没见着，看着满眼的古董爱好者在赝品堆那里挑来挑去，讨价还价，我就心烦意乱。",
      "level": 2
    },
    {
      "id": "5.4",
      "text": "我做的生意，叫做古董盘子，盘子口开在上海，每年都有两个月呆在山西，有时候下下乡村收收古董，有时候就在这市场里捣鼓一下，靠着自己的几分眼力讨讨生活。",
      "level": 2
    },
    {
      "id": "5.4.1",
      "text": "山西是中国文化荟萃之地，地下文物看陕西，地上文物看山西，当年山西开钱庄的老板汇通天下，富可敌国，大量的古物从全国各地会聚到山西，山西成为了古董买卖的中心，经过十年浩劫之后，古董大多流落民间，所以全国各地的人到山西来淘宝的很多。",
      "level": 3
    },
    {
      "id": "5.4.2",
      "text": "所谓古董盘子，就是指两地贩卖古董，赚取差价的意思，理论上来说，古董本身是没有实用价值的，他的价值由购买者自己的喜好来体现，所以我们这样的职业才有利可图。",
      "level": 3
    },
    {
      "id": "5.4.2.1",
      "text": "山西和上海的古董价格，就可能相差十倍以上。",
      "level": 4
    },
    {
      "id": "5.5",
      "text": "那一次，我到这里来主要是为一个上海的客人挑一些青铜器，最近几年青铜器的收藏风潮很火，大有赶超传统瓷器的意思。",
      "level": 2
    },
    {
      "id": "5.5.1",
      "text": "可是来回了几趟，基本没看到可能是真货的东西，甚至连能看得上眼的假货都没看到，后来挤到几个以前做过生意的摊主那里，递了几支烟聊了一会儿，才知道是怎么回事情，原来长沙那块儿严打盗墓，快一个多月了，拿着好东西那些地老鼠都没法运出来，货源没了，这里靠到民间去收的能有多少啊，自然是一片萧条。",
      "level": 3
    },
    {
      "id": "5.6",
      "text": "我一琢磨，心中已经有一丝绝望，这市场恐怕短时间恢复不过来，这一次可能得空手回上海。",
      "level": 2
    },
    {
      "id": "5.6.1",
      "text": "可怜我这单生意，油水还不少，就这么打了水漂，真是丧气，这水漂还是小，名气坏了，以后我这盘子要盘起来可就难喽。",
      "level": 3
    },
    {
      "id": "5.7",
      "text": "在市场里穿来穿去，也没有认真地看上什么东西，不知不觉着，日头已经往西走了，再过三十分钟。",
      "level": 2
    },
    {
      "id": "5.7.1",
      "text": "天一黑，就算有好东西我也不敢看了，因为傍晚是眼力最差的时候，这个时候什么假货都上来，太多太乱，青铜器的做假又是极其逼真的，稍微一个疏忽，就可能\"打眼\"。",
      "level": 3
    },
    {
      "id": "5.8",
      "text": "如果当时决定再看几眼，或者是坐哪里休息一下，下面的事情可能就完全和我没关系，可是命运就是这样，该是我碰上的，就是我碰上。",
      "level": 2
    },
    {
      "id": "5.9",
      "text": "我住的招待所就在南宫的边上，大概也就是一百多米的样子，是属于无证经营的那种，各色人等聚集，好在价钱便宜，经得起日子住。",
      "level": 2
    },
    {
      "id": "5.9.1",
      "text": "房间虽然只有五个多平方，但是我一个人住，又有独立卫生间，洗澡厕所都不用排队，这在这个招待所里，已经是总统套房的级别。",
      "level": 3
    },
    {
      "id": "5.9.1.1",
      "text": "此时我一身汗臭，就特别想念那两个人都挤不下的独立卫生间。",
      "level": 4
    },
    {
      "id": "5.10",
      "text": "才走了没几步，忽然一个人在后面用手指捅了我一下，我以为是小偷，忙一捂口袋转过身去一看，是一个干巴巴的小老头，大概五六十岁，一头的白发，穿着个土里土气的蓝色工作服，手里捂着个包，正眼巴巴地看着我，看样子是个苦命人。",
      "level": 2
    },
    {
      "id": "5.10.1",
      "text": "这老头不像是城里人，难道是找我问路的？",
      "level": 3
    },
    {
      "id": "5.10.1.1",
      "text": "我看着奇怪，问道，\"你干什么？\"",
      "level": 4
    },
    {
      "id": "5.10.2",
      "text": "老头先是鬼鬼祟祟地看了看四周，轻声对我说了一句：\"爬牙里抬子，等打？\"",
      "level": 3
    },
    {
      "id": "5.10.3",
      "text": "我一听，心说什么台子凳子的，还等打，你他娘的才等着挨揍呢，道：\"我也不要台子凳子。\"",
      "level": 3
    },
    {
      "id": "5.10.4",
      "text": "那老头愣了一下，似乎没听懂我说话，又说道：\"爬牙里抬子，等打等打？\"",
      "level": 3
    },
    {
      "id": "5.10.5",
      "text": "我心情不好，这时候有点火，便对他道：\"我不等打，你要是等打，随便去找个人踹一脚，包你不用等！\"",
      "level": 3
    },
    {
      "id": "5.10.6",
      "text": "那老头子挠了挠头，给我的表情吓到了，看了我几眼，慢慢就走开去。",
      "level": 3
    },
    {
      "id": "5.10.7",
      "text": "\"有病\"我心里骂了一句，继续向招待所走去，直走到南宫门口，回头一看，那老头没跟来，不知道走到哪里去了。",
      "level": 3
    },
    {
      "id": "5.10.8",
      "text": "我心里觉得纳闷，他说的话不是山西的方言，也不像是周边省份的，他到底是干什么的？难道是要饭的？",
      "level": 3
    },
    {
      "id": "5.10.9",
      "text": "如果要饭的，这老头也算是聪明，淘到宝贝的人心情好，遇到乞丐自然就会施舍，可以这老头运气不好，碰上我心情很差。",
      "level": 3
    },
    {
      "id": "5.11",
      "text": "我回到招待所自己常包的房间，先是洗了个澡把汗给洗了，然后就去下面的饭店吃饭，饭店的老板是我的老乡，姓李，名少爷，因为是这家店的少东，所以我们都叫他少爷。",
      "level": 2
    },
    {
      "id": "5.11.1",
      "text": "一直以来我来太原都在他这里吃，这人好古，对古玩特别感兴趣，每次我过来，他就会找我聊古玩的事情，还不时拿出一些所谓的宝贝，让我来看，所以我一坐下，看着两条腿夹着两瓶啤酒走到我边上，就知道这家伙又来了。",
      "level": 3
    },
    {
      "id": "5.11.1.1",
      "text": "抬头一看，果然是他，正嘎巴嘎巴嚼着花生米，一手两瓶啤酒，一手一碟蜜汁叉烧鸭，坐到我的对面，问道：\"哥们儿，今天收获如何？\"",
      "level": 4
    },
    {
      "id": "5.11.2",
      "text": "我接过啤酒，长叹一声说什么收获啊，屁都没有，再这么折腾下去，我那盘子早晚就得关门，到时候咱就在这里摆个地摊卖卖西贝货。",
      "level": 3
    },
    {
      "id": "5.11.3",
      "text": "少爷笑道：\"那是你自己找的，你想你那上海客人又不是什么火眼金睛，你在这里掏个百八块钱的高仿货或是找几件残品，去西城找几个师傅-旧貌换新颜-，大的修小，小的修长，不就成了，何必和自己过不去呢，我就不相信你那上海客人的眼力能有这么好。\"",
      "level": 3
    },
    {
      "id": "5.11.4",
      "text": "我摇了摇头，笑而不答，少爷的办法，是人都想得到，但是古董盘子这一行，不像是摆地摊的，来一个杀一个，杀一百是一百，在这一行混，就得让人放心，不然谁从你这里拿货？",
      "level": 3
    },
    {
      "id": "5.11.4.1",
      "text": "要是骗一次给你骗过去了，日后总有机会被识穿，那时候在这行里就没办法立足了。",
      "level": 4
    },
    {
      "id": "5.11.5",
      "text": "少爷看我不说话，知道我不同意他的看法，道：\"哎，你别笑，我这话实在啊，你看这世道，早也关门，晚也关门，你不妨关门前捞上一笔，总比饿死强啊，现在走盘子的难度你不是不知道，早认识的几个早改行了。\"",
      "level": 3
    },
    {
      "id": "5.11.6",
      "text": "少爷这论调我每天几乎都能听一遍，这时哎了一声，摆手道：\"你他娘的别扯了，你又不是这行里人，你发表什么意见，我做事情有自己的原则。\"",
      "level": 3
    },
    {
      "id": "5.11.7",
      "text": "少爷呵呵一声，道：\"原则？做古董的人还有原则，哎，亏的你穷，没办法了。\"",
      "level": 3
    },
    {
      "id": "5.11.8",
      "text": "少爷奚落我是正常的，都说乱世黄金，盛世古董，这年头哪个做古董，就算最差也是个万元户，可是我，就一身行头还行，身上无半两余钱，都是吃光用光，身体也不算健康，这种局面的确和我的原则有关系，山西摆地摊的，没一个笨的，只要是好东西，就不便宜，我又不卖假货，加上偶而打个眼给人坑一下，这钱就不留我啊。",
      "level": 3
    },
    {
      "id": "5.11.9",
      "text": "说起心中凄苦，又想起那青铜器的生意，不由唏唏不已。",
      "level": 3
    },
    {
      "id": "5.12",
      "text": "正说着，忽然从门口进来一人，少爷看到客人自然要招呼，马上起身，问道：\"老板，吃点什么？\"",
      "level": 2
    },
    {
      "id": "5.12.1",
      "text": "少爷一见是小生意，就不去招呼了，进到厨房吩咐厨子烧东西，然后自己又走出来，继续跟我聊天。",
      "level": 3
    },
    {
      "id": "5.12.1.1",
      "text": "我就压低声音，用筷子头指了指边上那人，问道：\"这人是哪里人，你听得出吗？\"",
      "level": 4
    },
    {
      "id": "5.12.2",
      "text": "\"山西啊，山西口音\"少爷也压低了声音：\"你在山西也呆了不少时间，这点耳力都没有？\"",
      "level": 3
    },
    {
      "id": "5.12.3",
      "text": "我略微转头，偷偷看了看那低着头不知道在想什么的老头，心说山西，那刚才他和我说的那些话是山西话，不是啊，虽然我很多时候都在外省，但是山西话我不可能听不懂啊，那等打等打？难道是新发明的山西土语？",
      "level": 3
    },
    {
      "id": "5.12.4",
      "text": "少爷拍了我一下，问道：\"你搞什么？倒古董倒疯了，连老头也喜欢了？\"",
      "level": 3
    },
    {
      "id": "5.12.5",
      "text": "我一听失笑，转过头道：\"胡扯什么？我是觉得有件事情很奇怪……\"",
      "level": 3
    },
    {
      "id": "5.12.5.1",
      "text": "说着突然想到少爷也是山西腔，马上问道，\"哎，对了，你是山西本地人吧，我问你，山西话里面-等打等打-，是什么意思？\"",
      "level": 4
    },
    {
      "id": "5.12.6",
      "text": "\"等打等打？\"少爷眉头一皱，脸色也一变，\"你哪里听来这话的？\"",
      "level": 3
    },
    {
      "id": "5.12.7",
      "text": "\"这是什么话？\"我问道，看他表情有变，觉得奇怪。",
      "level": 3
    },
    {
      "id": "5.12.8",
      "text": "少爷压低声音：\"这是南爬子的蛮话啊，老子以前听几个在宾馆里的老头子说过几句，我也是听不懂去问我大爷，是我大爷和我说的。\"",
      "level": 3
    },
    {
      "id": "5.12.9",
      "text": "我哦了一声，心里一惊，转头再看那老头，心说，难道这其貌不扬的老头，竟然是个南爬子？",
      "level": 3
    },
    {
      "id": "5.12.10",
      "text": "南爬子是山西一带外八行的人对盗墓贼的称呼，我也听我家里人说过，南爬子很神秘，山西的古墓也很多，而且山西的大墓，容易出粽子。",
      "level": 3
    },
    {
      "id": "5.12.10.1",
      "text": "天下养尸归\"两西\"，第一是陕西，第二就是山西，南爬子在山西讨生活，手段要比其他地方的走地仙，穿山鬼高明很多。",
      "level": 4
    },
    {
      "id": "5.12.11",
      "text": "一般传得比较普遍的传说里，南爬子都是两个人一起，一老一少，穿大褂，带毡帽，有的还摆摊子给人算命，活脱脱就是风水先生一个，他们一般不亲自下地挖洞盗墓，他们平日里用来营生的手段，叫做\"认眼\"，也就是把为其他盗墓贼定点，他们有特殊的手段，可以理得山川大气，知道古墓在什么地方，行情最好的时候，十五块大洋走一次，四处一看，用扇子一点，点了就走，从不走空。",
      "level": 3
    },
    {
      "id": "5.12.12",
      "text": "只有一些特殊的情况，比如说世道不好，或者碰上规格非常高的古墓时，他们才会亲自下地，行话里叫支锅，锅支起来，就是盗成了，锅支不起来，就是走空了。",
      "level": 3
    },
    {
      "id": "5.12.13",
      "text": "南爬子盗墓，很讲究规矩，从不结大伙，一般都是由舅舅带着外甥，盗墓的时候，舅在外甥在内，进墓之前，必须洗手，点9寸长香，香灭之前，人必须出来。",
      "level": 3
    },
    {
      "id": "5.12.14",
      "text": "他们和关外的鞑子一样，做活的时候不说人话，有自己的一套暗语。",
      "level": 3
    },
    {
      "id": "5.12.14.1",
      "text": "这套语不是行内人，基本上听不懂，而且据说学这门语言，必须入得南爬子这一门，要是你没有入这门，就算有人教，你也学不会，有点西藏天授诗人的感觉。",
      "level": 4
    },
    {
      "id": "5.12.15",
      "text": "我问少爷：\"那这等打等打？是什么意思？你知道不知道？\"",
      "level": 3
    },
    {
      "id": "5.12.16",
      "text": "少爷摇头：\"我又不是南爬子，怎么可能知道……干什么，这老头子，难道是……\"",
      "level": 3
    },
    {
      "id": "5.12.17",
      "text": "我点点头，把刚才在南宫门口发生的事情和他说了一遍，少爷一听，眼睛一亮：\"我说，老许，你运气不错啊，你那青铜器，可能有指望了。\"",
      "level": 3
    },
    {
      "id": "5.12.18",
      "text": "我一听奇怪，\"为什么这么说？\"",
      "level": 3
    },
    {
      "id": "5.12.19",
      "text": "\"南爬子进城，身上肯定带着好东西呢，南爬子的东西不能见光，他们只找知道规矩的做买卖，刚刚他和你说那话，他又在南宫门前转着，估计是有东西要出手。\"",
      "level": 3
    },
    {
      "id": "5.12.19.1",
      "text": "少爷眯起眼睛看了看，看到了那老头捂的破包，道：\"你看那小破包，那是精气横流啊，没错，你的买卖来了。\"",
      "level": 4
    },
    {
      "id": "5.12.20",
      "text": "我半信半疑，这哪有这么好的事情，我们这一行什么骗子没见过，上次我在河南，碰上一老实巴焦的农民，那样子，要多老实有多老实，都可以说有点傻了，说他从泥里耙出来一碗，就二十块钱想卖，我拿过那碗来一看，照他脑袋上就是一下，那他娘的就是高仿瓷，后来在他身上一搜，这一身山沟土味道的农民兄弟，竟然口袋有上海大世界舞厅的票根。",
      "level": 3
    },
    {
      "id": "5.12.21",
      "text": "古董界的骗子无一不是老实憨厚的，因为做古董的人都有一种爆富心里，总是希望自己能够捡到别人疏忽的宝贝，老实敦厚的相貌，容易让人放松警惕。",
      "level": 3
    },
    {
      "id": "5.12.22",
      "text": "看着少爷那样子，要不是我和他几年的酒肉关系了，我真还会以为他娘的和着老头串通好，在和我演双簧呢。",
      "level": 3
    },
    {
      "id": "5.12.23",
      "text": "一边还在怀疑，少爷已经让人拿了瓶大曲酒过来，塞给我道：\"南爬子一天三顿酒，拿着这个，别说少爷我没仗义过你，日后发了财也好相见，快去！别让别人给堵了。\"",
      "level": 3
    },
    {
      "id": "5.12.24",
      "text": "我轻声对少爷道：\"算啦，这年头骗子太多了，咱们少惹这种人，该是穷就是穷。\"",
      "level": 3
    },
    {
      "id": "5.12.25",
      "text": "少爷把头一转，嘿嘿一笑：\"你这人，所以说有杀人的胆子却只有被别人杀的命，太墨守陈规。\"",
      "level": 3
    },
    {
      "id": "5.12.25.1",
      "text": "说着就把我的啤酒拿开，把白酒塞给我，\"你那眼力，河东也是十名之内，你还怕什么啊？\"",
      "level": 4
    },
    {
      "id": "5.12.26",
      "text": "我一想，倒也是，要是个骗子也就算了，要不是，那就是老天给我发达的机会，我还不要，那要是从别人那里听来那老头身上真有好东西，其他人买了发财了云云，那我还不一口气背过去。",
      "level": 3
    },
    {
      "id": "6",
      "text": "老头子闷头吃面，我端着菜和酒坐到他对面，他就有点奇怪，面也吃的不自在起来，也不问我干什么，手不自觉就捂到自己破包上去了。",
      "level": 1
    },
    {
      "id": "6.1",
      "text": "我一看这架势，似乎这包里真有什么好东西，心说难不成还真给少爷说中了？",
      "level": 2
    },
    {
      "id": "6.2",
      "text": "一边的少爷上来两只杯子，一只就放到老头子面前，老头子一看，以为我这边有人要占他座位，站起来就想换位置。",
      "level": 2
    },
    {
      "id": "6.3",
      "text": "我心说这人也活得窝囊，一把拉住他，叫道：\"哎，别走啊。\"",
      "level": 2
    },
    {
      "id": "6.4",
      "text": "老头子端着个面，笑道：\"给你朋友坐，给你朋友坐，我到那边去吃就行了。\"",
      "level": 2
    },
    {
      "id": "6.5",
      "text": "我把他按下，道：\"什么朋友，这酒是请你喝的。\"",
      "level": 2
    },
    {
      "id": "6.5.1",
      "text": "说着把酒一开，就给他倒上。",
      "level": 3
    },
    {
      "id": "6.6",
      "text": "老头子看着奇怪，但是酒味道一起来，我就看他腿软，想走也走不动，问我：\"请我吃的？我又不认识你，为什么要请我吃酒啊？\"",
      "level": 2
    },
    {
      "id": "6.7",
      "text": "我递上一支烟，他摆手不要，我一定要塞给他，他就接过来，也不抽，放到一边。",
      "level": 2
    },
    {
      "id": "6.7.1",
      "text": "我露出一个专业的古董买卖者表情，笑道：\"你不认识我，我可认识你。\"",
      "level": 3
    },
    {
      "id": "6.8",
      "text": "老头子更迷糊了，问道：\"你认识我，我就没道理不认识你啊？\"",
      "level": 2
    },
    {
      "id": "6.9",
      "text": "我假装看了看四周，然后压低了声音，指了指他手里的破包，轻声对他了说了一句：\"你别不相信，我不仅认识你，我还认识，你那包里的东西。\"",
      "level": 2
    },
    {
      "id": "6.10",
      "text": "老头子脸色马上一变，一捂那破包就站了起来，我一看这架势，这老头子似乎想要拔腿就跑，心说至于嘛，紧张成这样？忙站起来拦住他的去路，说道：\"好说好说，我还能抢你的不成？\"",
      "level": 2
    },
    {
      "id": "6.11",
      "text": "老头子不吃我这一套，问道：\"你到底是干什么的？\"",
      "level": 2
    },
    {
      "id": "6.12",
      "text": "我示意他坐下来，轻声就对他道：\"你刚才在南宫外头，不是问我等打不等打吗？你还记得不记得？\"",
      "level": 2
    },
    {
      "id": "6.13",
      "text": "老头子疑惑地看着我，好像在回忆，但是没回忆起来，摇头道：\"不记得咧。你就和我直说，你到底是干什么的？我看你笑眯眯，不是个好东西。你要不说我就走咧。\"",
      "level": 2
    },
    {
      "id": "6.14",
      "text": "我心里骂了一声，拍了他一下，轻声说道：\"您看您这记性，我不就是个南宫里收古董的吗，您是真不记得还是假不记得？\"",
      "level": 2
    },
    {
      "id": "6.15",
      "text": "老头子一听，人就静了下来，打量了我一下，问道：\"你真是个收古董的？那你太神通广大咧，你咋知道我有东西要卖？\"",
      "level": 2
    },
    {
      "id": "6.16",
      "text": "我咳了一声，指了指他的包，道：\"您看您整天捂着个包，又操着一口蛮话在南宫门口转悠，谁都知道您是老南爬子进城来倒货来了，这都不用教的。\"",
      "level": 2
    },
    {
      "id": "6.16.1",
      "text": "这是胡说，能看出他身上带着货，其实还真不容易。",
      "level": 3
    },
    {
      "id": "6.17",
      "text": "老头子却一愣：\"啥蛮话？啥是南爬子？\"",
      "level": 2
    },
    {
      "id": "6.18",
      "text": "我一听也奇怪，道：\"就是你和我说的那等打不等打啊？\"",
      "level": 2
    },
    {
      "id": "6.19",
      "text": "\"哦，那是蛮话，我不知道，这话是我朋友教我的。说是要卖古董的，都得这么吆喝。\"",
      "level": 2
    },
    {
      "id": "6.20",
      "text": "我一听，感情他自己也不知道自己说的是什么，笑道：\"老爷子，今时不同往日，你那朋友教的这鬼话，现在没人讲了，所以你东西才卖不掉，咱们坐下说，别给人看戏。\"",
      "level": 2
    },
    {
      "id": "6.21",
      "text": "说着指了指另外几个在吃饭的客人，那几个人正看戏一样看着我们，不知道我调戏一老头干什么。",
      "level": 2
    },
    {
      "id": "6.22",
      "text": "那老头子看到其他人都在看我们，似乎也明白了，坐回到座位，低声道：\"难怪卖了六七天都没人理我──老板，那请我喝酒的意思，是想收我的东西？\"",
      "level": 2
    },
    {
      "id": "6.23",
      "text": "我不知道他包里到底是什么东西，看他這樣子，也是个分辨不出古玩价值的青头，但是我上当上多了，知道越是这样的人，越有可能是骗子，不敢小瞧他，道：\"对，只要你要想出手，不过我得先看看你的东西。\"",
      "level": 2
    },
    {
      "id": "6.24",
      "text": "那老头子就怀疑地看了我一眼，小心翼翼地拿出了包，拿了一半却又拿了回去：\"要不换个地方，我朋友说我卖这东西，逮住得枪毙，我带出来可不容易啊。\"",
      "level": 2
    },
    {
      "id": "6.25",
      "text": "我听了好笑，心说你里面是兵马佣还是司母方鼎啊？逮住了还得枪毙，真是越看他越像骗子，不过看他的认真劲，不好去逆他的意思，一看四处也都是南宫出来的人，现在一个个都竖着耳朵听呢，他说得也有道理，于是指了指一边厨房的门，道：\"也行，好东西咱们别给其他人看，索性咱们进内屋，我仔细和您说说这事？\"",
      "level": 2
    },
    {
      "id": "6.26",
      "text": "这一小房间后面都不通，很是清净，有事情我就在这地方睡个午觉什么的，少爷摆上一圆桌子，我就让这老头别客气。",
      "level": 2
    },
    {
      "id": "6.27",
      "text": "他早就对这白酒垂涎欲滴，一扬头就喝了一大口，脸上马上就泛红，然后夹起菜就吃。",
      "level": 2
    },
    {
      "id": "6.27.1",
      "text": "看样子没吃过好东西似的。",
      "level": 3
    },
    {
      "id": "6.28",
      "text": "我一看这老头也太嫩了，哪有跑江湖的，人说让你喝酒你就喝的，可想到这里，心里忽然一个激灵，心说这家伙该不是个骗吃骗喝的，等一下他包里一拿出来，是一大瓦片，我们他娘的气死还贴上一桌子菜。",
      "level": 2
    },
    {
      "id": "6.29",
      "text": "想着我就不让他多吃了，问道：\"老爷子，你别光顾着吃，咱们边吃边谈，你那东西，能让我们看了吧？\"",
      "level": 2
    },
    {
      "id": "6.30",
      "text": "老头子却不理我，两口就把一杯白酒喝干了，还真不客气，自己又给倒上，一下子酒瓶子就见底，道：\"你喝这酒不错\"",
      "level": 2
    },
    {
      "id": "6.31",
      "text": "我一看真他娘的能喝，于是让少爷再拿两瓶子汾酒来，让他悠着点。",
      "level": 2
    },
    {
      "id": "6.32",
      "text": "老头子只顾着吃，我又问他要了几次东西，他都没听到似的，最后我把他那酒给抢了过来，他才把那只破包塞给我。",
      "level": 2
    },
    {
      "id": "6.33",
      "text": "我急着打开，心说要是个破烂，就别怪我不尊敬老人，保证打得你把吃下去的全吐出来。",
      "level": 2
    },
    {
      "id": "6.34",
      "text": "这包是解放前的东西，是晚清时候地主婆出门带的那种，虽然味道很重，但是拿到南宫，也能对付个几张大团结，我拉开包的拉链，往里面一看，里面全是报纸包的一团一团的东西。",
      "level": 2
    },
    {
      "id": "6.35",
      "text": "老古话说，一个字压一个鬼，所以明器都要用有字的东西包，以前是用写着字的宣纸，现在自然是用报纸，上面这么多字，来一个加强师的鬼都给你包死。",
      "level": 2
    },
    {
      "id": "6.35.1",
      "text": "现在这规矩其他地方都有，很多行业，用报纸来包东西，并不是只图报纸方便而已。",
      "level": 3
    },
    {
      "id": "6.36",
      "text": "我拿出来一数，有六个，三个大，二个小，还有一个是扁的。",
      "level": 2
    },
    {
      "id": "6.37",
      "text": "拆开大的‏:‏一看，我的耳根就开始跳了，报纸里还全是泥，我稍微一看，就发现是一只西汉时候的双耳细颈青铜觯，看着货色和保存的程度，这一用来喝酒的东西，当时可能只有二十文钱不到，现在五千块钱是不在话下。",
      "level": 2
    },
    {
      "id": "6.38",
      "text": "那几年五千块是什么概念？我看着就觉得有种晕呼的感觉，赶紧去看其他几样，另外那两个小的，二个大的，都是大小形状不同的青铜觚和青铜卣，一看就是同一套里的，我一估计，不得了，这一套东西，在南宫就能卖到三万，要去了上海或者北京，那真不好说了。",
      "level": 2
    },
    {
      "id": "6.39",
      "text": "最后一扁的东西，是一个片腐朽青铜片，上面刻着鸟篆铭文和云雷纹路，似乎是从一大的青铜器上掰下来的。",
      "level": 2
    },
    {
      "id": "6.40",
      "text": "光这几个小件，已经够我小赚一比了，看这青铜片，估计他可能还有大东西没带出来，心里不由咋舌头，这些东西，别说请一顿酒，就算是请他吃一个礼拜，也是凤毛麟角的事情。",
      "level": 2
    },
    {
      "id": "6.41",
      "text": "我看得目瞪口呆，就问那老头子：\"老爷子，这些个东西，您都是从哪里弄来的啊？我靠，可把我晃了眼了。\"",
      "level": 2
    },
    {
      "id": "6.42",
      "text": "老头子看了我一眼，道：\"这你就别问了，想要就开个价吧。\"",
      "level": 2
    },
    {
      "id": "6.43",
      "text": "这时候我还真不敢随便开价，这些东西的规格太高，而且成色很好，现在很少能看到这种档次的东西，我感觉这东西可能不是盗墓盗出来的，而可能是从那些收藏这些东西的有钱人家里偷出来的。",
      "level": 2
    },
    {
      "id": "6.43.1",
      "text": "要是盗墓的东西我不怕，死人不会报警，但是要是从人家里偷出来的，那这东西就烫手，一流到市面上去，很可能就会查到我头上来。",
      "level": 3
    },
    {
      "id": "6.44",
      "text": "我左右为难，想了想说道：\"老爷子，不瞒您说，您这东西成色太好，拿出去，敢收的人不多，你要不就实话告诉我，你这东西怎么来的，要不，我就帮你介绍几个胆子大的，你给我点介绍费得了，不然要是你这东西是黑货，那我就给您给害了。\"",
      "level": 2
    },
    {
      "id": "6.45",
      "text": "\"黑货，甚是黑货？\"老头子不解，不过一看我又不买这东西了，他也紧张起来，酒也停了。",
      "level": 2
    },
    {
      "id": "6.46",
      "text": "我把这黑货解释了一遍给他听，道：\"这什么东西我都敢收，就是这黑货，我不敢收啊，雷子比鬼还厉害。\"",
      "level": 2
    },
    {
      "id": "6.47",
      "text": "他就若有所思地想了想，对我道：\"老板你放心，这些不是黑货，这些东西，是我从黄河里捞出来的。\"",
      "level": 2
    },
    {
      "id": "6.48",
      "text": "\"黄河里？\"我真没想到是这个回答。",
      "level": 2
    },
    {
      "id": "6.49",
      "text": "\"对，说起来也有半年时间了。\"",
      "level": 2
    },
    {
      "id": "6.50",
      "text": "老头子把酒一放，似乎下了决心，\"你别看我这个样子，我其实也是个技术工，我是黄河上跑船的。",
      "level": 2
    },
    {
      "id": "6.50.1",
      "text": "这事情是这样的──\"",
      "level": 3
    },
    {
      "id": "7",
      "text": "王全胜和几个人承包了一艘小船，用一种特别的爬犁，沉入黄河中，顺流纤拉，将黄河底淤泥的垃圾抓进爬犁里，再打捞上来用水冲洗后分拣。",
      "level": 1
    },
    {
      "id": "7.1",
      "text": "基本上百分之九十捞上来的垃圾都是没用的，又给重新倾倒回黄河里，只留下金属、塑料和玻璃，可以回收卖钱。",
      "level": 2
    },
    {
      "id": "7.2",
      "text": "虽然如此，王全胜一年的收入还是比较可观，因为他所承包的那一段流域，是黄河的沉淀区。",
      "level": 2
    },
    {
      "id": "7.2.1",
      "text": "河面宽，流速慢，很多垃圾都沉淀在这一段。",
      "level": 3
    },
    {
      "id": "7.2.2",
      "text": "他一个来回，最少都能赚二十块钱，那个年代，那个地方，这样的收入是不可想象的。",
      "level": 3
    },
    {
      "id": "7.3",
      "text": "现在他手里的这几只青铜器，是去年十二月份的时候，他从水坝下面捞上来的，他说当时他的爬犁拉到那地方的时候，突然水面上就打了旋，他的经验就知道，这是河底的淤泥塌下去了。",
      "level": 2
    },
    {
      "id": "7.4",
      "text": "黄河底很不平坦，很多地方下面是架空，给他的爬犁一拉，平衡打破，上头架空的东西就会沉下去，要是爬犁拉到的东西很重，王全胜的船就可能会给扯到水线下面去，所以他马上就放开了爬犁的绳子，让它往下沉，结果奇怪的是，他放下了六七米的绳子，爬犁却还在往下掉，似乎下面塌出的空洞，非常深。",
      "level": 2
    },
    {
      "id": "7.5",
      "text": "一直到绳子放下了十多米，他才感觉到底了，然后他就尝试把爬犁拖出来，前前后后几个方向拖了很久，爬犁才松动。",
      "level": 2
    },
    {
      "id": "7.6",
      "text": "他们几个人吃力地拉动绳子，想把爬犁从水里拉上来，可是还没出水呢，就有人叫了一声，他们一看，一下子都不敢拉了，原来水下的爬犁上面钩着的，竟然好像是一个人。",
      "level": 2
    },
    {
      "id": "7.7",
      "text": "〖bt1〗三、陶人俑",
      "level": 2
    },
    {
      "id": "7.8",
      "text": "捞到死人对于他们来说，是非常不吉利的，但是如果已经捞到了，就必须让他出水，不然下次再出船，这死人就可能来翻他们的船。",
      "level": 2
    },
    {
      "id": "7.9",
      "text": "王全胜不是第一次碰到过这种情况，虽然不愿意，但是也没有办法，老祖宗的规矩不能破坏，于是就让他们继续拉。",
      "level": 2
    },
    {
      "id": "7.10",
      "text": "拉出水面一看，却发现爬犁钩着的不是死人，而是一个黑色陶人。",
      "level": 2
    },
    {
      "id": "7.10.1",
      "text": "这个黑色陶人一看就是古代的东西，是一个半蹲着的女人，等真人大小，手做着一个动作，应该是本来拿着什么东西的。",
      "level": 3
    },
    {
      "id": "7.11",
      "text": "王全胜一看坏了，这好像是窨俑，古时候一旦有人溺水失踪，他的亲人就会将一个失踪人模样的陶人沉到水里于河神交换，尸体就会浮上来。",
      "level": 2
    },
    {
      "id": "7.12",
      "text": "这东西比死人还不吉利，王全胜就直骂晦气，但是他们仔细一看这陶人，发现又不对，这陶人纹路细腻，动作生动，表情祥和，看上去非常精致，不像是穷苦人家自己烧制的。",
      "level": 2
    },
    {
      "id": "7.13",
      "text": "几个人一琢磨，哦，是墓人。",
      "level": 2
    },
    {
      "id": "7.14",
      "text": "这些人迷信思想很重，他们都知道这种东西是坟墓里才有的，意识到自己刚才那一耙子，可能耙到了埋在黄河底的什么古墓了，非常害怕，连碰也不敢碰，就想把这东西扔回水里去。",
      "level": 2
    },
    {
      "id": "7.15",
      "text": "但是他船上有一个合伙人，却阻止了他们，这个人外号叫二麻子，以前做过古玩，客观地评价一下，这人就是比王全胜有见识，他一看到这陶人，眼睛就放光，就知道自己财路来了。",
      "level": 2
    },
    {
      "id": "7.16",
      "text": "就让他们把陶人搬上船，告诉他们这东西值钱，可以卖给国家博物馆，外国人也喜欢，捞到这东西，是上天给你的福气。",
      "level": 2
    },
    {
      "id": "7.17",
      "text": "王全胜听了将信将疑，说捞死人的东西，会遭报应的，但是几个年轻人都是相信二麻子，几个人又下去几耙子，结果又钩上几只形状像夜猫子的大型青铜器（我知道这是鸟尊），上面刻满了鸟篆铭文。",
      "level": 2
    },
    {
      "id": "7.18",
      "text": "鸟尊大概有半米高，上面的青铜锈迹斑斑，腐蚀得很厉害，二麻子一刮鸟尊的表面，上面的青铜锈就成片地往下掉。",
      "level": 2
    },
    {
      "id": "7.19",
      "text": "这几个小的青铜器也是这样捞上来的，王全胜基本上见都没有见过，他当时不知道这些破铜烂铁也值钱，但是二麻子就告诉他们，这些东西有的比金子还值钱，要他们能拿多少就拿多少。",
      "level": 2
    },
    {
      "id": "7.20",
      "text": "几个人心生畏惧，也没敢多捞，只有二麻子，他不耐其烦地下耙子，似乎想要把下面能捞的都捞上，在水里，他们的耙子很明显几次都钩到一个非常沉重的东西，一旦钩到这个东西，耙子就起不上来，不论怎么样都动不了。",
      "level": 2
    },
    {
      "id": "7.21",
      "text": "二麻子说可能是钩到了棺材，不死心，最后耙子都给拉直了，才钩上来一片青铜片，王全胜就不敢乱来了，说吃饭的家伙是祖传的，弄坏了不吉利。",
      "level": 2
    },
    {
      "id": "7.21.1",
      "text": "老祖宗会怪罪。",
      "level": 3
    },
    {
      "id": "7.22",
      "text": "于是把他们捞上来的东西冲洗干净，用布盖上，几个人不敢白天上岸，一直等到晚上，几个人就才连夜把东西搬回村里，逃回了自己家。",
      "level": 2
    },
    {
      "id": "7.23",
      "text": "他们等了几天，似乎没人发现这事情，二麻子就放下心来，带着一只小青铜片出了镇，和他们说到太原府找他的娘舅帮忙，找几个主顾来，把这些东西卖了换钱。",
      "level": 2
    },
    {
      "id": "7.24",
      "text": "这一去就是六个半多月，前几天他才打电话回来，说他找到主顾了，让他们找个人带几件东西上来交货。",
      "level": 2
    },
    {
      "id": "7.25",
      "text": "几个人其实根本就指望这钱，当时半年多没见着二麻子，以为这东西卖不掉了，跑去指不定能不能拿得到钱，说不定连路费也贴进去，正巧那时候正在农忙，谁也不肯去，王全胜最老实，就把这事情推给他了。",
      "level": 2
    },
    {
      "id": "7.26",
      "text": "王全胜回家和老婆一说，要出门，他老婆就不肯，结果两个人大吵了一架，他一怒之下，就带着东西，坐火车到了太原。",
      "level": 2
    },
    {
      "id": "7.27",
      "text": "来之前，二麻子让他去南宫找他，他一路问了一圈，找到了二麻子娘舅的摊子，却不见开门，他是头一回进城，也没个地方歇脚，就只好在南宫门口等，晚上就窝在树下，这一等就是七八天，他来时候的钱也用得差不多了，也不知道二麻子出了什么事情，就是没出现。",
      "level": 2
    },
    {
      "id": "7.28",
      "text": "他是和他媳妇吵了架出来的，就这么回去，在家里肯定是抬不起头来，想来想去，把心一横，心说这里不是卖古董的吗？把这些东西给卖了，让那婆娘也看看，自己不是这么窝囊的人。",
      "level": 2
    },
    {
      "id": "7.29",
      "text": "不过他这人天生不会说话，也不知道这做买卖，怎么开这口，一直一直晃来晃去，那句南爬子的蛮话，也是那二麻子扯淡的时候教给他的，他以为还真是这么回事情，问了几次，都遭了白眼，结果东西也没出手。",
      "level": 2
    },
    {
      "id": "7.29.1",
      "text": "晃了两天，钱也用完了，锐气也没了，心说回去给老婆骂就骂吧，这日子还得过啊，于是乎准备着吃完面，就回乡去，没想到碰上我们了。",
      "level": 3
    },
    {
      "id": "7.30",
      "text": "王全胜喝了点酒，酒后吐真言，虽然口齿并不怎么清楚，我还是听了个八九不离十，直听得遍体生寒。",
      "level": 2
    },
    {
      "id": "7.31",
      "text": "这黄河里的事情真是说不清楚，淤泥里什么都有，我心说下次说不定还能捞个飞碟上来。",
      "level": 2
    },
    {
      "id": "7.32",
      "text": "但是这种事情，只要是在黄河边上的人，基本上都听老人讲过，所以这故事也有可能是他胡诌的，王全胜这个人看上去虽然憨厚，但是我看得出从他骨子里透着精明，他的憨厚，只是因为他的见识少，并不是真的笨。",
      "level": 2
    },
    {
      "id": "7.33",
      "text": "我暂且听着，也不全信，对他道：\"那你这些个东西，已经是捞上来的全部了？\"",
      "level": 2
    },
    {
      "id": "7.34",
      "text": "王全胜点头，就打着酒嗝问我：\"我身边就都在这里了，不过我家里还有。老板，你可看也看过了，听也听过了，这些个东西，你能给我多少钱？\"",
      "level": 2
    },
    {
      "id": "7.35",
      "text": "我心里一琢磨，二麻子这种人，肯定不会给他们分很多钱，他们也绝对想不到这东西能值到上万，但是我这人不能太贪，于是假装又看了看，对他道：\"可惜，你这东西给你在泥里埋了，样子给你埋残了，本来还能卖得更高，这样吧，咱们也别论这个价钱，我就吃点亏，多给你一点，一件东西，我给你一千元，下次生意，怎么样？\"",
      "level": 2
    },
    {
      "id": "7.36",
      "text": "王全胜\"砰\"的一声就坐在地上了，一下子就站不起来了，我赶紧把他拉起来，道：\"你什么毛病啊你？\"",
      "level": 2
    },
    {
      "id": "7.37",
      "text": "\"哎呀我的娘啊，这东西那是真值钱啊，六样，可就是六千元？我得掏多少沙子才能赚这么多啊。\"",
      "level": 2
    },
    {
      "id": "7.38",
      "text": "王全胜发着抖道。",
      "level": 2
    },
    {
      "id": "7.39",
      "text": "我呵呵一笑，一边出去让少爷帮我准备钱，一边道：\"不不，你这五样东西，我给你五千元，你这青铜片我可不要，这是破烂。\"",
      "level": 2
    },
    {
      "id": "7.40",
      "text": "王全胜也点头，道：\"是是，我给喝糊涂了。\"",
      "level": 2
    },
    {
      "id": "7.41",
      "text": "趁着少爷去准备钱的工夫，我就继续问他，这青铜片是什么东西？",
      "level": 2
    },
    {
      "id": "7.42",
      "text": "王全胜说，那就是从水下那大东西上剥落下来的，二麻子让他也带一片上来，好找几个行家去看看。",
      "level": 2
    },
    {
      "id": "7.42.1",
      "text": "然后问我要不要，要的话，就送给我得了。",
      "level": 3
    },
    {
      "id": "7.43",
      "text": "我对这东西很有兴趣，心想恭敬不如从命，就接了过来，这时候少爷拿来钱，我一张一张数给他，他拿过来之后又数了好几遍，才揣到兜里，我和他也一样，仔细查看了好几遍这些青铜小件，确定不是假货，也给揣到兜里。",
      "level": 2
    },
    {
      "id": "7.44",
      "text": "王全胜一下子心情大好，舌头也利索多了，就叫着这顿他来付账，又叫着少爷上酒，我一看这家伙到底能喝多少啊，又上了一瓶白酒，一瓶汾酒。",
      "level": 2
    },
    {
      "id": "7.45",
      "text": "他这个时候已经把我当成知己一样，一个劲儿的给我倒酒，还说着，要不到..."
    }
  ],
  "concepts": [
    {
      "name": "黄河",
      "frequency": 26,
      "context": "The Yellow River is a central geographical element where the story originates and the mysterious events unfold."
    },
    {
      "name": "奇闻",
      "frequency": 2,
      "context": "Refers to strange or unusual occurrences, forming the basis of the narrative."
    },
    {
      "name": "村子",
      "frequency": 13,
      "context": "The setting for the initial mysterious events related to the Yellow River."
    },
    {
      "name": "老人",
      "frequency": 7,
      "context": "Sources of traditional knowledge and stories about the Yellow River and local legends."
    },
    {
      "name": "黄沙",
      "frequency": 5,
      "context": "The commodity that the villagers trade, which is linked to the Yellow River's sediment."
    },
    {
      "name": "黄沙厂",
      "frequency": 2,
      "context": "Villages specialized in the trade of Yellow River sand, forming their own interest groups."
    },
    {
      "name": "枯水期",
      "frequency": 2,
      "context": "A period when the Yellow River's water level drops, exposing the riverbed and creating opportunities for sand extraction."
    },
    {
      "name": "断流",
      "frequency": 4,
      "context": "The phenomenon of the Yellow River drying up in sections, leading to the exposure of the riverbed."
    },
    {
      "name": "断水湖",
      "frequency": 2,
      "context": "A lake formed in the riverbed during periods of斷流."
    },
    {
      "name": "黄河眼",
      "frequency": 7,
      "context": "A mysterious, never-drying lake in the riverbed, believed to be the 'eye' of the Yellow River."
    },
    {
      "name": "龙",
      "frequency": 4,
      "context": "A mythical creature associated with the '黄河眼', believed to be the source of its water."
    },
    {
      "name": "小孩子",
      "frequency": 2,
      "context": "An enigmatic child who warns the village about the drying up of the '黄河眼'."
    },
    {
      "name": "巨响",
      "frequency": 1,
      "context": "A loud noise heard from the direction of the '黄河眼' before it turned turbid."
    },
    {
      "name": "浑浊",
      "frequency": 1,
      "context": "Describes the state of the '黄河眼' after the mysterious event."
    },
    {
      "name": "石台",
      "frequency": 14,
      "context": "A mysterious stone platform discovered in the dried-up '黄河眼'."
    },
    {
      "name": "影子",
      "frequency": 6,
      "context": "A shadowy figure observed within the '石台', which exhibits peculiar changes."
    },
    {
      "name": "风水先生",
      "frequency": 4,
      "context": "Individuals consulted for their expertise in geomancy, often unable to explain the strange occurrences."
    },
    {
      "name": "老头",
      "frequency": 14,
      "context": "An elderly, enigmatic figure with apparent knowledge of mysterious matters, including '南爬子'."
    },
    {
      "name": "南爬子",
      "frequency": 9,
      "context": "A term for tomb raiders in the Shanxi region, associated with a unique dialect and specialized skills."
    },
    {
      "name": "算盘",
      "frequency": 1,
      "context": "A peculiar round abacus used by the old man, suggesting a connection to divination or calculation."
    },
    {
      "name": "墨镜",
      "frequency": 1,
      "context": "Glasses used to shield the old man's eyes from the perceived blinding light of the '石台'."
    },
    {
      "name": "工人",
      "frequency": 4,
      "context": "Individuals who assisted in moving the old man and later guarded the '石台'."
    },
    {
      "name": "军阀",
      "frequency": 2,
      "context": "Military figures who intervene in the village's affairs, attempting to excavate the '石台'."
    },
    {
      "name": "军队",
      "frequency": 1,
      "context": "A unit of soldiers sent by the warlord to investigate the '石台'."
    },
    {
      "name": "梦",
      "frequency": 1,
      "context": "A recurring dream experienced by villagers after the disappearance of the old man, containing a cryptic message."
    },
    {
      "name": "古董商人",
      "frequency": 4,
      "context": "The narrator's profession, which leads him into the investigation of the mysterious artifacts."
    },
    {
      "name": "前妻",
      "frequency": 5,
      "context": "The narrator's ex-wife, whose influence led him to the antique trade."
    },
    {
      "name": "老丈人",
      "frequency": 2,
      "context": "The narrator's father-in-law, who was involved in the antique business."
    },
    {
      "name": "古董",
      "frequency": 12,
      "context": "The objects of trade and fascination for the narrator and others in the story."
    },
    {
      "name": "电力工程",
      "frequency": 1,
      "context": "The narrator's former profession before becoming an antique dealer."
    },
    {
      "name": "命运",
      "frequency": 2,
      "context": "A recurring theme, suggesting a predetermined path for individuals."
    },
    {
      "name": "太原",
      "frequency": 3,
      "context": "The city where the narrator encounters the old man and begins his investigation."
    },
    {
      "name": "南宫古玩市场",
      "frequency": 6,
      "context": "A bustling antique market where the narrator frequents and has a significant encounter."
    },
    {
      "name": "瓷器",
      "frequency": 1,
      "context": "A type of antique found in the market."
    },
    {
      "name": "青铜器",
      "frequency": 7,
      "context": "A significant type of antique that the narrator is seeking and later acquires."
    },
    {
      "name": "木器",
      "frequency": 1,
      "context": "A type of antique found in the market."
    },
    {
      "name": "赝品",
      "frequency": 1,
      "context": "Fake antiques, abundant in the market."
    },
    {
      "name": "古董盘子",
      "frequency": 5,
      "context": "The narrator's business of buying and selling antiques between different locations for profit."
    },
    {
      "name": "盗墓",
      "frequency": 4,
      "context": "Illegal excavation of tombs, which impacts the supply of antiques."
    },
    {
      "name": "地老鼠",
      "frequency": 1,
      "context": "Slang for tomb raiders."
    },
    {
      "name": "货源",
      "frequency": 1,
      "context": "The supply of antiques available for trade."
    },
    {
      "name": "上海",
      "frequency": 4,
      "context": "The city where the narrator's business is based and where some of his clients are located."
    },
    {
      "name": "招待所",
      "frequency": 3,
      "context": "The narrator's lodging in Taiyuan."
    },
    {
      "name": "小老头",
      "frequency": 1,
      "context": "A description of the old man encountered at the market entrance."
    },
    {
      "name": "蛮话",
      "frequency": 3,
      "context": "A strange dialect spoken by the old man, later identified as a form of '南爬子' language."
    },
    {
      "name": "饭店",
      "frequency": 3,
      "context": "The establishment where the narrator meets his friend '少爷'."
    },
    {
      "name": "少爷",
      "frequency": 10,
      "context": "The narrator's friend and a restaurant owner, who provides advice and insights."
    },
    {
      "name": "高仿货",
      "frequency": 1,
      "context": "High-quality fakes."
    },
    {
      "name": "残品",
      "frequency": 1,
      "context": "Damaged antiques."
    },
    {
      "name": "原则",
      "frequency": 2,
      "context": "The narrator's adherence to ethical practices in his business."
    },
    {
      "name": "万元户",
      "frequency": 1,
      "context": "A term for someone who possesses ten thousand yuan, indicating wealth."
    },
    {
      "name": "黑货",
      "frequency": 3,
      "context": "Stolen goods, which the narrator is hesitant to deal with."
    },
    {
      "name": "雷子",
      "frequency": 1,
      "context": "A term referring to the authorities or law enforcement, implying danger for dealing with '黑货'."
    },
    {
      "name": "南爬子",
      "frequency": 9,
      "context": "Re-emphasis on the term for tomb raiders, central to the old man's potential identity."
    },
    {
      "name": "外八行",
      "frequency": 1,
      "context": "A traditional classification of various professions, including those on the fringes of society."
    },
    {
      "name": "墓",
      "frequency": 2,
      "context": "Ancient burial sites."
    },
    {
      "name": "粽子",
      "frequency": 1,
      "context": "Slang for a tomb raider or a corpse found in a tomb."
    },
    {
      "name": "两西",
      "frequency": 1,
      "context": "Refers to Shaanxi and Shanxi, regions known for '养尸' (raising corpses) and abundant ancient tombs."
    },
    {
      "name": "走地仙",
      "frequency": 1,
      "context": "Another term for a type of tomb raider."
    },
    {
      "name": "穿山鬼",
      "frequency": 1,
      "context": "Another term for a type of tomb raider."
    },
    {
      "name": "认眼",
      "frequency": 1,
      "context": "The specialized skill of '南爬子' in locating ancient tombs."
    },
    {
      "id": "7.12.1",
      "text": "那老头子在黄河里捞上来的青铜器，是他卖给主角的。",
      "level": 1
    },
    {
      "id": "7.12.2",
      "text": "这些青铜器是王全胜在黄河底捞上来的，他是一个黄河上的船夫。",
      "level": 1
    },
    {
      "id": "7.12.3",
      "text": "这些青铜器包括了双耳细颈青铜觯、青铜觚和青铜卣，以及一片刻有鸟篆铭文和云雷纹路的青铜片。",
      "level": 1
    },
    {
      "id": "7.12.4",
      "text": "这些青铜器的价值很高，主角判断一套可以卖到三万以上。",
      "level": 1
    },
    {
      "id": "7.12.5",
      "text": "王全胜之所以会卖这些东西，是因为他在黄河底捞到了一件黑色的陶人俑。",
      "level": 1
    },
    {
      "id": "7.12.6",
      "text": "这个陶人俑被认为是古代的窨俑，与墓葬有关。",
      "level": 1
    },
    {
      "id": "7.12.7",
      "text": "二麻子，王全胜的合伙人，看出了陶人俑和青铜器的价值，并怂恿他们捞上来。",
      "level": 1
    },
    {
      "id": "7.12.8",
      "text": "二麻子声称自己以前做过古玩生意，对这些东西很了解。",
      "level": 1
    },
    {
      "id": "7.12.9",
      "text": "他们还试图捞上来一个沉重的东西，可能是棺材，但只钩上来一片青铜片。",
      "level": 1
    },
    {
      "id": "7.12.10",
      "text": "王全胜是因为和老婆吵架，又在太原没找到二麻子，才心一横决定卖掉这些东西。",
      "level": 1
    },
    {
      "id": "7.12.11",
      "text": "主角对青铜片很感兴趣，并从王全胜那里得到了。",
      "level": 1
    },
    {
      "id": "7.12.12",
      "text": "主角以每件一千元的价格，共五千元买下了五件青铜器。",
      "level": 1
    },
    {
      "id": "8",
      "text": "故事发生在1997年7月的太原南宫古玩市场。",
      "level": 1
    },
    {
      "id": "8.1",
      "text": "主角因为生意不顺，心情烦躁。",
      "level": 2
    },
    {
      "id": "8.2",
      "text": "主角遇到了一个奇怪的老头，说了一些听不懂的话。",
      "level": 2
    },
    {
      "id": "8.3",
      "text": "主角的朋友少爷认为老头可能是个盗墓贼（南爬子），身上可能带着好东西。",
      "level": 2
    },
    {
      "id": "8.4",
      "text": "主角最终请老头吃饭，并得到了他从黄河里捞出来的几件青铜器。",
      "level": 2
    },
    {
      "id": "8.5",
      "text": "老头解释了自己捞到这些东西的经过：他是一个黄河上的船夫，在捞淤泥垃圾时，钩到了一个黑色的陶人俑。",
      "level": 2
    },
    {
      "id": "8.6",
      "text": "陶人俑被认为是墓葬的陪葬品。",
      "level": 2
    },
    {
      "id": "8.7",
      "text": "之后，他们又捞到了几件青铜器，包括鸟尊。",
      "level": 2
    },
    {
      "id": "8.8",
      "text": "王全胜（老头）觉得这些东西不吉利，但他的合伙人二麻子认为它们值钱。",
      "level": 2
    },
    {
      "id": "8.9",
      "text": "二麻子带着一件青铜片去太原找买家。",
      "level": 2
    },
    {
      "id": "8.10",
      "text": "王全胜因家中矛盾和在太原无人接应，决定将捞到的东西卖掉。",
      "level": 2
    },
    {
      "id": "8.11",
      "text": "主角以五千元的价格买下了五件青铜器。",
      "level": 2
    },
    {
      "id": "8.12",
      "text": "主角还从王全胜那里得到了那片刻有铭文的青铜片。",
      "level": 2
    }
  ],
  "relations": [
    {
      "source": "黄河",
      "target": "村子",
      "type": "location_of"
    },
    {
      "source": "村子",
      "target": "黄沙",
      "type": "main_industry"
    },
    {
      "source": "黄沙",
      "target": "黄沙厂",
      "type": "form_of_organization"
    },
    {
      "source": "黄沙厂",
      "target": "断流",
      "type": "affected_by"
    },
    {
      "source": "断流",
      "target": "黄河眼",
      "type": "consequence_of"
    },
    {
      "source": "黄河眼",
      "target": "龙",
      "type": "legend_associated_with"
    },
    {
      "source": "黄河眼",
      "target": "小孩子",
      "type": "warning_about"
    },
    {
      "source": "黄河眼",
      "target": "浑浊",
      "type": "change_in_state"
    },
    {
      "source": "浑浊",
      "target": "龙飞走",
      "type": "explanation_of"
    },
    {
      "source": "黄河眼",
      "target": "石台",
      "type": "discovery_in"
    },
    {
      "source": "石台",
      "target": "影子",
      "type": "contains"
    },
    {
      "source": "石台",
      "target": "风水先生",
      "type": "subject_of_consultation"
    },
    {
      "source": "石台",
      "target": "老头",
      "type": "investigated_by"
    },
    {
      "source": "老头",
      "target": "南爬子",
      "type": "former_profession"
    },
    {
      "source": "老头",
      "target": "算盘",
      "type": "possesses"
    },
    {
      "source": "老头",
      "target": "墨镜",
      "type": "uses"
    },
    {
      "source": "老头",
      "target": "石台",
      "type": "interacts_with"
    },
    {
      "source": "老头",
      "target": "消失",
      "type": "fate_of"
    },
    {
      "source": "影子",
      "target": "消失",
      "type": "fate_of"
    },
    {
      "source": "石台",
      "target": "冒水",
      "type": "reaction_to_excavation"
    },
    {
      "source": "冒水",
      "target": "军阀",
      "type": "causes_retreat_of"
    },
    {
      "source": "老头",
      "target": "梦",
      "type": "appears_in"
    },
    {
      "source": "古董商人",
      "target": "古董",
      "type": "profession"
    },
    {
      "source": "古董商人",
      "target": "前妻",
      "type": "influenced_by"
    },
    {
      "source": "前妻",
      "target": "老丈人",
      "type": "family_relationship"
    },
    {
      "source": "老丈人",
      "target": "古董",
      "type": "profession"
    },
    {
      "source": "古董商人",
      "target": "命运",
      "type": "believes_in"
    },
    {
      "source": "古董商人",
      "target": "太原",
      "type": "travels_to"
    },
    {
      "source": "太原",
      "target": "南宫古玩市场",
      "type": "contains"
    },
    {
      "source": "南宫古玩市场",
      "target": "古董",
      "type": "features"
    },
    {
      "source": "古董商人",
      "target": "青铜器",
      "type": "seeking"
    },
    {
      "source": "南宫古玩市场",
      "target": "盗墓",
      "type": "affected_by"
    },
    {
      "source": "盗墓",
      "target": "货源",
      "type": "impacts"
    },
    {
      "source": "古董商人",
      "target": "古董盘子",
      "type": "business_model"
    },
    {
      "source": "古董盘子",
      "target": "上海",
      "type": "operates_between"
    },
    {
      "source": "古董商人",
      "target": "赝品",
      "type": "navigates_around"
    },
    {
      "source": "古董商人",
      "target": "老头",
      "type": "encounters"
    },
    {
      "source": "老头",
      "target": "蛮话",
      "type": "speaks"
    },
    {
      "source": "蛮话",
      "target": "南爬子",
      "type": "originates_from"
    },
    {
      "source": "少爷",
      "target": "饭店",
      "type": "owns"
    },
    {
      "source": "少爷",
      "target": "古董",
      "type": "interested_in"
    },
    {
      "source": "少爷",
      "target": "古董商人",
      "type": "friend_of"
    },
    {
      "source": "少爷",
      "target": "南爬子",
      "type": "identifies"
    },
    {
      "source": "南爬子",
      "target": "好东西",
      "type": "carries"
    },
    {
      "source": "古董商人",
      "target": "黑货",
      "type": "avoids_dealing_with"
    },
    {
      "source": "古董商人",
      "target": "酒",
      "type": "uses_as_facilitator"
    },
    {
      "source": "老头",
      "target": "青铜器",
      "type": "possesses"
    },
    {
      "source": "老头",
      "target": "黄河",
      "type": "source_of_antiques"
    },
    {
      "source": "老头",
      "target": "陶人俑",
      "type": "discovers"
    },
    {
      "source": "陶人俑",
      "target": "墓葬",
      "type": "associated_with"
    },
    {
      "source": "陶人俑",
      "target": "二麻子",
      "type": "identified_by"
    },
    {
      "source": "陶人俑",
      "target": "青铜器",
      "type": "found_with"
    },
    {
      "source": "青铜器",
      "target": "鸟尊",
      "type": "example_of"
    },
    {
      "source": "青铜器",
      "target": "古董商人",
      "type": "purchased_by"
    },
    {
      "source": "王全胜",
      "target": "黄河",
      "type": "works_on"
    },
    {
      "source": "王全胜",
      "target": "船夫",
      "type": "profession"
    },
    {
      "source": "王全胜",
      "target": "陶人俑",
      "type": "discovers"
    },
    {
      "source": "王全胜",
      "target": "青铜器",
      "type": "discovers"
    },
    {
      "source": "王全胜",
      "target": "二麻子",
      "type": "collaborates_with"
    },
    {
      "source": "二麻子",
      "target": "古玩",
      "type": "former_experience"
    },
    {
      "source": "二麻子",
      "target": "买家",
      "type": "seeks"
    },
    {
      "source": "王全胜",
      "target": "主角",
      "type": "sells_to"
    },
    {
      "source": "青铜片",
      "target": "主角",
      "type": "given_to"
    },
    {
      "source": "主角",
      "target": "陶人俑",
      "type": "identifies_as_important"
    },
    {
      "source": "主角",
      "target": "青铜器",
      "type": "recognizes_value_of"
    },
    {
      "source": "故事",
      "target": "黄河",
      "type": "originates_from"
    },
    {
      "source": "故事",
      "target": "奇闻",
      "type": "is_a"
    },
    {
      "source": "故事",
      "target": "诡异",
      "type": "characterized_by"
    },
    {
      "source": "黄河",
      "target": "神秘",
      "type": "associated_with"
    },
    {
      "source": "黄河",
      "target": "强大",
      "type": "associated_with"
    },
    {
      "source": "黄河",
      "target": "多变",
      "type": "associated_with"
    },
    {
      "source": "村子",
      "target": "黄沙",
      "type": "depends_on_for_livelihood"
    },
    {
      "source": "黄河眼",
      "target": "干涸",
      "type": "unusual_event"
    },
    {
      "source": "石台",
      "target": "半透明",
      "type": "property_of"
    },
    {
      "source": "石台",
      "target": "吸收热量",
      "type": "property_of"
    },
    {
      "source": "老头",
      "target": "刺眼",
      "type": "perceives_from_stone_platform"
    },
    {
      "source": "老头",
      "target": "石台",
      "type": "instructs_to_be_placed_on"
    },
    {
      "source": "老头",
      "target": "消失",
      "type": "occurs_after_sitting_on_stone_platform"
    },
    {
      "source": "军阀",
      "target": "石台",
      "type": "attempts_to_excavate"
    },
    {
      "source": "石台",
      "target": "冒水",
      "type": "responds_to_excavation_with"
    },
    {
      "source": "古董商人",
      "target": "前妻",
      "type": "reason_for_career_change"
    },
    {
      "source": "古董商人",
      "target": "电力工程",
      "type": "former_profession"
    },
    {
      "source": "命运",
      "target": "古董",
      "type": "destiny_of_protagonist"
    },
    {
      "source": "太原",
      "target": "南宫古玩市场",
      "type": "location_of"
    },
    {
      "source": "古董盘子",
      "target": "风险",
      "type": "inherent_in"
    },
    {
      "source": "古董盘子",
      "target": "回报",
      "type": "inherent_in"
    },
    {
      "source": "盗墓",
      "target": "严打",
      "type": "subject_of"
    },
    {
      "source": "老头",
      "target": "南爬子",
      "type": "identity_of"
    },
    {
      "source": "少爷",
      "target": "老头",
      "type": "identifies_as_potential_seller"
    },
    {
      "source": "老头",
      "target": "青铜器",
      "type": "source_of"
    },
    {
      "source": "王全胜",
      "target": "黄河",
      "type": "discovery_location"
    },
    {
      "source": "王全胜",
      "target": "爬犁",
      "type": "tool_of"
    },
    {
      "source": "王全胜",
      "target": "陶人俑",
      "type": "discovery_of"
    },
    {
      "source": "王全胜",
      "target": "青铜器",
      "type": "discovery_of"
    },
    {
      "source": "二麻子",
      "target": "青铜器",
      "type": "recognizes_value_of"
    },
    {
      "source": "王全胜",
      "target": "主角",
      "type": "transaction_with"
    },
    {
      "source": "主角",
      "target": "青铜片",
      "type": "acquisition_of"
    }
  ],
  "hierarchy": {
    "main_topics": [
      "The Yellow River's Mystery",
      "The Antique Trade",
      "Mysterious Discoveries"
    ],
    "structure": "The document is structured with an introduction (引子) detailing a foundational mystery, followed by chapters (正文) that unfold the protagonist's journey into the antique world and his eventual entanglement with the initial mystery through a series of discoveries and encounters."
  }
}