{
  "propositions": [
    {
      "id": "1",
      "text": "The story begins with Zhang Yu, an administrative manager, struggling to carry a large box of fruit and nearly colliding with Tao Xiaowei, the president's special assistant.",
      "level": 1
    },
    {
      "id": "1.1",
      "text": "Zhang Yu apologizes to Tao Xiaowei, who is described as a mature and beautiful professional woman in her early thirties.",
      "level": 2
    },
    {
      "id": "1.2",
      "text": "The company has a summer tradition of distributing 100 jin of fruit daily to employees at 3 PM.",
      "level": 2
    },
    {
      "id": "1.3",
      "text": "Zhang Yu humorously explains that as the only male in the administrative department and the company's central office, he has to handle physically demanding tasks like distributing fruit.",
      "level": 2
    },
    {
      "id": "1.4",
      "text": "Despite the physical labor, Zhang Yu enjoys the task because it allows him to interact with female colleagues, as he is currently single.",
      "level": 2
    },
    {
      "id": "1.5",
      "text": "Tao Xiaowei, having other matters on her mind, acknowledges Zhang Yu's point and walks away, discreetly making a phone call.",
      "level": 2
    },
    {
      "id": "1.6",
      "text": "Female colleagues from the technical department approach Zhang Yu to get their share of the fruit.",
      "level": 2
    },
    {
      "id": "1.7",
      "text": "Zhang Yu instructs them to take fruit from the pantry to ensure fair distribution.",
      "level": 2
    },
    {
      "id": "1.8",
      "text": "As more female colleagues gather, the sound of their high heels creates a 'symphony'.",
      "level": 2
    },
    {
      "id": "1.9",
      "text": "Upon reaching the pantry, Zhang Yu distributes some fruit and then the female colleagues begin to take theirs, commenting on the quality of the fruit.",
      "level": 2
    },
    {
      "id": "1.10",
      "text": "Zhang Yu, usually playful with his female colleagues, is preoccupied with Tao Xiaowei's recent unusual behavior.",
      "level": 2
    },
    {
      "id": "1.11",
      "text": "Zhang Yu secretly admires Tao Xiaowei but hesitates to express his feelings due to her higher position and rumored boyfriend from their UK study abroad days.",
      "level": 2
    },
    {
      "id": "1.12",
      "text": "Li Yan, Zhang Yu's department director, enters the pantry and questions his daze.",
      "level": 2
    },
    {
      "id": "1.13",
      "text": "Zhang Yu speculates to Li Yan that Tao Xiaowei might be planning to leave the company, which he immediately regrets saying.",
      "level": 2
    },
    {
      "id": "1.14",
      "text": "Li Yan reveals that Tao Xiaowei's boyfriend might have had an issue, as he hasn't been seen with her at company events for the past three months.",
      "level": 2
    },
    {
      "id": "1.15",
      "text": "Zhang Yu feels a sense of comfort upon hearing this news.",
      "level": 2
    },
    {
      "id": "1.16",
      "text": "Several administrative specialists enter with a cake from '21 Cake' to celebrate a new employee's birthday.",
      "level": 2
    },
    {
      "id": "1.17",
      "text": "Tao Xiaowei, having finished her call, passes by and is invited by Li Yan to have some cake.",
      "level": 2
    },
    {
      "id": "1.18",
      "text": "Zhang Yu, touched by Li Yan's remark about Tao Xiaowei liking cake, decides to give his share to her.",
      "level": 2
    },
    {
      "id": "1.19",
      "text": "The company president happens to pass by and is called over by Tao Xiaowei.",
      "level": 2
    },
    {
      "id": "1.20",
      "text": "The president is surprised to be called over but enters, only to find that the cake has been distributed.",
      "level": 2
    },
    {
      "id": "1.21",
      "text": "Zhang Yu, with his untouched slice of cake, offers it to the president.",
      "level": 2
    },
    {
      "id": "1.22",
      "text": "The president, feeling awkward, offers to share the cake with Zhang Yu, who declines.",
      "level": 2
    },
    {
      "id": "1.23",
      "text": "Both the president and Tao Xiaowei give Zhang Yu grateful looks, which makes Zhang Yu hopeful.",
      "level": 2
    },
    {
      "id": "1.24",
      "text": "After the birthday celebration, Zhang Yu rushes out to buy a cake voucher from '21 Cake' to give to Tao Xiaowei.",
      "level": 2
    },
    {
      "id": "1.25",
      "text": "Zhang Yu, nervous, approaches Tao Xiaowei at her workstation outside the president's office.",
      "level": 2
    },
    {
      "id": "1.26",
      "text": "Zhang Yu nervously explains that he bought a cake voucher for a friend's birthday and is giving her his share since she likes cake.",
      "level": 2
    },
    {
      "id": "1.27",
      "text": "Tao Xiaowei, realizing Zhang Yu's feelings, asks how much it costs, but he insists she take it for free.",
      "level": 2
    },
    {
      "id": "1.28",
      "text": "Tao Xiaowei finds Zhang Yu attractive and is unsure how to respond.",
      "level": 2
    },
    {
      "id": "1.29",
      "text": "Zhang Yu, taking a bold step, invites Tao Xiaowei to a birthday dinner for a new employee.",
      "level": 2
    },
    {
      "id": "1.30",
      "text": "Tao Xiaowei smiles warmly and accepts the cake voucher, promising to think about the dinner invitation.",
      "level": 2
    },
    {
      "id": "1.31",
      "text": "Tao Xiaowei is revealed to be having problems with her boyfriend, who has become obsessive and difficult.",
      "level": 2
    },
    {
      "id": "1.32",
      "text": "She sought help from a psychologist but her boyfriend's condition fluctuates.",
      "level": 2
    },
    {
      "id": "1.33",
      "text": "Tao Xiaowei is overwhelmed by conflicting advice from friends and family regarding her relationship.",
      "level": 2
    },
    {
      "id": "1.34",
      "text": "She sees Zhang Yu as a potential confidant but is hesitant due to his romantic interest.",
      "level": 2
    },
    {
      "id": "1.35",
      "text": "Tao Xiaowei declines Zhang Yu's dinner invitation via MSN, stating she has work to do.",
      "level": 2
    },
    {
      "id": "1.36",
      "text": "Tao Xiaowei stays late at the office, reflecting on her situation.",
      "level": 2
    },
    {
      "id": "1.37",
      "text": "She has another argument with her boyfriend over the phone.",
      "level": 2
    },
    {
      "id": "1.38",
      "text": "Tao Xiaowei drives home to her apartment in the 'Heaven Garden' community.",
      "level": 2
    },
    {
      "id": "1.39",
      "text": "She receives a text message from Zhang Yu expressing concern and offering to treat her to a meal.",
      "level": 2
    },
    {
      "id": "1.40",
      "text": "Tao Xiaowei decides to go out to eat and drink to relax, but this decision turns out to be a fatal mistake.",
      "level": 2
    },
    {
      "id": "1.41",
      "text": "Approximately six hours later, a report is placed on Liu Jiazhang's desk detailing the death of Tao Xiaowei.",
      "level": 2
    },
    {
      "id": "1.42",
      "text": "The report states Tao Xiaowei's estimated time of death, her physical characteristics, and the cause of death: a heavy blow to the back of the head, leading to brainstem damage and cessation of vital functions.",
      "level": 2
    },
    {
      "id": "1.43",
      "text": "The death is classified as homicide.",
      "level": 2
    },
    {
      "id": "2",
      "text": "Three days later, on a high-speed train, a young couple, Mai Tao and a young woman, are playfully interacting.",
      "level": 1
    },
    {
      "id": "2.1",
      "text": "Mai Tao receives a call from Liu Gangming, the head of criminal investigation.",
      "level": 2
    },
    {
      "id": "2.2",
      "text": "Mai Tao, a 28-year-old criminal psychologist, speaks to Liu Gangming privately in the train's restroom.",
      "level": 2
    },
    {
      "id": "2.3",
      "text": "Liu Gangming asks Mai Tao to come to the police station immediately after the train arrives.",
      "level": 2
    },
    {
      "id": "2.4",
      "text": "Mai Tao jokes with Liu Gangming, referring to him as 'Old Man', and they discuss a recent trip Mai Tao took to Xinjiang.",
      "level": 2
    },
    {
      "id": "2.5",
      "text": "Mai Tao's companion is displeased when he tells her he cannot take her home as planned.",
      "level": 2
    },
    {
      "id": "2.6",
      "text": "The young woman obtains Mai Tao's phone number by calling herself.",
      "level": 2
    },
    {
      "id": "2.7",
      "text": "At the train station, Mai Tao leaves the young woman abruptly, explaining he is expected elsewhere.",
      "level": 2
    },
    {
      "id": "2.8",
      "text": "Mai Tao is picked up by a car with police plates and taken to the police station.",
      "level": 2
    },
    {
      "id": "2.9",
      "text": "Mai Tao's dual profession is revealed: he is a criminal psychologist who lectures at a university and consults for the police.",
      "level": 2
    },
    {
      "id": "2.10",
      "text": "He became a consultant after his academic work caught the attention of Dean Zuo, who introduced him to Captain Liu Gangming.",
      "level": 2
    },
    {
      "id": "2.11",
      "text": "At the police station, Liu Gangming, nicknamed 'Colonel Sanders' due to his receding hairline, greets Mai Tao warmly.",
      "level": 2
    },
    {
      "id": "2.12",
      "text": "Mai Tao jokingly complains about his Xinjiang trip being filled with banquets and drinking.",
      "level": 2
    },
    {
      "id": "2.13",
      "text": "Liu Gangming then becomes serious and shows Mai Tao a company ID card of the deceased, Tao Xiaowei.",
      "level": 2
    },
    {
      "id": "2.14",
      "text": "Mai Tao recognizes her as a beautiful woman.",
      "level": 2
    },
    {
      "id": "2.15",
      "text": "Liu Gangming is aware of Mai Tao's relationship with his daughter.",
      "level": 2
    },
    {
      "id": "2.16",
      "text": "Mai Tao deduces that Tao Xiaowei is the victim of a murder case.",
      "level": 2
    },
    {
      "id": "2.17",
      "text": "Liu Gangming briefs Mai Tao on the case: Tao Xiaowei was murdered around 9 PM on her way home from work.",
      "level": 2
    },
    {
      "id": "2.18",
      "text": "The unusual aspect of the case is the lack of witnesses in the densely populated 'Heaven Garden' community.",
      "level": 2
    },
    {
      "id": "2.19",
      "text": "Tao Xiaowei was killed by a single blow to the back of the head with a brick, causing immediate death.",
      "level": 2
    },
    {
      "id": "2.20",
      "text": "Her valuables, including a laptop, phone, and wallet, were stolen.",
      "level": 2
    },
    {
      "id": "2.21",
      "text": "Mai Tao initially suspects a common robbery but is intrigued by the efficiency of the single fatal blow.",
      "level": 2
    },
    {
      "id": "2.22",
      "text": "Liu Gangming brings up the 'Hammer Gang' case from years ago, where young criminals escalated from robbery to murder.",
      "level": 2
    },
    {
      "id": "2.23",
      "text": "This comparison suggests Liu Gangming fears a serial killer is emerging.",
      "level": 2
    },
    {
      "id": "2.24",
      "text": "Mai Tao prepares to leave for a meeting with 'Teacher Ai'.",
      "level": 2
    },
    {
      "id": "2.25",
      "text": "Liu Gangming expresses concern about the impending 60th National Day celebrations and the potential for further crimes.",
      "level": 2
    },
    {
      "id": "3",
      "text": "Liu Anxin, Liu Jiazhang's daughter, is described as having a contrasting personality to her gentle mother.",
      "level": 1
    },
    {
      "id": "3.1",
      "text": "Anxin was a tomboy in her youth but matured into a refined lady in college.",
      "level": 2
    },
    {
      "id": "3.2",
      "text": "Despite her success in business, her career has made finding a suitable partner difficult due to societal perceptions of successful women.",
      "level": 2
    },
    {
      "id": "3.3",
      "text": "Her mother is anxious about her marriage, while her father is more patient.",
      "level": 2
    },
    {
      "id": "3.4",
      "text": "Mai Tao appears, and both Anxin and her father approve of him.",
      "level": 2
    },
    {
      "id": "3.5",
      "text": "Their wedding plans were delayed due to the death of Mai Tao's parents.",
      "level": 2
    },
    {
      "id": "3.6",
      "text": "Anxin is upset with Mai Tao for not calling her during his trip.",
      "level": 2
    },
    {
      "id": "3.7",
      "text": "Mai Tao, despite his expertise in psychology, struggles to understand Anxin's emotions.",
      "level": 2
    },
    {
      "id": "3.8",
      "text": "Mai Tao's cell phone has a weak earpiece volume, leading to miscommunication with Anxin.",
      "level": 2
    },
    {
      "id": "3.9",
      "text": "Mai Tao is on his way to meet Ai Lian, a renowned detective novelist, who is 7 years older than him.",
      "level": 2
    },
    {
      "id": "3.10",
      "text": "Ai Lian's success as an author stems from his deep understanding of crime and psychology, influenced by his own studies.",
      "level": 2
    },
    {
      "id": "3.11",
      "text": "Mai Tao was a devoted fan of Ai Lian's work and was inspired to pursue criminal psychology.",
      "level": 2
    },
    {
      "id": "3.12",
      "text": "Ai Lian and Mai Tao have a mentor-mentee relationship.",
      "level": 2
    },
    {
      "id": "3.13",
      "text": "They meet at a familiar restaurant where they often discuss their work.",
      "level": 2
    },
    {
      "id": "3.14",
      "text": "Ai Lian astutely deduces Mai Tao's recent travel and lack of rest based on his appearance and the cigarettes he is smoking.",
      "level": 2
    },
    {
      "id": "3.15",
      "text": "Ai Lian advises Mai Tao to look for obvious clues rather than overcomplicating matters.",
      "level": 2
    },
    {
      "id": "3.16",
      "text": "Mai Tao asks Ai Lian about his decision to stop practicing psychology and become a writer.",
      "level": 2
    },
    {
      "id": "3.17",
      "text": "Ai Lian reveals that he switched careers after his elder sister died 12 years ago.",
      "level": 2
    },
    {
      "id": "4",
      "text": "12 years ago, Ai Lian, a recent psychology graduate, struggled to find employment as a psychologist.",
      "level": 1
    },
    {
      "id": "4.1",
      "text": "He eventually found a position at a game company that invested in him due to the perceived future potential of psychology.",
      "level": 2
    },
    {
      "id": "4.2",
      "text": "The narrative hints at the difficulties and emotional toll of being a psychologist.",
      "level": 2
    }
  ],
  "concepts": [
    {
      "name": "Zhang Yu",
      "frequency": 16,
      "context": "Administrative manager at L company, single, enjoys interacting with female colleagues, harbors feelings for Tao Xiaowei."
    },
    {
      "name": "Tao Xiaowei",
      "frequency": 17,
      "context": "President's special assistant at L company, 30s, attractive, professional, experiencing relationship problems, becomes a murder victim."
    },
    {
      "name": "L company",
      "frequency": 10,
      "context": "The workplace where the initial events of the story unfold."
    },
    {
      "name": "Fruit distribution",
      "frequency": 4,
      "context": "A summer tradition at L company to combat the heat, handled by Zhang Yu."
    },
    {
      "name": "Li Yan",
      "frequency": 4,
      "context": "Zhang Yu's department director, observant and pragmatic."
    },
    {
      "name": "Birthday celebration",
      "frequency": 3,
      "context": "A new employee's birthday is celebrated with cake, bringing characters together."
    },
    {
      "name": "Cake voucher",
      "frequency": 3,
      "context": "A gift from Zhang Yu to Tao Xiaowei, symbolizing his affection."
    },
    {
      "name": "Relationship problems",
      "frequency": 4,
      "context": "Tao Xiaowei's struggles with her boyfriend's obsessive and volatile behavior."
    },
    {
      "name": "Psychological distress",
      "frequency": 3,
      "context": "Tao Xiaowei's emotional turmoil due to her relationship issues."
    },
    {
      "name": "Murder",
      "frequency": 8,
      "context": "The central crime involving Tao Xiaowei's death."
    },
    {
      "name": "Liu Jiazhang",
      "frequency": 2,
      "context": "A police officer, presumably Liu Gangming's father or relative, receives the initial death report."
    },
    {
      "name": "Mai Tao",
      "frequency": 20,
      "context": "A 28-year-old criminal psychologist, consultant for the police, in a relationship with Liu Anxin."
    },
    {
      "name": "Liu Gangming",
      "frequency": 13,
      "context": "Head of criminal investigation, Mai Tao's superior and father-in-law, plays a key role in the murder investigation."
    },
    {
      "name": "Criminal psychology",
      "frequency": 7,
      "context": "Mai Tao's area of expertise, used to analyze crimes and criminals."
    },
    {
      "name": "Train journey",
      "frequency": 3,
      "context": "The setting for the initial encounter between Mai Tao and his companion, and where he receives a call from Liu Gangming."
    },
    {
      "name": "Police station",
      "frequency": 6,
      "context": "The location where the murder investigation is conducted."
    },
    {
      "name": "Heaven Garden community",
      "frequency": 4,
      "context": "Tao Xiaowei's residential area and the scene of her murder."
    },
    {
      "name": "Brick",
      "frequency": 3,
      "context": "The murder weapon used to kill Tao Xiaowei."
    },
    {
      "name": "Robbery",
      "frequency": 4,
      "context": "The motive for Tao Xiaowei's murder, with her valuables stolen."
    },
    {
      "name": "Hammer Gang",
      "frequency": 2,
      "context": "A past criminal case that Liu Gangming brings up as a comparison for the current murder."
    },
    {
      "name": "Liu Anxin",
      "frequency": 9,
      "context": "Liu Gangming's daughter, Mai Tao's girlfriend, successful in her career, facing challenges in finding a partner."
    },
    {
      "name": "Ai Lian",
      "frequency": 16,
      "context": "A successful detective novelist, mentor to Mai Tao, also a former psychologist."
    },
    {
      "name": "Detective novel writing",
      "frequency": 4,
      "context": "Ai Lian's profession and a key aspect of his character."
    },
    {
      "name": "Reader-author relationship",
      "frequency": 2,
      "context": "The dynamic between Ai Lian and Mai Tao, with Mai Tao being a dedicated reader."
    },
    {
      "name": "Psychological consultation",
      "frequency": 4,
      "context": "Ai Lian's former profession and a topic of discussion with Mai Tao."
    },
    {
      "name": "Elder sister's death",
      "frequency": 2,
      "context": "The tragic event that led Ai Lian to change careers."
    },
    {
      "name": "Modern psychology in China",
      "frequency": 2,
      "context": "The nascent state of psychology in China 12 years prior to the story."
    }
  ],
  "relations": [
    {
      "source": "Zhang Yu",
      "target": "Tao Xiaowei",
      "type": "admires"
    },
    {
      "source": "Zhang Yu",
      "target": "L company",
      "type": "works_at"
    },
    {
      "source": "Tao Xiaowei",
      "target": "L company",
      "type": "works_at"
    },
    {
      "source": "Tao Xiaowei",
      "target": "Relationship problems",
      "type": "experiences"
    },
    {
      "source": "Tao Xiaowei",
      "target": "Murder",
      "type": "victim_of"
    },
    {
      "source": "Murder",
      "target": "Heaven Garden community",
      "type": "occurred_at"
    },
    {
      "source": "Murder",
      "target": "Brick",
      "type": "weapon_used"
    },
    {
      "source": "Robbery",
      "target": "Murder",
      "type": "motive_for"
    },
    {
      "source": "Mai Tao",
      "target": "Liu Gangming",
      "type": "works_with"
    },
    {
      "source": "Mai Tao",
      "target": "Criminal psychology",
      "type": "specializes_in"
    },
    {
      "source": "Mai Tao",
      "target": "Liu Anxin",
      "type": "is_in_relationship_with"
    },
    {
      "source": "Mai Tao",
      "target": "Ai Lian",
      "type": "mentee_of"
    },
    {
      "source": "Liu Gangming",
      "target": "Liu Anxin",
      "type": "is_father_of"
    },
    {
      "source": "Liu Gangming",
      "target": "Murder",
      "type": "investigates"
    },
    {
      "source": "Liu Gangming",
      "target": "Hammer Gang",
      "type": "recalls"
    },
    {
      "source": "Liu Anxin",
      "target": "L company",
      "type": "works_at"
    },
    {
      "source": "Ai Lian",
      "target": "Detective novel writing",
      "type": "profession"
    },
    {
      "source": "Ai Lian",
      "target": "Psychological consultation",
      "type": "former_profession"
    },
    {
      "source": "Ai Lian",
      "target": "Elder sister's death",
      "type": "influenced_by"
    },
    {
      "source": "Psychological consultation",
      "target": "Modern psychology in China",
      "type": "context"
    }
  ],
  "hierarchy": {
    "main_topics": [
      "The Case of Tao Xiaowei's Murder",
      "Introduction of Characters and Relationships",
      "Criminal Psychology and Investigation Methods",
      "Past Criminal Cases and Future Threats"
    ],
    "structure": "The document is structured into chapters, introducing characters and plot points sequentially. Chapter 1 sets the scene and introduces initial characters and a mystery. Chapter 2 introduces the criminal psychologist and the murder investigation. Chapter 3 delves into the personal lives of key characters and their relationships. Chapter 4 provides backstory for Ai Lian and touches upon the early days of psychology in China."
  }
}