{
  "propositions": [
    {
      "id": "1",
      "text": "The document is a first-person account of a retired geological exploration team member detailing extraordinary events encountered during his career, particularly related to a classified project known as the \"723 Project\".",
      "level": 1
    },
    {
      "id": "1.1",
      "text": "The narrative begins with the author's decision to write down these experiences, feeling it a duty to record them despite their unusual nature and potential conflict with conventional worldviews.",
      "level": 2
    },
    {
      "id": "1.2",
      "text": "The author emphasizes that the account is presented as a novel, not a report, to circumvent the limitations of official documentation and convey the extraordinary nature of the events.",
      "level": 2
    },
    {
      "id": "2",
      "text": "The author's geological exploration career spanned twenty years and involved traversing vast, unexplored regions of China, marked by extreme hardship and encountering numerous inexplicable and terrifying incidents.",
      "level": 1
    },
    {
      "id": "2.1",
      "text": "Initially, the most challenging aspect of his work was the profound monotony and the feeling of suffocation associated with continuous mountainous terrain.",
      "level": 2
    },
    {
      "id": "2.2",
      "text": "This perception of monotony was shattered after a pivotal event in 1962, revealing the presence of mysterious phenomena within the mountains that defied rational understanding.",
      "level": 2
    },
    {
      "id": "3",
      "text": "The 1962 event was triggered by the cessation of the \"723 Project\" in Inner Mongolia, a large-scale coal exploration initiative.",
      "level": 1
    },
    {
      "id": "3.1",
      "text": "The project was abruptly halted, leading to the secretive recruitment of experienced geological technical personnel from various exploration teams across the country.",
      "level": 2
    },
    {
      "id": "3.2",
      "text": "Rumors circulated about the discovery of something extraordinary by the 723 Project, with numerous unconfirmed versions of what was found.",
      "level": 2
    },
    {
      "id": "3.3",
      "text": "The author was among these selected technical soldiers, transported by military vehicles to a remote, heavily fortified base in the mountains.",
      "level": 2
    },
    {
      "id": "3.4",
      "text": "The base was characterized by a large number of military tents and the presence of Army Engineers, suggesting an operation far beyond standard geological exploration.",
      "level": 2
    },
    {
      "id": "3.5",
      "text": "The presence of advanced Soviet-imported exploration equipment, capable of much deeper prospecting than the country's capabilities allowed at the time, added to the mystery and unease.",
      "level": 2
    },
    {
      "id": "4",
      "text": "The author recounts conversations with his tentmates, Wang Sichuan and Lao Mao, revealing their backgrounds and the prevailing speculations about the 723 Project.",
      "level": 1
    },
    {
      "id": "4.1",
      "text": "Wang Sichuan, from a family with a history in coal mining and military service, expressed a strong aversion to coal despite his father's career.",
      "level": 2
    },
    {
      "id": "4.2",
      "text": "The author shares his own family background, which was complicated by his grandfather's alleged past as a bandit, leading to a classification as \"reactionary rich peasant\" that was later altered to \"poor peasant\" through a religious connection.",
      "level": 2
    },
    {
      "id": "5",
      "text": "After a month of idle waiting and increasing anxiety, the group was transported deeper into the mountains, towards an abandoned Japanese military base.",
      "level": 1
    },
    {
      "id": "5.1",
      "text": "The journey was arduous, with rough, newly-made roads and frequent delays, suggesting they were heading into a remote and uncharted area, possibly near the Sino-Mongolian border.",
      "level": 2
    },
    {
      "id": "5.2",
      "text": "Upon arrival, they discovered a dilapidated Japanese base, surrounded by rusted barbed wire and overgrown wooden structures, indicating its abandonment for decades.",
      "level": 2
    },
    {
      "id": "5.3",
      "text": "The author notes the unsettling atmosphere of the location, possibly due to its association with Japanese occupation.",
      "level": 2
    },
    {
      "id": "6",
      "text": "A meeting was convened where a Colonel announced that the following information was a state secret, requiring an oath of lifelong non-disclosure.",
      "level": 1
    },
    {
      "id": "6.1",
      "text": "The Colonel explained that a \"Classified Film Zero\" would be shown, which was a term for highly confidential films made for central leadership.",
      "level": 2
    },
    {
      "id": "6.2",
      "text": "The film, a black and white short, detailed the reason for their recruitment: the discovery of a Japanese transport plane wreck in 1959.",
      "level": 2
    },
    {
      "id": "6.3",
      "text": "The wreckage contained extensive Japanese geological survey documents for Northeast China and Mongolia, primarily focused on oil exploration.",
      "level": 2
    },
    {
      "id": "6.4",
      "text": "Crucially, a secure coded metal box was found beneath one of the document boxes, containing encrypted geological data from an unknown location.",
      "level": 2
    },
    {
      "id": "6.5",
      "text": "Despite efforts, the encrypted data could not be deciphered due to the complexity of Japanese codes and the inability to consult American codebooks.",
      "level": 2
    },
    {
      "id": "6.6",
      "text": "Following the encrypted data's geographical indicators, the 723 Project team located the Japanese temporary base, but found it abandoned and burned, with no initial geological findings.",
      "level": 2
    },
    {
      "id": "7",
      "text": "The translated Japanese documents indicated that the Japanese had discovered something of immense significance, prompting them to assemble and transport a \"Shenshan\" heavy bomber to a location 1200 meters underground.",
      "level": 1
    },
    {
      "id": "7.1",
      "text": "This extraordinary feat suggested the existence of a hidden underground passage and evidence of extensive equipment deployment by the Japanese.",
      "level": 2
    },
    {
      "id": "7.2",
      "text": "The author's team was brought to this site to search for the underground passage.",
      "level": 2
    },
    {
      "id": "8",
      "text": "The discovery of a large, fissure-like cave structure ten days later, confirmed the existence of a potential entry point to the underground.",
      "level": 1
    },
    {
      "id": "8.1",
      "text": "The cave was found to have a vertical shaft of 214 meters leading to an underground river and four branching tunnels.",
      "level": 2
    },
    {
      "id": "8.2",
      "text": "The author's team, along with engineering soldiers, was prepared to descend into the cave system for further investigation.",
      "level": 2
    },
    {
      "id": "9",
      "text": "Lao Mao expresses suspicions about the discovery and the secrecy surrounding it, suggesting the cave was found long before their arrival and that the operation is more complex than revealed.",
      "level": 1
    },
    {
      "id": "9.1",
      "text": "He warns the author to be extremely cautious.",
      "level": 2
    },
    {
      "id": "10",
      "text": "The author and his team are divided into groups and prepared for the descent into the cave system.",
      "level": 1
    },
    {
      "id": "10.1",
      "text": "The author is assigned to the second group, alongside Wang Sichuan and two other experienced geological technicians.",
      "level": 2
    },
    {
      "id": "10.2",
      "text": "The descent into the cave is described as a slow and perilous process, highlighting the extreme depth and the unsettling darkness.",
      "level": 2
    },
    {
      "id": "11",
      "text": "The cave system exhibits characteristics of both geological fault caves and karst caves, suggesting complex underground formations.",
      "level": 1
    }
  ],
  "concepts": [
    {
      "name": "大漠苍狼-绝地勘探",
      "frequency": 5,
      "context": "The title of the document, indicating the subject matter of a novel about geological exploration in harsh environments."
    },
    {
      "name": "地质勘探",
      "frequency": 15,
      "context": "Geological exploration, the author's profession and the central activity of the narrative. It encompasses searching for mineral resources, scientific investigation, and encountering the unknown."
    },
    {
      "name": "七二三工程",
      "frequency": 10,
      "context": "A specific, mysterious, and classified geological project in Inner Mongolia that serves as the catalyst for the extraordinary events described."
    },
    {
      "name": "1962年",
      "frequency": 3,
      "context": "The year of a pivotal event that changed the author's perception of his work, revealing hidden mysteries."
    },
    {
      "name": "内蒙古",
      "frequency": 5,
      "context": "The primary geographical location of the 723 Project and the subsequent events, characterized by mountains, forests, and remote areas."
    },
    {
      "name": "技术人员",
      "frequency": 10,
      "context": "The skilled individuals, including the author, who are recruited for the secret 723 Project due to their expertise."
    },
    {
      "name": "神秘",
      "frequency": 5,
      "context": "A recurring theme describing phenomena and events that defy rational explanation and understanding."
    },
    {
      "name": "苏联设备",
      "frequency": 3,
      "context": "Advanced exploration equipment imported from the Soviet Union, suggesting a level of technological capability beyond the nation's standard at the time."
    },
    {
      "name": "日本",
      "frequency": 10,
      "context": "Related to the historical context of Japanese occupation in Northeast China and the discovery of a Japanese military base and its secrets."
    },
    {
      "name": "零号片",
      "frequency": 5,
      "context": "A classified film shown to the technical personnel, revealing the background of the mission and the discovery of Japanese secrets."
    },
    {
      "name": "飞机",
      "frequency": 8,
      "context": "A significant object in the narrative, particularly the discovery of a Japanese bomber buried underground and its implications."
    },
    {
      "name": "地下",
      "frequency": 10,
      "context": "The setting for much of the extraordinary discoveries, including hidden passages, buried objects, and underground structures."
    },
    {
      "name": "洞穴",
      "frequency": 10,
      "context": "A key location where further investigation into the underground mysteries takes place, presenting new challenges and discoveries."
    },
    {
      "name": "保密",
      "frequency": 10,
      "context": "A constant theme throughout the narrative, emphasizing the classified nature of the events and the need for secrecy."
    },
    {
      "name": "推测",
      "frequency": 10,
      "context": "The process of forming hypotheses and theories to understand the inexplicable events, often leading to more questions than answers."
    },
    {
      "name": "老猫",
      "frequency": 8,
      "context": "A wise and observant character who provides insights and warnings to the author, often sensing the underlying strangeness of the situation."
    },
    {
      "name": "王四川",
      "frequency": 5,
      "context": "The author's tentmate and companion, a practical and friendly character who provides a foil to the mysterious elements of the story."
    },
    {
      "name": "工程兵",
      "frequency": 10,
      "context": "Military personnel responsible for engineering and construction, playing a crucial role in accessing and navigating the challenging terrains and underground structures."
    },
    {
      "name": "地质构造",
      "frequency": 3,
      "context": "The scientific principles and formations related to the earth's crust, relevant to understanding the cave structures and underground discoveries."
    }
  ],
  "relations": [
    {
      "source": "地质勘探",
      "target": "七二三工程",
      "type": "involved_in"
    },
    {
      "source": "七二三工程",
      "target": "内蒙古",
      "type": "occurred_in"
    },
    {
      "source": "技术人员",
      "target": "七二三工程",
      "type": "recruited_for"
    },
    {
      "source": "神秘",
      "target": "地质勘探",
      "type": "encountered_during"
    },
    {
      "source": "苏联设备",
      "target": "七二三工程",
      "type": "used_in"
    },
    {
      "source": "日本",
      "target": "飞机",
      "type": "discovered_wreckage_of"
    },
    {
      "source": "飞机",
      "target": "地下",
      "type": "found_buried_in"
    },
    {
      "source": "零号片",
      "target": "飞机",
      "type": "revealed_discovery_of"
    },
    {
      "source": "零号片",
      "target": "保密",
      "type": "subject_of"
    },
    {
      "source": "洞穴",
      "target": "地下",
      "type": "leads_to"
    },
    {
      "source": "洞穴",
      "target": "工程兵",
      "type": "explored_by"
    },
    {
      "source": "老猫",
      "target": "神秘",
      "type": "perceived"
    },
    {
      "source": "老猫",
      "target": "推测",
      "type": "engaged_in"
    },
    {
      "source": "王四川",
      "target": "地质勘探",
      "type": "colleague_of"
    },
    {
      "source": "保密",
      "target": "推测",
      "type": "necessitates"
    },
    {
      "source": "地质构造",
      "target": "洞穴",
      "type": "characterizes"
    }
  ],
  "hierarchy": {
    "main_topics": [
      "Geological Exploration",
      "The 723 Project",
      "Mysterious Discoveries",
      "Underground Exploration",
      "Historical Secrets"
    ],
    "structure": "The document follows a chronological narrative structure, beginning with the author's reflections and progressing through the events of the 723 Project, the journey to the abandoned base, the screening of the classified film, and the initial exploration of the cave system. It is interspersed with personal anecdotes, dialogues, and reflections that add depth and context to the unfolding mystery."
  }
}