{
  "propositions": [
    {
      "id": "1",
      "text": "The story of Artemis and Apollo in Greek mythology represents a tragic love bound by divine prohibitions.",
      "level": 1
    },
    {
      "id": "1.1",
      "text": "Artemis, the goddess of the moon and hunting, and Apollo, the sun god, share a deep but forbidden love.",
      "level": 2
    },
    {
      "id": "1.2",
      "text": "Their love leads to conflict and tragedy, culminating in Artemis's death in Apollo's arms.",
      "level": 2
    },
    {
      "id": "2",
      "text": "In the setting of Turukansha City, Artemis and Apollo are reincarnated as mortal figures with lingering divine connections.",
      "level": 1
    },
    {
      "id": "2.1",
      "text": "Artemis appears as a holy maiden, protector of the city, burdened by her dual identity as both divine and mortal.",
      "level": 2
    },
    {
      "id": "2.2",
      "text": "Apollo is reincarnated as Cassio, a military leader, whose love for Artemis continues to torment him.",
      "level": 2
    },
    {
      "id": "3",
      "text": "The central conflict revolves around the tension between duty and personal desire for both Artemis and Cassio.",
      "level": 1
    },
    {
      "id": "3.1",
      "text": "Artemis struggles with her role as a protector versus her longing for freedom and love.",
      "level": 2
    },
    {
      "id": "3.2",
      "text": "Cassio faces the dilemma of pursuing his love for Artemis despite the societal and divine constraints.",
      "level": 2
    }
  ],
  "concepts": [
    {
      "name": "Artemis",
      "frequency": 15,
      "context": "Goddess of moon and hunting, reincarnated as a holy maiden in Turukansha City."
    },
    {
      "name": "Apollo",
      "frequency": 10,
      "context": "Sun god, reincarnated as Cassio, a military leader in Turukansha City."
    },
    {
      "name": "Forbidden Love",
      "frequency": 8,
      "context": "Central theme of the tragic relationship between Artemis and Apollo."
    },
    {
      "name": "Turukansha City",
      "frequency": 7,
      "context": "Ancient, mysterious city setting for the reincarnated story of Artemis and Apollo."
    },
    {
      "name": "Duty vs. Desire",
      "frequency": 6,
      "context": "Conflict between personal longing and societal or divine responsibilities."
    }
  ],
  "relations": [
    {
      "source": "Artemis",
      "target": "Apollo",
      "type": "forbidden_love"
    },
    {
      "source": "Artemis",
      "target": "Turukansha City",
      "type": "protector_of"
    },
    {
      "source": "Apollo",
      "target": "Turukansha City",
      "type": "leader_of"
    },
    {
      "source": "Artemis",
      "target": "Duty vs. Desire",
      "type": "embodies"
    },
    {
      "source": "Apollo",
      "target": "Duty vs. Desire",
      "type": "embodies"
    }
  ],
  "hierarchy": {
    "main_topics": [
      "Greek Mythology of Artemis and Apollo",
      "Reincarnation in Turukansha City",
      "Conflict of Duty and Desire"
    ],
    "structure": "The document is structured into a prologue detailing the mythological background of Artemis and Apollo, followed by chapters set in Turukansha City where their reincarnated forms face similar emotional and societal conflicts."
  }
}