{
  "propositions": [
    {
      "id": "1",
      "text": "天机：龙脉迷踪之翡翠扳指",
      "level": 1
    },
    {
      "id": "1.1",
      "text": "楔子",
      "level": 2
    },
    {
      "id": "1.1.1",
      "text": "地点：华盛顿市乔治敦区中心的一栋住宅内",
      "level": 3
    },
    {
      "id": "1.1.2",
      "text": "时间：1997年6月15日，深夜11点46分。",
      "level": 3
    },
    {
      "id": "1.1.3",
      "text": "这是一栋典型的美国住宅，沿街道而建，木制结构的二层房屋，前面有一个小花坛，花园则在房屋的后面。",
      "level": 3
    },
    {
      "id": "1.1.4",
      "text": "整栋房屋除二楼的一个窗口，其它部位都漆黑一片，有亮光的窗户上一个身影时隐时现，如同钟摆，如此持续两三个小时了。",
      "level": 3
    },
    {
      "id": "1.1.5",
      "text": "房屋的主人叫谭璟，美籍华裔，34岁，单身一人住在这里。",
      "level": 3
    },
    {
      "id": "1.1.6",
      "text": "亮灯的房间是谭璟的书房，此刻他正焦虑不安地在书房内来回走动，眉头紧锁仿佛有重要的事情困扰着他。",
      "level": 3
    },
    {
      "id": "1.1.7",
      "text": "或许是走累了，谭璟在书桌后面坐下来，静静地思考了几分钟后，顺手抓过旁边的一支笔，在一张A4纸上刷刷写了几个汉字，停了几秒钟后又不断重复地写着这几个字，似乎是在用这种方式排遣着内心的焦虑。",
      "level": 3
    },
    {
      "id": "1.1.8",
      "text": "一向稳重的谭璟，今晚之所以如此烦躁，是因为上午发生的一件意外事故。",
      "level": 3
    },
    {
      "id": "1.1.9",
      "text": "今天上午，美国国家安全档案局解密了一批二战期间从日本陆军参谋本部缴获的绝密情报档案。",
      "level": 3
    },
    {
      "id": "1.1.10",
      "text": "谭璟是美国国家安全档案馆工作人员，参与了解密档案的全部过程。",
      "level": 3
    },
    {
      "id": "1.1.11",
      "text": "在美国关于档案的解密时间有严格的规定，国家安全档案局的档案解密时间必须是五十年以上，而其它地方保存的档案解密时间是三十年。",
      "level": 3
    },
    {
      "id": "1.1.12",
      "text": "所以今天解密的情报档案都是五十年前，美军占领日本本土时搜集到的一批绝密情报。",
      "level": 3
    },
    {
      "id": "1.1.13",
      "text": "国安局的绝密档案全部保存在被称为“美国黑室”的秘密档案库中，这是一个比国家金库还坚固、严密的地方，世界上没有几个人了解“黑室”的真实情况，包括总统。",
      "level": 3
    },
    {
      "id": "1.1.14",
      "text": "谭璟和另外一名哈迪斯的工作人员负责把解密档案从“黑室”取出来，然后送到总部办公大楼，在办公大楼的三楼设有一个对外开放的展示区。",
      "level": 3
    },
    {
      "id": "1.1.15",
      "text": "整个过程由谭璟和哈迪斯两人具体负责，另外还有两名全副武装的警卫全程跟随。",
      "level": 3
    },
    {
      "id": "1.1.16",
      "text": "谭璟亲手把所有解密档案放入一个手提式数码保险箱内，由哈迪斯带着手提箱一起离开秘密档案库，通过地下通道到达总部办公大楼，随后乘电梯来到位于三楼对外开放的展示区，整个过程中手提保险箱从未离开过谭璟的视线。",
      "level": 3
    },
    {
      "id": "1.1.17",
      "text": "到达展示区后，谭璟将手提保险箱打开，取出里面的解密档案，准备向展示区的工作人员移交，但是在清点时突然发现少了一份。",
      "level": 3
    },
    {
      "id": "1.1.18",
      "text": "谭璟和哈迪斯都惊出了一身冷汗，急忙重新检查了一遍，最后确定其中的一份绝密档案从“黑室”取出后不翼而飞了。",
      "level": 3
    },
    {
      "id": "1.1.19",
      "text": "在现场俩人都没有声张，这件事并未引起外界人员的注意，但是却让安全局的头头们大为恼怒，在被称为世界上安保最严密的地方发生这样的事情，的确让他们难堪。",
      "level": 3
    },
    {
      "id": "1.1.20",
      "text": "而谭璟和哈迪斯是唯一接触到解密档案的工作人员，自然脱不了干系。",
      "level": 3
    },
    {
      "id": "1.1.21",
      "text": "整个晚上，谭璟的脑海里无数遍地回想着从秘密档案库到展示区的全部过程中，就是琢磨不出那个环节出了问题，他想象不出档案是如何从手提箱里消失的。",
      "level": 3
    },
    {
      "id": "1.1.22",
      "text": "让谭璟焦虑的还不仅是丢失解密档案这件事，档案的内容更让他坐立不安。",
      "level": 3
    },
    {
      "id": "1.1.23",
      "text": "因为丢失的这份绝密档案关系到华夏民族的安危，这份绝密情报是1937年6月初，由时任关东军参谋长的东条英机签署的一项针对北京城的绝密计划。",
      "level": 3
    },
    {
      "id": "1.1.24",
      "text": "谭璟也是今天才看到这份绝密计划的内容，虽然是在美国出生长大，可以说是一个地地道道的美国人，但是他的身体里流淌着华夏儿女的血，他很清楚这份绝密计划上的内容对华夏民族的危害有多严重。",
      "level": 3
    },
    {
      "id": "1.1.25",
      "text": "虽然已经过去了整整六十年，如果有人再次实施这项绝密计划上的内容，后果将依然不堪设想。",
      "level": 3
    },
    {
      "id": "1.1.26",
      "text": "越想越让谭璟不安，他意识到自己必须把丢失的档案中涉及到的相关信息告知有关部门。",
      "level": 3
    },
    {
      "id": "1.1.27",
      "text": "想到这里，他拿过旁边的电话薄，查找中国使馆的电话。",
      "level": 3
    },
    {
      "id": "1.1.28",
      "text": "刚把厚厚的电话薄翻开，房门突然传来咔吧的轻微响声，谭璟听出是门锁的声音，他怔了一下，猜想可能是<bos>贼潜入家中了，急忙拉开书桌下的一个抽屉，伸手抓起一支捷克生产的CZ75型民用手枪。",
      "level": 3
    },
    {
      "id": "1.1.29",
      "text": "谭璟握着手枪，起身绕过书桌，向前走了两步，书房门就被推开了。",
      "level": 3
    },
    {
      "id": "1.1.30",
      "text": "谭璟猛然吃了一惊，还没等他有所反应，感觉一团黑影闪了一下，一个身穿黑色紧身衣裤的人就已经站在自己面前，他甚至没有看清这个人是如何进来的。",
      "level": 3
    },
    {
      "id": "1.1.31",
      "text": "只见进来人的整个头部被黑色的头巾裹得严严实实，只露出两只眼睛，身体轻盈的听不到一丝声响，感觉好像是传说中的忍者。",
      "level": 3
    },
    {
      "id": "1.1.32",
      "text": "“你是什么人？”",
      "level": 3
    },
    {
      "id": "1.1.33",
      "text": "谭璟的话刚出口，黑衣人的手突然一扬，一个亮晶晶的东西从他的手里飞出来，同时发出一种慑人心魄的怪声，恰如一道闪电劈向谭璟的额头。",
      "level": 3
    },
    {
      "id": "1.1.34",
      "text": "只听“啪”的一声，一个圆圆的、形状怪异的金属暗器深深地扎在谭璟的眉心上，谭璟没来得及哼一声就仰面摔倒在书桌前的地板上。",
      "level": 3
    },
    {
      "id": "1.1.35",
      "text": "黑衣蒙面人没看谭璟一眼就转身走出书房，幽灵般地消失在黑夜中……",
      "level": 3
    },
    {
      "id": "1.2",
      "text": "第一章 血掌",
      "level": 2
    },
    {
      "id": "1.2.1",
      "text": "时间：公元1937年6月28日早晨。",
      "level": 3
    },
    {
      "id": "1.2.2",
      "text": "地点：北平府右街，交通大学学生公寓内。",
      "level": 3
    },
    {
      "id": "1.2.3",
      "text": "天刚蒙蒙亮，一阵急促的敲门声把还在睡梦中的李梦龙惊醒了，听到门外有人喊，“李梦龙，有人给你送了一件东西，说是有急事，让你赶快看看。”",
      "level": 3
    },
    {
      "id": "1.2.4",
      "text": "李梦龙一听，答应一声急忙跳下床，打开门一看，原来是公寓楼看门的张大爷，手里托着一件长方形的东西，外面用牛皮纸包裹的严严实实。",
      "level": 3
    },
    {
      "id": "1.2.5",
      "text": "李梦龙接过纸包，感觉不是很重，猜不出里面是什么东西，有些奇怪，于是问了一句，“张大爷，是个什么样的人送来的？”",
      "level": 3
    },
    {
      "id": "1.2.6",
      "text": "“一个二十多岁的小伙子，说是令尊托他送来的，让你赶紧看看。把东西交给我后就走了。”",
      "level": 3
    },
    {
      "id": "1.2.7",
      "text": "“谢谢张大爷。”",
      "level": 3
    },
    {
      "id": "1.2.8",
      "text": "“不谢，我走了。”说完张大爷转身离开。",
      "level": 3
    },
    {
      "id": "1.2.9",
      "text": "李梦龙关上房门，转身走到靠近窗户的书桌边，把手里的东西放在桌子上，端详了一下这个一尺多长，像盒子一样的东西感觉很好奇，大清早的父亲让人送什么东西来？",
      "level": 3
    },
    {
      "id": "1.2.10",
      "text": "他伸手把插在笔筒里的水果刀拿过来，然后从一端将外层的牛皮纸划破，露出了黑色木盒的一角。",
      "level": 3
    },
    {
      "id": "1.2.11",
      "text": "李梦龙随即用小刀把包裹在外面的牛皮纸全部割开，里面是一个精致的木制盒子。",
      "level": 3
    },
    {
      "id": "1.2.12",
      "text": "黝黑发亮的木盒制作非常精致，表面没有任何修饰，从侧面看四四方方，像是一块木头雕刻而成没有一丝缝隙，甚至看不出如何打开，木盒似乎流露着一种诡秘气息。",
      "level": 3
    },
    {
      "id": "1.2.13",
      "text": "李梦龙端详片刻，随后拿起木盒轻轻晃动了一下，感觉里面有东西在动。",
      "level": 3
    },
    {
      "id": "1.2.14",
      "text": "与此同时，他的拇指放在木盒的顶部，无意中将上部木块顶开了一条缝隙，原来盒盖与木盒是镶嵌在一起的，可以从一端抽拉开来。",
      "level": 3
    },
    {
      "id": "1.2.15",
      "text": "随着裂开的缝隙，一股浓浓的血腥味从盒子里冒了出来，李梦龙急忙将盒盖全部抽出来，一副恐怖的画面出现在他的眼前，木盒内盛放着一只血淋淋的人手，断手的拇指上赫然戴着一个翠色浓艳的翡翠扳指。",
      "level": 3
    },
    {
      "id": "1.2.16",
      "text": "李梦龙的脸色瞬间变得煞白，顿时感觉一阵头晕目眩，大脑一片空白，忽然一阵强烈的恶心让他忍不住干呕了起来。",
      "level": 3
    },
    {
      "id": "1.2.17",
      "text": "李梦龙用手扶着桌子的一角，身体有些微微地颤抖，他努力控制住自己的情绪，睁大的双眼死死盯着断手拇指上的那个熟悉的翡翠扳指……",
      "level": 3
    },
    {
      "id": "1.2.18",
      "text": "没错，这个玉扳指就是父亲的，李梦龙对这个翡翠扳指太熟悉了，只要看到父亲就会看到这个扳指儿，他从未见父亲从手上取下过，父亲对这个扳指似乎有种异乎寻常的痴爱。",
      "level": 3
    },
    {
      "id": "1.2.19",
      "text": "一时间李梦龙似乎还没有反应过来究竟发生了什么事，他无意识地用手触摸了一下木盒中那只没有血色的断手……一丝冰凉通过手指瞬间传遍他的全身，伸出去的手也如同触电般得猛地缩回来。",
      "level": 3
    },
    {
      "id": "1.2.20",
      "text": "李梦龙的大脑也随着清醒过来，一股寒意从心底泛起，本能地预感到家里可能发生了大事。",
      "level": 3
    },
    {
      "id": "1.2.21",
      "text": "李梦龙急忙又查看了一下木盒里面，除了这只断手没有其他任何物件，他又一把抓起包裹木盒的牛皮纸，里外翻看了一遍，上面同样没有一个字。",
      "level": 3
    },
    {
      "id": "1.2.22",
      "text": "李梦龙顾不上多想，拿起盒盖重新插回到木盒上，用最快的速度穿上衣服，然后抱起木盒就冲出了寝室……",
      "level": 3
    },
    {
      "id": "1.3",
      "text": "第二章 惨案",
      "level": 2
    },
    {
      "id": "1.3.1",
      "text": "李梦龙算是一个土生土长的北京人，已经好几代人生活在京城，他的家在北京城内的东四四条胡同，这是个让外地人听起来感觉怪怪的地名。",
      "level": 3
    },
    {
      "id": "1.3.2",
      "text": "其实北京城内的许多地名都很有讲究和来历，例如东四这个地名，可不是胡乱起的，是东四牌楼的简称。",
      "level": 3
    },
    {
      "id": "1.3.3",
      "text": "明朝永乐皇帝改建北京时，为了讲究气势和格局，就分别在北京城的东四、西四、东单、西单等地方建立了一批牌楼。",
      "level": 3
    },
    {
      "id": "1.3.4",
      "text": "正是因为在东四这个十字路口的四个方向各建了一个牌楼，于是就有了东四牌楼和东四这两个地名。",
      "level": 3
    },
    {
      "id": "1.3.5",
      "text": "东四牌楼，那可算得上是宏伟壮丽，有气势，每个牌楼都是四柱三楼式，描金彩绘，檐下还有如意斗拱。",
      "level": 3
    },
    {
      "id": "1.3.6",
      "text": "东西两个牌楼上个写有“履仁”、“行义”，南北牌楼上则皆书有“大市街”三字。",
      "level": 3
    },
    {
      "id": "1.3.7",
      "text": "而这南北走向的大市街，就是今天看到的东四南北大街，同时也是东四地区商业的精华所在，这条大街上汇集了当时北京最知名的老买卖。",
      "level": 3
    },
    {
      "id": "1.3.8",
      "text": "北京城内有“东富西贵”之说，而这个东富的意思就是指东四这一带是商家和富人聚集的地方，例如控制老北京金融市场的四大钱庄，其中恒兴号、恒和号、恒利号三大钱庄都在这里。",
      "level": 3
    },
    {
      "id": "1.3.9",
      "text": "而西城多是达官贵人居住生活的地方。",
      "level": 3
    },
    {
      "id": "1.3.10",
      "text": "金店、钱庄、粮行和当铺统称为老北京的“四大行”，而这四个行当可以说直接操纵着京城的金融行情，所以必须具有很强的经济实力才能从事这四个行当。",
      "level": 3
    },
    {
      "id": "1.3.11",
      "text": "李梦龙的父亲就在大市街开着一家最大的粮行，而且还在另外几家金店和当铺都有份子，所以李府的经济实力可想而知。",
      "level": 3
    },
    {
      "id": "1.3.12",
      "text": "四条胡同中段有一座广亮大门楼，筒瓦硬山过垄脊，门楣处四个雕花门簪，门旁一对雕刻精美的抱鼓石，门檐柱带雀替，朱红色的如意大门。",
      "level": 3
    },
    {
      "id": "1.3.13",
      "text": "一看这门楼的气势，就知道院内居住的不是一般人，这里就是李梦龙的家。",
      "level": 3
    },
    {
      "id": "1.3.14",
      "text": "李梦龙的父亲叫李承耀，不仅是个生意人，而且还是北平三合会的会长。",
      "level": 3
    },
    {
      "id": "1.3.15",
      "text": "三合会的前身是清代民间秘密社团天地会。",
      "level": 3
    },
    {
      "id": "1.3.16",
      "text": "三合会的成员多是侠义之士，辛亥革命期间，三合会积极参与革命，并协助孙中山、黄兴、陈其美等革命人士举行武装起义，李承耀就曾为保护革命人士受过重伤。",
      "level": 3
    },
    {
      "id": "1.3.17",
      "text": "当李梦龙坐着黄包车从府右街赶到四条胡同，远远地就看见自己家楼处站着几个警察，不祥的预感立刻袭上心头，他赶紧跺了一下踏板让黄包车停下。",
      "level": 3
    },
    {
      "id": "1.3.18",
      "text": "李梦龙一只手抱着木盒跳下车，从口袋里摸出一块大洋，扬手抛给车夫，说了一句，“不用找了。”转身就往大门口跑。",
      "level": 3
    },
    {
      "id": "1.3.19",
      "text": "还没等李梦龙跑上台阶，旁边一个警察伸出警棍拦住了他，“干什么的，这里封了，不能进……”",
      "level": 3
    },
    {
      "id": "1.3.20",
      "text": "“这是我家！”李梦龙喊了一声，同时伸出胳膊不经意间使出了一招白鹤亮翅，一下把拦他的警车拨到了一边，抬脚冲上了台阶。",
      "level": 3
    },
    {
      "id": "1.3.21",
      "text": "一看李梦龙的这个架势，像是猛虎下山，其他几个警察也不敢再阻拦，任由他冲进大门里。",
      "level": 3
    },
    {
      "id": "1.3.22",
      "text": "这是一座标准的老北京四合院，布局严谨，有明显的中轴线，左右对称主次分明，沿中轴方向由目字形的三进院落组成。",
      "level": 3
    },
    {
      "id": "1.3.23",
      "text": "第一进院有假山、游廊，大门内倒座房东三间，西五间，北房三间带前后过廊，明间为一过道门可通二进院。",
      "level": 3
    },
    {
      "id": "1.3.24",
      "text": "刚冲进大门内，一股浓浓的血腥味就扑面而来，东西厢房门口都有警察，这两边都是家里的下人居住的地方，李梦龙跑到东侧厢房的门口，往里一看，床上的几具尸体已经盖上了白布，正准备往外抬。",
      "level": 3
    },
    {
      "id": "1.3.25",
      "text": "李梦龙愤怒地一把抓住身边一个警察的胳膊，大声质问：“是谁干的？”",
      "level": 3
    },
    {
      "id": "1.3.26",
      "text": "警察白了他一眼，没好气地说：“我还想知道谁干的呢！”",
      "level": 3
    },
    {
      "id": "1.3.27",
      "text": "李梦龙顾不上再问，转身往北房明间的过道跑去，父母住在最后面的院子里，他现在最担心地是家人的安全，父亲的手掌都被砍下来，看来是凶多吉少了。",
      "level": 3
    },
    {
      "id": "1.3.28",
      "text": "当李梦龙跑进后花园，里面的情景使他的心一下子提了起来，庭院两边的游廊和中间的甬道上都站着十多个斜挎盒子炮的便衣，整个院内都弥漫着紧张气氛，李梦龙刚要往北面的正房走，一个家伙马上拦住了他。",
      "level": 3
    },
    {
      "id": "1.3.29",
      "text": "“站住，里面正在勘查现场，谁也不能过去。”",
      "level": 3
    },
    {
      "id": "1.3.30",
      "text": "李梦龙顾不上搭理他，右手轻轻一划拉，将他拨到甬道的一边，然后就往明间那边闯。",
      "level": 3
    },
    {
      "id": "1.3.31",
      "text": "“站住，老子一枪灭了你。”",
      "level": 3
    },
    {
      "id": "1.3.32",
      "text": "被轻轻一推就弄到一边，对方显然是个功夫很深的练家子，这个便衣恼羞成怒，顺手从枪套里拔出了二把盒子，扒开枪机将枪口对准了李梦龙的后背。",
      "level": 3
    },
    {
      "id": "1.3.33",
      "text": "叫喊声惊动了其他人，正房前的过廊内也有三个便衣，见状纷纷拔出了家伙，将枪口对准李梦龙，挡住了他的去路。",
      "level": 3
    },
    {
      "id": "1.3.34",
      "text": "“让开，这是我家，我要看看父母怎么样了！”李梦龙大声说。",
      "level": 3
    },
    {
      "id": "1.3.35",
      "text": "这时正房的明间门口出现一个三十多岁的男子，中等身材，西装革履，头戴礼帽，脸上不带丝毫表情，一副冷漠的神态，这个人往李梦龙这边看了看，随后挥了一下拿在手里的白手套，示意那几个人让李梦龙过来。",
      "level": 3
    },
    {
      "id": "1.3.36",
      "text": "等李梦龙走进前廊，这个人用犀利的目光上下打量着他，“你是什么人？”",
      "level": 3
    },
    {
      "id": "1.3.37",
      "text": "“我叫李梦龙，这里是我的家。”",
      "level": 3
    },
    {
      "id": "1.3.38",
      "text": "说话的同时李梦龙仔细地端详着问话人，眼神中流露着猜疑，一副冷如冰霜拒人千里的表情，让他感觉很不舒服。",
      "level": 3
    },
    {
      "id": "1.3.39",
      "text": "这个人点点头，看样子知道李梦龙的情况，随即说：“你是李府的大公子，现在交通大学上学。”",
      "level": 3
    },
    {
      "id": "1.3.40",
      "text": "“我父母怎么样了？”李梦龙焦急地问，他现在没有心情跟人闲聊。",
      "level": 3
    },
    {
      "id": "1.3.41",
      "text": "“没有发现你的父母，估计是被凶手绑架了。”",
      "level": 3
    },
    {
      "id": "1.3.42",
      "text": "李梦龙悬着的心稍微放松了一下，这说明父母有可能还活着，急忙又问：“其他人怎么样了？”",
      "level": 3
    },
    {
      "id": "1.3.43",
      "text": "“只留下了两个活口，其他人都被害了。有个叫丑哥的被捆绑在堂屋的太师椅上，另外还有一个人中了一枪，不过没死已经被送往医院了。”",
      "level": 3
    },
    {
      "id": "1.3.44",
      "text": "“丑哥！他在哪里？”李梦龙焦急问，他猜想丑哥或许知道父母的一些情况。",
      "level": 3
    },
    {
      "id": "1.3.45",
      "text": "丑哥是李府的家丁，比李梦龙大几岁。",
      "level": 3
    },
    {
      "id": "1.3.46",
      "text": "丑哥人如其名，长得奇丑无比，大大的脑门，圆圆的小眼睛，而整个脸部却只有拳头那么大，猛一看就像是一个外星人。",
      "level": 3
    },
    {
      "id": "1.3.47",
      "text": "就是因为长得太丑，被村子里的人视为怪物，三岁多的时候被家里抛弃，在街上乞讨的时候被李梦龙的父亲遇到，可怜这个孩子，把他带回家里，李承耀对于丑哥来说如同再生父母，所以丑哥对李承耀也是忠心耿耿。",
      "level": 3
    },
    {
      "id": "1.3.48",
      "text": "这个人似乎看出了李梦龙的心思，对他说：“这个丑哥什么都不知道，提供不出有价值的线索。”",
      "level": 3
    },
    {
      "id": "1.3.49",
      "text": "随后又自我介绍说：“我姓严，名弘帅，侦缉处的，现在由我负责这个案件……”",
      "level": 3
    },
    {
      "id": "1.3.50",
      "text": "没等严弘帅说完，旁边一个便衣立刻上来拍马屁，“这是我们的处长，北平赫赫有名的神探。”",
      "level": 3
    },
    {
      "id": "1.3.51",
      "text": "严弘帅注意到了李梦龙左手抱着的精致木盒，于是用手指指木盒问：“能告诉我这里面是什么吗？”",
      "level": 3
    },
    {
      "id": "1.3.52",
      "text": "“呃……里面是……我的私人物品……”不知为什么李梦龙心里突然闪过一个念头，不能把木盒内的断手告诉其他人，为了不引起严弘帅的疑心，急忙岔开话题，“严处长，发现什么线索了没有？”",
      "level": 3
    },
    {
      "id": "1.3.53",
      "text": "“根据现场勘查，进入这里的至少有十多人，从遗留的弹壳可以知道，凶手使用的是口径9毫米的毛瑟手枪，作案时间大约在凌晨三点钟左右，周围的邻居都没有听到枪声，因此推测枪上可能装有消音器。",
      "level": 3
    },
    {
      "id": "1.3.54",
      "text": "从装备上推断可能不是一般的盗匪，行凶者手段凶残，而且干净利落，死者都是一枪毙命，好像跟你们家有深仇大恨。",
      "level": 3
    },
    {
      "id": "1.3.55",
      "text": "另外来人好像对财物不感兴趣……”",
      "level": 3
    },
    {
      "id": "1.3.56",
      "text": "严弘帅说话的同时，眼睛紧紧地盯着李梦龙，刚才李梦龙回答时闪烁其词，好像在掩盖什么，所以他想从李梦龙的表情中寻找答案。",
      "level": 3
    },
    {
      "id": "1.3.57",
      "text": "“严处长，能不能先让我见见丑哥？”",
      "level": 3
    },
    {
      "id": "1.3.58",
      "text": "李梦龙突然打断严弘帅的话，他有种预感，凶手绝对不会平白无故地留下丑哥这个活口。",
      "level": 3
    },
    {
      "id": "1.3.59",
      "text": "另外行凶者用父亲的断手把自己引回家，一定有什么目的。",
      "level": 3
    },
    {
      "id": "1.3.60",
      "text": "严弘帅略一沉思，然后把身体往旁边一闪，“好吧，丑哥还在明间里，你去吧。”",
      "level": 3
    },
    {
      "id": "1.3.61",
      "text": "北房明间内的地面上还有黑乎乎的两滩血迹，也不知道是谁留下的。",
      "level": 3
    },
    {
      "id": "1.3.62",
      "text": "只见丑哥表情痴呆地坐在旁边的红木太师椅上，仿佛被吓傻了样，脸上没有任何表情，身体一动不动，有一个探员在向他询问着什么。",
      "level": 3
    },
    {
      "id": "1.3.63",
      "text": "看到李梦龙走了进来，丑哥的眼珠动了一下，表情随即发生了变化，呼呼地喘着粗气，胸脯不住地上下起伏，显得异常激动。",
      "level": 3
    },
    {
      "id": "1.3.64",
      "text": "小眼睛瞪得溜圆，憋了几秒钟后，哇的一声大哭起来，从椅子上一下子扑倒在地，向前爬了两步，一把抱住李梦龙的双腿放声大哭起来，一边哭一边哽咽着念道：“少爷啊……老爷、夫人都被人抓走了……还有小姐也被带走了……其他人都被杀害了……都死了……”",
      "level": 3
    },
    {
      "id": "1.3.65",
      "text": "李梦龙知道丑哥对父亲的感情，比他这个做儿子的还重，赶紧弯腰搀扶着丑哥的胳膊，把他拉起来，“丑哥，快起来，告诉我是谁干的？”",
      "level": 3
    },
    {
      "id": "1.3.66",
      "text": "丑哥抽搐着说：“那些人……都蒙着脸，见人就杀……不知道是些什么人。”",
      "level": 3
    },
    {
      "id": "1.3.67",
      "text": "“他们什么话也没说？”李梦龙怀疑地问。",
      "level": 3
    },
    {
      "id": "1.3.68",
      "text": "丑哥靠近李梦龙低声说：“少爷，有件事我要单独跟你说。”",
      "level": 3
    },
    {
      "id": "1.3.69",
      "text": "李梦龙怔了一下，他随即明白过来，抓走父母的人一定是留下什么话。",
      "level": 3
    },
    {
      "id": "1.3.70",
      "text": "李梦龙没有做声，转身朝右侧的一个门口走去，这个门口通向父亲的内书房，平常是不让人随便进入。",
      "level": 3
    },
    {
      "id": "1.3.71",
      "text": "俩人走进书房后，跟在后面的丑哥回身把房门关上，随后匆忙从口袋里摸出一个信封，一脸焦急的表情，压低声音说：“领头的那个人临走时塞进我的口袋里，说这封信必须交给你，而且不能让任何人知道，否则老爷夫人还有小姐的命就没有了……”",
      "level": 3
    },
    {
      "id": "1.3.72",
      "text": "李梦龙匆忙把信抽出来，只见上面用毛笔写着三句话：限你三天时间，找出三合会守护的秘密来换取你家人的性命，否则你知道后果。",
      "level": 3
    },
    {
      "id": "1.3.73",
      "text": "看着信上的字，李梦龙一下子愣住了，他虽然知道父亲是三合会的会长，但是他并不知道三合会有什么秘密，而且也从未听父亲说起过，到底是什么秘密？",
      "level": 3
    },
    {
      "id": "1.3.74",
      "text": "忽然间，李梦龙仿佛感觉到有座山压在了自己的肩膀上，如论如何必须找出这个秘密来救自己的亲人。",
      "level": 3
    },
    {
      "id": "1.3.75",
      "text": "愣了片刻后，李梦龙忽然想起木盒中父亲的手掌，于是把木盒放在书桌上，然后将盒盖轻轻抽出来，同时对丑哥说：“丑哥，你看一下这个是否是家父的……”",
      "level": 3
    },
    {
      "id": "1.3.76",
      "text": "当丑哥看见木盒内的断手后，立刻张大了嘴巴，随即哆嗦着说：“这……这……是老爷的手……”",
      "level": 3
    },
    {
      "id": "1.3.77",
      "text": "李梦龙一把抓住丑哥的肩膀，用低沉的声音问：“昨晚究竟发生了什么事情，家父被抓走的时候你看到了没有？”",
      "level": 3
    },
    {
      "id": "1.3.78",
      "text": "“昨晚我睡得特别死，被人捆绑起来后才醒过来，你知道我是和李先生住一间屋，我们俩被几个蒙面人推到明间外的前廊里，我听到有个人在明间里面对老爷说，让老爷交出掌握的秘密，不过老爷一直说不知道。",
      "level": 3
    },
    {
      "id": "1.3.79",
      "text": "后来他们就当着老爷的面把春梅她们俩杀了……又把夫人和小姐推进去，威胁老爷说要杀了夫人和小姐，老爷还是说不知道，最后他们就把老爷、夫人他们一起装进口袋里，临走的时候把我捆绑在椅子上，朝李先生的胸口开了一枪就走了……”",
      "level": 3
    },
    {
      "id": "1.3.80",
      "text": "“他们没说是什么秘密吗？”李梦龙急忙问。",
      "level": 3
    },
    {
      "id": "1.3.81",
      "text": "丑哥摇摇头，然后好奇地问：“难道少爷也不知道是什么秘密吗？”",
      "level": 3
    },
    {
      "id": "1.3.82",
      "text": "“不知道，从来没有听爹说过三合会守护着什么秘密……”",
      "level": 3
    },
    {
      "id": "1.3.83",
      "text": "没等李梦龙说完，丑哥就焦急地说：“这可怎么办好，得赶紧想方法救老爷夫人，那些家伙都是杀人不眨眼的魔鬼。”",
      "level": 3
    },
    {
      "id": "1.4",
      "text": "第三章 密信",
      "level": 2
    },
    {
      "id": "1.4.1",
      "text": "丑哥话音未落，身后突然响了两下敲门声，没等丑哥去开门，严弘帅已经从外面推开了结实的雕花木门，随后迈步走进了。",
      "level": 3
    },
    {
      "id": "1.4.2",
      "text": "“李公子，希望你不要有事情瞒着我，否则对破案不利，现在你的家人下落不明，生死未卜，你必须跟我们侦缉处合作，才有希望营救他们……”严弘帅神情严肃地说。",
      "level": 3
    },
    {
      "id": "1.4.3",
      "text": "眼见事情瞒不过这位处长了，李梦龙只好如实说：“抓走我父母的人离开前塞进丑哥的口袋里一封信，并警告他这封信只能给我看，否则会杀了我的家人。”",
      "level": 3
    },
    {
      "id": "1.4.4",
      "text": "说着话，李梦龙把手里的信递给严弘帅。",
      "level": 3
    },
    {
      "id": "1.4.5",
      "text": "严弘帅接过信后并没有着急看，而是用怀疑的目光盯着李梦龙，“李公子，此刻你应该是在学校里上课，能告诉我，你为什么赶回家里来吗？”",
      "level": 3
    },
    {
      "id": "1.4.6",
      "text": "李梦龙指着桌上的木盒说：“今天早上不知道是什么人把这个东西送到学校，里面是一只断手，拇指上的这个玉扳指与我父亲戴的那个很相似，所以我猜测家里可能出了意外，就急忙赶回来了。”",
      "level": 3
    },
    {
      "id": "1.4.7",
      "text": "严弘帅看了一眼木盒中那只血迹斑驳的断手，吃惊地问：“你能确定这只手是令尊的？”",
      "level": 3
    },
    {
      "id": "1.4.8",
      "text": "“这个翡翠扳指的确是家父的。”",
      "level": 3
    },
    {
      "id": "1.4.9",
      "text": "李梦龙的话让人感觉有些模棱两可，虽然理智告诉他这只断手就是父亲的，但是情感上却在排斥这个事实，所以他不愿意直接说出来。",
      "level": 3
    },
    {
      "id": "1.4.10",
      "text": "严弘帅没有再吭声，低头看着手里的信，思考了一下，抬头望着李梦龙说：“很显然这些人是冲着三合会的秘密而来，你知道这个秘密是什么吗？”",
      "level": 3
    },
    {
      "id": "1.4.11",
      "text": "“问题的关键是我不知道三合会有什么秘密，也从未听家父提起过……”李梦龙焦躁不安地说。",
      "level": 3
    },
    {
      "id": "1.4.12",
      "text": "严弘帅把信又递给李梦龙，然后分析说：“现在看来这些人的目的非常明确，就是冲着三合会守护的秘密而来，他们计划周密，而且制定了不止一套方案。",
      "level": 3
    },
    {
      "id": "1.4.13",
      "text": "从现场情况分析，先威逼令尊，想从令尊口中得到这个秘密，很显然没有得逞。",
      "level": 3
    },
    {
      "id": "1.4.14",
      "text": "随后开始第二套方案，留下丑哥这个活口，就是为了给你传话。",
      "level": 3
    },
    {
      "id": "1.4.15",
      "text": "你是李府长子，所以他们相信你或许知道这个秘密，从而用你的家人作为人质来威逼你……”",
      "level": 3
    },
    {
      "id": "1.4.16",
      "text": "李梦龙赞同严弘帅严谨的推理，事情很可能如他所说，于是急忙问：“严处长，现在该怎么办？我根本不知道这个什么秘密。”",
      "level": 3
    },
    {
      "id": "1.4.17",
      "text": "“从整个作案过程可以判断出，这些人对你们家的情况非常熟悉，甚至每个人睡觉的房间都掌握得一清二楚。",
      "level": 3
    },
    {
      "id": "1.4.18",
      "text": "他们很可能已经估计到，从令尊口中得不到这个秘密，所以才会事先考虑好了第二步计划，用你的家人做人质，迫使你用这个秘密来换取家人的性命。",
      "level": 3
    },
    {
      "id": "1.4.19",
      "text": "这也说明这个秘密非常重要，我们必须了解这个秘密究竟是什么，才能制定相应的对策……”",
      "level": 3
    },
    {
      "id": "1.4.20",
      "text": "李梦龙一边听严弘帅说，一边着急得在书房里来回踱步，家中突然发生这么大的事情，他已经乱了方寸，感觉自己束手无策一点办法都没有，烦躁地打断了严弘帅的话，“可是我根本不知道这个秘密是什么，怎么救我父母和妹妹？我要去向谁打听这个狗屁秘密……”",
      "level": 3
    },
    {
      "id": "1.4.21",
      "text": "“李公子，我希望你冷静下来，着急与事无补，反而会给对方可乘之机。”",
      "level": 3
    },
    {
      "id": "1.4.22",
      "text": "李梦龙停下脚步，冲着严弘帅大声说：“我们李家上上下下死了二十多口人，我的父母妹妹下落不明，我怎么能冷静！”",
      "level": 3
    },
    {
      "id": "1.4.23",
      "text": "“对方给你的信上并没有留下联系方式，说明他们肯定还会找你，只要有人露面，我们就可以顺藤摸瓜找到他们。”",
      "level": 3
    },
    {
      "id": "1.4.24",
      "text": "李梦龙感觉严弘帅的话有道理，自己光顾着急了没有仔细地考虑这些问题，他急忙问：“那我就在这里等着他们的人来吗？”",
      "level": 3
    },
    {
      "id": "1.4.25",
      "text": "严弘帅摇摇头，“事情恐怕没有这么简单，现在虽然还不清楚对方使用什么手段联系你，但是可以肯定，他们对你的情况掌握得一清二楚，所以我推测如果你找不出三合会守护的那个秘密，他们的人一定不会露面。”",
      "level": 3
    },
    {
      "id": "1.4.26",
      "text": "“严处长的意思是我必须要找到他们所说的那个秘密，然后才能把他们引出来？”",
      "level": 3
    },
    {
      "id": "1.4.27",
      "text": "“恐怕如此。”",
      "level": 3
    },
    {
      "id": "1.4.28",
      "text": "“可是……我……”李梦龙急得张口结舌地不知道如何表达。",
      "level": 3
    },
    {
      "id": "1.4.29",
      "text": "严弘帅摆摆手，示意李梦龙不要着急，同时安慰他说：“李公子先不要着急，对方给你限定了三天时间，他们既然这么做，说明他们相信你能找到。",
      "level": 3
    },
    {
      "id": "1.4.30",
      "text": "你先在这里认真思考一下，看看是否能发现什么线索，我去处理外面的事情，有什么情况咱们及时通气。”",
      "level": 3
    },
    {
      "id": "1.4.31",
      "text": "“好吧，拜托严处长费心了。”",
      "level": 3
    },
    {
      "id": "1.4.32",
      "text": "严弘帅走到书房门口，忽然又回过头来看着李梦龙说：“冷静，你现在最需要的是冷静，另外考虑一下，还有谁可能知道三合会的秘密。”",
      "level": 3
    },
    {
      "id": "1.4.33",
      "text": "“谢谢严处长，我知道了。”",
      "level": 3
    },
    {
      "id": "1.4.34",
      "text": "严弘帅出去后，站在一旁的丑哥小心翼翼地对李梦龙说：“少爷，你坐着，我去厨房给你弄点吃的。”",
      "level": 3
    },
    {
      "id": "1.4.35",
      "text": "李梦龙现在哪有心思吃东西，他摆摆手轻声说：“不用了，丑哥，我先问你件事。”说着话李梦龙坐在书桌后面的圈椅上。",
      "level": 3
    },
    {
      "id": "1.4.36",
      "text": "“哎，少爷要问什么事？”",
      "level": 3
    },
    {
      "id": "1.4.37",
      "text": "丑哥的年龄比李梦龙大几岁，李梦龙从小就记得丑哥一直跟随父亲，虽然丑哥是个下人，而且长相又奇丑无比，但是父亲从不把丑哥当做外人，也许丑哥能知道一点那个什么秘密。",
      "level": 3
    },
    {
      "id": "1.4.38",
      "text": "“丑哥，你跟随我父亲这么多年，难道就没有听家父提起过三合会有什么秘密？”",
      "level": 3
    },
    {
      "id": "1.4.39",
      "text": "丑哥低头想了一下，随后摇着头说：“没有，从来没有听老爷说起过，我被绑在前廊的时候，听到明间有个人问老爷三合会守护的秘密，当时就感觉很奇怪，从来没有听说过咱们三合会有什么秘密。”",
      "level": 3
    },
    {
      "id": "1.4.40",
      "text": "丑哥是父亲身边最信任的人，如果连他 ভবিষ্যৎ知道有什么秘密，那其他人就更不可能知道了。",
      "level": 3
    },
    {
      "id": "1.4.41",
      "text": "李梦龙沉思了一会，疑惑不解地问：“丑哥，我记得你睡觉一直很警觉，昨晚怎么会一点动静也没有听到吗？”",
      "level": 3
    },
    {
      "id": "1.4.42",
      "text": "丑哥皱着眉头，有些内疚地说：“我昨晚睡得特别早，吃过晚饭不久就感觉特别困，跟老爷说了一声就回房睡了。醒来的时候已经被人捆绑起来了，什么动静也没听到。”",
      "level": 3
    },
    {
      "id": "1.4.43",
      "text": "“哦！难道家里二十多口人都没有听到动静？”李梦龙用怀疑的语气问，他忽然感觉那个地方有些不对劲。",
      "level": 3
    },
    {
      "id": "1.4.44",
      "text": "“不知道，我跟李先生睡一个屋，醒来的时候看到他也被捆绑起来了，我们俩被推到了院子后，看到夫人、小姐，还有春梅她们两个人也都被捆绑着站在明间外面，当时好像只有老爷一个人在明间里面……”",
      "level": 3
    },
    {
      "id": "1.4.45",
      "text": "李梦龙越想越感觉事情有些蹊跷，住在前院里的这些人，有几个都是父亲的徒弟，内家功夫非常了得，怎么会一点动静也没听到？莫非是被人下了迷药？",
      "level": 3
    },
    {
      "id": "1.4.46",
      "text": "刚才严弘帅提到，凶手对家里的情况非常清楚，难道家里有他们的内线？想到这里李梦龙忍不住打了一个寒战，如果是那样就太可怕了。",
      "level": 3
    },
    {
      "id": "1.4.47",
      "text": "整个李府唯一没有受到伤害的就是丑哥，如果要说丑哥会出卖父亲，李梦龙说什么也不会相信。",
      "level": 3
    },
    {
      "id": "1.4.48",
      "text": "“丑哥，警察是如何知道咱们家出了事的？”李梦龙忽然又问。",
      "level": 3
    },
    {
      "id": "1.4.49",
      "text": "“有两个蒙面人先把我捆绑在太师椅上，还用手巾把我的嘴也塞上了，离开前向李先生开了一枪，没想到李先生没死，过了有半个时辰他又活过来了。",
      "level": 3
    },
    {
      "id": "1.4.50",
      "text": "李先生把塞在我嘴里的手巾弄出来，我用牙把捆绑在李先生身上的绳子解开，然后李先生向警察局打电话，打完电话后还没来得及把我松开，他又昏倒在地上，一直等到警察来把他抬走了。”",
      "level": 3
    },
    {
      "id": "1.4.51",
      "text": "丑哥说的这个李先生叫李庚，不到三十岁，是一个落魄书生，几年前从外地流落到京城，靠给人家写信混饭吃。",
      "level": 3
    },
    {
      "id": "1.4.52",
      "text": "李梦龙的父亲看中了李庚的才华收留了他。",
      "level": 3
    },
    {
      "id": "1.4.53",
      "text": "李庚也没让李承耀失望，不仅写的一手好字，而且还会记账，于是做了李家的账房先生，而且这个李庚足智多谋，对事情往往有独到的见解，因此深得李承耀的信任和赏识，有什么事情也喜欢跟他商量。",
      "level": 3
    },
    {
      "id": "1.4.54",
      "text": "李府的佣人、家丁有二十多人，只有丑哥和李庚两个人住在后院的西厢房，这说明李承耀把他们俩当做自家人看待。",
      "level": 3
    },
    {
      "id": "1.4.55",
      "text": "李梦龙和丑哥正说着话，严弘帅推门进来，手里拿着几张纸。",
      "level": 3
    },
    {
      "id": "1.4.56",
      "text": "李梦龙急忙站起来，猜想严弘帅可能有线索了。",
      "level": 3
    },
    {
      "id": "1.4.57",
      "text": "“李公子，请你们俩核对一下这些遇害的人，是否有漏掉的人，另外看一下他们的身份是否符合。”",
      "level": 3
    },
    {
      "id": "1.4.58",
      "text": "说着话严弘帅把名单放在书桌上，随即又补充道：“我让李记粮行的王掌柜带着两个伙计逐一核对的，王掌柜要到后面来看你，我让他先等等……”",
      "level": 3
    },
    {
      "id": "1.4.59",
      "text": "李承耀出了事，李梦龙自然就是粮行当家的，王掌柜肯定要来向他请示，特别是家里出了这么大的事情。",
      "level": 3
    },
    {
      "id": "1.4.60",
      "text": "这可是灭门惨案，这个时候恐怕整个东四地界内已经传遍了。",
      "level": 3
    },
    {
      "id": "1.4.61",
      "text": "李梦龙瞅了一眼桌上的名单，心里猜到了严弘帅这样做的目的，于是问道：“严处长是不是怀疑我们家有内线？”",
      "level": 3
    },
    {
      "id": "1.4.62",
      "text": "严弘帅瞥了丑哥一眼没有说话，李梦龙立刻明白了她的意思，于是对丑哥说：“你先到外面去，我跟严处长商量点事情。”",
      "level": 3
    },
    {
      "id": "1.4.63",
      "text": "丑哥答应一声，没有多想就走出书房。",
      "level": 3
    },
    {
      "id": "1.4.64",
      "text": "严弘帅看着李梦龙说：“从案发过程分析，有内线的可能性非常大，李府中所有人都有嫌疑……”",
      "level": 3
    },
    {
      "id": "1.4.65",
      "text": "李梦龙对严弘帅这句话很反感，这样说等于<bos>把他纳入到了嫌疑人中，马上反驳道：“严处长的意思，这些被害的人也有可能是他们的内线？”",
      "level": 3
    },
    {
      "id": "1.4.66",
      "text": "“不错，这伙人非常凶残，杀人灭口不是没有可能。”",
      "level": 3
    },
    {
      "id": "1.4.67",
      "text": "“这么说我也有嫌疑了？”李梦龙生气地反问。",
      "level": 3
    },
    {
      "id": "1.4.68",
      "text": "“李公子误会我的意思了，丑哥和那个受伤的李庚都有嫌疑，因为整个李府就他们两个人活下来，特别是丑哥……”",
      "level": 3
    },
    {
      "id": "1.4.69",
      "text": "不等严弘帅说完李梦龙就打断了他的话，“严处长，你不了解丑哥跟我们家的关系，他对家父的感情甚至超过我这个做儿子的，如果说丑哥出卖李家，绝对不可能。”",
      "level": 3
    },
    {
      "id": "1.4.70",
      "text": "“李公子，很多时候人们总是被表面现象所蒙蔽，调查案件是不能带有感情色彩的……”",
      "level": 3
    },
    {
      "id": "1.4.71",
      "text": "没等严弘帅说完李梦龙就打断了他的话，“严处长，我想侦缉处应该去追查绑架了我父母的那些人，而不是围绕着我们家里的人浪费时间。”",
      "level": 3
    },
    {
      "id": "1.4.72",
      "text": "李梦龙说话的时候眼睛不经意地落在了书桌一端的一摞账本上，这些账本都是李庚记的，他心里忽然闪过一个念头，父亲如果有什么难以解决的事情一般都会对李庚说，总是很认真地听取李庚的意见，或许李庚对这个秘密有所了解。",
      "level": 3
    },
    {
      "id": "1.4.73",
      "text": "想到这里，李梦龙看着严弘帅问：“请问你们把受伤的李先生送到那家医院了？我想去看看他。”",
      "level": 3
    },
    {
      "id": "1.4.74",
      "text": "“协和医院。”",
      "level": 3
    },
    {
      "id": "1.4.75",
      "text": "严弘帅沉吟了一下接着说：“这个……李公子，请恕我直言，当务之急是要知道三合会守护的那个秘密是什么，这也是了解凶手身份的关键。",
      "level": 3
    },
    {
      "id": "1.4.76",
      "text": "如果知道了这个秘密的具体内容，就能推断出是什么人绑架了令尊。”",
      "level": 3
    },
    {
      "id": "1.4.77",
      "text": "“我去探望李庚也是为这个，家父有什么重要的事情都是与他商谈，我想或许他能知道些内情。”",
      "level": 3
    },
    {
      "id": "1.4.78",
      "text": "严弘帅想了一下，随即说：“好吧，我安排两名兄弟陪同李公子一起去医院，我的车在大门外，你们乘车去可以节省时间。”",
      "level": 3
    },
    {
      "id": "1.4.79",
      "text": "“不用劳烦严处长的人，我自己去就可以。”",
      "level": 3
    },
    {
      "id": "1.4.80",
      "text": "严弘帅冷冷地说：“你现在是这个案件最关键的人，必须要保证你的安全。”",
      "level": 3
    },
    {
      "id": "1.4.81",
      "text": "听严弘帅这样说，李梦龙也不再坚持，他把盛放断手的木盒放到书桌下的抽屉中，然后同严弘帅一起走出内书房。",
      "level": 3
    },
    {
      "id": "1.5",
      "text": "第四章 奇迹",
      "level": 2
    },
    {
      "id": "1.5.1",
      "text": "李家所在的四条胡距离协和医院很近，沿东四南大街向南直行，只有几公里的路程。",
      "level": 3
    },
    {
      "id": "1.5.2",
      "text": "半个小时后，李梦龙就乘坐严弘帅的那辆黑色福特轿车来到了设在豫王府内的协和医院。",
      "level": 3
    },
    {
      "id": "1.5.3",
      "text": "北京协和是石油巨头洛克菲勒先生投资创建的一家医院，是协和医学院的附属医院，建于1921年，当时洛克菲勒先生还不远万里亲自前来祝贺。",
      "level": 3
    },
    {
      "id": "1.5.4",
      "text": "协和医院拥有北京最优秀的医生和先进的医疗设备。",
      "level": 3
    },
    {
      "id": "1.5.5",
      "text": "与不远处金碧辉煌的紫禁城不同，豫王府的屋顶都是绿色的琉璃瓦。",
      "level": 3
    },
    {
      "id": "1.5.6",
      "text": "虽然改成了医院，所有建筑依然保持着原貌，到处都是雕梁画栋，看起来给人气势非凡的感觉。",
      "level": 3
    },
    {
      "id": "1.5.7",
      "text": "两个便衣如同保镖，寸步不离地跟着李梦龙一起来到病房，房门敞开着，让李梦龙吃惊地是身穿病号服的李庚竟然坐在病床上，旁边站着一位穿白大褂的医生，俩人正在交谈着什么。",
      "level": 3
    },
    {
      "id": "1.5.8",
      "text": "李庚的脸色虽然还有些苍白，不过精神却不错，看到李梦龙走进来，显得有些意外，惊讶地问：“少爷，您怎么来了？”",
      "level": 3
    },
    {
      "id": "1.5.9",
      "text": "李梦龙从李庚胸前裂开的衣襟处看到了里面白色的绷带，胸口中了一枪怎么会好得这么快？很惊讶地问：“李先生，你的伤怎么样了？”",
      "level": 3
    },
    {
      "id": "1.5.10",
      "text": "李庚轻声说：“老天保佑，没有什么大事，我正在跟黄医生商量着准备出院。”",
      "level": 3
    },
    {
      "id": "1.5.11",
      "text": "“你要出院？这怎么可以。”李梦龙显然对李庚的这个决定很是吃惊。",
      "level": 3
    },
    {
      "id": "1.5.12",
      "text": "“家里出了那么大的事情，老爷夫人被人绑架了，我怎么能安心在这里养伤，再说我的伤也没什么大碍，不信你问黄医生。”",
      "level": 3
    },
    {
      "id": "1.5.13",
      "text": "站在病床另外一侧的这位黄医生三十多岁，戴着一副金丝眼镜，长得很白净，给人文质彬彬的感觉。",
      "level": 3
    },
    {
      "id": "1.5.14",
      "text": "黄医生连声感叹道：“奇迹，真的是奇迹，子弹从胸腔穿过去，竟然没有伤到任何器官。”",
      "level": 3
    },
    {
      "id": "1.5.15",
      "text": "“这么说李先生的伤真的没什么大事？”李梦龙显得有点喜出望外，这是今天听到的唯一一个好消息。",
      "level": 3
    },
    {
      "id": "1.5.16",
      "text": "“主要是防止伤口感染，除此之外应该没什么事。",
      "level": 3
    },
    {
      "id": "1.5.17",
      "text": "不过要卧床休养，不能有剧烈活动。”",
      "level": 3
    },
    {
      "id": "1.5.18",
      "text": "听黄医生这样说，李梦龙稍微有些放心，实话说他非常期望李庚能跟自己一起回家，现在太需要李庚的帮助了。",
      "level": 3
    },
    {
      "id": "1.5.19",
      "text": "李庚侧脸看着李梦龙，“少爷，你来得正是时候，麻烦你替我办一下出院手续，我现在就跟你一起回去。”",
      "level": 3
    },
    {
      "id": "1.5.20",
      "text": "李梦龙没有做声，他用征询的目光看着对面的黄医生。",
      "level": 3
    },
    {
      "id": "1.5.21",
      "text": "黄医生微微点了一下头，“要回去也可以，不过要带上预防感染的药，回家后要卧床休息。”",
      "level": 3
    },
    {
      "id": "1.5.22",
      "text": "李梦龙怎么也没想到李庚能跟自己回去，有李庚的帮助，或许就能找到那个秘密了，赶紧连声回答，“好，好，一定让李先生按时服药，卧床休养。”",
      "level": 3
    },
    {
      "id": "1.5.23",
      "text": "李梦龙很快办好了出院手续，然后又到药房取了黄医生开的一大包消炎药，随后几个人乘车回到东四四条胡同。",
      "level": 3
    },
    {
      "id": "1.5.24",
      "text": "可能是伤口还有些疼痛，李庚一只手捂在胸前的伤口上，行走的很慢。",
      "level": 3
    },
    {
      "id": "1.5.25",
      "text": "李庚的身体本来就瘦弱单薄，现在略微弯着腰，蓝布大褂拖在脚面上，感觉有些弱不禁风的样子。",
      "level": 3
    },
    {
      "id": "1.5.26",
      "text": "李梦龙搀扶着李庚慢慢走进弥漫着血腥和恐怖气氛的四合院，迎面碰到往外走严弘帅，不知为什么李庚的脸上闪过一丝异样的表情，似乎在刻意回避严弘帅的目光。",
      "level": 3
    },
    {
      "id": "1.5.27",
      "text": "李梦龙没有注意到李庚变化的神情，他急忙跟严弘帅打招呼，“严处长要出去？”",
      "level": 3
    },
    {
      "id": "1.5.28",
      "text": "“我要回去向局长汇报一下案情。”",
      "level": 3
    },
    {
      "id": "1.5.29",
      "text": "看到李庚后，严弘帅流露出意外的表情，似乎有些不太相信，他用怀疑的目光把李庚上下打量了一遍，惊讶地问：“李先生的伤这么快就好了？”",
      "level": 3
    },
    {
      "id": "1.5.30",
      "text": "李梦龙急忙说：“呃，吉人天相，子弹只是穿过了李先生的身体，并没有伤到体内的器官，医生说可以回来休养。”",
      "level": 3
    },
    {
      "id": "1.5.31",
      "text": "李梦龙注意到了严弘帅的表情中带着猜疑。",
      "level": 3
    },
    {
      "id": "1.5.32",
      "text": "去医院前严弘帅表示过对李庚和丑哥的怀疑，所以他也没有多想，搀扶着李庚朝后院走去。",
      "level": 3
    },
    {
      "id": "1.5.33",
      "text": "后院西厢房是李庚和丑哥住的房间，能与李承耀的家人住在一个后院里，也说明了俩人在李家特殊的地位，这是其他家丁都难以享受的待遇。",
      "level": 3
    },
    {
      "id": "1.5.34",
      "text": "正在北房前廊里的丑哥看到从过道进来的俩人，赶紧跑了过来，同李梦龙一起把李庚搀扶进西厢房里，让李庚躺在床上。",
      "level": 3
    },
    {
      "id": "1.5.35",
      "text": "李庚不住地说：“少爷，我没事，不用管我，你赶快去打听老爷和夫人的消息。”",
      "level": 3
    },
    {
      "id": "1.5.36",
      "text": "“李先生，你先躺着歇息一下，我去拿件东西来让你看看。”说完李梦龙匆忙走出西厢房。",
      "level": 3
    },
    {
      "id": "1.5.37",
      "text": "几分钟后李梦龙又回来了，手里捧着盛放断手的盒子。",
      "level": 3
    },
    {
      "id": "1.5.38",
      "text": "李庚急忙挺起上身想坐起来，丑哥见状急忙扶起李庚，让他靠在自己身体上。",
      "level": 3
    },
    {
      "id": "1.5.39",
      "text": "李梦龙表情凝重，缓慢地将盒盖抽出来，随后将木盒放在李庚面前。",
      "level": 3
    },
    {
      "id": "1.5.40",
      "text": "当李庚看清木盒里的断手后，脸色变得更加苍白，他抬起头吃惊地看着李梦龙，张口结舌地问：“这……这……这是老爷的手……少爷，你这是在什么地方发现的？”",
      "level": 3
    },
    {
      "id": "1.5.41",
      "text": "“这是今天早上我在学校里收到的。”",
      "level": 3
    },
    {
      "id": "1.5.42",
      "text": "这句话是从李梦龙的牙缝里挤出来的，说话的同时又从口袋里掏出那封信递给李庚，“李先生再看看这个。”",
      "level": 3
    },
    {
      "id": "1.5.43",
      "text": "李庚接过信，看了一眼后什么话也没有，静静地坐在那里一动不动，好像在思考着什么。",
      "level": 3
    },
    {
      "id": "1.5.44",
      "text": "李梦龙等了一会不见李庚说话，就着急地问：“李先生，你对信中提到的这个秘密知道多少？”",
      "level": 3
    },
    {
      "id": "1.5.45",
      "text": "“我不是三合会中的人，所以并不知道三合会守护的秘密是什么。”李庚轻轻地摇着头说，停顿了一下，他接着说：“不过我知道一个人，他或许知道这个秘密……”",
      "level": 3
    },
    {
      "id": "1.5.46",
      "text": "“呃，谁会知道这个秘密？”李梦龙迫不及待地问。",
      "level": 3
    },
    {
      "id": "1.5.47",
      "text": "“白云观的主持张元子道长。”",
      "level": 3
    },
    {
      "id": "1.5.48",
      "text": "一句话点醒梦中人，李梦龙抬手猛地拍了一下自己的脑门，恍然大悟地说：“对啊，我怎么没有想到师爷，他肯定会知道三合会守护的秘密是什么。”",
      "level": 3
    },
    {
      "id": "1.5.49",
      "text": "李梦龙之所以称张元子道长为师爷，是因为他的父亲李承耀是张元子的俗家弟子，道长同样也是三合会中的人，而且李承耀加入三合会就是道长介绍的，也是道长力荐他做了会长，所以三合会守护的秘密道长肯定知道。",
      "level": 3
    },
    {
      "id": "1.5.50",
      "text": "“少爷，我陪你去白云观吧。”李庚气喘吁吁地说，他的体质本来就弱，经过这一折腾，显得更虚弱了。",
      "level": 3
    },
    {
      "id": "1.5.51",
      "text": "李梦龙赶紧扶着李庚躺下，轻声说：“你在家好好休息，我自己去就可以了。”",
      "level": 3
    },
    {
      "id": "1.5.52",
      "text": "“少爷，还让我陪你去吧？”丑哥担心地说。",
      "level": 3
    },
    {
      "id": "1.5.53",
      "text": "“不，你在这里照顾好李先生，我很快就会回来。”说完，李梦龙抱起盛放断手的木盒匆忙走出厢房。",
      "level": 3
    },
    {
      "id": "1.6",
      "text": "第五章 白云观",
      "level": 2
    },
    {
      "id": "1.6.1",
      "text": "白云观位于北京城西便门外一公里处，此观始建于唐代，最早称为天长观。",
      "level": 3
    },
    {
      "id": "1.6.2",
      "text": "唐玄宗因为斋心敬道，奉祀老子，而建此观。",
      "level": 3
    },
    {
      "id": "1.6.3",
      "text": "观内至今还有一座汉白玉石雕的老子坐像，头顶束髻，长髯垂胸，身着道装，据说就是唐代的遗物。",
      "level": 3
    },
    {
      "id": "1.6.4",
      "text": "白云观是“全真第一丛林”，是道教仅有的两大教派之一的全真道的圣地。",
      "level": 3
    },
    {
      "id": "1.6.5",
      "text": "白云观享有如此盛名，是由于道教史上的著名人物邱处机晚年入居并仙逝于此观。",
      "level": 3
    },
    {
      "id": "1.6.6",
      "text": "观内有邱祖殿，奉祀全真龙门派始祖长春真人邱处机。",
      "level": 3
    },
    {
      "id": "1.6.7",
      "text": "殿内正中摆放着一个巨大的“瘿钵”，是用古树根雕制而成。",
      "level": 3
    },
    {
      "id": "1.6.8",
      "text": "此钵为清朝雍正皇帝所赐，据说观内道士生活无着落时，可抬着此钵到皇宫募化，宫中必有施舍。",
      "level": 3
    },
    {
      "id": "1.6.9",
      "text": "而邱Chu的遗蜕就埋藏于此“瘿钵”之下。",
      "level": 3
    },
    {
      "id": "1.6.10",
      "text": "白云观还是老北京的世俗乐园，逢年过节热闹非凡，特别是农历正月初一到初十的春节庙会，前来玩耍的人摩肩接踵。",
      "level": 3
    },
    {
      "id": "1.6.11",
      "text": "北京人有骑毛驴逛白云观的习俗，庙会上的毛驴，毛鬃刷得干干净净，额前还顶着红绸扎的花，透露着喜庆劲。",
      "level": 3
    },
    {
      "id": "1.6.12",
      "text": "不过现在的白云观却是门前冷落车马稀，日本人屯军平津一带，大兵压境，虎视眈眈地盯着京城，而且还不时地举行军事演习，伺机挑起战争，兵荒马乱的时候百姓哪里还有心情来逛白云观。",
      "level": 3
    },
    {
      "id": "1.6.13",
      "text": "李梦龙来到白云观山门外时，刚好是正午时分，平日里人流如织的山门此时却见不到一个人影。",
      "level": 3
    },
    {
      "id": "1.6.14",
      "text": "虽然是艳阳高照，眼前的道观却显得有些凄凉和萧条，李梦龙的心里忽然产生了一丝不安，直觉提醒他有什么意外要发生。",
      "level": 3
    },
    {
      "id": "1.6.15",
      "text": "白云观内的一切对于李梦龙来说都很熟悉，从记事起父亲就经常带他来这里。",
      "level": 3
    },
    {
      "id": "1.6.16",
      "text": "而且道长张元子也非常喜欢他，每次来总是要教他一两招全真教的武功，李梦龙最拿手的天罡拳就是道长亲自传授的。",
      "level": 3
    },
    {
      "id": "1.6.17",
      "text": "顾不上多想，李梦龙一溜小跑来到山门前，汉白玉石拱券上的小石猴乌黑油亮，这是被无数人用手抚摸的结果，北京人相信摸了白云观的小石猴，诸事顺利，所以来此的人都会抚摸一下小石猴。",
      "level": 3
    },
    {
      "id": "1.6.18",
      "text": "李梦龙也忍不住用手抚摸了一下小石猴，同时在心里暗暗祈祷自己的亲人平安无事。",
      "level": 3
    },
    {
      "id": "1.6.19",
      "text": "穿过山门，绕过影壁，便是窝风桥。",
      "level": 3
    },
    {
      "id": "1.6.20",
      "text": "有一个年轻的道人站在桥前挡住了李梦龙的去路。",
      "level": 3
    },
    {
      "id": "1.6.21",
      "text": "道人有二十多岁，穿白短褂，头顶挽着发髻，手里托着几枚铜钱，面带微笑地站在桥前。",
      "level": 3
    },
    {
      "id": "1.6.22",
      "text": "因为经常来白云观，对于观中的道人，李梦龙多半都认识，眼前的这个年轻道人却很面生，好像从未见过。",
      "level": 3
    },
    {
      "id": "1.6.23",
      "text": "“无量天尊。”道人念了一声常尊圣号，随后接着说：“客官好，您今天必须打中铜铃才能从这里过去。”",
      "level": 3
    },
    {
      "id": "1.6.24",
      "text": "窝风桥是在旱池上架的桥，桥下悬着一个巨形铜钱，在铜钱中间的钱眼中挂一铃铛，平常从这里走过的人都喜欢丢铜板去击打钱眼中的铃铛，如果击中就预示着财源广进，万事如意。",
      "level": 3
    },
    {
      "id": "1.6.25",
      "text": "老北京有名的“打金钱眼”的习俗说的就是这里。",
      "level": 3
    },
    {
      "id": "1.6.26",
      "text": "以前每次来白云观李梦龙都会提起准备好一大把铜钱，为的就是击打钱眼中的铜铃。",
      "level": 3
    },
    {
      "id": "1.6.27",
      "text": "李梦龙感觉有些奇怪，以前来玩这个游戏都是自愿的，也没见有道士拦在这里，这跟拦路打劫差不多。",
      "level": 3
    },
    {
      "id": "1.6.28",
      "text": "现在李梦龙没有心思玩这个，急忙对年轻的道人说：“对不起，我有急事要去见道长。”",
      "level": 3
    },
    {
      "id": "1.6.29",
      "text": "说着话李梦龙想从旁边绕过去，没想到这个道士身体...",
      "level": 3
    }
  ],
  "concepts": [
    {
      "name": "谭璟",
      "frequency": 14,
      "context": "美籍华裔，34岁，美国国家安全档案馆工作人员，卷入绝密情报失窃事件，后被神秘黑衣人杀死。"
    },
    {
      "name": "绝密情报档案",
      "frequency": 5,
      "context": "二战期间从日本陆军参谋本部缴获，涉及针对北京城的绝密计划。"
    },
    {
      "name": "美国黑室",
      "frequency": 2,
      "context": "国安局的绝密档案库，比国家金库还坚固严密。"
    },
    {
      "name": "翡翠扳指",
      "frequency": 6,
      "context": "出现在断手上的关键线索，李梦龙的父亲所有，具有重要的象征意义。"
    },
    {
      "name": "李梦龙",
      "frequency": 31,
      "context": "故事主角，北平李府大公子，交通大学学生，卷入家庭惨案，寻找三合会的秘密。"
    },
    {
      "name": "李承耀",
      "frequency": 7,
      "context": "李梦龙的父亲，北平三合会的会长，生意人，因拒绝透露三合会的秘密而被绑架。"
    },
    {
      "name": "三合会",
      "frequency": 12,
      "context": "清代民间秘密社团天地会演变而来，李承耀是其会长，守护着一个秘密。"
    },
    {
      "name": "惨案",
      "frequency": 2,
      "context": "指李府发生的灭门惨案，多人遇害，李承耀一家被绑架。"
    },
    {
      "name": "秘密",
      "frequency": 10,
      "context": "三合会守护的秘密，是绑匪勒索李梦龙的关键，也是故事的核心谜团。"
    },
    {
      "name": "丑哥",
      "frequency": 14,
      "context": "李府家丁，忠心耿耿，是惨案的幸存者之一，对李承耀如同再生父母。"
    },
    {
      "name": "严弘帅",
      "frequency": 13,
      "context": "侦缉处处长，负责调查李府惨案，对李梦龙和丑哥、李庚有所怀疑。"
    },
    {
      "name": "李庚",
      "frequency": 11,
      "context": "李府账房先生，落魄书生，被李承耀收留，是惨案的另一位幸存者，似乎知道一些内情。"
    },
    {
      "name": "白云观",
      "frequency": 7,
      "context": "位于北京城西，道教圣地，李梦龙前往寻找张元子道长以了解三合会的秘密。"
    },
    {
      "name": "张元子道长",
      "frequency": 4,
      "context": "白云观主持，李承耀的俗家弟子，也是三合会中人，被认为是知道三合会秘密的关键人物。"
    }
  ],
  "relations": [
    {
      "source": "谭璟",
      "target": "绝密情报档案",
      "type": "involved_in"
    },
    {
      "source": "绝密情报档案",
      "target": "美国黑室",
      "type": "stored_in"
    },
    {
      "source": "绝密情报档案",
      "target": "翡翠扳指",
      "type": "contains_clue_about"
    },
    {
      "source": "李梦龙",
      "target": "李承耀",
      "type": "son_of"
    },
    {
      "source": "李承耀",
      "target": "三合会",
      "type": "leader_of"
    },
    {
      "source": "三合会",
      "target": "秘密",
      "type": "guards"
    },
    {
      "source": "惨案",
      "target": "李梦龙",
      "type": "affects"
    },
    {
      "source": "丑哥",
      "target": "李承耀",
      "type": "loyal_to"
    },
    {
      "source": "严弘帅",
      "target": "李梦龙",
      "type": "investigates"
    },
    {
      "source": "李庚",
      "target": "李承耀",
      "type": "confidante_of"
    },
    {
      "source": "白云观",
      "target": "张元子道长",
      "type": "home_of"
    },
    {
      "source": "张元子道长",
      "target": "三合会",
      "type": "member_of"
    },
    {
      "source": "李梦龙",
      "target": "秘密",
      "type": "seeks"
    },
    {
      "source": "李梦龙",
      "target": "翡翠扳指",
      "type": "discovers_clue_in"
    },
    {
      "source": "李梦龙",
      "target": "断手",
      "type": "finds"
    },
    {
      "source": "断手",
      "target": "翡翠扳指",
      "type": "wears"
    }
  ],
  "hierarchy": {
    "main_topics": [
      "Introduction (楔子)",
      "The Crime (惨案)",
      "The Clues (血掌, 密信, 奇迹)",
      "The Search for Secrets (白云观)"
    ],
    "structure": "The document is structured chronologically and thematically, beginning with an unsettling incident in Washington, moving to a grisly discovery in Beijing, detailing the ensuing investigation and the protagonist's quest for a hidden secret, and culminating in a journey to a significant religious site."
  }
}