{
  "propositions": [
    {
      "id": "1",
      "text": "A French expatriate in Seoul discovered two frozen infant corpses in his home refrigerator upon returning from vacation.",
      "level": 1
    },
    {
      "id": "1.1",
      "text": "The discovery was made in a large refrigerator on his small balcony.",
      "level": 2
    },
    {
      "id": "1.2",
      "text": "The French national reported the incident to the police through a Korean friend.",
      "level": 2
    },
    {
      "id": "2",
      "text": "The police and the National Forensic Service are investigating the incident.",
      "level": 1
    },
    {
      "id": "3",
      "text": "The bodies were found wrapped in plastic bags, one on the upper and one on the lower shelf of the freezer.",
      "level": 1
    },
    {
      "id": "4",
      "text": "The infants appeared to be newborn, based on the umbilical cord and meconium.",
      "level": 1
    },
    {
      "id": "5",
      "text": "Preliminary investigation of the luxury apartment, which has electronic surveillance, showed no signs of forced entry.",
      "level": 1
    },
    {
      "id": "5.1",
      "text": "The electronic key card for the main door was held by the French resident, a Filipina housekeeper, and a French friend.",
      "level": 2
    },
    {
      "id": "5.2",
      "text": "The housekeeper and the French friend were not in Korea at the time of the discovery.",
      "level": 2
    },
    {
      "id": "6",
      "text": "The narrator, a journalist, reflects on life-altering events and the inability to foresee them.",
      "level": 1
    },
    {
      "id": "6.1",
      "text": "A fatal truck accident is cited as an example of a predetermined fate.",
      "level": 2
    },
    {
      "id": "7",
      "text": "The narrator connects the current investigation to a previous major case they survived.",
      "level": 1
    },
    {
      "id": "8",
      "text": "The frozen infant case is described as the most fitting example of a bizarre event.",
      "level": 1
    },
    {
      "id": "8.1",
      "text": "The Korean news report is seen as only a small glimpse into a larger, stranger phenomenon.",
      "level": 2
    },
    {
      "id": "9",
      "text": "The narrator intends to use this case as a starting point for further speculation and investigation.",
      "level": 1
    },
    {
      "id": "10",
      "text": "The narrator's commute on the Shanghai subway is described.",
      "level": 1
    },
    {
      "id": "10.1",
      "text": "The subway is comfortable due to strong air conditioning and fewer passengers at midday.",
      "level": 2
    },
    {
      "id": "10.2",
      "text": "Observational details of other passengers, including a couple and a man picking his feet.",
      "level": 2
    },
    {
      "id": "11",
      "text": "The narrator is reading 'A Brief History of Time'.",
      "level": 1
    },
    {
      "id": "12",
      "text": "The narrator reflects on their life as a journalist, encountering peculiar events.",
      "level": 1
    },
    {
      "id": "12.1",
      "text": "They consider themselves destined for gossip, romance, or a dangerous life.",
      "level": 2
    },
    {
      "id": "13",
      "text": "The narrator believes the world is more complex than it appears and struggles to explain events scientifically.",
      "level": 1
    },
    {
      "id": "14",
      "text": "The narrator receives a letter at the 'Morning Star' newspaper office.",
      "level": 1
    },
    {
      "id": "14.1",
      "text": "The letter is addressed to 'Morning Star Newspaper Mobile Department' and is already opened.",
      "level": 2
    },
    {
      "id": "14.2",
      "text": "The sender is a mentally ill patient who frequently writes to the narrator.",
      "level": 2
    },
    {
      "id": "14.3",
      "text": "The letters typically cover world events, praise the narrator's work, and discuss the sender's personal life.",
      "level": 2
    },
    {
      "id": "14.4",
      "text": "The current letter states the sender's illness has greatly improved and mentions her daughter is missing.",
      "level": 2
    },
    {
      "id": "14.5",
      "text": "This is the second letter mentioning the daughter's disappearance.",
      "level": 2
    },
    {
      "id": "15",
      "text": "The narrator feels a slight unease after reading the letter.",
      "level": 1
    },
    {
      "id": "16",
      "text": "A colleague, Liu Tang, known as 'Ghost Tang' for his red hair, shows off his 'creative' Qixi Festival gift: inflatable dolls.",
      "level": 1
    },
    {
      "id": "17",
      "text": "The sight of the inflatable dolls triggers a strong, suppressed memory in the narrator.",
      "level": 1
    },
    {
      "id": "18",
      "text": "The memory concerns an interview three years prior at a Shanghai hospital.",
      "level": 1
    },
    {
      "id": "19",
      "text": "The narrator received a tip about a strange case in the obstetrics department.",
      "level": 1
    },
    {
      "id": "20",
      "text": "The narrator met a patient named Huang Zhi.",
      "level": 1
    },
    {
      "id": "21",
      "text": "Huang Zhi insisted on seeing her baby, despite being told it was a 'deformed child'.",
      "level": 1
    },
    {
      "id": "22",
      "text": "Huang Zhi's young daughter, Xianxian, waited in the room.",
      "level": 1
    },
    {
      "id": "23",
      "text": "The narrator followed the nurse and doctor to the delivery room.",
      "level": 1
    },
    {
      "id": "24",
      "text": "The delivery room door was locked from the inside.",
      "level": 1
    },
    {
      "id": "25",
      "text": "A horrific scream emanated from the delivery room.",
      "level": 1
    },
    {
      "id": "26",
      "text": "Huang Zhi was later brought out, having fainted from shock.",
      "level": 1
    },
    {
      "id": "27",
      "text": "The doctor showed the narrator the 'infant', which was a flattened, skin-like husk.",
      "level": 1
    },
    {
      "id": "28",
      "text": "This 'thing' had limbs but was incredibly thin, resembling a 'paper infant'.",
      "level": 1
    },
    {
      "id": "29",
      "text": "The doctor initially suggested it was a 'paper infant' but later expressed doubt.",
      "level": 1
    },
    {
      "id": "30",
      "text": "The doctor theorized that a 'paper infant' could be a result of a twin pregnancy where one twin is much stronger and absorbs nutrients and even parts of the weaker twin.",
      "level": 1
    },
    {
      "id": "31",
      "text": "The doctor questioned the whereabouts of the second twin and what mechanism could cause such extreme flattening and absorption.",
      "level": 1
    },
    {
      "id": "32",
      "text": "The doctor concluded that the object was not a natural 'paper infant' and that something else must have caused its formation.",
      "level": 1
    },
    {
      "id": "33",
      "text": "Huang Zhi, now awake, stares blankly at the ceiling.",
      "level": 1
    },
    {
      "id": "34",
      "text": "The narrator decides to visit Huang Zhi in Datang village to gather more information.",
      "level": 1
    },
    {
      "id": "35",
      "text": "Datang village is described as a prosperous village transitioning from rural to urban.",
      "level": 1
    },
    {
      "id": "36",
      "text": "The narrator has difficulty finding Huang Zhi's exact address and asks an elderly woman.",
      "level": 1
    },
    {
      "id": "37",
      "text": "The elderly woman describes Huang Zhi's house as 'ominous' and advises caution.",
      "level": 1
    },
    {
      "id": "38",
      "text": "Huang Zhi's house is a dilapidated, old two-story building.",
      "level": 1
    },
    {
      "id": "39",
      "text": "The narrator learns about Huang Zhi's family history: adopted by an old fisherman, her father's death at sea, marriage to an abusive husband (Zhou Guodong), her mother-in-law's disappearance, and Zhou Guodong's own mysterious disappearance.",
      "level": 1
    },
    {
      "id": "40",
      "text": "Whispers of Huang Zhi having a 'hard fate' and 'clashing' with others have circulated in the village.",
      "level": 1
    },
    {
      "id": "41",
      "text": "The elderly woman reveals that Huang Zhi's daughter, Zhou Xianxian, has also gone missing in the last two to three months.",
      "level": 1
    },
    {
      "id": "42",
      "text": "The village believes Huang Zhi's daughter was likely abducted due to her mother's mental state and the child's tendency to wander with strangers.",
      "level": 1
    }
  ],
  "concepts": [
    {
      "name": "Frozen infant corpses",
      "frequency": 2,
      "context": "Discovered in a refrigerator in Seoul."
    },
    {
      "name": "Investigation",
      "frequency": 3,
      "context": "Police and forensic services are investigating the infant discovery and the disappearance of Zhou Xianxian."
    },
    {
      "name": "French expatriate",
      "frequency": 1,
      "context": "The discoverer of the frozen infants in Seoul."
    },
    {
      "name": "Reporter",
      "frequency": 5,
      "context": "The narrator's profession, influencing their approach to stories and investigations."
    },
    {
      "name": "Bizarre/Weird events",
      "frequency": 4,
      "context": "The overarching theme of the narrative, exemplified by the frozen infants and the 'paper infant'."
    },
    {
      "name": "Speculation",
      "frequency": 3,
      "context": "The narrator's intent to explore possibilities and deductions from the case."
    },
    {
      "name": "Memory",
      "frequency": 3,
      "context": "Suppressed memories resurfacing due to current events."
    },
    {
      "name": "Hospital",
      "frequency": 5,
      "context": "Setting for the 'paper infant' revelation and Huang Zhi's circumstances."
    },
    {
      "name": "Huang Zhi",
      "frequency": 10,
      "context": "The central female character involved in the 'paper infant' case and whose family history is explored."
    },
    {
      "name": "Paper infant",
      "frequency": 8,
      "context": "A uniquely thin, flattened infant husk discovered at the hospital, the subject of much mystery and scientific/supernatural speculation."
    },
    {
      "name": "Twins/Multiple births",
      "frequency": 3,
      "context": "A potential explanation for the 'paper infant' phenomenon involving nutrient absorption."
    },
    {
      "name": "Disappearance",
      "frequency": 4,
      "context": "The disappearance of Huang Zhi's daughter, Zhou Xianxian, and other family members."
    },
    {
      "name": "Village",
      "frequency": 6,
      "context": "Datang village is the setting for Huang Zhi's current life and the unfolding of her family's tragic history."
    },
    {
      "name": "Superstition/Ominous",
      "frequency": 3,
      "context": "Village beliefs about Huang Zhi and her house being 'ominous' or 'evil'."
    },
    {
      "name": "Family history",
      "frequency": 3,
      "context": "The complex and tragic lineage of Huang Zhi's family, contributing to the village's perception of her."
    },
    {
      "name": "Mental illness",
      "frequency": 4,
      "context": "Huang Zhi's condition, exacerbated by her traumatic experiences."
    }
  ],
  "relations": [
    {
      "source": "Frozen infant corpses",
      "target": "Investigation",
      "type": "subject_of"
    },
    {
      "source": "French expatriate",
      "target": "Frozen infant corpses",
      "type": "discoverer_of"
    },
    {
      "source": "Reporter",
      "target": "Investigation",
      "type": "participant_in"
    },
    {
      "source": "Reporter",
      "target": "Bizarre/Weird events",
      "type": "focuses_on"
    },
    {
      "source": "Reporter",
      "target": "Memory",
      "type": "triggered_by"
    },
    {
      "source": "Paper infant",
      "target": "Hospital",
      "type": "found_at"
    },
    {
      "source": "Paper infant",
      "target": "Twins/Multiple births",
      "type": "theorized_cause_of"
    },
    {
      "source": "Huang Zhi",
      "target": "Paper infant",
      "type": "mother_of"
    },
    {
      "source": "Huang Zhi",
      "target": "Disappearance",
      "type": "involved_in"
    },
    {
      "source": "Zhou Xianxian",
      "target": "Disappearance",
      "type": "subject_of"
    },
    {
      "source": "Huang Zhi",
      "target": "Mental illness",
      "type": "suffers_from"
    },
    {
      "source": "Huang Zhi",
      "target": "Family history",
      "type": "central_to"
    },
    {
      "source": "Huang Zhi",
      "target": "Village",
      "type": "resident_of"
    },
    {
      "source": "Village",
      "target": "Superstition/Ominous",
      "type": "associated_with"
    },
    {
      "source": "Reporter",
      "target": "Huang Zhi",
      "type": "seeking_information_from"
    }
  ],
  "hierarchy": {
    "main_topics": [
      "The discovery of frozen infant corpses in Seoul",
      "The 'paper infant' case and its investigation",
      "Huang Zhi's tragic family history and disappearance of her daughter",
      "The narrator's role as a journalist and their personal reflections"
    ],
    "structure": "The document begins with the shocking discovery in Seoul, then transitions to the narrator's personal reflections and past experiences. The narrative then focuses on a disturbing hospital interview leading to the 'paper infant' revelation. Finally, it delves into Huang Zhi's village life and the mysterious disappearances within her family, connecting back to the narrator's investigation and unease."
  }
}