{
  "propositions": [
    {
      "id": "1",
      "text": "The document is a review of the book \"The Tibetan Code 1\" by He Ma.",
      "level": 1
    },
    {
      "id": "1.1",
      "text": "It also provides a link to a special topic page for the book, including reviews, updates, and recommendations.",
      "level": 2
    },
    {
      "id": "1.2",
      "text": "A link to TXT Novel Heaven is provided for classic literature, martial arts novels, romance novels, and humanities and social science books online and for free mobile download.",
      "level": 2
    },
    {
      "id": "2",
      "text": "Chapter 1 begins with a story about a photograph.",
      "level": 1
    },
    {
      "id": "2.1",
      "text": "The protagonist, Zhuo Muqiangba, is introduced.",
      "level": 2
    },
    {
      "id": "2.1.1",
      "text": "He is described as tall, powerfully built, with a fierce appearance but a kind demeanor, wearing a suit and glasses, and often smiling.",
      "level": 3
    },
    {
      "id": "2.1.2",
      "text": "He is addressed as President Zhuo or Professor, and by his friends as Qiangba.",
      "level": 3
    },
    {
      "id": "2.1.3",
      "text": "Zhuo Muqiangba is a 42-year-old Tibetan man.",
      "level": 3
    },
    {
      "id": "2.1.4",
      "text": "He is the president of Tianshi Famous Dog Breeding Base Company and a visiting professor at Fudan University's Biology Department, specializing in world-famous dogs.",
      "level": 3
    },
    {
      "id": "2.1.5",
      "text": "He grew up in the small village of Dawa Nuocuo, deep in the Tibetan plateau, close to the no-man's-land.",
      "level": 3
    },
    {
      "id": "2.1.6",
      "text": "His name, \"Qiangba,\" means \"the one who can conquer the sea.\"",
      "level": 3
    },
    {
      "id": "2.1.7",
      "text": "He has achieved considerable success, becoming a millionaire company president and a renowned university professor.",
      "level": 3
    },
    {
      "id": "2.1.8",
      "text": "His success is attributed to dogs, specifically Tibetan Mastiffs.",
      "level": 3
    },
    {
      "id": "3",
      "text": "Zhuo Muqiangba gives a speech at a world-class獒犬 (Tibetan Mastiff) competition in Pennsylvania.",
      "level": 1
    },
    {
      "id": "3.1",
      "text": "He discusses the history and origin of Tibetan Mastiffs, stating they are the largest and fiercest dogs recognized worldwide, a product of the Tibetan region, existing for tens of millions of years.",
      "level": 2
    },
    {
      "id": "3.1.1",
      "text": "He claims they spread to Greece about 2,000 years ago, then to the Roman Empire, and eventually to various European countries through the Slavic people, with their genetic lineage present in modern world-famous dogs.",
      "level": 3
    },
    {
      "id": "3.1.2",
      "text": "He asserts that the noblest dog in Lhasa and the entire Tibetan region is the Tibetan Mastiff.",
      "level": 3
    },
    {
      "id": "3.2",
      "text": "The event is organized by his company to promote Tibetan Mastiffs, increase public awareness, and promote his breeding base to international breeders.",
      "level": 2
    },
    {
      "id": "3.3",
      "text": "Hundreds of reporters and over 8,000 attendees, including many passionate dog breeders, are present.",
      "level": 2
    },
    {
      "id": "3.4",
      "text": "Zhuo Muqiangba states that a purebred young Tibetan Mastiff can be worth over $100,000 USD.",
      "level": 2
    },
    {
      "id": "3.4.1",
      "text": "He confidently asserts that his base possesses the most purebred Tibetan Mastiffs, boasting about their Snow Mastiffs, Iron-Wrapped-Gold, and Red Mastiffs.",
      "level": 3
    },
    {
      "id": "3.5",
      "text": "Attendees believe his base has top-tier Tibetan Mastiffs and that he has profound knowledge of them.",
      "level": 2
    },
    {
      "id": "3.5.1",
      "text": "They hope their dogs will be selected by Zhuo Muqiangba for breeding to obtain purer bloodlines.",
      "level": 3
    },
    {
      "id": "4",
      "text": "An anonymous questioner disrupts the speech.",
      "level": 1
    },
    {
      "id": "4.1",
      "text": "The questioner asks, \"If a Tibetan Mastiff leaves Tibet, can it still be called a Tibetan Mastiff?\"",
      "level": 2
    },
    {
      "id": "4.2",
      "text": "This question angers the audience, with some immediately refuting it.",
      "level": 2
    },
    {
      "id": "4.3",
      "text": "Zhuo Muqiangba intervenes, explaining that Tibetan Mastiffs possess their fierce physique and unique dominance in Tibet.",
      "level": 2
    },
    {
      "id": "4.3.1",
      "text": "He attributes the superiority of his base's dogs to their Tibetan selection, free-range breeding, and training in Tibet, emphasizing they are true Tibetan Mastiffs.",
      "level": 3
    },
    {
      "id": "4.4",
      "text": "The questioner is described as wearing a lowered hat and sunglasses, and a large trench coat, concealing his face.",
      "level": 2
    },
    {
      "id": "5",
      "text": "A pivotal event occurs during the speech.",
      "level": 1
    },
    {
      "id": "5.1",
      "text": "A small boy pushes through the crowd and hands something to Zhuo Muqiangba.",
      "level": 2
    },
    {
      "id": "5.1.1",
      "text": "The item appears to be a postcard-like object.",
      "level": 3
    },
    {
      "id": "5.1.2",
      "text": "The boy quickly retreats after delivering it, seemingly on behalf of someone else.",
      "level": 3
    },
    {
      "id": "5.2",
      "text": "Zhuo Muqiangba opens the envelope while continuing his speech.",
      "level": 2
    },
    {
      "id": "5.3",
      "text": "Upon opening it, his smile vanishes, and he becomes stunned and motionless on stage.",
      "level": 2
    },
    {
      "id": "5.3.1",
      "text": "The hall falls silent, except for camera flashes.",
      "level": 3
    },
    {
      "id": "5.3.2",
      "text": "His face turns pale, and his hands begin to tremble as he clutches the postcard.",
      "level": 3
    },
    {
      "id": "5.3.3",
      "text": "Onlookers notice his eye twitching, indicating extreme shock.",
      "level": 3
    },
    {
      "id": "5.4",
      "text": "After about half a minute, Zhuo Muqiangba grabs the microphone, his voice dry and sharp, asking who gave the item to the boy.",
      "level": 2
    },
    {
      "id": "5.5",
      "text": "He looks in the direction the boy was looking and sees the trench-coated, sunglasses-wearing man has disappeared.",
      "level": 2
    },
    {
      "id": "5.6",
      "text": "Zhuo Muqiangba abandons his speech and jumps off the stage to pursue the man, causing a commotion.",
      "level": 2
    },
    {
      "id": "5.7",
      "text": "In the chaos, Zhuo Muqiangba disappears.",
      "level": 2
    },
    {
      "id": "5.8",
      "text": "Speculation arises about the contents of the item, with some suggesting it was a photo of Zhuo Muqiangba with a lover, leading to widespread sensationalism by the media.",
      "level": 2
    },
    {
      "id": "5.9",
      "text": "Zhuo Muqiangba is not seen at the competition for several days.",
      "level": 2
    },
    {
      "id": "6",
      "text": "Zhuo Muqiangba visits Professor Fang Xin in Shanghai.",
      "level": 1
    },
    {
      "id": "6.1",
      "text": "Fang Xin is Zhuo Muqiangba's former mentor and a leading authority in canine zoology.",
      "level": 2
    },
    {
      "id": "6.2",
      "text": "They were collaborators on Tibetan Mastiff research, but Fang Xin opposed commercializing the dogs.",
      "level": 2
    },
    {
      "id": "6.3",
      "text": "Zhuo Muqiangba continues to support Fang Xin's academic work, which is crucial for gaining official recognition for world-famous dogs.",
      "level": 2
    },
    {
      "id": "6.4",
      "text": "Fang Xin is currently writing a paper on Tibetan Mastiff lineage, akin to creating a global pedigree for the breed, which is for the Matthias Biology Forum where he is expected to receive a prestigious award.",
      "level": 2
    },
    {
      "id": "7",
      "text": "Zhuo Muqiangba presents a mysterious item to Professor Fang Xin.",
      "level": 1
    },
    {
      "id": "7.1",
      "text": "Zhuo Muqiangba arrives with a steel-reinforced anti-theft money transport box, which he has handcuffed to himself, indicating extreme caution.",
      "level": 2
    },
    {
      "id": "7.2",
      "text": "Inside the box is a golden匣子 (box) about a foot square, intricately carved with Buddhist figures and inlaid with rare cat's eye stones, described as a family heirloom used for storing Buddhist scriptures.",
      "level": 2
    },
    {
      "id": "7.3",
      "text": "Fang Xin is deeply intrigued, as he believed nothing could surprise him anymore.",
      "level": 2
    },
    {
      "id": "7.4",
      "text": "Zhuo Muqiangba eventually allows Fang Xin to open the golden box.",
      "level": 2
    },
    {
      "id": "7.5",
      "text": "Inside, there are two photographs.",
      "level": 2
    },
    {
      "id": "8",
      "text": "The photographs reveal a secret.",
      "level": 1
    },
    {
      "id": "8.1",
      "text": "The first photo is blurry and taken in a vast grassland with low shrubs under a blue sky.",
      "level": 2
    },
    {
      "id": "8.1.1",
      "text": "It captures a black hurricane-like shape, which is actually an animal.",
      "level": 3
    },
    {
      "id": "8.2",
      "text": "The second photo, taken from the same location at night, is clearer.",
      "level": 2
    },
    {
      "id": "8.2.1",
      "text": "The animal is closer and facing the camera.",
      "level": 3
    },
    {
      "id": "8.2.2",
      "text": "The creature's face resembles a lion, but its body is covered in thick fur, more like a yak, with powerful musculature suggesting cat-like agility.",
      "level": 3
    },
    {
      "id": "8.3",
      "text": "Fang Xin, after studying the photos for a long time, declares them to be fake, likely computer-generated.",
      "level": 2
    },
    {
      "id": "8.4",
      "text": "He argues that the scale of the animal, indicated by its height relative to trees in the background, suggests a shoulder height of 1.2 to 1.4 meters, which is impossibly large for a dog, let alone a Tibetan Mastiff.",
      "level": 2
    },
    {
      "id": "8.4.1",
      "text": "He also points out that the animal's speed, calculated from its blurriness, exceeds that of a cheetah, the fastest land animal.",
      "level": 3
    },
    {
      "id": "8.4.2",
      "text": "Furthermore, Fang Xin claims the fur color is an impossible deep purplish-red, not black or brown, suggesting it's a computer artifact.",
      "level": 3
    },
    {
      "id": "8.5",
      "text": "Zhuo Muqiangba, though initially frustrated, is convinced of the animal's existence, particularly by the dog's intensely expressive eyes in the second photo.",
      "level": 2
    },
    {
      "id": "9",
      "text": "Zhuo Muqiangba's resolve to find the mysterious dog solidifies.",
      "level": 1
    },
    {
      "id": "9.1",
      "text": "He is deeply affected by the photos, feeling an almost spiritual calling to find the creature.",
      "level": 2
    },
    {
      "id": "9.2",
      "text": "He abandons the dog competition to search for the man who delivered the photos but fails to find him or the boy who delivered them.",
      "level": 2
    },
    {
      "id": "9.3",
      "text": "He becomes obsessed with the photographs, studying every detail, including a specific bifurcated hair and a scratch on a claw.",
      "level": 2
    },
    {
      "id": "9.4",
      "text": "A phone call from an unknown person claiming to have information about the photos jolts him out of his despair.",
      "level": 2
    },
    {
      "id": "10",
      "text": "Zhuo Muqiangba meets Tang Ming.",
      "level": 1
    },
    {
      "id": "10.1",
      "text": "Tang Ming is a young Chinese man who claims to have the photos from his older brother.",
      "level": 2
    },
    {
      "id": "10.2",
      "text": "He explains that his brother, Tang Tao, was found in extremely disoriented mental state after an expedition.",
      "level": 2
    },
    {
      "id": "10.3",
      "text": "Tang Tao, known as \"Lone Walker,\" is a renowned adventurer who has undertaken numerous dangerous solo expeditions.",
      "level": 2
    },
    {
      "id": "10.4",
      "text": "Tang Tao's photography was a hobby developed during his travels, and his photos are highly sought after.",
      "level": 2
    },
    {
      "id": "10.5",
      "text": "He was found by a patrol in Kekexili, running desperately and speaking cryptic phrases about \"the madman of Menghe\" and \"the gate of hell.\"",
      "level": 2
    },
    {
      "id": "10.6",
      "text": "His abandoned jeep was found 300 kilometers away, out of gas.",
      "level": 2
    },
    {
      "id": "11",
      "text": "Zhuo Muqiangba visits Tang Tao in a psychiatric hospital.",
      "level": 1
    },
    {
      "id": "11.1",
      "text": "The walls of Tang Tao's room are covered with many photos, most of them blurry images of the mysterious dog.",
      "level": 2
    },
    {
      "id": "11.2",
      "text": "Tang Tao suffers from pyrophobia and constant psychological distress.",
      "level": 2
    },
    {
      "id": "11.3",
      "text": "Tang Ming believes his brother's photos are genuine, given his reputation as a photographer.",
      "level": 2
    },
    {
      "id": "12",
      "text": "The conversation between Zhuo Muqiangba and Fang Xin turns to the history of their relationship and Fang Xin's teaching.",
      "level": 1
    },
    {
      "id": "12.1",
      "text": "Fang Xin recalls his first lecture to a sparse class, where he introduced the value of studying dogs.",
      "level": 2
    },
    {
      "id": "12.1.1",
      "text": "He initially tested the students by showing slides of various dogs, none of whom could identify them.",
      "level": 3
    },
    {
      "id": "12.2",
      "text": "The discussion then shifted to the fiercest dogs.",
      "level": 2
    },
    {
      "id": "12.2.1",
      "text": "When Fang Xin showed a picture of a Tibetan Mastiff, someone exclaimed it was a lion.",
      "level": 3
    },
    {
      "id": "12.2.2",
      "text": "Fang Xin introduced the Tibetan Mastiff as the world's fiercest dog, originating from the Qinghai-Tibet Plateau.",
      "level": 3
    },
    {
      "id": "12.2.3",
      "text": "He explained its origins, with the best physique from Hequ and the fiercest from Dama County, Tibet.",
      "level": 3
    },
    {
      "id": "12.2.4",
      "text": "He defined a Tibetan Mastiff as a dog four chi tall, fierce, protective, and capable of fighting beasts.",
      "level": 3
    },
    {
      "id": "12.2.5",
      "text": "He mentioned the saying \"one Tibetan Mastiff can fight three wolves,\" highlighting their protective role for sheep against predators.",
      "level": 3
    },
    {
      "id": "12.3",
      "text": "Zhuo Muqiangba, a large student with a pronounced Tibetan physiognomy, asked about the most powerful type of Tibetan Mastiff.",
      "level": 2
    },
    {
      "id": "12.3.1",
      "text": "Fang Xin explained the classification of Tibetan Mastiffs into three types, five subfamilies, and eleven major lineages, highlighting the Hequ Mastiff for its physique and the Dangxiang Mastiff for its ferocity.",
      "level": 3
    },
    {
      "id": "12.4",
      "text": "He then elaborated on the concept of \"Nine Dogs and One Mastiff\" (九狗一獒), a brutal selection process where only one of ten puppies survives, often by cannibalizing its littermates.",
      "level": 2
    },
    {
      "id": "12.4.1",
      "text": "This process is seen as instinctual, stemming from wolf pack behavior for survival in harsh environments.",
      "level": 3
    },
    {
      "id": "12.4.2",
      "text": "The survivor is considered a \"mastiff of mastiffs\" (獒中之獒) for its strong will to live and resilience.",
      "level": 3
    },
    {
      "id": "12.5",
      "text": "Fang Xin also shared a more ancient and mysterious legend of the \"Heaven-Bestowed Divine Mastiff\" (天授神獒), where one of nine puppies born to a mother mastiff becomes a divine mastiff, ultimately consuming its siblings and mother, becoming the apex predator.",
      "level": 2
    },
    {
      "id": "12.5.1",
      "text": "This legend, though not widely known or verifiable, describes a mastiff capable of hunting bears and dominating the food chain.",
      "level": 3
    },
    {
      "id": "12.6",
      "text": "Zhuo Muqiangba, unfazed, asked what could be more powerful than \"Nine Dogs and One Mastiff.\"",
      "level": 2
    },
    {
      "id": "12.7",
      "text": "Fang Xin, after some deliberation, revealed the existence of \"War Mastiffs\" (战獒), the most revered in Tibet, akin to the mounts of Bodhisattvas or sacred elephants.",
      "level": 2
    },
    {
      "id": "12.7.1",
      "text": "These are the \"Nine Dogs and One Mastiff\" breeds, meticulously trained by generations of experts to be exceptionally intelligent, loyal, aggressive, and capable fighters.",
      "level": 3
    },
    {
      "id": "12.7.2",
      "text": "He recounted the story of a hunter named Awang Pu Cai and his War Mastiff, Duoji, who displayed extraordinary loyalty and ferocity after Awang's death.",
      "level": 3
    },
    {
      "id": "13",
      "text": "Despite Fang Xin's skepticism about the photos, Zhuo Muqiangba is determined to find the mysterious dog.",
      "level": 1
    },
    {
      "id": "13.1",
      "text": "He acknowledges Fang Xin's expertise but feels his mentor lacks the conviction to believe in the photos.",
      "level": 2
    },
    {
      "id": "13.2",
      "text": "Zhuo Muqiangba leaves, his resolve to embark on this quest alone strengthened.",
      "level": 2
    }
  ],
  "concepts": [
    {
      "name": "藏獒 (Tibetan Mastiff)",
      "frequency": 26,
      "context": "The central subject of discussion and narrative. Described in terms of its physical attributes, historical significance, origin, temperament, and mythical status."
    },
    {
      "name": "卓木强巴 (Zhuo Muqiangba)",
      "frequency": 22,
      "context": "The main protagonist of the excerpt. A successful businessman and professor, his character is defined by his passion for Tibetan Mastiffs and his pursuit of a mysterious specimen."
    },
    {
      "name": "方新 (Fang Xin)",
      "frequency": 17,
      "context": "Zhuo Muqiangba's former professor and mentor, a distinguished canine zoologist whose scientific skepticism contrasts with Zhuo Muqiangba's faith."
    },
    {
      "name": "照片 (photograph)",
      "frequency": 13,
      "context": "The catalyst for the main plot. The mysterious photos of an extraordinary Tibetan Mastiff drive Zhuo Muqiangba's actions and fuel the central mystery."
    },
    {
      "name": "塔克拉玛干沙漠",
      "frequency": 1,
      "context": "Mentioned as an extreme solo expedition undertaken by Tang Tao."
    },
    {
      "name": "黄河",
      "frequency": 1,
      "context": "Mentioned in relation to the origin of the Hequ Mastiff."
    },
    {
      "name": "狮子",
      "frequency": 2,
      "context": "Used as a comparison for the facial features of the mysterious dog, and also as a misidentification by an audience member."
    },
    {
      "name": "狼",
      "frequency": 5,
      "context": "Mentioned in the context of the Tibetan Mastiff's historical role in protecting livestock from predators."
    },
    {
      "name": "西藏",
      "frequency": 10,
      "context": "The geographical origin and primary habitat of the Tibetan Mastiff, holding a significant cultural and environmental context."
    },
    {
      "name": "达玛县",
      "frequency": 1,
      "context": "Cited as the origin of the fiercest Tibetan Mastiffs."
    },
    {
      "name": "河曲",
      "frequency": 1,
      "context": "Mentioned as the origin of Tibetan Mastiffs with the best physique."
    },
    {
      "name": "唐明 (Tang Ming)",
      "frequency": 6,
      "context": "The younger brother of Tang Tao, who initiates contact with Zhuo Muqiangba regarding the photographs."
    },
    {
      "name": "唐涛 (Tang Tao)",
      "frequency": 6,
      "context": "Tang Ming's older brother, the photographer of the mysterious dog photos, and a renowned adventurer suffering from mental distress."
    },
    {
      "name": "独行侠",
      "frequency": 2,
      "context": "The moniker of Tang Tao, reflecting his reputation for extreme solo expeditions."
    },
    {
      "name": "可可西里",
      "frequency": 1,
      "context": "The location where Tang Tao was found by the search and rescue team."
    },
    {
      "name": "安德列医院",
      "frequency": 2,
      "context": "The psychiatric hospital where Tang Tao is being treated."
    },
    {
      "name": "战獒 (War Mastiff)",
      "frequency": 5,
      "context": "The highest echelon of Tibetan Mastiffs, trained for combat and holding immense prestige in Tibetan culture."
    },
    {
      "name": "九狗一獒",
      "frequency": 4,
      "context": "A concept describing the brutal survival of the fittest among young Tibetan Mastiffs, leading to the \"mastiff of mastiffs.\""
    },
    {
      "name": "天授神獒",
      "frequency": 2,
      "context": "A legendary type of Tibetan Mastiff, born with exceptional power and destined to dominate."
    },
    {
      "name": "獒犬大赛 (Tibetan Mastiff Competition)",
      "frequency": 3,
      "context": "The event where Zhuo Muqiangba's speech is interrupted, and which he later abandons."
    },
    {
      "name": "电脑合成 (computer-generated)",
      "frequency": 3,
      "context": "Fang Xin's initial conclusion about the authenticity of the mysterious dog photographs."
    },
    {
      "name": "眼神 (eyes)",
      "frequency": 2,
      "context": "The clarity and intensity of the dog's eyes in the photograph are a key element that convinces Zhuo Muqiangba of its reality."
    },
    {
      "name": "探险",
      "frequency": 2,
      "context": "Refers to Tang Tao's adventurous pursuits."
    },
    {
      "name": "高源 (plateau)",
      "frequency": 5,
      "context": "The unique environment of Tibet that shapes the Tibetan Mastiff and its characteristics."
    },
    {
      "name": "寻山护卫队 (Kekexili Search and Rescue Team)",
      "frequency": 1,
      "context": "The group that discovered Tang Tao."
    }
  ],
  "relations": [
    {
      "source": "藏獒",
      "target": "青藏地区",
      "type": "originates_from"
    },
    {
      "source": "卓木强巴",
      "target": "天狮名犬驯养基地公司",
      "type": "president_of"
    },
    {
      "source": "卓木强巴",
      "target": "复旦大学",
      "type": "visiting_professor_at"
    },
    {
      "source": "方新",
      "target": "卓木强巴",
      "type": "mentor_of"
    },
    {
      "source": "唐涛",
      "target": "唐明",
      "type": "brother_of"
    },
    {
      "source": "照片",
      "target": "藏獒",
      "type": "depicts"
    },
    {
      "source": "战獒",
      "target": "獒",
      "type": "type_of"
    },
    {
      "source": "九狗一獒",
      "target": "獒",
      "type": "concept_related_to"
    },
    {
      "source": "天授神獒",
      "target": "獒",
      "type": "legendary_type_of"
    },
    {
      "source": "卓木强巴",
      "target": "照片",
      "type": "obsessed_with"
    },
    {
      "source": "唐涛",
      "target": "探险",
      "type": "engages_in"
    },
    {
      "source": "卓木强巴",
      "target": "方新",
      "type": "seeks_guidance_from"
    },
    {
      "source": "方新",
      "target": "照片",
      "type": "believes_fake"
    },
    {
      "source": "卓木强巴",
      "target": "照片",
      "type": "believes_real"
    },
    {
      "source": "藏獒",
      "target": "凶猛",
      "type": "characteristic"
    },
    {
      "source": "藏獒",
      "target": "忠诚",
      "type": "characteristic"
    },
    {
      "source": "方新",
      "target": "科学",
      "type": "values"
    },
    {
      "source": "卓木强巴",
      "target": "信念",
      "type": "driven_by"
    }
  ],
  "hierarchy": {
    "main_topics": [
      "The Book and its Context",
      "Character Introduction: Zhuo Muqiangba",
      "The Tibetan Mastiff Competition and a Mysterious Interruption",
      "The Revelation of the Mysterious Photographs",
      "Professor Fang Xin's Skepticism and Zhuo Muqiangba's Resolve",
      "The Photographer and his Troubling Expedition",
      "The History and Lore of Tibetan Mastiffs (Fang Xin's Lecture)"
    ],
    "structure": "The document is structured chronologically, starting with an introduction to the book and its protagonist, then detailing a pivotal event at a competition, followed by an investigation into the mysterious photographs and their origins, culminating in a detailed historical and legendary account of Tibetan Mastiffs presented as a lecture. The narrative weaves together elements of mystery, adventure, and academic discussion."
  }
}