{
  "propositions": [
    {
      "id": "1",
      "text": "This world has ghosts.",
      "level": 1
    },
    {
      "id": "1.1",
      "text": "I heard a story about a person twisting a cat's neck, sucking its blood, and then being bitten by his dog.",
      "level": 2
    },
    {
      "id": "1.2",
      "text": "I often wonder what the last one to be bitten would be.",
      "level": 2
    },
    {
      "id": "2",
      "text": "The story I am about to tell has no relation to the story I heard.",
      "level": 1
    },
    {
      "id": "2.1",
      "text": "Perhaps it will be related to you.",
      "level": 2
    },
    {
      "id": "2.2",
      "text": "Look, it is standing behind you.",
      "level": 2
    },
    {
      "id": "3",
      "text": "Night has fallen.",
      "level": 1
    },
    {
      "id": "3.1",
      "text": "For the residents of Liuqiao Town, this night is no different.",
      "level": 2
    },
    {
      "id": "3.2",
      "text": "For the students of the only middle school in town, it is also no different.",
      "level": 2
    },
    {
      "id": "3.3",
      "text": "Except for the dark sky mixed with hazy lightning and thunder, everything is as usual.",
      "level": 2
    },
    {
      "id": "4",
      "text": "The classroom of Grade 1 (2) is unusually quiet.",
      "level": 1
    },
    {
      "id": "4.1",
      "text": "Even the students who usually make the most noise are silent now.",
      "level": 2
    },
    {
      "id": "4.2",
      "text": "The only sounds are the turning of pages and writing.",
      "level": 2
    },
    {
      "id": "4.3",
      "text": "The occasional dull thunder reminds people that tomorrow will be bad weather.",
      "level": 2
    },
    {
      "id": "4.4",
      "text": "However, the rain never falls, as if waiting for something.",
      "level": 2
    },
    {
      "id": "4.5",
      "text": "Like a volcano about to erupt, once triggered, it will be irreversible.",
      "level": 2
    },
    {
      "id": "5",
      "text": "Wang Lisheng sits stiffly in a seat by the wall.",
      "level": 1
    },
    {
      "id": "5.1",
      "text": "His eyes are vacant, his gaze unfocused, as if unable to concentrate.",
      "level": 2
    },
    {
      "id": "5.2",
      "text": "He notices his hands are trembling, his whole body is trembling.",
      "level": 2
    },
    {
      "id": "5.3",
      "text": "He emits a strange sound from his throat, like the roar of a trapped creature.",
      "level": 2
    },
    {
      "id": "5.4",
      "text": "But this roar cannot escape his throat; only he can hear it.",
      "level": 2
    },
    {
      "id": "6",
      "text": "Zhou Feng, sitting in the front row, finally turns around.",
      "level": 1
    },
    {
      "id": "6.1",
      "text": "He was at the internet cafe with Wang Lisheng last night.",
      "level": 2
    },
    {
      "id": "6.2",
      "text": "After returning, Wang Lisheng became like this, as if he had lost his soul.",
      "level": 2
    },
    {
      "id": "6.3",
      "text": "He asked, but Wang Lisheng refused to say anything.",
      "level": 2
    },
    {
      "id": "6.4",
      "text": "He originally thought Wang Lisheng was angry about Li Xue.",
      "level": 2
    },
    {
      "id": "6.5",
      "text": "Everyone knows that there is a very beautiful cashier named Li Xue at the Legend Internet Cafe.",
      "level": 3
    },
    {
      "id": "6.6",
      "text": "She is even more beautiful than the campus belle.",
      "level": 3
    },
    {
      "id": "6.7",
      "text": "Many people risk being caught by teachers to go to the Legend Internet Cafe not only for online games but also for Li Xue.",
      "level": 3
    },
    {
      "id": "6.8",
      "text": "This includes Wang Lisheng and Zhou Feng.",
      "level": 3
    },
    {
      "id": "6.9",
      "text": "Later, Zhou Feng considered brotherhood more important than women and automatically opted out.",
      "level": 3
    },
    {
      "id": "6.10",
      "text": "Once at the internet cafe, Zhou Feng saw a man being inappropriate with Li Xue.",
      "level": 4
    },
    {
      "id": "6.11",
      "text": "Without a word, he grabbed a stool and smashed it on the man's head, until the man knelt and called him grandpa, without even compensating for medical expenses.",
      "level": 4
    },
    {
      "id": "6.12",
      "text": "Zhou Feng is a feared figure in school.",
      "level": 4
    },
    {
      "id": "6.13",
      "text": "This is not only because his father is the town mayor of Liuqiao Town, but also because of his reckless personality, influenced by watching 'Young and Dangerous' movies.",
      "level": 4
    },
    {
      "id": "6.14",
      "text": "However, Wang Lisheng did not win Li Xue's heart.",
      "level": 4
    },
    {
      "id": "6.15",
      "text": "Just yesterday, Li Xue took a boy to the internet cafe and introduced him as her boyfriend.",
      "level": 4
    },
    {
      "id": "6.16",
      "text": "That gentle boy with severe myopia turned out to be the student council president Jiang Tao, the principal's son.",
      "level": 4
    },
    {
      "id": "7",
      "text": "Zhou Feng observes that Wang Lisheng does not seem to be suffering from heartbreak.",
      "level": 1
    },
    {
      "id": "7.1",
      "text": "He then cleverly assumes Wang Lisheng is upset about the class meeting yesterday.",
      "level": 2
    },
    {
      "id": "7.2",
      "text": "The skinny class teacher, like a radish strip, announced the three worst students in front of the entire class.",
      "level": 2
    },
    {
      "id": "7.3",
      "text": "Wang Lisheng's grades are poor and he often gets into trouble, so he rightfully and predictably made the list.",
      "level": 2
    },
    {
      "id": "7.4",
      "text": "Although Zhou Feng causes trouble a hundred times more than Wang Lisheng, his grades have always been among the best.",
      "level": 2
    },
    {
      "id": "7.5",
      "text": "He can never be the worst student, but he is also not among the best.",
      "level": 2
    },
    {
      "id": "7.6",
      "text": "After the teacher finished speaking, spitting and gesticulating, he instructed the worst students to inform their parents about the parent-teacher meeting next Wednesday.",
      "level": 2
    },
    {
      "id": "8",
      "text": "Speaking of their class teacher, he is truly detestable.",
      "level": 1
    },
    {
      "id": "8.1",
      "text": "He always raids the Legend Internet Cafe at unpredictable times.",
      "level": 2
    },
    {
      "id": "8.2",
      "text": "Regardless of which class you are in, he will find ways to 'talk' you back to school.",
      "level": 2
    },
    {
      "id": "8.3",
      "text": "This makes students so nervous every time they go online, fearing being caught.",
      "level": 2
    },
    {
      "id": "8.4",
      "text": "Some students hide in internet cafes to smoke, afraid of him appearing.",
      "level": 2
    },
    {
      "id": "8.5",
      "text": "No one can predict when he will suddenly appear.",
      "level": 2
    },
    {
      "id": "8.6",
      "text": "He also constantly uses the loudspeaker during class meetings and even during breaks to incessantly talk about the harms of internet addiction.",
      "level": 2
    },
    {
      "id": "8.7",
      "text": "He even cites a plethora of alarming examples of students who became misguided due to internet addiction.",
      "level": 2
    },
    {
      "id": "8.8",
      "text": "When he exhausted all means to extinguish the temptation of online games for students, he finally gave up.",
      "level": 2
    },
    {
      "id": "8.9",
      "text": "He hasn't mentioned the internet for over half a month and hasn't been to the internet cafe.",
      "level": 2
    },
    {
      "id": "9",
      "text": "When both of the above possibilities are ruled out, Zhou Feng believes Wang Lisheng has been bullied.",
      "level": 1
    },
    {
      "id": "9.1",
      "text": "This makes him angry, so he turns around and asks accusingly: 'Shengzi, tell me, did someone bully you?'",
      "level": 2
    },
    {
      "id": "10",
      "text": "Actually, Zhou Feng's voice is not particularly loud, but because the classroom is so quiet, his words are more shocking than the thunder outside.",
      "level": 1
    },
    {
      "id": "10.1",
      "text": "Everyone naturally looks up in this direction, then immediately lowers their heads.",
      "level": 2
    },
    {
      "id": "11",
      "text": "Zhou Feng looks at the bewildered Wang Lisheng and becomes more annoyed: 'Speak up! Why are you dumbfounded?'",
      "level": 1
    },
    {
      "id": "12",
      "text": "Wang Lisheng snaps back to reality and grunts from his nostrils: 'No.'",
      "level": 1
    },
    {
      "id": "13",
      "text": "'Do you consider me a brother? If so, tell me. What can't we say to each other?'",
      "level": 1
    },
    {
      "id": "13.1",
      "text": "After speaking, he growls at a plump girl sitting in front of Wang Lisheng: 'What are you looking at?'",
      "level": 2
    },
    {
      "id": "14",
      "text": "Hu Ying says nothing but subconsciously rolls her eyes at Zhou Feng.",
      "level": 1
    },
    {
      "id": "15",
      "text": "'Oh! You dare to glare at me? Shorty, believe it or not, I'll dig your eyeballs out!'",
      "level": 1
    },
    {
      "id": "15.1",
      "text": "The love of beauty is universal, especially for a seventeen-year-old girl in her prime.",
      "level": 2
    },
    {
      "id": "15.2",
      "text": "Although Hu Ying knows she is not attractive, and is short and fat, her heart cannot accept being called such nicknames, especially in front of so many classmates.",
      "level": 2
    },
    {
      "id": "15.3",
      "text": "Her self-esteem is suddenly hurt.",
      "level": 2
    },
    {
      "id": "15.4",
      "text": "So she glares at Zhou Feng again.",
      "level": 2
    },
    {
      "id": "16",
      "text": "'Glare at your mother's head!'",
      "level": 1
    },
    {
      "id": "16.1",
      "text": "As Zhou Feng says this, he picks up a book from Wang Lisheng's desk.",
      "level": 2
    },
    {
      "id": "16.2",
      "text": "Before he finishes speaking, he swings the book at Hu Ying's face.",
      "level": 2
    },
    {
      "id": "17",
      "text": "Hu Ying purses her lips, holding back tears.",
      "level": 1
    },
    {
      "id": "17.1",
      "text": "Her cheeks burn with pain.",
      "level": 2
    },
    {
      "id": "17.2",
      "text": "Although she curses Zhou Feng to go to hell ten thousand times in her heart, she dares not look at him again.",
      "level": 2
    },
    {
      "id": "18",
      "text": "All the classmates watch this indifferently.",
      "level": 1
    },
    {
      "id": "18.1",
      "text": "Some even gloat.",
      "level": 2
    },
    {
      "id": "18.2",
      "text": "Being ugly is not Hu Ying's fault, but to others, ugliness itself seems like a mistake.",
      "level": 2
    },
    {
      "id": "18.3",
      "text": "Therefore, no one takes Hu Ying being bullied seriously, and of course, no one dares to take it seriously.",
      "level": 2
    },
    {
      "id": "19",
      "text": "At this moment, Wang Lisheng suddenly grabs Zhou Feng's hand and whispers in his ear: 'Let's not go online anymore from now on.'",
      "level": 1
    },
    {
      "id": "20",
      "text": "'What?'",
      "level": 1
    },
    {
      "id": "20.1",
      "text": "Zhou Feng scratches his itchy ear.",
      "level": 2
    },
    {
      "id": "20.2",
      "text": "He heard Wang Lisheng's words clearly, but Wang Lisheng was too close, making his eardrum sensitive.",
      "level": 2
    },
    {
      "id": "21",
      "text": "Wang Lisheng repeats himself, this time even quieter.",
      "level": 1
    },
    {
      "id": "22",
      "text": "'What's wrong? What happened?'",
      "level": 1
    },
    {
      "id": "22.1",
      "text": "He looks at Wang Lisheng.",
      "level": 2
    },
    {
      "id": "22.2",
      "text": "Wang Lisheng's expression is extremely complex.",
      "level": 2
    },
    {
      "id": "22.3",
      "text": "He vaguely perceives a kind of fear in Wang Lisheng's eyes.",
      "level": 2
    },
    {
      "id": "22.4",
      "text": "This is something he has never seen before.",
      "level": 2
    },
    {
      "id": "23",
      "text": "Wang Lisheng shakes his head forcefully, as if trying to shake something off.",
      "level": 1
    },
    {
      "id": "23.1",
      "text": "He opens his mouth but says nothing.",
      "level": 2
    },
    {
      "id": "23.2",
      "text": "Then he sweeps all the books on the desk into the drawer and stands up to leave the classroom.",
      "level": 2
    },
    {
      "id": "24",
      "text": "Zhou Feng watches Wang Lisheng's retreating figure, feeling somewhat inexplicable.",
      "level": 1
    },
    {
      "id": "24.1",
      "text": "What's wrong with Wang Lisheng?",
      "level": 2
    },
    {
      "id": "24.2",
      "text": "Has he been possessed?",
      "level": 2
    },
    {
      "id": "25",
      "text": "Wang Lisheng is indeed possessed.",
      "level": 1
    },
    {
      "id": "26",
      "text": "Wang Lisheng cannot forget the terrifying scene of last night.",
      "level": 1
    },
    {
      "id": "26.1",
      "text": "Perhaps others would consider it a absurd accident or a scary prank.",
      "level": 2
    },
    {
      "id": "26.2",
      "text": "He had tried to comfort himself, but it was useless.",
      "level": 2
    },
    {
      "id": "26.3",
      "text": "For the whole day, he has been unable to break free from that deep fear.",
      "level": 2
    },
    {
      "id": "26.4",
      "text": "It's like an inescapable nightmare, clinging to him tightly from the inside out.",
      "level": 2
    },
    {
      "id": "27",
      "text": "Since the class teacher stopped raiding internet cafes, students who used to frequent them became even more reckless.",
      "level": 1
    },
    {
      "id": "27.1",
      "text": "Before, they would concoct elaborate excuses to take leave from teachers.",
      "level": 2
    },
    {
      "id": "27.2",
      "text": "Now, they go whenever they want, too lazy to attend classes.",
      "level": 2
    },
    {
      "id": "27.3",
      "text": "Almost all the money given by parents is spent at the Legend Internet Cafe, as well as on game point cards.",
      "level": 2
    },
    {
      "id": "28",
      "text": "The Legend Internet Cafe is the only internet cafe in Liuqiao Town and has the best monitoring and communication systems.",
      "level": 1
    },
    {
      "id": "28.1",
      "text": "Last night was like any other.",
      "level": 2
    },
    {
      "id": "28.2",
      "text": "Zhou Feng and Wang Lisheng went online after dinner and stayed until late at night.",
      "level": 2
    },
    {
      "id": "28.3",
      "text": "Wang Lisheng was engrossed in playing when his computer suddenly froze.",
      "level": 2
    },
    {
      "id": "28.4",
      "text": "He cursed and went to the restroom while the computer restarted.",
      "level": 2
    },
    {
      "id": "28.5",
      "text": "In the restroom mirror, he saw a haggard face.",
      "level": 2
    },
    {
      "id": "28.6",
      "text": "Due to frequent late nights and prolonged exposure to computer screens, his skin was dry and pale.",
      "level": 3
    },
    {
      "id": "28.7",
      "text": "His eye sockets were deeply sunken, and his eyes were bloodshot.",
      "level": 3
    },
    {
      "id": "28.8",
      "text": "Combined with his naturally thin build, he looked like a zombie just crawled out of a grave.",
      "level": 3
    },
    {
      "id": "29",
      "text": "Wang Lisheng shivers inexplicably as he looks at himself in the mirror.",
      "level": 1
    },
    {
      "id": "30",
      "text": "He washes his face with water and returns to the computer.",
      "level": 1
    },
    {
      "id": "30.1",
      "text": "His computer screen is black.",
      "level": 2
    },
    {
      "id": "30.2",
      "text": "This black is not the natural black of a shut-down computer, but a strange, indescribable black.",
      "level": 2
    },
    {
      "id": "30.3",
      "text": "He restarts it again, but it still doesn't respond.",
      "level": 2
    },
    {
      "id": "30.4",
      "text": "At this time, those staying overnight at the internet cafe are either asleep in their chairs or focused on their screens.",
      "level": 2
    },
    {
      "id": "30.5",
      "text": "No one notices anything wrong with Wang Lisheng's computer.",
      "level": 2
    },
    {
      "id": "31",
      "text": "Just as Wang Lisheng is about to call the attendant, some white dots appear on the black screen.",
      "level": 1
    },
    {
      "id": "31.1",
      "text": "Those dots seem to be moving, like newly detached larvae wriggling restlessly.",
      "level": 2
    },
    {
      "id": "31.2",
      "text": "Slowly, they turn into blurry text.",
      "level": 2
    },
    {
      "id": "32",
      "text": "Because the characters are too small, Wang Lisheng leans closer to the computer to identify them.",
      "level": 1
    },
    {
      "id": "32.1",
      "text": "The white dots instantly enlarge, and the text fills the entire screen.",
      "level": 2
    },
    {
      "id": "33",
      "text": "Wang Lisheng sits up abruptly as if electrocuted, staring at the screen without blinking.",
      "level": 1
    },
    {
      "id": "34",
      "text": "Three simple words, but they fill Wang Lisheng with a fatal fear.",
      "level": 1
    },
    {
      "id": "34.1",
      "text": "'Help me.'",
      "level": 2
    },
    {
      "id": "35",
      "text": "By the time he recovers, the text is gone, and the computer returns to normal.",
      "level": 1
    },
    {
      "id": "35.1",
      "text": "But Wang Lisheng can no longer be calm.",
      "level": 2
    },
    {
      "id": "35.2",
      "text": "He doesn't even dare to touch the computer, as if the mouse is a button for a time bomb.",
      "level": 2
    },
    {
      "id": "35.3",
      "text": "If he touches it, he will be blown to pieces.",
      "level": 2
    },
    {
      "id": "35.4",
      "text": "He sits there blankly until Zhou Feng calls him back to the dormitory near dawn.",
      "level": 2
    },
    {
      "id": "36",
      "text": "Wang Lisheng thinks about the incident all day.",
      "level": 1
    },
    {
      "id": "36.1",
      "text": "He knows it's not a hallucination.",
      "level": 2
    },
    {
      "id": "36.2",
      "text": "He really saw three words on the computer screen at the Legend Internet Cafe last night: 'Help me.'",
      "level": 2
    },
    {
      "id": "36.3",
      "text": "What does it mean?",
      "level": 2
    },
    {
      "id": "36.4",
      "text": "He doesn't dare to tell Zhou Feng, nor does he know how to tell him.",
      "level": 2
    },
    {
      "id": "36.5",
      "text": "He is afraid Zhou Feng will think he is crazy.",
      "level": 2
    },
    {
      "id": "36.6",
      "text": "He tosses and turns in bed, his mind filled with those three damned words.",
      "level": 2
    },
    {
      "id": "37",
      "text": "Damn it! It's that time again!",
      "level": 1
    },
    {
      "id": "37.1",
      "text": "As punctual as the evening news!",
      "level": 2
    },
    {
      "id": "37.2",
      "text": "Wang Lisheng suddenly begins to hate himself.",
      "level": 2
    },
    {
      "id": "37.3",
      "text": "Why does he have the habit of getting up to go to the toilet in the middle of the night?",
      "level": 2
    },
    {
      "id": "38",
      "text": "Wang Lisheng angrily tears off a piece of paper and walks out of the dormitory in the dark.",
      "level": 1
    },
    {
      "id": "38.1",
      "text": "He is actually a bit scared right now, all because of that computer last night.",
      "level": 2
    },
    {
      "id": "38.2",
      "text": "But he is even more reluctant to wake Zhou Feng.",
      "level": 2
    },
    {
      "id": "38.3",
      "text": "Zhou Feng always says he's not assertive enough.",
      "level": 2
    },
    {
      "id": "38.4",
      "text": "If Zhou Feng knew he was even afraid to go to the toilet, not only Zhou Feng but perhaps all his classmates would burst into laughter.",
      "level": 2
    },
    {
      "id": "39",
      "text": "A flash of lightning streaks across the night sky, illuminating the sleeping campus.",
      "level": 1
    },
    {
      "id": "39.1",
      "text": "Wang Lisheng unconsciously runs towards the toilet.",
      "level": 2
    },
    {
      "id": "40",
      "text": "The toilet is very quiet, so quiet that only the sound of his own heart beating can be heard.",
      "level": 1
    },
    {
      "id": "40.1",
      "text": "The fluorescent lights are covered in dust, casting a eerie pale blue light.",
      "level": 2
    },
    {
      "id": "41",
      "text": "To bolster his courage, Wang Lisheng whistles, but stops after a few notes.",
      "level": 1
    },
    {
      "id": "41.1",
      "text": "The whistling sound echoes hollowly in the toilet, making him feel creepy.",
      "level": 2
    },
    {
      "id": "42",
      "text": "He tries to think about other things, about Li Xue's clear and captivating eyes.",
      "level": 1
    },
    {
      "id": "42.1",
      "text": "But as he thinks, Li Xue's eyes are unconsciously replaced by those three terrifying words on the computer screen.",
      "level": 2
    },
    {
      "id": "43",
      "text": "Wang Lisheng remembers that around this time last night, a computer at the Legend Internet Cafe suddenly froze, and three inexplicable words appeared on the black screen.",
      "level": 1
    },
    {
      "id": "44",
      "text": "Wang Lisheng feels he is going crazy.",
      "level": 1
    },
    {
      "id": "45",
      "text": "He dares not squat any longer.",
      "level": 1
    },
    {
      "id": "45.1",
      "text": "He pulls up his pants and pushes the door open.",
      "level": 2
    },
    {
      "id": "45.2",
      "text": "He turns on the faucet and quickly washes his hands.",
      "level": 2
    },
    {
      "id": "45.3",
      "text": "Just as he is about to leave, he suddenly hears a faint sound.",
      "level": 2
    },
    {
      "id": "46",
      "text": "He immediately turns around and asks alertly: 'Who?'",
      "level": 1
    },
    {
      "id": "46.1",
      "text": "No one answers, perhaps no one is there.",
      "level": 2
    },
    {
      "id": "47",
      "text": "However, he hears another faint, heart-pounding sound.",
      "level": 1
    },
    {
      "id": "47.1",
      "text": "The sound comes from the innermost door.",
      "level": 2
    },
    {
      "id": "48",
      "text": "'Who? Who's in there?'",
      "level": 1
    },
    {
      "id": "48.1",
      "text": "Wang Lisheng asks bravely, but he clearly feels his whole body trembling.",
      "level": 2
    },
    {
      "id": "48.2",
      "text": "He slowly moves towards the door.",
      "level": 2
    },
    {
      "id": "49",
      "text": "The door suddenly bangs open with a 'boom'!",
      "level": 1
    },
    {
      "id": "49.1",
      "text": "The echoing violent impact startles Wang Lisheng in the silent night.",
      "level": 2
    },
    {
      "id": "49.2",
      "text": "He is also awakened.",
      "level": 2
    },
    {
      "id": "49.3",
      "text": "Just as he is about to unleash his already bad temper, he sees a man lying on the ground, and his eyes widen.",
      "level": 2
    },
    {
      "id": "50",
      "text": "The person on the ground is covered in blood, wearing a white shirt stained with bloodstains.",
      "level": 1
    },
    {
      "id": "50.1",
      "text": "He covers his bloody face with his hands and writhes on the ground.",
      "level": 2
    },
    {
      "id": "51",
      "text": "No matter how brave Wang Lisheng is, he is stunned by the scene.",
      "level": 1
    },
    {
      "id": "51.1",
      "text": "Moreover, he was already frightened once at the Legend Internet Cafe last night.",
      "level": 2
    },
    {
      "id": "51.2",
      "text": "He stands there blankly, unable to speak or move.",
      "level": 2
    },
    {
      "id": "52",
      "text": "He clearly hears heavy breathing, but cannot distinguish whether it is his own or the man's.",
      "level": 1
    },
    {
      "id": "53",
      "text": "The person on the ground seems to relax his body.",
      "level": 1
    },
    {
      "id": "53.1",
      "text": "He uses his bloody hand to press on the ground and crawls laboriously towards Wang Lisheng.",
      "level": 2
    },
    {
      "id": "54",
      "text": "What does he want to do?",
      "level": 1
    },
    {
      "id": "54.1",
      "text": "Wang Lisheng holds his breath and asks himself.",
      "level": 2
    },
    {
      "id": "55",
      "text": "The person on the ground grabs Wang Lisheng's pant leg.",
      "level": 1
    },
    {
      "id": "55.1",
      "text": "He lifts his face, which is covered in blood, and the blood continues to drip down.",
      "level": 2
    },
    {
      "id": "56",
      "text": "He looks at Wang Lisheng, his eyes full of fear and an indescribable complex emotion.",
      "level": 1
    },
    {
      "id": "57",
      "text": "He opens his mouth, and the blood quickly flows into his mouth from his nose.",
      "level": 1
    },
    {
      "id": "57.1",
      "text": "He makes a hoarse, ghostly sound from his throat: 'Help... help... me...'",
      "level": 2
    },
    {
      "id": "58",
      "text": "Wang Lisheng's mind goes blank.",
      "level": 1
    },
    {
      "id": "58.1",
      "text": "He has never been so terrified.",
      "level": 2
    },
    {
      "id": "58.2",
      "text": "He hesitates for a moment, then breaks free from the hand holding his pant leg and runs out the door.",
      "level": 2
    },
    {
      "id": "59",
      "text": "As soon as he reaches the male dormitory building, he collides with someone unexpectedly, nearly scaring his soul out of him.",
      "level": 1
    },
    {
      "id": "59.1",
      "text": "This fright finally makes him let out a bone-chilling scream.",
      "level": 2
    },
    {
      "id": "59.2",
      "text": "Without even looking at who he bumped into, he runs upstairs in a state of shock.",
      "level": 2
    },
    {
      "id": "60",
      "text": "'Wang Lisheng! What are you doing?'",
      "level": 1
    },
    {
      "id": "60.1",
      "text": "Wang Lisheng is long gone.",
      "level": 2
    },
    {
      "id": "61",
      "text": "Wang Lisheng's appearance bewilders the dean of students.",
      "level": 1
    },
    {
      "id": "61.1",
      "text": "He picks up the flashlight from the ground.",
      "level": 2
    },
    {
      "id": "61.2",
      "text": "He thinks about Wang Lisheng's expression and looks at the toilet.",
      "level": 2
    },
    {
      "id": "61.3",
      "text": "He calms himself and walks towards the toilet.",
      "level": 2
    },
    {
      "id": "62",
      "text": "Wang Lisheng returns to the dormitory and lies on his bed, unable to sleep all night.",
      "level": 1
    },
    {
      "id": "63",
      "text": "In the darkness, those pleading eyes constantly float before his eyes.",
      "level": 1
    },
    {
      "id": "63.1",
      "text": "Because the person's face was covered in blood, and Wang Lisheng was extremely scared at the time, he didn't recognize his appearance.",
      "level": 2
    },
    {
      "id": "63.2",
      "text": "Who is he?",
      "level": 2
    },
    {
      "id": "63.3",
      "text": "Why was his face covered in blood in the middle of the night?",
      "level": 2
    },
    {
      "id": "63.4",
      "text": "And in the toilet?",
      "level": 2
    },
    {
      "id": "63.5",
      "text": "Where did that blood come from?",
      "level": 2
    },
    {
      "id": "64",
      "text": "Wang Lisheng doesn't know why he didn't help that person.",
      "level": 1
    },
    {
      "id": "64.1",
      "text": "He seemed to be seriously injured.",
      "level": 2
    },
    {
      "id": "64.2",
      "text": "If it were someone else, who knows what they would have done.",
      "level": 2
    },
    {
      "id": "64.3",
      "text": "But Wang Lisheng was truly scared, he didn't even think of helping him.",
      "level": 2
    },
    {
      "id": "65",
      "text": "Help?",
      "level": 1
    },
    {
      "id": "65.1",
      "text": "Wang Lisheng suddenly remembers that the person he saw in the toilet last night said the exact same three words he saw on the computer screen at the Legend Internet Cafe!",
      "level": 2
    },
    {
      "id": "66",
      "text": "Pure coincidence?",
      "level": 1
    },
    {
      "id": "66.1",
      "text": "No!",
      "level": 2
    },
    {
      "id": "66.2",
      "text": "He quickly dismisses the thought.",
      "level": 2
    },
    {
      "id": "66.3",
      "text": "There are no such coincidences in this world!",
      "level": 2
    },
    {
      "id": "66.4",
      "text": "Wang Lisheng realizes that if these two events are connected, it is terrifying beyond imagination.",
      "level": 2
    },
    {
      "id": "67",
      "text": "Wang Lisheng suddenly thinks that the person he saw in the toilet last night might not be human.",
      "level": 1
    },
    {
      "id": "67.1",
      "text": "Then, he is...",
      "level": 2
    },
    {
      "id": "68",
      "text": "Thinking of this, Wang Lisheng's whole body twitches violently.",
      "level": 1
    },
    {
      "id": "69",
      "text": "At the same time, the torrential rain finally arrives with fury.",
      "level": 1
    },
    {
      "id": "70",
      "text": "This downpour, for Wang Lisheng, is like a thousand-year-old uncorrupted soul roaring across the sky, sweeping across the entire world.",
      "level": 1
    },
    {
      "id": "71",
      "text": "At the same time.",
      "level": 1
    },
    {
      "id": "72",
      "text": "A silhouette, head bowed, wanders the corridor like a ghost.",
      "level": 1
    },
    {
      "id": "72.1",
      "text": "Occasionally, a brief flash of lightning plunges the entire campus into an eerie atmosphere.",
      "level": 2
    },
    {
      "id": "73",
      "text": "The silhouette hesitates for a long time, as if gathering courage to knock on a door.",
      "level": 1
    },
    {
      "id": "74",
      "text": "The gentle knock is drowned out by the wind and rain.",
      "level": 1
    },
    {
      "id": "74.1",
      "text": "So the silhouette knocks again, as if making a big decision, adding more force.",
      "level": 2
    },
    {
      "id": "75",
      "text": "'Who?'",
      "level": 1
    },
    {
      "id": "75.1",
      "text": "The voice from inside the room sounds almost simultaneously with the thunder, overlapping.",
      "level": 2
    },
    {
      "id": "76",
      "text": "'It's me...'",
      "level": 1
    },
    {
      "id": "77",
      "text": "The light in the room turns on.",
      "level": 1
    },
    {
      "id": "77.1",
      "text": "A moment later, the door creaks open.",
      "level": 2
    },
    {
      "id": "78",
      "text": "Outside, the wind blows the branches, making sharp, piercing sounds.",
      "level": 1
    },
    {
      "id": "78.1",
      "text": "And the leaves trembling in the wind, in this dark night, look like countless ghostly shadows dancing a clumsy dance without rhythm.",
      "level": 2
    },
    {
      "id": "79",
      "text": "The wind intensifies, the rain gets heavier.",
      "level": 1
    },
    {
      "id": "80",
      "text": "In the girls' dormitory, Wang Ling, sleeping on the upper bunk, is suddenly awakened by a thunderclap.",
      "level": 1
    },
    {
      "id": "80.1",
      "text": "She opens her eyes and sees that the window is open, banging 'bang bang' in the wind.",
      "level": 2
    },
    {
      "id": "80.2",
      "text": "The fierce wind and heavy rain pour into the dormitory.",
      "level": 2
    },
    {
      "id": "80.3",
      "text": "Wang Ling's deskmate, Zhang Haiying, sleeps by the window.",
      "level": 2
    },
    {
      "id": "80.4",
      "text": "Zhang Haiying is a girl who only knows how to laugh and has no worries.",
      "level": 2
    },
    {
      "id": "80.5",
      "text": "Once she falls asleep, even if the sky falls, she won't wake up.",
      "level": 2
    },
    {
      "id": "80.6",
      "text": "And now, she is sleeping by the window, with her head facing the window, completely oblivious to the noise.",
      "level": 2
    },
    {
      "id": "81",
      "text": "Wang Ling thinks for a moment and sits up.",
      "level": 1
    },
    {
      "id": "81.1",
      "text": "If Zhang Haiying sleeps like this all night, and the rain doesn't stop, she might get sick tomorrow.",
      "level": 2
    },
    {
      "id": "82",
      "text": "Wang Ling carefully grabs the head of the bed.",
      "level": 1
    },
    {
      "id": "82.1",
      "text": "She tries to step on the edge of the lower bunk with her foot.",
      "level": 2
    },
    {
      "id": "82.2",
      "text": "As she steps, she almost screams.",
      "level": 2
    },
    {
      "id": "82.3",
      "text": "Her foot touches something soft and cold.",
      "level": 2
    },
    {
      "id": "82.4",
      "text": "In her panic, her entire weight falls onto that smooth, unknown object.",
      "level": 2
    },
    {
      "id": "83",
      "text": "A ghostly cry comes from the lower bunk: 'Ah! Wang Ling, are you trying to kill me! You stepped on my arm and so hard! It's not your flesh, doesn't it hurt?'",
      "level": 1
    },
    {
      "id": "84",
      "text": "The arm retracts.",
      "level": 1
    },
    {
      "id": "84.1",
      "text": "Wang Ling jumps out of bed, fumbling for her shoes, and says repeatedly: 'Sorry, sorry!'",
      "level": 2
    },
    {
      "id": "85",
      "text": "Li Xia rubs her arm and asks: 'What are you getting up for in the middle of the night?'",
      "level": 1
    },
    {
      "id": "86",
      "text": "'Oh, it's raining. I want to close the window. Zhang Haiying will get wet. I'm afraid she'll get sick tomorrow.'",
      "level": 1
    },
    {
      "id": "87",
      "text": "'Hmm, then you go close it. I'll shine the light for you.'",
      "level": 1
    },
    {
      "id": "87.1",
      "text": "After speaking, Li Xia takes out a small flashlight from under her pillow.",
      "level": 2
    },
    {
      "id": "88",
      "text": "After Wang Ling closes the window, she adjusts Zhang Haiying's quilt, covering her properly.",
      "level": 1
    },
    {
      "id": "88.1",
      "text": "Then she checks if other girls have their quilts covered properly.",
      "level": 2
    },
    {
      "id": "88.2",
      "text": "Only then does she say to Li Xia with relief: 'Okay, thank you. It's fine now. You should sleep too.'",
      "level": 2
    },
    {
      "id": "89",
      "text": "'Wang Ling, talk to me, okay? I can't sleep, I feel so restless.'",
      "level": 1
    },
    {
      "id": "90",
      "text": "'What's restless about a child? We can talk tomorrow. What time is it? Go to sleep, or we'll be late for early self-study.'",
      "level": 1
    },
    {
      "id": "91",
      "text": "Li Xia pouts and, like a child, grabs Wang Ling's hand, shaking it and saying: 'Wang Ling, good Wang Ling, just talk to me for a while. Just a little while, okay?'",
      "level": 1
    },
    {
      "id": "92",
      "text": "Li Xia is the youngest girl in the class, and the youngest student in the entire first year.",
      "level": 1
    },
    {
      "id": "92.1",
      "text": "She just celebrated her sixteenth birthday a month ago.",
      "level": 2
    },
    {
      "id": "92.2",
      "text": "Although she is young, she is an excellent student.",
      "level": 2
    },
    {
      "id": "92.3",
      "text": "The school values her highly, and she lives up to expectations.",
      "level": 2
    },
    {
      "id": "92.4",
      "text": "Her essay 'Mother' won first place in the county writing competition.",
      "level": 2
    },
    {
      "id": "92.5",
      "text": "Teachers praise her constantly.",
      "level": 2
    },
    {
      "id": "92.6",
      "text": "It's hard to imagine that someone who receives so much affection would also have worries.",
      "level": 2
    },
    {
      "id": "93",
      "text": "Wang Ling looks at her cute appearance and can't bear to refuse.",
      "level": 1
    },
    {
      "id": "93.1",
      "text": "She always dotes on her the most.",
      "level": 2
    },
    {
      "id": "94",
      "text": "So she says: 'Alright, I'll talk to you for a while. But we agree, just a little while. I don't want to be drowsy in class tomorrow with dark circles under my eyes.'",
      "level": 1
    },
    {
      "id": "95",
      "text": "'Yes, yes. Lie down, we'll squeeze in.'",
      "level": 1
    },
    {
      "id": "95.1",
      "text": "Li Xia says, moving aside to make space for Wang Ling, and then turns off the flashlight, putting it under her pillow.",
      "level": 2
    },
    {
      "id": "96",
      "text": "Wang Ling says: 'Haven't washed the quilt in a long time, has it? It smells.'",
      "level": 1
    },
    {
      "id": "97",
      "text": "Li Xia says shyly: 'Mm, but I don't know how to wash it.'",
      "level": 1
    },
    {
      "id": "98",
      "text": "'If it doesn't rain tomorrow, I'll wash it for you.'",
      "level": 1
    },
    {
      "id": "99",
      "text": "'No need. Isn't the day after tomorrow the weekend? I'll take it home for my mom to wash. I need to go home to get money.'",
      "level": 1
    },
    {
      "id": "100",
      "text": "Wang Ling can't help but ask: 'Get money? Didn't I see you had over 300 yuan a couple of days ago? Where's your money?'",
      "level": 1
    },
    {
      "id": "101",
      "text": "'I... I bought, bought something.'",
      "level": 1
    },
    {
      "id": "101.1",
      "text": "Li Xia stammers, afraid to tell Wang Ling that not only is the 300 yuan gone, but she also borrowed 200 from classmates.",
      "level": 2
    },
    {
      "id": "101.2",
      "text": "She now only has 20 yuan left.",
      "level": 2
    },
    {
      "id": "101.3",
      "text": "If she doesn't go home to get money the day after tomorrow, she'll have trouble even eating.",
      "level": 2
    },
    {
      "id": "101.4",
      "text": "But she can't say it.",
      "level": 2
    },
    {
      "id": "101.5",
      "text": "Although Wang Ling treats her like a sister, Wang Ling is extremely frugal.",
      "level": 2
    },
    {
      "id": "101.6",
      "text": "Wang Ling transferred to this school from a rural area because her family is in dire straits, so she wants to make every penny count.",
      "level": 2
    },
    {
      "id": "101.7",
      "text": "If Wang Ling knew where the 500 yuan went, she would be furious.",
      "level": 2
    },
    {
      "id": "102",
      "text": "'Bought something? What did you buy?'",
      "level": 1
    },
    {
      "id": "102.1",
      "text": "Wang Ling asks.",
      "level": 2
    },
    {
      "id": "102.2",
      "text": "In the dark, she can't see Li Xia's expression, but she senses that Li Xia is lying.",
      "level": 2
    },
    {
      "id": "103",
      "text": "'I really bought something. Do you believe me?'",
      "level": 1
    },
    {
      "id": "103.1",
      "text": "Li Xia wraps her arm around Wang Ling's arm from under the quilt and presses her face against Wang Ling's shoulder, changing the subject.",
      "level": 2
    },
    {
      "id": "103.2",
      "text": "She asks softly: 'Wang Ling, have you ever liked someone?'",
      "level": 2
    },
    {
      "id": "104",
      "text": "'Me?'",
      "level": 1
    },
    {
      "id": "104.1",
      "text": "Wang Ling's body trembles slightly.",
      "level": 2
    },
    {
      "id": "104.2",
      "text": "A very handsome face immediately appears in her mind.",
      "level": 2
    },
    {
      "id": "104.3",
      "text": "From the first day Wang Ling transferred, she felt he looked like Takeshi Kaneshiro and fell in love with him silently.",
      "level": 2
    },
    {
      "id": "104.4",
      "text": "But he never even looked at her directly.",
      "level": 2
    },
    {
      "id": "104.5",
      "text": "She is just an ordinary girl among many, even the most inconspicuous.",
      "level": 2
    },
    {
      "id": "104.6",
      "text": "She knows her liking is destined to be a hopeless unrequited love, so she has never expressed it or dared to tell anyone.",
      "level": 2
    },
    {
      "id": "104.7",
      "text": "She avoids him everywhere, but subconsciously pays attention to him at unexpected moments.",
      "level": 2
    },
    {
      "id": "104.8",
      "text": "Perhaps to others, he is an incorrigible bad student.",
      "level": 2
    },
    {
      "id": "104.9",
      "text": "But for Wang Ling, every word, every action, every move he makes has an irresistible charm.",
      "level": 2
    },
    {
      "id": "104.10",
      "text": "Wang Ling's face heats up, her heart beats faster, feeling a sour, indescribable emotion, whether it's happiness or sadness.",
      "level": 2
    },
    {
      "id": "105",
      "text": "'Yes? Wang Ling?'",
      "level": 1
    },
    {
      "id": "106",
      "text": "'Mmm... No.'",
      "level": 1
    },
    {
      "id": "107",
      "text": "'No? You thought for so long and it's no? You definitely have someone. Tell me who he is! Is he in our class?'",
      "level": 1
    },
    {
      "id": "108",
      "text": "'Really, no.'",
      "level": 1
    },
    {
      "id": "108.1",
      "text": "Wang Ling's face turns red.",
      "level": 2
    },
    {
      "id": "108.2",
      "text": "She is glad it's night and Li Xia can't see her expression, otherwise she would be too embarrassed.",
      "level": 2
    },
    {
      "id": "109",
      "text": "'You dare to lie again! Believe it or not, I'll tickle you!'",
      "level": 1
    },
    {
      "id": "109.1",
      "text": "As Li Xia says this, her hand has already reached Wang Ling's armpit.",
      "level": 2
    },
    {
      "id": "109.2",
      "text": "The two girls laugh and wrestle.",
      "level": 2
    },
    {
      "id": "110",
      "text": "Their actions quickly draw protests from other girls in the room.",
      "level": 1
    },
    {
      "id": "110.1",
      "text": "Someone shouts: 'What are you fighting about? It's the middle of the night, can't you let people sleep?'",
      "level": 2
    },
    {
      "id": "111",
      "text": "They immediately stop, but still can't help but stifle their laughter under the covers.",
      "level": 1
    },
    {
      "id": "111.1",
      "text": "After a long while, Wang Ling peeks her head out to breathe.",
      "level": 2
    },
    {
      "id": "111.2",
      "text": "Li Xia also crawls out.",
      "level": 2
    },
    {
      "id": "112",
      "text": "Wang Ling thinks for a moment and says: 'Why did you suddenly ask me this? Don't tell me you've fallen for someone?'",
      "level": 1
    },
    {
      "id": "113",
      "text": "'Me... I haven't.'",
      "level": 1
    },
    {
      "id": "113.1",
      "text": "Li Xia smiles.",
      "level": 2
    },
    {
      "id": "114",
      "text": "Wang Ling turns to face Li Xia: 'It's not true, is it? You're just a little girl, you just turned sixteen!'",
      "level": 1
    },
    {
      "id": "115",
      "text": "Li Xia mutters: 'Sixteen isn't that young. You're only a year older than me.'",
      "level": 1
    },
    {
      "id": "116",
      "text": "'So it's true? You're dating? Do you know this is bad? It will affect your studies. So many people love and care about you, how can you disappoint them? Do you understand how terrible early romance is?'",
      "level": 1
    },
    {
      "id": "116.1",
      "text": "Wang Ling says these words, feeling hypocritical.",
      "level": 2
    },
    {
      "id": "116.2",
      "text": "Isn't her own secret crush on another boy also early romance?",
      "level": 2
    },
    {
      "id": "116.3",
      "text": "But she has to do this.",
      "level": 2
    },
    {
      "id": "116.4",
      "text": "She doesn't want to see such an excellent student like Li Xia fall into early romance; Li Xia is only sixteen!",
      "level": 2
    },
    {
      "id": "117",
      "text": "'I'm not. We haven't even met.'",
      "level": 1
    },
    {
      "id": "118",
      "text": "'Haven't met?'",
      "level": 1
    },
    {
      "id": "118.1",
      "text": "Wang Ling doesn't understand for a moment.",
      "level": 2
    },
    {
      "id": "119",
      "text": "'Yeah, we met online...'",
      "level": 1
    },
    {
      "id": "120",
      "text": "'Oh God! You're having an online romance?'",
      "level": 1
    },
    {
      "id": "120.1",
      "text": "Wang Ling is shocked.",
      "level": 2
    },
    {
      "id": "121",
      "text": "Li Xia hastily covers Wang Ling's mouth with her hand: 'Shh! Keep your voice down! Do you want the whole school to know tomorrow?'",
      "level": 1
    },
    {
      "id": "121.1",
      "text": "Li Xia is almost in tears from anxiety.",
      "level": 2
    },
    {
      "id": "122",
      "text": "'I really don't understand, how can you have feelings for someone you've never met?'",
      "level": 1
    },
    {
      "id": "123",
      "text": "Li Xia says softly: 'You wouldn't understand. Even I don't understand why. My mind is full of him. Really.",
      "level": 1
    },
    {
      "id": "123.1",
      "text": "He's different from the boys at our school.",
      "level": 2
    },
    {
      "id": "123.2",
      "text": "We've video chatted. I'll take you sometime, so you can see him too.",
      "level": 2
    },
    {
      "id": "123.3",
      "text": "He's not particularly handsome, but he's like an artist.",
      "level": 2
    },
    {
      "id": "123.4",
      "text": "I love the way he smokes during video calls, a bit cool, a bit melancholic.",
      "level": 2
    },
    {
      "id": "123.5",
      "text": "You know, he tells me so many things I've never heard before.",
      "level": 2
    },
    {
      "id": "123.6",
      "text": "I really admire him, I really like him. Do you understand me, Wang Ling?'",
      "level": 2
    },
    {
      "id": "124",
      "text": "Wang Ling shakes her head in the dark: 'I don't understand. I think you're crazy.'",
      "level": 1
    },
    {
      "id": "125",
      "text": "'Yes, not only am I crazy, but I'm also very scared.'",
      "level": 1
    },
    {
      "id": "126",
      "text": "'Of course you should be scared! Haven't you heard the class teacher talk so much about the harms of the internet? If that's the case, I'd rather you liked someone from our school. What is the internet? It's all illusions, and all sorts of people are on it. Do you know that?'",
      "level": 1
    },
    {
      "id": "127",
      "text": "Li Xia says: 'I know, but I'm not afraid of him deceiving me. I trust him.'",
      "level": 1
    },
    {
      "id": "128",
      "text": "'If you continue to be so addicted, you'll be beyond help, Li Xia.'",
      "level": 1
    },
    {
      "id": "129",
      "text": "'No, listen to me.'",
      "level": 1
    },
    {
      "id": "129.1",
      "text": "Li Xia suddenly lowers her voice.",
      "level": 2
    },
    {
      "id": "129.2",
      "text": "She tightly clutches Wang Ling's arm, her body trembling slightly.",
      "level": 2
    },
    {
      "id": "129.3",
      "text": "She continues: 'Do you know why our class teacher is so opposed to students going online?'",
      "level": 2
    },
    {
      "id": "130",
      "text": "'Don't even mention him. If it were me, I'd oppose it too! The internet is so bad. Look at those game addicts in our class, they look like neither humans nor ghosts from staying up late. I really don't understand what's so fun about games.",
      "level": 1
    },
    {
      "id": "130.1",
      "text": "Even if you reach the highest level, become number one in the whole game world, so what? You still have to return to real life.",
      "level": 2
    },
    {
      "id": "130.2",
      "text": "Games can't be eaten, I really don't get it.'",
      "level": 2
    },
    {
      "id": "131",
      "text": "Li Xia doesn't comment on her words and continues: 'Do you know why the dormitory next to us, the one by the stairs, is always locked?'",
      "level": 1
    },
    {
      "id": "132",
      "text": "'Yes, isn't it said that there's something unclean inside? That it's haunted...'",
      "level": 1
    },
    {
      "id": "132.1",
      "text": "Wang Ling dares not say the last word.",
      "level": 2
    },
    {
      "id": "132.2",
      "text": "On this dark, rainy night, discussing such a sensitive topic always makes people tremble with fear, and connect it to many things, especially since that dormitory is next to theirs, only a few steps away.",
      "level": 2
    },
    {
      "id": "133",
      "text": "'Do you know why it's unclean?'",
      "level": 1
    },
    {
      "id": "134",
      "text": "'I, I don't know. You better not say anymore.'",
      "level": 1
    },
    {
      "id": "134.1",
      "text": "Wang Ling suddenly feels very cold.",
      "level": 2
    },
    {
      "id": "134.2",
      "text": "She pulls the quilt tighter, wrapping herself up.",
      "level": 2
    },
    {
      "id": "135",
      "text": "But Li Xia shows no signs of stopping, even though she feels colder than Wang Ling.",
      "level": 1
    },
    {
      "id": "135.1",
      "text": "She says: 'Because... someone died in there.'",
      "level": 2
    },
    {
      "id": "136",
      "text": "Wang Ling shivers: 'No way?'",
      "level": 1
    },
    {
      "id": "137",
      "text": "'Mm, it happened a few years ago. I was in junior high then. That girl was the school beauty. She was really beautiful and had a great personality. Everyone liked her.",
      "level": 1
    },
    {
      "id": "137.1",
      "text": "Boys in our school lined up to pursue her, and some even fought for her.",
      "level": 2
    },
    {
      "id": "137.2",
      "text": "But she didn't like any of them.",
      "level": 2
    },
    {
      "id": "137.3",
      "text": "Later, she found out she was having an online romance and fell in love with a married man. She didn't know at first.",
      "level": 2
    },
    {
      "id": "137.4",
      "text": "Then, that man actually came to find her.",
      "level": 2
    },
    {
      "id": "137.5",
      "text": "She lost all interest in studying, often skipping class to be with that man wildly. She wouldn't listen to anyone.",
      "level": 2
    },
    {
      "id": "137.6",
      "text": "She loved that man so much that she was almost crazy.",
      "level": 2
    },
    {
      "id": "137.7",
      "text": "Not long after, the man's wife found her and dragged her out of the classroom.",
      "level": 2
    },
    {
      "id": "137.8",
      "text": "You know, in front of the entire school and all the teachers, she beat and cursed her.",
      "level": 2
    },
    {
      "id": "137.9",
      "text": "The woman outside was very fierce, her curses were too ugly, too vicious.",
      "level": 2
    },
    {
      "id": "137.10",
      "text": "After cursing and hitting her, she still wasn't satisfied and made the man slap the girl on the spot.",
      "level": 2
    },
    {
      "id": "137.11",
      "text": "That man was also a henpecked coward, and he actually slapped the girl.",
      "level": 2
    },
    {
      "id": "137.12",
      "text": "It wasn't until the police arrived that they left.",
      "level": 2
    },
    {
      "id": "137.13",
      "text": "No one could stop the woman; she was like a madwoman, as if she didn't care about her life.",
      "level": 2
    },
    {
      "id": "137.14",
      "text": "Imagine, how could a seventeen-year-old girl withstand such a commotion?",
      "level": 2
    },
    {
      "id": "137.15",
      "text": "That night, she committed suicide, right in the dormitory next to ours.",
      "level": 2
    },
    {
      "id": "137.16",
      "text": "In the morning, a girl from their room found her body and fainted on the spot.",
      "level": 2
    },
    {
      "id": "137.17",
      "text": "Many people ran to see. I didn't dare to go.",
      "level": 2
    },
    {
      "id": "137.18",
      "text": "I heard her appearance was terrifying.",
      "level": 2
    },
    {
      "id": "137.19",
      "text": "Next to her was an empty bottle of methomyl and a suicide note.",
      "level": 2
    },
    {
      "id": "137.20",
      "text": "Do you know what methomyl is? I didn't know at first, then I learned it's a highly toxic pesticide.",
      "level": 2
    },
    {
      "id": "137.21",
      "text": "After she died, the girls who used to live there dared not stay.",
      "level": 2
    },
    {
      "id": "137.22",
      "text": "The dormitory was not locked originally, but the next day, something terrifying happened.",
      "level": 2
    },
    {
      "id": "138",
      "text": "At this point, Li Xia snuggles even closer to Wang Ling.",
      "level": 1
    },
    {
      "id": "138.1",
      "text": "Wang Ling is already dumbfounded, unable to speak.",
      "level": 2
    },
    {
      "id": "139",
      "text": "Li Xia swallows and continues:",
      "level": 1
    },
    {
      "id": "140",
      "text": "'That girl had a cat.",
      "level": 1
    },
    {
      "id": "140.1",
      "text": "She didn't keep it in the dormitory; animals aren't allowed. She kept it at her father's house.",
      "level": 2
    },
    {
      "id": "140.2",
      "text": "The cat was beautiful, completely white, without a single stray hair.",
      "level": 2
    },
    {
      "id": "140.3",
      "text": "The day after that girl died, two girls who used to live in that dormitory went to find something.",
      "level": 2
    },
    {
      "id": "140.4",
      "text": "Guess what they saw?",
      "level": 2
    },
    {
      "id": "140.5",
      "text": "The cat was dead, right on that girl's bed.",
      "level": 2
    },
    {
      "id": "140.6",
      "text": "The cat died miserably, its eyes gouged out.",
      "level": 2
    },
    {
      "id": "140.7",
      "text": "No one knows how the cat died or who dug out its eyes.",
      "level": 2
    },
    {
      "id": "140.8",
      "text": "The incident spread like wildfire at school, and the stories became more exaggerated.",
      "level": 2
    },
    {
      "id": "140.9",
      "text": "The principal immediately locked the dormitory that day, and it hasn't been opened since.",
      "level": 2
    },
    {
      "id": "140.10",
      "text": "The principal even held a meeting and warned us never to speak of this matter.",
      "level": 2
    },
    {
      "id": "140.11",
      "text": "Anyone who broke the rule would be punished with cleaning the entire school, including the playground, the entire dormitory building, the school corridors, and the cafeteria, as well as cleaning the toilets.",
      "level": 2
    },
    {
      "id": "140.12",
      "text": "The severe punishment was expulsion after completing all the cleaning tasks.",
      "level": 2
    },
    {
      "id": "140.13",
      "text": "No one dared to speak of it outside, not entirely out of fear of the principal, but mainly out of personal fear, especially not to tell transfer students.",
      "level": 2
    },
    {
      "id": "140.14",
      "text": "It's much better now. Years have passed, and no one mentions it anymore.",
      "level": 2
    },
    {
      "id": "140.15",
      "text": "You don't know, when that girl first died, this school was always haunted.",
      "level": 2
    },
    {
      "id": "140.16",
      "text": "Some people saw her shadow floating around the playground late at night, some heard her singing in the toilet, and some heard cats meowing in the middle of the night...",
      "level": 2
    },
    {
      "id": "141",
      "text": "Wang Ling only recovers after a long time.",
      "level": 1
    },
    {
      "id": "141.1",
      "text": "Although she and Li Xia are almost hugging each other at this moment, she feels so cold that she has lost all sensation.",
      "level": 2
    },
    {
      "id": "142",
      "text": "She thinks for a moment and asks Li Xia: 'So, that's why the class teacher strongly opposes students going online? He thinks online romance led that girl to her death.'",
      "level": 1
    },
    {
      "id": "143",
      "text": "'Not entirely. That girl was his daughter. The class teacher also left the school for a while because of this incident. He was forced back by the principal last year.'",
      "level": 1
    },
    {
      "id": "144",
      "text": "'Oh! Li Xia, listen to me, don't go online anymore.",
      "level": 1
    },
    {
      "id": "144.1",
      "text": "There's no one online worth trusting.",
      "level": 2
    },
    {
      "id": "144.2",
      "text": "You're still so young, and you're so smart.",
      "level": 2
    },
    {
      "id": "144.3",
      "text": "You have a great future, don't let online romance ruin it!'",
      "level": 2
    },
    {
      "id": "145",
      "text": "Li Xia still insists, saying sweetly: 'Don't worry, I know you mean well.",
      "level": 1
    },
    {
      "id": "145.1",
      "text": "But I trust him. He won't deceive me. He's very good to me, really.",
      "level": 2
    },
    {
      "id": "145.2",
      "text": "I'll take you to meet him sometime, but don't tell anyone, okay? The school is most against online romance.'",
      "level": 2
    },
    {
      "id": "146",
      "text": "Wang Ling sighs helplessly.",
      "level": 1
    },
    {
      "id": "146.1",
      "text": "Facing such a stubborn Li Xia, she is speechless.",
      "level": 2
    },
    {
      "id": "146.2",
      "text": "She asks herself, how can she pull Li Xia out of that deep web?",
      "level": 2
    },
    {
      "id": "147",
      "text": "'Wang Ling, sleep with me tonight, I'm afraid alone.'",
      "level": 1
    },
    {
      "id": "148",
      "text": "'Okay, let's sleep.'",
      "level": 1
    },
    {
      "id": "149",
      "text": "But Wang Ling can't sleep no matter what.",
      "level": 1
    },
    {
      "id": "149.1",
      "text": "Her mind is filled with the story Li Xia told her about the girl in the dormitory next door.",
      "level": 2
    },
    {
      "id": "149.2",
      "text": "Her hands and feet are ice-cold, almost stiff.",
      "level": 2
    },
    {
      "id": "149.3",
      "text": "In her ears, the storm roars endlessly.",
      "level": 2
    },
    {
      "id": "150",
      "text": "She faintly hears the cry of a baby.",
      "level": 1
    },
    {
      "id": "151",
      "text": "No! That's a cat's cry!",
      "level": 1
    },
    {
      "id": "152",
      "text": "That sound... seems to be coming from under her bed!",
      "level": 1
    },
    {
      "id": "153",
      "text": "The heavy rain roared all night until the next morning.",
      "level": 1
    },
    {
      "id": "153.1",
      "text": "The entire campus was filled with a damp atmosphere.",
      "level": 2
    },
    {
      "id": "154",
      "text": "The class teacher was not present for today's math class.",
      "level": 1
    },
    {
      "id": "154.1",
      "text": "The substitute teacher said he was sick.",
      "level": 2
    },
    {
      "id": "154.2",
      "text": "This made many students secretly cheer.",
      "level": 2
    },
    {
      "id": "154.3",
      "text": "Some students even wished he would never recover and never return to school.",
      "level": 2
    },
    {
      "id": "154.4",
      "text": "Yes, besides the few students with excellent math grades, not many people liked the class teacher.",
      "level": 2
    },
    {
      "id": "154.5",
      "text": "At most, they appeared to respect him on the surface, but they respected his profession, not him as a person.",
      "level": 2
    },
    {
      "id": "155",
      "text": "Especially Wang Lisheng.",
      "level": 1
    },
    {
      "id": "155.1",
      "text": "He was most afraid of math class.",
      "level": 2
    },
    {
      "id": "155.2",
      "text": "Just as he was secretly happy, he realized that this substitute teacher was even more annoying than the class teacher.",
      "level": 2
    },
    {
      "id": "155.3",
      "text": "Whether it was a coincidence or Wang Lisheng was just unlucky, in two consecutive math classes, Wang Lisheng was called upon to answer questions numerous times.",
      "level": 2
    },
    {
      "id": "155.4",
      "text": "This had never happened in math classes before.",
      "level": 2
    },
    {
      "id": "155.5",
      "text": "Wang Lisheng's math grades were already poor, and with him being absent-minded for the past two days, he couldn't answer a single question correctly.",
      "level": 2
    },
    {
      "id": "155.6",
      "text": "This made him a complete laughingstock.",
      "level": 2
    },
    {
      "id": "155.7",
      "text": "No matter how unmotivated he usually was, his self-esteem was truly hurt today.",
      "level": 2
    },
    {
      "id": "155.8",
      "text": "As soon as math class ended, he ran back to the dormitory.",
      "level": 2
    },
    {
      "id": "155.9",
      "text": "For the remaining three classes, he never showed his face.",
      "level": 2
    },
    {
      "id": "156",
      "text": "During the break, Zhou Feng went to see Wang Lisheng.",
      "level": 1
    },
    {
      "id": "156.1",
      "text": "Wang Lisheng was lying on the bed, staring blankly, saying nothing.",
      "level": 2
    },
    {
      "id": "156.2",
      "text": "No one knew what he was thinking.",
      "level": 2
    },
    {
      "id": "157",
      "text": "Today, Wang Ling was also somewhat distracted.",
      "level": 1
    },
    {
      "id": "157.1",
      "text": "Not only did she not get up for early self-study this morning, but she was also two minutes late for the first class.",
      "level": 2
    },
    {
      "id": "157.2",
      "text": "She didn't hear a word of what the teacher said.",
      "level": 2
    },
    {
      "id": "157.3",
      "text": "She was in a daze the entire morning.",
      "level": 2
    },
    {
      "id": "158",
      "text": "During the last geography class, she noticed Li Xia was gone.",
      "level": 1
    },
    {
      "id": "158.1",
      "text": "Wang Ling's first reaction was that Li Xia had skipped class to go to the internet cafe.",
      "level": 2
    },
    {
      "id": "159",
      "text": "Actually, this was not the first time Li Xia had skipped class.",
      "level": 1
    },
    {
      "id": "159.1",
      "text": "She always asked for leave, claiming to be unwell, during geography, history, and politics classes.",
      "level": 2
    },
    {
      "id": "159.2",
      "text": "Before, Wang Ling always believed Li Xia was really sick.",
      "level": 2
    },
    {
      "id": "159.3",
      "text": "She never imagined that a well-behaved student like Li Xia would also lie.",
      "level": 2
    },
    {
      "id": "159.4",
      "text": "But after last night, Wang Ling realized that every time Li Xia skipped class, it was to go online to see that so-called 'artist'.",
      "level": 2
    },
    {
      "id": "160",
      "text": "This made Wang Ling a little uneasy.",
      "level": 1
    },
    {
      "id": "160.1",
      "text": "She nudged Zhang Haiying next to her and whispered: 'Do you know where Li Xia went?'",
      "level": 2
    },
    {
      "id": "161",
      "text": "Zhang Haiying's condition doesn't look good.",
      "level": 1
    },
    {
      "id": "161.1",
      "text": "Although Wang Ling got up to close the window last night, Zhang Haiying still caught a cold.",
      "level": 2
    },
    {
      "id": "161.2",
      "text": "She sneezes repeatedly, her eyes and nose are red.",
      "level": 2
    },
    {
      "id": "161.3",
      "text": "She says in a stuffy voice: 'I think she went to see a doctor. She just borrowed 30 yuan from me, and I don't have much money left.'",
      "level": 2
    },
    {
      "id": "161.4",
      "text": "After speaking, she covers her mouth and sneezes again.",
      "level": 2
    },
    {
      "id": "162",
      "text": "'Borrowed money? She's been spending a lot of money these days. She said she bought things. Did you see her buy anything?'",
      "level": 1
    },
    {
      "id": "162.1",
      "text": "Wang Ling is always confused about where Li Xia's money goes.",
      "level": 2
    },
    {
      "id": "162.2",
      "text": "Even going online, it's impossible to spend hundreds of yuan in two days, and she hasn't seen Li Xia buy anything valuable recently.",
      "level": 2
    },
    {
      "id": "163",
      "text": "Zhang Haiying takes a tissue from her pocket, pinches her nose, and says vaguely: 'Didn't pay attention. Why care so much about other people? She's not a child.'",
      "level": 1
    },
    {
      "id": "164",
      "text": "'No, I'm just afraid she's spending money on the wrong things...'",
      "level": 1
    },
    {
      "id": "165",
      "text": "'You're just worrying unnecessarily.'",
      "level": 1
    },
    {
      "id": "165.1",
      "text": "Zhang Haiying interrupts her and continues: 'It's not your money she's spending, why are you so worried?",
      "level": 2
    },
    {
      "id": "165.2",
      "text": "Besides, her family is rich. I heard her mom lost 10,000 yuan in a night of mahjong without batting an eye.",
      "level": 2
    },
    {
      "id": "165.3",
      "text": "They only have this one precious daughter, they spoil her like anything. Why would they care about that little bit of money?",
      "level": 2
    },
    {
      "id": "165.4",
      "text": "Ah!'",
      "level": 2
    },
    {
      "id": "165.5",
      "text": "Zhang Haiying sneezes for a long time. The sneeze just won't come out.",
      "level": 2
    },
    {
      "id": "165.6",
      "text": "She wipes her nose with a tissue, feeling annoyed.",
      "level": 2
    },
    {
      "id": "165.7",
      "text": "'Colds are so annoying. This afternoon, there are history, politics, and research classes. I'm too lazy to go. I'll go home and rest for two days.'",
      "level": 2
    },
    {
      "id": "166",
      "text": "'Wang Ling!'",
      "level": 1
    },
    {
      "id": "167",
      "text": "Wang Ling reflexively stands up from her seat, looking at the geography teacher blankly.",
      "level": 1
    },
    {
      "id": "168",
      "text": "'You answer this question: Which part of the water cycle continuously replenishes the Earth's water bodies through water vapor transport?'",
      "level": 1
    },
    {
      "id": "169",
      "text": "'...'",
      "level": 1
    },
    {
      "id": "169.1",
      "text": "Wang Ling lowers her head, feeling dizzy.",
      "level": 2
    },
    {
      "id": "169.2",
      "text": "Before this, she hadn't been listening to the teacher at all.",
      "level": 2
    },
    {
      "id": "170",
      "text": "'Zhou Feng! You help her answer this question!'",
      "level": 1
    },
    {
      "id": "171",
      "text": "When Wang Ling hears the teacher call Zhou Feng's name, she inexplicably tenses up.",
      "level": 1
    },
    {
      "id": "171.1",
      "text": "She thinks, it's over, now Zhou Feng will also be embarrassed!",
      "level": 2
    },
    {
      "id": "172",
      "text": "Who would have thought that Zhou Feng would only pause for a moment before answering fluently:",
      "level": 1
    },
    {
      "id": "172.1",
      "text": "'Ocean water evaporates when heated, forming water vapor. The water vapor condenses into rain and is transported to the ground. The ground, through surface runoff, underground runoff, and other methods, converges into rivers and returns to the ocean, thus continuously replenishing the Earth's water bodies.'",
      "level": 2
    },
    {
      "id": "173",
      "text": "Wang Ling's face immediately turns red.",
      "level": 1
    },
    {
      "id": "174",
      "text": "'Very good. When you're in class, you should act like you're in class. Daydreaming, whispering to each other, thinking geography class is...'",
      "level": 1
    },
    {
      "id": "175",
      "text": "Wang Ling doesn't hear the rest of the geography teacher's words.",
      "level": 1
    },
    {
      "id": "175.1",
      "text": "She doesn't dare to lift her head, only wishing the ground would crack open and swallow her whole.",
      "level": 2
    },
    {
      "id": "176",
      "text": "As soon as the class bell rings, Wang Ling thinks of nothing else and heads directly to the Legend Internet Cafe.",
      "level": 1
    },
    {
      "id": "177",
      "text": "The air in the internet cafe is not good.",
      "level": 1
    },
    {
      "id": "177.1",
      "text": "Although the internet cafe is well-equipped and spacious, it is still smoky and chaotic.",
      "level": 2
    },
    {
      "id": "177.2",
      "text": "Wang Ling can't help but cover her mouth and cough gently.",
      "level": 2
    },
    {
      "id": "177.3",
      "text": "She scans the internet cafe and finds that more than half of the people online are students from their school.",
      "level": 2
    },
    {
      "id": "177.4",
      "text": "Some have cigarettes in their mouths, legs crossed, in all sorts of poses, no different from petty thugs.",
      "level": 2
    },
    {
      "id": "177.5",
      "text": "Wang Ling doesn't know what others think, but she feels it's an environment that can easily lead people astray.",
      "level": 2
    },
    {
      "id": "178",
      "text": "Wang Ling sees Li Xia sitting in an inconspicuous corner, a silly smile on her face.",
      "level": 1
    },
    {
      "id": "178.1",
      "text": "Wang Ling slowly walks over.",
      "level": 2
    },
    {
      "id": "178.2",
      "text": "She doesn't alert Li Xia, silently standing behind her and looking at the computer screen.",
      "level": 2
    },
    {
      "id": "179",
      "text": "Li Xia is completely focused on chatting.",
      "level": 1
    },
    {
      "id": "179.1",
      "text": "She doesn't notice or expect Wang Ling to be behind her at this moment.",
      "level": 2
    },
    {
      "id": "179.2",
      "text": "She is using a chat interface, so Wang Ling can clearly see a conversation that makes her disbelieve and completely shocked.",
      "level": 2
    },
    {
      "id": "180",
      "text": "Cold Coffee: Honey, do you want me to visit you?",
      "level": 1
    },
    {
      "id": "181",
      "text": "Cute Cat: I don't know, I'm so scared.",
      "level": 1
    },
    {
      "id": "182",
      "text": "Cold Coffee: What are you afraid of? Afraid I'm not the man you imagined? Yes! I'm not good, I have nothing. I'm destined to be a wanderer.",
      "level": 1
    },
    {
      "id": "182.1",
      "text": "Before I met you, I thought my heart had died. You revived me, you know?",
      "level": 2
    },
    {
      "id": "183",
      "text": "Cute Cat: Will you be good to me? Will you be good to me forever?",
      "level": 1
    },
    {
      "id": "184",
      "text": "Cold Coffee: To be honest, baby, I don't know what forever means. Right now, I can't give you anything.",
      "level": 1
    },
    {
      "id": "184.1",
      "text": "But I swear, I will be good to you, unless I'm not in this world anymore.",
      "level": 2
    },
    {
      "id": "185",
      "text": "Cute Cat: No, I believe you. I'm just afraid. Afraid that one day you'll suddenly disappear and I won't be able to find you anymore.",
      "level": 1
    },
    {
      "id": "186",
      "text": "Cold Coffee: Don't doubt me, okay? As long as I'm still breathing, as long as my heart is still beating, I will never leave you.",
      "level": 1
    },
    {
      "id": "187",
      "text": "The words on the screen gradually become distant and blurry.",
      "level": 1
    },
    {
      "id": "187.1",
      "text": "Wang Ling feels her head getting heavy and her feet unsteady, as if she's about to collapse.",
      "level": 2
    },
    {
      "id": "187.2",
      "text": "She can't believe that a sixteen-year-old girl would say these things to a man she's never met online.",
      "level": 2
    },
    {
      "id": "187.3",
      "text": "To Wang Ling, this is simply terrifying!",
      "level": 2
    },
    {
      "id": "188",
      "text": "Li Xia seems to sense something.",
      "level": 1
    },
    {
      "id": "188.1",
      "text": "She suddenly turns around and sees Wang Ling, her face pale, and is also stunned: 'Why are you here?'",
      "level": 2
    },
    {
      "id": "189",
      "text": "Wang Ling looks at Li Xia.",
      "level": 1
    },
    {
      "id": "189.1",
      "text": "Li Xia's face is streaked with tears.",
      "level": 2
    },
    {
      "id": "189.2",
      "text": "She is actually crying for that 'Cold Coffee'!",
      "level": 2
    },
    {
      "id": "189.3",
      "text": "Wang Ling is truly dizzy.",
      "level": 2
    },
    {
      "id": "189.4",
      "text": "She wanted to lose her temper and scold Li Xia properly, but she finds she has no strength at all.",
      "level": 2
    },
    {
      "id": "189.5",
      "text": "She says softly: 'School's out. I thought you were really sick.'",
      "level": 2
    },
    {
      "id": "190",
      "text": "'I...'",
      "level": 1
    },
    {
      "id": "190.1",
      "text": "Li Xia lowers her head and bites her lower lip.",
      "level": 2
    },
    {
      "id": "191",
      "text": "'It's good that you're okay. I'm leaving.'",
      "level": 1
    },
    {
      "id": "191.1",
      "text": "Wang Ling glances at the screen again.",
      "level": 2
    },
    {
      "id": "192",
      "text": "Cold Coffee: Why aren't you talking?",
      "level": 1
    },
    {
      "id": "193",
      "text": "Cold Coffee: Are you there? Baby? Speak.",
      "level": 1
    },
    {
      "id": "194",
      "text": "Wang Ling suddenly feels extremely uncomfortable.",
      "level": 1
    },
    {
      "id": "194.1",
      "text": "She doesn't want to say anything more.",
      "level": 2
    },
    {
      "id": "194.2",
      "text": "She turns and walks outside.",
      "level": 2
    },
    {
      "id": "194.3",
      "text": "Just as she reaches the door, she sees Zhou Feng and several classmates from their class entering the internet cafe.",
      "level": 2
    },
    {
      "id": "194.4",
      "text": "Suddenly, an inexplicable anger rushes to Wang Ling's head.",
      "level": 2
    },
    {
      "id": "194.5",
      "text": "She charges straight at Zhou Feng, deliberately bumping into him, and runs out of the internet cafe.",
      "level": 2
    },
    {
      "id": "195",
      "text": "Zhou Feng watches Wang Ling's retreating figure and mutters: 'Is she sick?'",
      "level": 1
    },
    {
      "id": "196",
      "text": "'Wait for me! Wang Ling!'",
      "level": 1
    },
    {
      "id": "196.1",
      "text": "Li Xia's fingers fly across the keyboard, then she quickly logs off, pays, and chases after her.",
      "level": 2
    },
    {
      "id": "197",
      "text": "Li Xia links arms with Wang Ling and they walk towards the school together.",
      "level": 1
    },
    {
      "id": "197.1",
      "text": "Neither of them speaks.",
      "level": 2
    },
    {
      "id": "197.2",
      "text": "Li Xia keeps stealing glances at Wang Ling.",
      "level": 2
    },
    {
      "id": "197.3",
      "text": "Wang Ling frowns slightly, her lips tightly closed.",
      "level": 2
    },
    {
      "id": "198",
      "text": "Li Xia finally can't help but say in a sweet voice: 'Wang Ling, good Wang Ling, don't be angry anymore. I won't skip class anymore.",
      "level": 1
    },
    {
      "id": "198.1",
      "text": "I just feel that attending those classes doesn't matter, so I went online.'",
      "level": 2
    },
    {
      "id": "199",
      "text": "Wang Ling originally didn't want to say anything more, but she can't help but say: 'I'm not angry. It doesn't matter to me if you skip every class.",
      "level": 1
    },
    {
      "id": "199.1",
      "text": "But, Li Xia, you've gone too far. Do you know that? How can he call you... It's too terrifying!",
      "level": 2
    },
    {
      "id": "199.2",
      "text": "I can't imagine what will happen if this continues. You're only 16!",
      "level": 2
    },
    {
      "id": "199.3",
      "text": "From this, you can see that he's irresponsible and not worth trusting!",
      "level": 2
    },
    {
      "id": "199.4",
      "text": "But I know that no matter what I say now, you won't listen.",
      "level": 2
    },
    {
      "id": "199.5",
      "text": "Just pretend I said nothing.'",
      "level": 2
    },
    {
      "id": "200",
      "text": "'It's not his fault. He... he doesn't even know I'm only 16.'",
      "level": 1
    },
    {
      "id": "201",
      "text": "'Then what did you tell him your age is?'",
      "level": 1
    },
    {
      "id": "202",
      "text": "Li Xia mumbles and stutters: '22.'",
      "level": 1
    },
    {
      "id": "203",
      "text": "'Heavens!'",
      "level": 1
    },
    {
      "id": "203.1",
      "text": "Wang Ling stops walking.",
      "level": 2
    },
    {
      "id": "204",
      "text": "'Then does he know you're a student?'",
      "level": 1
    },
    {
      "id": "205",
      "text": "Li Xia shakes her head: 'No. I didn't dare to tell him. He doesn't like little girls.'",
      "level": 1
    },
    {
      "id": "206",
      "text": "'Do you know what you're doing, Li Xia?'",
      "level": 1
    },
    {
      "id": "207",
      "text": "Li Xia nods, her innocent face full of happiness: 'I know. You saw it just now. He really likes me. He said he'll never leave me.'",
      "level": 1
    },
    {
      "id": "208",
      "text": "Wang Ling puts her arm around Li Xia's shoulder and continues walking: 'Do you know him?'",
      "level": 1
    },
    {
      "id": "209",
      "text": "'Mm, he told me everything about himself. He's never lied to me. He even posted his songs online. I listened to them. He's very talented, really.",
      "level": 1
    },
    {
      "id": "209.1",
      "text": "He's just having a hard time right now. His life isn't good. He rented a place in Beijing to write the music he likes, and sometimes he performs gigs.",
      "level": 2
    },
    {
      "id": "209.2",
      "text": "I know, many famous artists have difficult paths at the beginning.",
      "level": 2
    },
    {
      "id": "209.3",
      "text": "I believe he will succeed. I believe.'",
      "level": 2
    },
    {
      "id": "210",
      "text": "Wang Ling sighs.",
      "level": 1
    },
    {
      "id": "210.1",
      "text": "She suddenly realizes something and asks nervously: 'You gave him money?'",
      "level": 2
    },
    {
      "id": "211",
      "text": "Li Xia looks down at her shoes: 'No.'",
      "level": 1
    },
    {
      "id": "212",
      "text": "'No? Then where's your money?'",
      "level": 1
    },
    {
      "id": "213",
      "text": "'I said I bought something.'",
      "level": 1
    },
    {
      "id": "214",
      "text": "'Bought what?'",
      "level": 1
    },
    {
      "id": "214.1",
      "text": "Wang Ling presses.",
      "level": 2
    },
    {
      "id": "215",
      "text": "'Ah, stop asking. It's annoying. I already said it wasn't him asking me for money, and I know what I'm doing.'",
      "level": 1
    },
    {
      "id": "215.1",
      "text": "Li Xia breaks free from Wang Ling's hand and turns to leave.",
      "level": 2
    },
    {
      "id": "216",
      "text": "Wang Ling stops her: 'You're wrong. You have no idea what you're doing!",
      "level": 1
    },
    {
      "id": "216.1",
      "text": "If you really knew, you wouldn't skip class to go online, you wouldn't be so naive about online romance, and you wouldn't be foolish enough to give him money!'",
      "level": 2
    },
    {
      "id": "217",
      "text": "'You're so annoying!'",
      "level": 1
    },
    {
      "id": "217.1",
      "text": "Li Xia shoves Wang Ling away forcefully and shouts angrily: 'Whether I give him money or not is my business! Whether I'm in an online romance or not is my own business!",
      "level": 2
    },
    {
      "id": "217.2",
      "text": "Do you know how annoying you are? I don't want to talk to you anymore!'",
      "level": 2
    },
    {
      "id": "218",
      "text": "After speaking, Li Xia turns and runs away.",
      "level": 1
    },
    {
      "id": "219",
      "text": "Wang Ling stands there blankly.",
      "level": 1
    },
    {
      "id": "219.1",
      "text": "She asks herself, did she do something wrong?",
      "level": 2
    },
    {
      "id": "220",
      "text": "She remembers the deceased girl Li Xia told her about.",
      "level": 1
    },
    {
      "id": "220.1",
      "text": "She then thinks about the conversation she just saw between Li Xia and 'Cold Coffee' at the internet cafe.",
      "level": 2
    },
    {
      "id": "220.2",
      "text": "She quickly gives herself an answer: she didn't do anything wrong!",
      "level": 2
    },
    {
      "id": "220.3",
      "text": "Although she doesn't understand what kind of person 'Cold Coffee' is, she doesn't want Li Xia to follow in the footsteps of that deceased girl.",
      "level": 2
    },
    {
      "id": "220.4",
      "text": "Even if Li Xia hates her, she has to find a way to persuade her.",
      "level": 2
    },
    {
      "id": "221",
      "text": "Thinking of this, her mood suddenly lightens.",
      "level": 1
    },
    {
      "id": "221.1",
      "text": "She walks quickly towards the school.",
      "level": 2
    },
    {
      "id": "222",
      "text": "Wang Ling sees Li Xia standing blankly under the dormitory building at a glance.",
      "level": 1
    },
    {
      "id": "222.1",
      "text": "Li Xia looks a bit strange, her face pale, her gaze vacant.",
      "level": 2
    },
    {
      "id": "223",
      "text": "'What's wrong?'",
      "level": 1
    },
    {
      "id": "223.1",
      "text": "Wang Ling asks.",
      "level": 2
    },
    {
      "id": "224",
      "text": "Li Xia doesn't speak.",
      "level": 1
    },
    {
      "id": "224.1",
      "text": "Wang Ling follows Li Xia's gaze and sees the teacher's building.",
      "level": 2
    },
    {
      "id": "225",
      "text": "What did Li Xia see?",
      "level": 1
    },
    {
      "id": "226",
      "text": "Just as Wang Ling is about to ask again, Li Xia speaks again.",
      "level": 1
    },
    {
      "id": "226.1",
      "text": "Her voice is very light and empty, as if from distant floating clouds.",
      "level": 2
    },
    {
      "id": "226.2",
      "text": "She says: 'I saw Liu Sijia.'",
      "level": 2
    },
    {
      "id": "227",
      "text": "'Who is Liu Sijia?'",
      "level": 1
    },
    {
      "id": "227.1",
      "text": "Wang Ling asks curiously.",
      "level": 2
    },
    {
      "id": "228",
      "text": "'The girl who committed suicide.'",
      "level": 1
    },
    {
      "id": "229",
      "text": "'No way?'",
      "level": 1
    },
    {
      "id": "229.1",
      "text": "Wang Ling is startled.",
      "level": 2
    },
    {
      "id": "230",
      "text": "'Mm, she floated by and disappeared. She's been at the school. She hasn't left.'",
      "level": 1
    },
    {
      "id": "231",
      "text": "'Don't scare yourself. It's daytime. You must have seen it wrong.'",
      "level": 1
    },
    {
      "id": "232",
      "text": "'No! It's true!'",
      "level": 1
    },
    {
      "id": "232.1",
      "text": "Li Xia's tone is firm, making Wang Ling also start to believe.",
      "level": 2
    },
    {
      "id": "233",
      "text": "She suddenly remembers the cat's meow she heard last night.",
      "level": 1
    },
    {
      "id": "233.1",
      "text": "She turns to look at the locked dormitory, and a chill creeps up from the soles of her feet into her bones.",
      "level": 2
    },
    {
      "id": "233.2",
      "text": "She shivers violently.",
      "level": 2
    },
    {
      "id": "234",
      "text": "At the Legend Internet Cafe.",
      "level": 1
    },
    {
      "id": "235",
      "text": "Friday afternoons generally don't have important classes, so those who usually like to go online, except for those who go home early, basically all come to the internet cafe.",
      "level": 1
    },
    {
      "id": "236",
      "text": "Nothing was happening initially.",
      "level": 1
    },
    {
      "id": "236.1",
      "text": "Students were playing games or chatting, and no one was bothering anyone else.",
      "level": 2
    },
    {
      "id": "237",
      "text": "Wan Meng, also from Grade 1 (2), after being killed off the server in the game numerous times, finally can't take it anymore.",
      "level": 1
    },
    {
      "id": "237.1",
      "text": "He stands up and looks around the internet cafe.",
      "level": 2
    },
    {
      "id": "237.2",
      "text": "He finally finds his virtual opponent.",
      "level": 2
    },
    {
      "id": "237.3",
      "text": "Then he walks up to Gao Yang, leans into his ear and says: 'Gao Yang, someone is relentlessly killing me in the game.",
      "level": 2
    },
    {
      "id": "237.4",
      "text": "His equipment is too good, I can't beat him. Help me.'",
      "level": 2
    },
    {
      "id": "238",
      "text": "Gao Yang has a cigarette in his mouth, squints his eyes, and says: 'I don't play your game, how can I help?'",
      "level": 1
    },
    {
      "id": "239",
      "text": "'He's in the internet cafe, I just found him. He's in our class.'",
      "level": 1
    },
    {
      "id": "240",
      "text": "'Who?'",
      "level": 1
    },
    {
      "id": "241",
      "text": "'Ding Yongming.'",
      "level": 1
    },
    {
      "id": "242",
      "text": "Gao Yang casually says 'oh' and his fingers move rapidly and forcefully on the keyboard.",
      "level": 1
    },
    {
      "id": "243",
      "text": "'Gao Yang, help me. I'm so frustrated from being killed off so many times, I can't play anymore.'",
      "level": 1
    },
    {
      "id": "244",
      "text": "'If you can't play anymore, go tell the person who's killing you. Why tell me?'",
      "level": 1
    },
    {
      "id": "244.1",
      "text": "Gao Yang's eyes remain fixed on the screen, not looking at Wan Meng at all.",
      "level": 2
    },
    {
      "id": "245",
      "text": "'But... Zhou Feng is also there.'",
      "level": 1
    },
    {
      "id": "246",
      "text": "'Zhou Feng is there, so what?'",
      "level": 1
    },
    {
      "id": "246.1",
      "text": "As soon as Zhou Feng is mentioned, Gao Yang reveals his naturally violent temper: 'Scared of what!'",
      "level": 2
    },
    {
      "id": "247",
      "text": "If one were to talk about Gao Yang, he is an extremely troublesome student.",
      "level": 1
    },
    {
      "id": "247.1",
      "text": "Relying on his father being the Party Secretary of Liuqiao Town, he does everything except good deeds.",
      "level": 2
    },
    {
      "id": "247.2",
      "text": "Because of this, Gao Yang and Zhou Feng are at odds in school.",
      "level": 2
    },
    {
      "id": "247.3",
      "text": "They dislike each other and always want to beat each other up.",
      "level": 2
    },
    {
      "id": "247.4",
      "text": "Especially after entering high school, they were placed in the same class, harboring a silent war between them, just waiting for a fuse.",
      "level": 2
    },
    {
      "id": "248",
      "text": "Wan Meng walks behind Ding Yongming and pats him on the shoulder.",
      "level": 1
    },
    {
      "id": "248.1",
      "text": "Ding Yongming takes off his headset and glances at Wan Meng: 'What?'",
      "level": 2
    },
    {
      "id": "249",
      "text": "'You've been chasing and killing me in the game.'",
      "level": 1
    },
    {
      "id": "250",
      "text": "Ding Yongming looks at him disdainfully: 'So what? What's the point of playing if you don't kill people? You can kill me too!'",
      "level": 1
    },
    {
      "id": "251",
      "text": "Ding Yongming's tone completely dismisses Wan Meng.",
      "level": 1
    },
    {
      "id": "251.1",
      "text": "Although Wan Meng is usually a bit timid, he has fought a few battles with Gao Yang.",
      "level": 2
    },
    {
      "id": "251.2",
      "text": "Seeing Ding Yongming so arrogant now, he can't help but get angry.",
      "level": 2
    },
    {
      "id": "251.3",
      "text": "Just as he is about to erupt, he unexpectedly meets Zhou Feng's gaze.",
      "level": 2
    },
    {
      "id": "252",
      "text": "Zhou Feng doesn't need to speak, just looks at Wan Meng, and Wan Meng freezes, not daring to make a sound.",
      "level": 1
    },
    {
      "id": "253",
      "text": "Gao Yang, seeing this, can't stand it anymore.",
      "level": 1
    },
    {
      "id": "253.1",
      "text": "He stands up, pushes Wan Meng aside, grabs Ding Yongming's collar, and pokes Ding Yongming's forehead with his finger, saying word by word: 'Ding Yongming! Don't be arrogant! Games are fake, believe it or not, today I'll let you...'",
      "level": 2
    }
  ],
  "concepts": [
    {
      "name": "Ghosts",
      "frequency": 2,
      "context": "Introduced in the epigraph and alluded to in the supernatural events."
    },
    {
      "name": "Cat's blood",
      "frequency": 1,
      "context": "Mentioned in the epigraph as part of a disturbing story."
    },
    {
      "name": "Dogs",
      "frequency": 1,
      "context": "Mentioned in the epigraph as part of a disturbing story."
    },
    {
      "name": "Storytelling",
      "frequency": 2,
      "context": "The narrative structure itself and the framing of the story being told."
    },
    {
      "name": "Night",
      "frequency": 4,
      "context": "Sets the mood and time for significant events."
    },
    {
      "name": "Liuqiao Town",
      "frequency": 2,
      "context": "The primary setting for the events of the story."
    },
    {
      "name": "Middle school students",
      "frequency": 17,
      "context": "The main characters and their activities, including school and extracurriculars."
    },
    {
      "name": "Thunder and lightning",
      "frequency": 4,
      "context": "Adds to the atmospheric tension and foreshadows events."
    },
    {
      "name": "Wang Lisheng",
      "frequency": 18,
      "context": "The central character experiencing fear and supernatural events."
    },
    {
      "name": "Classroom",
      "frequency": 4,
      "context": "The setting for initial character interactions and Wang Lisheng's distress."
    },
    {
      "name": "Internet cafe",
      "frequency": 8,
      "context": "A key location where Wang Lisheng has a supernatural encounter and other students frequent."
    },
    {
      "name": "Zhou Feng",
      "frequency": 11,
      "context": "A friend of Wang Lisheng, characterized by his loyalty and aggressive nature."
    },
    {
      "name": "Li Xue",
      "frequency": 2,
      "context": "A beautiful cashier at the internet cafe who is the object of affection for some students."
    },
    {
      "name": "Brotherhood",
      "frequency": 1,
      "context": "Implied in the friendship between Zhou Feng and Wang Lisheng."
    },
    {
      "name": "Jiang Tao",
      "frequency": 1,
      "context": "Student council president and son of the principal, Li Xue's boyfriend."
    },
    {
      "name": "Class teacher",
      "frequency": 5,
      "context": "An authority figure who dislikes internet usage and is a source of student complaints."
    },
    {
      "name": "Online games",
      "frequency": 3,
      "context": "A common activity for students, contributing to their neglect of schoolwork."
    },
    {
      "name": "Parent-teacher meeting",
      "frequency": 1,
      "context": "A scheduled event that causes anxiety for students with poor grades."
    },
    {
      "name": "Trouble",
      "frequency": 2,
      "context": "A characteristic of some students, like Wang Lisheng and Zhou Feng."
    },
    {
      "name": "Fear",
      "frequency": 6,
      "context": "A dominant emotion experienced by Wang Lisheng and others due to supernatural events."
    },
    {
      "name": "Computer screen",
      "frequency": 4,
      "context": "The medium through which the supernatural message appears."
    },
    {
      "name": "Text messages",
      "frequency": 2,
      "context": "The form in which the supernatural message is conveyed."
    },
    {
      "name": "Supernatural events",
      "frequency": 6,
      "context": "The core of the plot, including apparitions and unsettling experiences."
    },
    {
      "name": "Internet addiction",
      "frequency": 4,
      "context": "A prevalent issue among students, with significant consequences."
    },
    {
      "name": "Dormitory",
      "frequency": 7,
      "context": "The living quarters for the students, where some unsettling events occur."
    },
    {
      "name": "Rain",
      "frequency": 4,
      "context": "Adds to the atmosphere and often accompanies significant plot points."
    },
    {
      "name": "Hu Ying",
      "frequency": 3,
      "context": "A classmate who is bullied by Zhou Feng."
    },
    {
      "name": "Bullying",
      "frequency": 3,
      "context": "An act of aggression displayed by Zhou Feng towards Hu Ying."
    },
    {
      "name": "Self-esteem",
      "frequency": 2,
      "context": "Affected by bullying and academic performance."
    },
    {
      "name": "Silence",
      "frequency": 2,
      "context": "Creates tension and highlights the characters' internal states."
    },
    {
      "name": "Whispers",
      "frequency": 2,
      "context": "Used for secretive communication, often related to fear or personal matters."
    },
    {
      "name": "Possession",
      "frequency": 1,
      "context": "A possible explanation for Wang Lisheng's behavior."
    },
    {
      "name": "Nightmare",
      "frequency": 1,
      "context": "Describes Wang Lisheng's persistent sense of dread."
    },
    {
      "name": "Recklessness",
      "frequency": 1,
      "context": "A characteristic of some students' behavior regarding internet usage."
    },
    {
      "name": "Surveillance systems",
      "frequency": 1,
      "context": "Mentioned as being installed in the internet cafe."
    },
    {
      "name": "Hallucinations",
      "frequency": 1,
      "context": "Wang Lisheng questions if his experiences are real."
    },
    {
      "name": "Coincidence",
      "frequency": 2,
      "context": "Wang Lisheng questions the likelihood of certain events happening together."
    },
    {
      "name": "Terrifying connection",
      "frequency": 1,
      "context": "The realization that seemingly unrelated events are linked."
    },
    {
      "name": "Humanity",
      "frequency": 1,
      "context": "Wang Lisheng questions if the figure he saw was human."
    },
    {
      "name": "Storm",
      "frequency": 2,
      "context": "Symbolic of turmoil and overwhelming circumstances."
    },
    {
      "name": "Ghostly silhouette",
      "frequency": 1,
      "context": "Describes a mysterious figure in the corridor."
    },
    {
      "name": "Eerie atmosphere",
      "frequency": 1,
      "context": "Created by the weather and mysterious events."
    },
    {
      "name": "Knocking",
      "frequency": 2,
      "context": "A sound that signals interaction or disturbance."
    },
    {
      "name": "Opening door",
      "frequency": 2,
      "context": "A common trope for revelation or entry."
    },
    {
      "name": "Wind",
      "frequency": 3,
      "context": "Contributes to the dramatic and unsettling atmosphere."
    },
    {
      "name": "Branches",
      "frequency": 1,
      "context": "Describe the sounds and visual imagery of the storm."
    },
    {
      "name": "Shadows",
      "frequency": 1,
      "context": "Contributes to the eerie imagery."
    },
    {
      "name": "Wang Ling",
      "frequency": 10,
      "context": "A student who becomes involved in the mystery surrounding Li Xia and the haunted dormitory."
    },
    {
      "name": "Zhang Haiying",
      "frequency": 3,
      "context": "Wang Ling's deskmate who is often ill."
    },
    {
      "name": "Cold",
      "frequency": 3,
      "context": "A physical sensation that intensifies with fear and supernatural occurrences."
    },
    {
      "name": "Illness",
      "frequency": 2,
      "context": "Used as an excuse for skipping class."
    },
    {
      "name": "Money",
      "frequency": 5,
      "context": "A recurring theme related to Li Xia's expenses and her family's wealth."
    },
    {
      "name": "Lying",
      "frequency": 2,
      "context": "Li Xia's behavior towards Wang Ling regarding her actions."
    },
    {
      "name": "Self-deprecation",
      "frequency": 1,
      "context": "Wang Ling's internal thoughts about her own looks."
    },
    {
      "name": "Unrequited love",
      "frequency": 1,
      "context": "Wang Ling's secret feelings for a boy."
    },
    {
      "name": "Charm",
      "frequency": 1,
      "context": "Describes the attractiveness of Wang Ling's crush."
    },
    {
      "name": "Embarrassment",
      "frequency": 1,
      "context": "Wang Ling's reaction to her internal thoughts being exposed."
    },
    {
      "name": "Tickling",
      "frequency": 1,
      "context": "A playful interaction between Wang Ling and Li Xia."
    },
    {
      "name": "Protests",
      "frequency": 1,
      "context": "From other students about the noise."
    },
    {
      "name": "Laughter",
      "frequency": 2,
      "context": "An expression of amusement and camaraderie."
    },
    {
      "name": "Restlessness",
      "frequency": 1,
      "context": "Li Xia's feeling of unease."
    },
    {
      "name": "Complaints",
      "frequency": 1,
      "context": "From other students about being disturbed."
    },
    {
      "name": "Age",
      "frequency": 3,
      "context": "A significant factor in the relationships and concerns within the story."
    },
    {
      "name": "Early romance",
      "frequency": 2,
      "context": "A topic of concern for Wang Ling regarding Li Xia."
    },
    {
      "name": "Disappointment",
      "frequency": 1,
      "context": "The potential consequence of Li Xia's actions."
    },
    {
      "name": "Hypocrisy",
      "frequency": 1,
      "context": "Wang Ling's internal reflection on her own advice."
    },
    {
      "name": "Online romance",
      "frequency": 5,
      "context": "The central issue for Li Xia, with dangerous implications."
    },
    {
      "name": "Artist",
      "frequency": 2,
      "context": "Li Xia's description of her online boyfriend."
    },
    {
      "name": "Video chat",
      "frequency": 2,
      "context": "How Li Xia interacts with her online boyfriend."
    },
    {
      "name": "Coolness",
      "frequency": 1,
      "context": "A trait Li Xia finds attractive in her online boyfriend."
    },
    {
      "name": "Melancholy",
      "frequency": 1,
      "context": "Another trait Li Xia finds attractive."
    },
    {
      "name": "Worship",
      "frequency": 1,
      "context": "Li Xia's strong admiration for her online boyfriend."
    },
    {
      "name": "Illusion",
      "frequency": 1,
      "context": "Wang Ling's perception of the internet."
    },
    {
      "name": "Trust",
      "frequency": 2,
      "context": "A key element in Li Xia's belief in her online boyfriend."
    },
    {
      "name": "Addiction",
      "frequency": 1,
      "context": "A warning given to Li Xia about her online activities."
    },
    {
      "name": "Harms of internet",
      "frequency": 1,
      "context": "A topic discussed by the class teacher."
    },
    {
      "name": "Game addicts",
      "frequency": 1,
      "context": "Students who neglect their studies due to online gaming."
    },
    {
      "name": "Uncleanliness",
      "frequency": 1,
      "context": "The rumored state of the locked dormitory."
    },
    {
      "name": "Haunted",
      "frequency": 1,
      "context": "The reputation of the locked dormitory."
    },
    {
      "name": "Death",
      "frequency": 2,
      "context": "The fate of the girl in the locked dormitory and her cat."
    },
    {
      "name": "School beauty",
      "frequency": 1,
      "context": "The description of the deceased girl."
    },
    {
      "name": "Married man",
      "frequency": 1,
      "context": "The person the deceased girl was in love with."
    },
    {
      "name": "Abuse",
      "frequency": 2,
      "context": "The physical and verbal abuse the deceased girl endured."
    },
    {
      "name": "Suicide",
      "frequency": 2,
      "context": "The tragic end of the deceased girl."
    },
    {
      "name": "Pesticide",
      "frequency": 1,
      "context": "The means of suicide used by the deceased girl."
    },
    {
      "name": "Cat",
      "frequency": 3,
      "context": "A significant symbol, its death mirroring the girl's fate."
    },
    {
      "name": "Gouged eyes",
      "frequency": 1,
      "context": "A gruesome detail of the cat's death."
    },
    {
      "name": "Rumors",
      "frequency": 2,
      "context": "The exaggerated stories that spread about the dormitory and the cat."
    },
    {
      "name": "Principal",
      "frequency": 2,
      "context": "The authority figure who locks the dormitory and warns students."
    },
    {
      "name": "Punishment",
      "frequency": 2,
      "context": "The consequences for breaking rules, including cleaning and expulsion."
    },
    {
      "name": "Transfer students",
      "frequency": 1,
      "context": "Mentioned as people not to tell the story to."
    },
    {
      "name": "Haunting",
      "frequency": 2,
      "context": "The supernatural occurrences at the school after the girl's death."
    },
    {
      "name": "Apparition",
      "frequency": 1,
      "context": "People seeing the deceased girl's shadow."
    },
    {
      "name": "Singing",
      "frequency": 1,
      "context": "Heard in the toilet, attributed to the deceased girl."
    },
    {
      "name": "Cat's meow",
      "frequency": 2,
      "context": "Heard in the middle of the night, adding to the fear."
    },
    {
      "name": "Dormitory story",
      "frequency": 1,
      "context": "The narrative Li Xia tells Wang Ling."
    },
    {
      "name": "Stiff limbs",
      "frequency": 1,
      "context": "Wang Ling's physical reaction to fear."
    },
    {
      "name": "Baby's cry",
      "frequency": 1,
      "context": "Wang Ling initially hears this, then corrects herself to a cat's cry."
    },
    {
      "name": "Under the bed",
      "frequency": 1,
      "context": "The perceived source of the unsettling sound."
    },
    {
      "name": "Damp atmosphere",
      "frequency": 1,
      "context": "The lingering feeling after the rain."
    },
    {
      "name": "Substitute teacher",
      "frequency": 1,
      "context": "Replaces the regular class teacher."
    },
    {
      "name": "Cheering",
      "frequency": 1,
      "context": "Students' reaction to the teacher's absence."
    },
    {
      "name": "Respect for profession",
      "frequency": 1,
      "context": "The only reason students might show respect for the teacher."
    },
    {
      "name": "Absent-mindedness",
      "frequency": 1,
      "context": "Wang Lisheng's state of mind affecting his performance."
    },
    {
      "name": "Laughingstock",
      "frequency": 1,
      "context": "Wang Lisheng's experience during math class."
    },
    {
      "name": "Dazed",
      "frequency": 1,
      "context": "Wang Ling's state of mind."
    },
    {
      "name": "Skipping class",
      "frequency": 3,
      "context": "Li Xia's behavior, initially believed to be illness, later revealed as internet visits."
    },
    {
      "name": "Lying",
      "frequency": 1,
      "context": "Li Xia's deceit about her reasons for skipping class."
    },
    {
      "name": "Unease",
      "frequency": 1,
      "context": "Wang Ling's feeling about Li Xia's actions."
    },
    {
      "name": "Nudged",
      "frequency": 1,
      "context": "Wang Ling's attempt to get Zhang Haiying's attention."
    },
    {
      "name": "Stuffy voice",
      "frequency": 1,
      "context": "Zhang Haiying's voice due to a cold."
    },
    {
      "name": "Confused about money",
      "frequency": 1,
      "context": "Wang Ling's concern about Li Xia's spending."
    },
    {
      "name": "Worrying unnecessarily",
      "frequency": 1,
      "context": "Zhang Haiying's dismissal of Wang Ling's concerns."
    },
    {
      "name": "Rich family",
      "frequency": 1,
      "context": "Description of Li Xia's family background."
    },
    {
      "name": "Spoiled",
      "frequency": 1,
      "context": "Li Xia's upbringing."
    },
    {
      "name": "Annoyance",
      "frequency": 1,
      "context": "Zhang Haiying's feeling about her cold."
    },
    {
      "name": "Reflexively stood up",
      "frequency": 1,
      "context": "Wang Ling's reaction to being called upon."
    },
    {
      "name": "Dizzy",
      "frequency": 1,
      "context": "Wang Ling's physical state during class."
    },
    {
      "name": "Tense",
      "frequency": 1,
      "context": "Wang Ling's reaction to Zhou Feng being called."
    },
    {
      "name": "Embarrassed",
      "frequency": 1,
      "context": "Wang Ling's fear for Zhou Feng."
    },
    {
      "name": "Fluent answer",
      "frequency": 1,
      "context": "Zhou Feng's response to the geography question."
    },
    {
      "name": "Water cycle",
      "frequency": 1,
      "context": "The subject of the geography question."
    },
    {
      "name": "Water vapor transport",
      "frequency": 1,
      "context": "A specific part of the water cycle."
    },
    {
      "name": "Ocean evaporation",
      "frequency": 1,
      "context": "A step in the water cycle."
    },
    {
      "name": "Condensation into rain",
      "frequency": 1,
      "context": "A step in the water cycle."
    },
    {
      "name": "Surface runoff",
      "frequency": 1,
      "context": "A way water returns to the ocean."
    },
    {
      "name": "Underground runoff",
      "frequency": 1,
      "context": "A way water returns to the ocean."
    },
    {
      "name": "Turning red",
      "frequency": 1,
      "context": "Wang Ling's reaction to being embarrassed."
    },
    {
      "name": "Daydreaming",
      "frequency": 1,
      "context": "Behavior criticized by the teacher."
    },
    {
      "name": "Whispering",
      "frequency": 1,
      "context": "Behavior criticized by the teacher."
    },
    {
      "name": "Class bell",
      "frequency": 1,
      "context": "Signaling the end of class."
    },
    {
      "name": "Smoky and chaotic",
      "frequency": 1,
      "context": "Description of the internet cafe's atmosphere."
    },
    {
      "name": "Coughing",
      "frequency": 1,
      "context": "Wang Ling's reaction to the air quality."
    },
    {
      "name": "Students online",
      "frequency": 1,
      "context": "The majority of people in the internet cafe."
    },
    {
      "name": "Thugs",
      "frequency": 1,
      "context": "Comparison of students' behavior in the internet cafe."
    },
    {
      "name": "Environment of corruption",
      "frequency": 1,
      "context": "Wang Ling's perception of the internet cafe."
    },
    {
      "name": "Silly smile",
      "frequency": 1,
      "context": "Li Xia's expression while chatting."
    },
    {
      "name": "Unnoticed",
      "frequency": 1,
      "context": "Wang Ling's approach to Li Xia."
    },
    {
      "name": "Chatting",
      "frequency": 3,
      "context": "Li Xia's activity on the computer."
    },
    {
      "name": "Shocking conversation",
      "frequency": 1,
      "context": "Wang Ling's reaction to the dialogue she witnesses."
    },
    {
      "name": "Honey",
      "frequency": 2,
      "context": "Term of endearment used in the online chat."
    },
    {
      "name": "Scared",
      "frequency": 2,
      "context": "Li Xia's expressed emotion."
    },
    {
      "name": "Wanderer",
      "frequency": 1,
      "context": "How the online boyfriend describes himself."
    },
    {
      "name": "Revived",
      "frequency": 1,
      "context": "The effect Li Xia has on her online boyfriend."
    },
    {
      "name": "Forever",
      "frequency": 1,
      "context": "Concept of everlasting commitment."
    },
    {
      "name": "Swear",
      "frequency": 1,
      "context": "The online boyfriend's promise."
    },
    {
      "name": "Doubt",
      "frequency": 1,
      "context": "Wang Ling's plea for Li Xia not to have."
    },
    {
      "name": "Breathing",
      "frequency": 1,
      "context": "A sign of life, linked to a promise."
    },
    {
      "name": "Heart beating",
      "frequency": 1,
      "context": "A sign of life, linked to a promise."
    },
    {
      "name": "Distant and blurry",
      "frequency": 1,
      "context": "Description of the screen text as Wang Ling becomes overwhelmed."
    },
    {
      "name": "Heavy head",
      "frequency": 1,
      "context": "A symptom of Wang Ling's distress."
    },
    {
      "name": "Unsteady feet",
      "frequency": 1,
      "context": "A symptom of Wang Ling's distress."
    },
    {
      "name": "Not imagined",
      "frequency": 1,
      "context": "Li Xia's fear about her online boyfriend."
    },
    {
      "name": "Sensed something",
      "frequency": 1,
      "context": "Li Xia's reaction to Wang Ling's presence."
    },
    {
      "name": "Pale face",
      "frequency": 1,
      "context": "Wang Ling's appearance."
    },
    {
      "name": "Tears",
      "frequency": 1,
      "context": "Li Xia's emotional state."
    },
    {
      "name": "Losing strength",
      "frequency": 1,
      "context": "Wang Ling's inability to confront Li Xia."
    },
    {
      "name": "Biting lip",
      "frequency": 1,
      "context": "Li Xia's sign of nervousness or distress."
    },
    {
      "name": "Anger",
      "frequency": 2,
      "context": "Wang Ling's sudden emotion towards Zhou Feng."
    },
    {
      "name": "Running out",
      "frequency": 2,
      "context": "Wang Ling's reaction."
    },
    {
      "name": "Muttering",
      "frequency": 1,
      "context": "Zhou Feng's comment about Wang Ling."
    },
    {
      "name": "Logging off",
      "frequency": 1,
      "context": "Li Xia's action after being seen."
    },
    {
      "name": "Paying",
      "frequency": 1,
      "context": "Li Xia's action after being seen."
    },
    {
      "name": "Chasing",
      "frequency": 1,
      "context": "Li Xia following Wang Ling."
    },
    {
      "name": "Linking arms",
      "frequency": 1,
      "context": "Wang Ling and Li Xia walking together."
    },
    {
      "name": "Silent walk",
      "frequency": 1,
      "context": "The atmosphere between Wang Ling and Li Xia."
    },
    {
      "name": "Frowning",
      "frequency": 1,
      "context": "Wang Ling's expression."
    },
    {
      "name": "Sweet voice",
      "frequency": 1,
      "context": "Li Xia's tone when apologizing."
    },
    {
      "name": "Apology",
      "frequency": 1,
      "context": "Li Xia's attempt to appease Wang Ling."
    },
    {
      "name": "Going too far",
      "frequency": 1,
      "context": "Wang Ling's assessment of Li Xia's actions."
    },
    {
      "name": "Irresponsible",
      "frequency": 1,
      "context": "Wang Ling's judgment of the online boyfriend."
    },
    {
      "name": "Pretending",
      "frequency": 1,
      "context": "Wang Ling's dismissal of her own advice."
    },
    {
      "name": "Not his fault",
      "frequency": 1,
      "context": "Li Xia's defense of her online boyfriend."
    },
    {
      "name": "Mumbling",
      "frequency": 1,
      "context": "Li Xia's hesitant speech."
    },
    {
      "name": "Stopping",
      "frequency": 1,
      "context": "Wang Ling's reaction to Li Xia's age revelation."
    },
    {
      "name": "Shaking head",
      "frequency": 1,
      "context": "Li Xia's response about the online boyfriend knowing she's a student."
    },
    {
      "name": "Not liking little girls",
      "frequency": 1,
      "context": "Reason Li Xia gave for not telling her age."
    },
    {
      "name": "Nodding",
      "frequency": 1,
      "context": "Li Xia's affirmation of her understanding."
    },
    {
      "name": "Pure face",
      "frequency": 1,
      "context": "Li Xia's innocent appearance."
    },
    {
      "name": "Happiness",
      "frequency": 1,
      "context": "Li Xia's emotional state."
    },
    {
      "name": "Putting arm around shoulder",
      "frequency": 1,
      "context": "Wang Ling's gesture towards Li Xia."
    },
    {
      "name": "Telling everything",
      "frequency": 1,
      "context": "What Li Xia claims her online boyfriend does."
    },
    {
      "name": "Posting songs online",
      "frequency": 1,
      "context": "An activity of Li Xia's online boyfriend."
    },
    {
      "name": "Talented",
      "frequency": 1,
      "context": "Wang Ling's opinion of the online boyfriend's music."
    },
    {
      "name": "Hard times",
      "frequency": 1,
      "context": "Li Xia's description of her online boyfriend's situation."
    },
    {
      "name": "Renting a place",
      "frequency": 1,
      "context": "The online boyfriend's living situation."
    },
    {
      "name": "Writing music",
      "frequency": 1,
      "context": "The online boyfriend's occupation."
    },
    {
      "name": "Performing gigs",
      "frequency": 1,
      "context": "The online boyfriend's activities."
    },
    {
      "name": "Difficult paths",
      "frequency": 1,
      "context": "The early struggles of successful artists."
    },
    {
      "name": "Success",
      "frequency": 1,
      "context": "Wang Ling's belief in the online boyfriend's future."
    },
    {
      "name": "Realizing something",
      "frequency": 1,
      "context": "Wang Ling's sudden insight."
    },
    {
      "name": "Giving money",
      "frequency": 2,
      "context": "The core of Wang Ling's concern about Li Xia's finances."
    },
    {
      "name": "Looking down at shoes",
      "frequency": 1,
      "context": "Li Xia's posture when avoiding a question."
    },
    {
      "id": "214.2",
      "text": "Wang Ling presses.",
      "level": 2
    },
    {
      "id": "215.2",
      "text": "Li Xia breaks free from Wang Ling's hand and turns to leave.",
      "level": 2
    },
    {
      "id": "216.2",
      "text": "If you really knew, you wouldn't skip class to go online, you wouldn't be so naive about online romance, and you wouldn't be foolish enough to give him money!'",
      "level": 2
    },
    {
      "id": "217.3",
      "text": "Do you know how annoying you are? I don't want to talk to you anymore!'",
      "level": 2
    },
    {
      "id": "218.1",
      "text": "After speaking, Li Xia turns and runs away.",
      "level": 2
    },
    {
      "id": "219.2",
      "text": "She asks herself, did she do something wrong?",
      "level": 2
    },
    {
      "id": "220.3",
      "text": "Even if Li Xia hates her, she has to find a way to persuade her.",
      "level": 2
    },
    {
      "id": "221.2",
      "text": "She walks quickly towards the school.",
      "level": 2
    },
    {
      "id": "222.2",
      "text": "Li Xia looks a bit strange, her face pale, her gaze vacant.",
      "level": 2
    },
    {
      "id": "224.2",
      "text": "Wang Ling follows Li Xia's gaze and sees the teacher's building.",
      "level": 2
    },
    {
      "id": "226.3",
      "text": "She says: 'I saw Liu Sijia.'",
      "level": 2
    },
    {
      "id": "227.2",
      "text": "Wang Ling asks curiously.",
      "level": 2
    },
    {
      "id": "230.2",
      "text": "She's been at the school. She hasn't left.'",
      "level": 2
    },
    {
      "id": "231.1",
      "text": "It's daytime. You must have seen it wrong.'",
      "level": 2
    },
    {
      "id": "232.2",
      "text": "Li Xia's tone is firm, making Wang Ling also start to believe.",
      "level": 2
    },
    {
      "id": "233.3",
      "text": "She shivers violently.",
      "level": 2
    },
    {
      "id": "237.4",
      "text": "'His equipment is too good, I can't beat him. Help me.'",
      "level": 2
    },
    {
      "id": "246.2",
      "text": "As soon as Zhou Feng is mentioned, Gao Yang reveals his naturally violent temper: 'Scared of what!'",
      "level": 2
    },
    {
      "id": "247.4",
      "text": "Especially after entering high school, they were placed in the same class, harboring a silent war between them, just waiting for a fuse.",
      "level": 2
    },
    {
      "id": "250.1",
      "text": "'So what? What's the point of playing if you don't kill people? You can kill me too!'",
      "level": 2
    },
    {
      "id": "251.3",
      "text": "Just as he is about to erupt, he unexpectedly meets Zhou Feng's gaze.",
      "level": 2
    },
    {
      "id": "253.1",
      "text": "He stands up, pushes Wan Meng aside, grabs Ding Yongming's collar, and pokes Ding Yongming's forehead with his finger, saying word by word: 'Ding Yongming! Don't be arrogant! Games are fake, believe it or not, today I'll let you...'",
      "level": 2
    },
    {
      "name": "Pushing",
      "frequency": 1,
      "context": "Gao Yang pushes Wan Meng aside."
    },
    {
      "name": "Grabbing collar",
      "frequency": 1,
      "context": "Gao Yang grabs Ding Yongming's collar."
    },
    {
      "name": "Poking forehead",
      "frequency": 1,
      "context": "Gao Yang pokes Ding Yongming's forehead."
    },
    {
      "name": "Arrogance",
      "frequency": 2,
      "context": "A characteristic of Ding Yongming and Gao Yang's perception of him."
    },
    {
      "name": "Fake",
      "frequency": 1,
      "context": "Gao Yang's description of games."
    },
    {
      "name": "Threat",
      "frequency": 1,
      "context": "Gao Yang's words to Ding Yongming."
    },
    {
      "name": "Power dynamics",
      "frequency": 2,
      "context": "Illustrated by the interactions between students, especially involving authority figures' children."
    },
    {
      "name": "Verbal abuse",
      "frequency": 1,
      "context": "The nature of the confrontation between Gao Yang and Ding Yongming."
    },
    {
      "name": "Interpersonal conflict",
      "frequency": 3,
      "context": "The underlying tensions and fights between students."
    },
    {
      "name": "Reckless personality",
      "frequency": 1,
      "context": "Describing Zhou Feng's character."
    },
    {
      "name": "Authority figures' children",
      "frequency": 2,
      "context": "Characters like Jiang Tao and Gao Yang, whose parents are influential."
    },
    {
      "name": "Silent war",
      "frequency": 1,
      "context": "The animosity between Zhou Feng and Gao Yang."
    },
    {
      "name": "Fuse",
      "frequency": 1,
      "context": "The trigger for the conflict between Zhou Feng and Gao Yang."
    },
    {
      "name": "Disdain",
      "frequency": 1,
      "context": "Ding Yongming's attitude towards Wan Meng."
    },
    {
      "name": "Dismissal",
      "frequency": 1,
      "context": "Ding Yongming's tone towards Wan Meng."
    },
    {
      "name": "Timid",
      "frequency": 1,
      "context": "Wan Meng's usual demeanor."
    },
    {
      "name": "Fighting",
      "frequency": 2,
      "context": "Activities involving Wan Meng and Gao Yang."
    },
    {
      "name": "Angry",
      "frequency": 2,
      "context": "Wan Meng's reaction to Ding Yongming's arrogance."
    },
    {
      "name": "Gaze",
      "frequency": 2,
      "context": "The communication between Zhou Feng and Wan Meng."
    },
    {
      "name": "Freezing",
      "frequency": 1,
      "context": "Wan Meng's reaction to Zhou Feng's look."
    },
    {
      "name": "Unable to make a sound",
      "frequency": 1,
      "context": "Wan Meng's reaction to Zhou Feng's look."
    },
    {
      "name": "Troublesome student",
      "frequency": 1,
      "context": "Description of Gao Yang."
    },
    {
      "name": "Party Secretary",
      "frequency": 1,
      "context": "Gao Yang's father's position."
    },
    {
      "name": "Good deeds",
      "frequency": 1,
      "context": "What Gao Yang avoids doing."
    },
    {
      "name": "At odds",
      "frequency": 1,
      "context": "Zhou Feng and Gao Yang's relationship."
    },
    {
      "name": "Dislike each other",
      "frequency": 1,
      "context": "Zhou Feng and Gao Yang's feelings towards each other."
    },
    {
      "name": "Beat each other up",
      "frequency": 1,
      "context": "Zhou Feng and Gao Yang's desire."
    },
    {
      "name": "High school",
      "frequency": 1,
      "context": "The setting for Zhou Feng and Gao Yang being in the same class."
    },
    {
      "name": "Unspoken war",
      "frequency": 1,
      "context": "The hidden conflict between Zhou Feng and Gao Yang."
    },
    {
      "name": "Waiting for a fuse",
      "frequency": 1,
      "context": "The state of the conflict between Zhou Feng and Gao Yang."
    },
    {
      "name": "Seeing this",
      "frequency": 1,
      "context": "Gao Yang's reaction to the interaction between Wan Meng and Ding Yongming."
    },
    {
      "name": "Can't stand it",
      "frequency": 1,
      "context": "Gao Yang's emotion."
    },
    {
      "name": "Pushing aside",
      "frequency": 1,
      "context": "Gao Yang's action towards Wan Meng."
    },
    {
      "name": "Grabbing collar",
      "frequency": 1,
      "context": "Gao Yang's action towards Ding Yongming."
    },
    {
      "name": "Poking forehead",
      "frequency": 1,
      "context": "Gao Yang's action towards Ding Yongming."
    },
    {
      "name": "Word by word",
      "frequency": 1,
      "context": "Gao Yang's manner of speaking."
    },
    {
      "name": "Games are fake",
      "frequency": 1,
      "context": "Gao Yang's statement about games."
    },
    {
      "name": "Believe it or not",
      "frequency": 1,
      "context": "Gao Yang's challenge to Ding Yongming."
    },
    {
      "name": "Today",
      "frequency": 1,
      "context": "Gao Yang's immediate threat."
    }
  ],
  "relations": [
    {
      "source": "Ghosts",
      "target": "Storytelling",
      "type": "is_part_of"
    },
    {
      "source": "Cat's blood",
      "target": "Ghosts",
      "type": "associated_with"
    },
    {
      "source": "Dogs",
      "target": "Ghosts",
      "type": "associated_with"
    },
    {
      "source": "Night",
      "target": "Fear",
      "type": "intensifies"
    },
    {
      "source": "Wang Lisheng",
      "target": "Fear",
      "type": "experiences"
    },
    {
      "source": "Wang Lisheng",
      "target": "Supernatural events",
      "type": "is_subject_of"
    },
    {
      "source": "Zhou Feng",
      "target": "Wang Lisheng",
      "type": "is_friend_of"
    },
    {
      "source": "Zhou Feng",
      "target": "Aggressive",
      "type": "is_characterized_by"
    },
    {
      "source": "Class teacher",
      "target": "Internet addiction",
      "type": "opposes"
    },
    {
      "source": "Class teacher",
      "target": "Liuqiao Town",
      "type": "is_in"
    },
    {
      "source": "Internet cafe",
      "target": "Students",
      "type": "is_frequented_by"
    },
    {
      "source": "Internet cafe",
      "target": "Supernatural events",
      "type": "is_location_of"
    },
    {
      "source": "Wang Lisheng",
      "target": "Internet cafe",
      "type": "is_at"
    },
    {
      "source": "Computer screen",
      "target": "Text messages",
      "type": "displays"
    },
    {
      "source": "Text messages",
      "target": "Supernatural events",
      "type": "conveys"
    },
    {
      "source": "Fear",
      "target": "Wang Lisheng",
      "type": "is_felt_by"
    },
    {
      "source": "Thunder and lightning",
      "target": "Atmosphere",
      "type": "contributes_to"
    },
    {
      "source": "Rain",
      "target": "Atmosphere",
      "type": "contributes_to"
    },
    {
      "source": "Storm",
      "target": "Turmoil",
      "type": "symbolizes"
    },
    {
      "source": "Wang Ling",
      "target": "Li Xia",
      "type": "is_concerned_about"
    },
    {
      "source": "Li Xia",
      "target": "Online romance",
      "type": "is_involved_in"
    },
    {
      "source": "Online romance",
      "target": "Dangerous implications",
      "type": "has"
    },
    {
      "source": "Deceased girl",
      "target": "Cat",
      "type": "had"
    },
    {
      "source": "Cat's death",
      "target": "Girl's fate",
      "type": "mirrors"
    },
    {
      "source": "Haunted dormitory",
      "target": "Rumors",
      "type": "is_subject_of"
    },
    {
      "source": "Power dynamics",
      "target": "Students",
      "type": "influences"
    },
    {
      "source": "Authority figures' children",
      "target": "Power dynamics",
      "type": "are_part_of"
    },
    {
      "source": "Zhou Feng",
      "target": "Gao Yang",
      "type": "has_conflict_with"
    },
    {
      "source": "Gao Yang",
      "target": "Troublesome student",
      "type": "is_a"
    },
    {
      "source": "Gao Yang",
      "target": "Verbal abuse",
      "type": "engages_in"
    },
    {
      "source": "Ding Yongming",
      "target": "Arrogance",
      "type": "displays"
    },
    {
      "source": "Games",
      "target": "Fake",
      "type": "is_perceived_as"
    },
    {
      "source": "Wang Lisheng",
      "target": "Computer screen",
      "type": "sees_message_on"
    },
    {
      "source": "Wang Lisheng",
      "target": "Toilet",
      "type": "goes_to"
    },
    {
      "source": "Wang Lisheng",
      "target": "Possession",
      "type": "is_suspected_of"
    },
    {
      "source": "Zhou Feng",
      "target": "Wang Lisheng",
      "type": "tries_to_help"
    },
    {
      "source": "Class teacher",
      "target": "Internet cafes",
      "type": "raids"
    },
    {
      "source": "Li Xia",
      "target": "Online boyfriend",
      "type": "is_infatuated_with"
    },
    {
      "source": "Wang Ling",
      "target": "Locked dormitory",
      "type": "is_afraid_of"
    },
    {
      "source": "Li Xia",
      "target": "Money",
      "type": "spends_heavily"
    },
    {
      "source": "Wang Ling",
      "target": "Lying",
      "type": "suspects"
    },
    {
      "source": "Wang Ling",
      "target": "Geography teacher",
      "type": "is_called_by"
    },
    {
      "source": "Zhou Feng",
      "target": "Geography question",
      "type": "answers"
    },
    {
      "source": "Wang Ling",
      "target": "Internet cafe",
      "type": "goes_to"
    },
    {
      "source": "Li Xia",
      "target": "Chatting",
      "type": "is_focused_on"
    },
    {
      "source": "Wang Ling",
      "target": "Chat conversation",
      "type": "overhears"
    },
    {
      "source": "Li Xia",
      "target": "Crying",
      "type": "is_doing"
    },
    {
      "source": "Wang Ling",
      "target": "Anger",
      "type": "feels"
    },
    {
      "source": "Li Xia",
      "target": "Online romance",
      "type": "defends"
    },
    {
      "source": "Wang Ling",
      "target": "Online romance",
      "type": "warns_against"
    },
    {
      "source": "Li Xia",
      "target": "Wang Ling",
      "type": "pushes_away"
    },
    {
      "source": "Wang Ling",
      "target": "Deceased girl's story",
      "type": "remembers"
    },
    {
      "id": "254",
      "source": "Gao Yang",
      "target": "Ding Yongming",
      "type": "threatens"
    }
  ],
  "hierarchy": {
    "main_topics": [
      "Supernatural fear and encounters",
      "Student life and social dynamics",
      "Online relationships and their dangers",
      "Mystery and local legends"
    ],
    "structure": "The document is structured chronologically, starting with an unsettling epigraph, then detailing events of one night and the following day. It unfolds through interconnected character perspectives, building suspense and revealing a growing sense of dread and mystery. The narrative progresses from an individual's fear (Wang Lisheng) to wider social concerns (internet addiction, relationships) and eventually to a legendary horror (the haunted dormitory)."
  }
}