{
  "propositions": [
    {
      "id": "1",
      "text": "The narrator receives a box with a small, intricately crafted bronze fish with snake-like eyebrows.",
      "level": 1
    },
    {
      "id": "1.1",
      "text": "The narrator is surprised by the ordinary appearance of the fish despite its fine craftsmanship.",
      "level": 2
    },
    {
      "id": "2",
      "text": "Third Uncle enters, revealing the bronze fish is a 'Snake Eyebrow Bronze Fish' and shows his own similar fish.",
      "level": 1
    },
    {
      "id": "2.1",
      "text": "Third Uncle's fish is also finely crafted but covered in white, chalky residue.",
      "level": 2
    },
    {
      "id": "2.2",
      "text": "The narrator explains that 'sea goods' (海货) are antiques salvaged from the sea, often covered in residue, reducing their value.",
      "level": 2
    },
    {
      "id": "3",
      "text": "Third Uncle recounts a past regret involving a sea expedition with his former lover, Wen Jin.",
      "level": 1
    },
    {
      "id": "3.1",
      "text": "Wen Jin was a skilled tomb raider who met Third Uncle in a tomb.",
      "level": 2
    },
    {
      "id": "3.2",
      "text": "They were known as the 'Divine Condor Couple' of the tomb raiding world.",
      "level": 2
    },
    {
      "id": "3.3",
      "text": "Wen Jin later disappeared.",
      "level": 2
    },
    {
      "id": "4",
      "text": "Third Uncle joined Wen Jin and her archaeology student classmates on a shipwreck archaeology expedition in Xisha.",
      "level": 1
    },
    {
      "id": "4.1",
      "text": "The expedition discovered a vast quantity of scattered porcelain shards on the seabed.",
      "level": 2
    },
    {
      "id": "4.2",
      "text": "Most of the porcelain was damaged or covered in marine organisms.",
      "level": 2
    },
    {
      "id": "5",
      "text": "An archaeology student went missing while out on a rubber boat.",
      "level": 1
    },
    {
      "id": "5.1",
      "text": "His body was found, with his hand clutching a Snake Eyebrow Bronze Fish.",
      "level": 2
    },
    {
      "id": "5.2",
      "text": "Third Uncle suspected the student had found something significant underwater.",
      "level": 2
    },
    {
      "id": "6",
      "text": "A search of the area revealed over forty identical, massive stone anchors.",
      "level": 1
    },
    {
      "id": "6.1",
      "text": "Third Uncle hypothesized the anchors belonged to an exceptionally large ship, suggesting a sunken shipwreck tomb.",
      "level": 2
    },
    {
      "id": "7",
      "text": "Wen Jin and Third Uncle had different motivations regarding the discovery.",
      "level": 1
    },
    {
      "id": "7.1",
      "text": "Wen Jin focused on the archaeological value.",
      "level": 2
    },
    {
      "id": "7.2",
      "text": "Third Uncle was concerned about the items being confiscated by the government.",
      "level": 2
    },
    {
      "id": "8",
      "text": "Third Uncle, drawing on his grandfather's notes, devised a plan to locate the tomb.",
      "level": 1
    },
    {
      "id": "8.1",
      "text": "He identified the probable burial point based on the anchor placements.",
      "level": 2
    },
    {
      "id": "9",
      "text": "They discovered a '土' (earth) shaped underground palace with multiple chambers.",
      "level": 1
    },
    {
      "id": "10",
      "text": "The team discussed how to enter the tomb, considering the risks of water infiltration.",
      "level": 1
    },
    {
      "id": "10.1",
      "text": "They decided to use explosives to create an entrance in the sand and then dig into the harder seafloor.",
      "level": 2
    },
    {
      "id": "11",
      "text": "After four days of digging, they reached a tomb wall.",
      "level": 1
    },
    {
      "id": "11.1",
      "text": "The outer wall was made of hollow bricks and had small holes, indicating it was designed to be filled with water.",
      "level": 2
    },
    {
      "id": "11.2",
      "text": "Third Uncle believed that in the water, traditional tomb mechanisms would be ineffective.",
      "level": 2
    },
    {
      "id": "12",
      "text": "They discovered a second, inner wall sealed with white clay, with a square entrance in the ceiling.",
      "level": 1
    },
    {
      "id": "12.1",
      "text": "This indicated a two-layered tomb wall with a water-filled space between them, designed to trap air in an inner chamber.",
      "level": 2
    },
    {
      "id": "13",
      "text": "A sudden storm approached, forcing them to seek shelter in the tomb.",
      "level": 1
    },
    {
      "id": "13.1",
      "text": "Third Uncle led the group into the tomb via the entrance.",
      "level": 2
    },
    {
      "id": "14",
      "text": "Inside the narrow, winding tomb passage, they encountered a mysterious ninth person.",
      "level": 1
    },
    {
      "id": "14.1",
      "text": "This 'ninth person' mimicked their movements and displayed a terrifying, scaled face.",
      "level": 2
    },
    {
      "id": "15",
      "text": "Lee Shati, startled by the entity, accidentally triggered a mechanism.",
      "level": 1
    },
    {
      "id": "15.1",
      "text": "The wall they were leaning on retracted, and they were pulled into a vortex.",
      "level": 2
    },
    {
      "id": "16",
      "text": "Third Uncle and the others emerged from the water into a chamber with a pleasant aroma.",
      "level": 1
    },
    {
      "id": "16.1",
      "text": "This chamber, likely an antechamber, contained porcelain grave goods and a circular fountain.",
      "level": 2
    },
    {
      "id": "16.2",
      "text": "The walls were covered with murals depicting pregnant-like figures.",
      "level": 2
    },
    {
      "id": "17",
      "text": "Lee Shati identified the tomb as a 'Sea Ghost Tomb' (海鬼墓).",
      "level": 2
    },
    {
      "id": "18",
      "text": "Third Uncle found a golden nanmu wood coffin in a different chamber, from which water continuously emerged.",
      "level": 1
    },
    {
      "id": "18.1",
      "text": "He fled the tomb through the fountain, emerging the next day.",
      "level": 2
    },
    {
      "id": "19",
      "text": "Third Uncle and the others were rescued, but the other ten people remained missing.",
      "level": 1
    },
    {
      "id": "19.1",
      "text": "Third Uncle believes the Snake Eyebrow Bronze Fish was key to his survival.",
      "level": 2
    },
    {
      "id": "20",
      "text": "A photograph reveals that a younger Third Uncle was with the missing group, and the 'Pockmarked Youth' (闷油瓶) was also present.",
      "level": 1
    },
    {
      "id": "20.1",
      "text": "The narrator is shocked by the Pockmarked Youth's lack of aging over twenty years.",
      "level": 2
    },
    {
      "id": "21",
      "text": "Third Uncle, realizing something, rushes off to Xisha again.",
      "level": 1
    },
    {
      "id": "22",
      "text": "The narrator faces financial difficulties after Third Uncle's departure.",
      "level": 1
    },
    {
      "id": "23",
      "text": "The narrator sells a 'golden nanmu wood coffin cover' (金缕玉棺套) for 1.2 million.",
      "level": 1
    },
    {
      "id": "23.1",
      "text": "He is given a bronze incense burner with carvings of figures resembling the tomb murals (called 'Forbidden Woman' or '禁婆') as a gift.",
      "level": 2
    },
    {
      "id": "24",
      "text": "Third Uncle is reported missing again after ten days of losing contact with his boat.",
      "level": 1
    }
  ],
  "concepts": [
    {
      "name": "盗墓笔记",
      "frequency": 1,
      "context": "Title of the document, a series about tomb raiding."
    },
    {
      "name": "怒海潜沙",
      "frequency": 1,
      "context": "Subtitle of the document, a specific story within the series."
    },
    {
      "name": "蛇眉铜鱼",
      "frequency": 5,
      "context": "A small, intricately crafted bronze fish with snake-like eyebrows, a significant artifact."
    },
    {
      "name": "三叔",
      "frequency": 17,
      "context": "Third Uncle, a key character and experienced tomb raider."
    },
    {
      "name": "海货",
      "frequency": 2,
      "context": "Antiques salvaged from the sea, often covered in residue."
    },
    {
      "name": "文锦",
      "frequency": 7,
      "context": "Third Uncle's former lover, a skilled tomb raider and member of an archaeology team."
    },
    {
      "name": "海斗",
      "frequency": 7,
      "context": "Tomb raiding in the sea or underwater."
    },
    {
      "name": "西沙",
      "frequency": 2,
      "context": "A location where a major sea tomb expedition took place."
    },
    {
      "name": "沉船葬海底墓",
      "frequency": 3,
      "context": "A type of tomb where a ship is used as the burial vessel and sunk underwater."
    },
    {
      "name": "石碇",
      "frequency": 2,
      "context": "Stone anchors, their discovery indicates a very large ship."
    },
    {
      "name": "考古",
      "frequency": 4,
      "context": "Archaeology, the study of human history and prehistory through excavation."
    },
    {
      "name": "海鬼",
      "frequency": 2,
      "context": "A supernatural entity associated with the sea and tombs, potentially a 'Sea Ghost'. "
    },
    {
      "name": "禁婆",
      "frequency": 2,
      "context": "A term referring to a 'bad thing' or 'evil spirit' associated with the sea, possibly a 'Forbidden Woman' or 'Sea Ghost'."
    },
    {
      "name": "金丝楠木棺",
      "frequency": 1,
      "context": "A coffin made of golden nanmu wood."
    },
    {
      "name": "骨香",
      "frequency": 1,
      "context": "Fragrance emanating from the 'Forbidden Woman's' bone, used for sleep."
    },
    {
      "name": "李四地",
      "frequency": 5,
      "context": "A male student, knowledgeable about water activities, who identifies the tomb as a 'Sea Ghost Tomb'."
    },
    {
      "name": "闷油瓶",
      "frequency": 5,
      "context": "The 'Pockmarked Youth', a mysterious character who appears to not age."
    },
    {
      "name": "合照",
      "frequency": 1,
      "context": "A group photograph from before the expedition."
    },
    {
      "name": "潘子",
      "frequency": 2,
      "context": "A character who is in a coma."
    },
    {
      "name": "玉棺套",
      "frequency": 1,
      "context": "A valuable item that the narrator sells."
    },
    {
      "name": "青铜香炉",
      "frequency": 1,
      "context": "A bronze incense burner, the 'Forbidden Woman's' bone is found inside."
    }
  ],
  "relations": [
    {
      "source": "蛇眉铜鱼",
      "target": "制作精细",
      "type": "attribute"
    },
    {
      "source": "蛇眉铜鱼",
      "target": "眉毛是蛇",
      "type": "attribute"
    },
    {
      "source": "三叔",
      "target": "倒斗",
      "type": "activity"
    },
    {
      "source": "海货",
      "target": "海里捞",
      "type": "origin"
    },
    {
      "source": "海货",
      "target": "白色灰状污垢",
      "type": "attribute"
    },
    {
      "source": "文锦",
      "target": "寻龙点穴",
      "type": "skill"
    },
    {
      "source": "文锦",
      "target": "探穴定位",
      "type": "skill"
    },
    {
      "source": "三叔",
      "target": "文锦",
      "type": "relationship (former lover)"
    },
    {
      "source": "沉船葬海底墓",
      "target": "沈万三的儿子",
      "type": "legendary association"
    },
    {
      "source": "石碇",
      "target": "四十多个",
      "type": "quantity"
    },
    {
      "source": "石碇",
      "target": "巨大",
      "type": "attribute"
    },
    {
      "source": "石碇",
      "target": "巨大的船",
      "type": "implication"
    },
    {
      "source": "海鬼",
      "target": "墓",
      "type": "association"
    },
    {
      "source": "禁婆",
      "target": "鬼",
      "type": "definition"
    },
    {
      "source": "禁婆",
      "target": "骨头",
      "type": "component"
    },
    {
      "source": "禁婆",
      "target": "骨香",
      "type": "attribute"
    },
    {
      "source": "闷油瓶",
      "target": "不老",
      "type": "attribute"
    },
    {
      "source": "蛇眉铜鱼",
      "target": "三叔",
      "type": "possession"
    },
    {
      "source": "玉棺套",
      "target": "卖",
      "type": "action"
    },
    {
      "source": "青铜香炉",
      "target": "禁婆的骨头",
      "type": "container"
    },
    {
      "source": "三叔",
      "target": "失踪",
      "type": "status"
    },
    {
      "source": "三叔",
      "target": "海斗",
      "type": "activity"
    },
    {
      "source": "文锦",
      "target": "失踪",
      "type": "status"
    },
    {
      "source": "李四地",
      "target": "海鬼墓",
      "type": "identification"
    }
  ],
  "hierarchy": {
    "main_topics": [
      "Introduction and Discovery of Snake Eyebrow Bronze Fish",
      "Third Uncle's Past Sea Expedition and the Sunken Ship Tomb",
      "Entering the Sunken Tomb and Facing a Storm",
      "Encountering Supernatural Elements and Escaping",
      "The Mystery of the Disappearances and the Pockmarked Youth",
      "Financial Struggles and a Lucrative Sale",
      "Third Uncle's Second Disappearance"
    ],
    "structure": "The document is structured chronologically, with Third Uncle recounting a past event which is interrupted by present-day events and discoveries, leading to a cyclical narrative of exploration and mystery."
  }
}