{
  "propositions": [
    {
      "id": "1",
      "text": "A young woman is observed walking down the street, unaware of being followed by two men and a middle-aged woman, and then a boy pointing at her.",
      "level": 1
    },
    {
      "id": "1.1",
      "text": "Hastings speculates about the situation, suggesting the woman might be a criminal or a victim.",
      "level": 2
    },
    {
      "id": "1.2",
      "text": "Poirot identifies the woman as the famous film star Mary Marvell, accompanied by admirers, and states she is aware of their presence.",
      "level": 2
    },
    {
      "id": "2",
      "text": "Poirot explains that he recognized Mary Marvell because he saw her film once, while Hastings, who had seen her films multiple times, did not recognize her.",
      "level": 1
    },
    {
      "id": "2.1",
      "text": "Hastings attributes his failure to recognize her to her different appearance compared to her film persona.",
      "level": 2
    },
    {
      "id": "2.2",
      "text": "Poirot uses the example of a dancer, Valeria St. Clair, to illustrate Hastings' focus on irrelevant details.",
      "level": 2
    },
    {
      "id": "3",
      "text": "Poirot deduces Mary Marvell is coming to his location because it houses a first-rate detective, not typical amenities for the wealthy.",
      "level": 1
    },
    {
      "id": "4",
      "text": "Mary Marvell arrives with her husband, Gregory Rolf, also a film star.",
      "level": 1
    },
    {
      "id": "4.1",
      "text": "They recently arrived in England after marrying in America.",
      "level": 2
    },
    {
      "id": "4.2",
      "text": "Mary Marvell is adorned with jewelry, notably a large diamond nicknamed 'The Star of the West,' insured for fifty thousand pounds.",
      "level": 2
    },
    {
      "id": "5",
      "text": "Mary Marvell seeks Poirot's help regarding threatening letters she has received concerning 'The Star of the West'.",
      "level": 1
    },
    {
      "id": "5.1",
      "text": "The first letter calls the diamond 'the left eye of God' and states it must be returned.",
      "level": 2
    },
    {
      "id": "5.2",
      "text": "The second letter is identical to the first.",
      "level": 2
    },
    {
      "id": "5.3",
      "text": "The third letter warns that the diamond will be taken and that on the full moon, both 'eyes of God' will be returned to God.",
      "level": 2
    },
    {
      "id": "5.4",
      "text": "Mary Marvell initially dismissed the first letter as a joke, became worried with the second, and is seriously concerned with the third.",
      "level": 2
    },
    {
      "id": "6",
      "text": "The letters were delivered by hand by a Chinese man, which frightens Mary Marvell because Gregory Rolf bought the gem from a Chinese man in San Francisco three years prior.",
      "level": 1
    },
    {
      "id": "6.1",
      "text": "The Chinese seller appeared terrified and eager to sell the gem for a fraction of its value.",
      "level": 2
    },
    {
      "id": "6.2",
      "text": "The gem was a wedding gift from Gregory to Mary.",
      "level": 2
    },
    {
      "id": "7",
      "text": "Poirot consults his almanac and determines the full moon is in three days.",
      "level": 1
    },
    {
      "id": "8",
      "text": "Poirot advises Mary Marvell to entrust the diamond to him for safekeeping until the full moon.",
      "level": 1
    },
    {
      "id": "9",
      "text": "Mary Marvell hesitates and reveals she wears the diamond.",
      "level": 1
    },
    {
      "id": "9.1",
      "text": "She produces the diamond, which Poirot examines and deems flawless.",
      "level": 2
    },
    {
      "id": "9.2",
      "text": "She states she is usually careful, keeping it in a jewel case at the hotel's safe, and brought it today only for Poirot to see.",
      "level": 2
    },
    {
      "id": "10",
      "text": "Mary Marvell plans to visit Lord and Lady Yardley at Yardley Manor on Friday, the day of the full moon.",
      "level": 1
    },
    {
      "id": "10.1",
      "text": "Hastings recalls rumors of Lord Yardley's indiscretions with actresses in America and a connection to Gregory Rolf's wife.",
      "level": 2
    },
    {
      "id": "11",
      "text": "Mary Marvell reveals they have a potential deal to film in Lord Yardley's ancestral castle.",
      "level": 1
    },
    {
      "id": "12",
      "text": "Hastings inquires if she won't wear the diamond to Yardley Manor, implying a potential issue.",
      "level": 1
    },
    {
      "id": "13",
      "text": "Mary Marvell, with a shrewd look, states she intends to wear it.",
      "level": 1
    },
    {
      "id": "14",
      "text": "Hastings mentions that Lord Yardley possesses famous jewelry, including a large diamond.",
      "level": 1
    },
    {
      "id": "15",
      "text": "Poirot suggests Mary Marvell and Lady Yardley are old acquaintances or that she and Lady Yardley are well acquainted.",
      "level": 1
    },
    {
      "id": "16",
      "text": "Mary Marvell confirms Gregory met Lady Yardley in America three years ago.",
      "level": 1
    },
    {
      "id": "17",
      "text": "Mary Marvell asks if they have seen 'Social Notes,' which featured an article about famous diamonds.",
      "level": 1
    },
    {
      "id": "18",
      "text": "Hastings retrieves the newspaper and Mary Marvell reads an article about the 'Star of the East,' an ancestral gem of the Yardley family, brought from India.",
      "level": 1
    },
    {
      "id": "18.1",
      "text": "The legend states the 'Star of the East' was the right eye of a temple idol, and a similar gem was its left eye.",
      "level": 2
    },
    {
      "id": "18.2",
      "text": "The legend predicts the gems will be returned to the idol when they reunite.",
      "level": 2
    },
    {
      "id": "18.3",
      "text": "The article notes a striking similarity to Mary Marvell's 'Star of the West,' suggesting a comparison would be interesting.",
      "level": 2
    },
    {
      "id": "19",
      "text": "Poirot questions Mary Marvell if she fears the implications of bringing the two gems together, given the legend and the Chinese connection.",
      "level": 1
    },
    {
      "id": "20",
      "text": "Mary Marvell states she doesn't believe Lady Yardley's gem is as good as hers and insists on taking it to Yardley Manor.",
      "level": 1
    },
    {
      "id": "21",
      "text": "Gregory Rolf arrives and expresses his belief that the situation is a prank.",
      "level": 1
    },
    {
      "id": "22",
      "text": "Poirot reiterates his advice to Mary Marvell not to wear the gem to Yardley Manor on Friday.",
      "level": 1
    },
    {
      "id": "23",
      "text": "Gregory agrees with Poirot but suggests Mary's desire to outdo another woman in terms of jewels is a factor.",
      "level": 1
    },
    {
      "id": "24",
      "text": "Poirot states he has given his advice and can do no more.",
      "level": 1
    },
    {
      "id": "25",
      "text": "Poirot observes that while Gregory is a good husband, his directness lacks strategy.",
      "level": 1
    },
    {
      "id": "26",
      "text": "Hastings shares his suspicions with Poirot, suggesting there's more behind the events.",
      "level": 1
    },
    {
      "id": "27",
      "text": "Poirot decides to go for a walk and asks Hastings to wait for his return.",
      "level": 1
    },
    {
      "id": "28",
      "text": "A lady arrives to see Poirot, and Hastings, recognizing her as Lady Yardley, invites her in.",
      "level": 1
    },
    {
      "id": "29",
      "text": "Hastings deduces Lady Yardley is there because she received blackmail letters about her gem.",
      "level": 1
    },
    {
      "id": "29.1",
      "text": "Lady Yardley confirms this, shocked that Hastings knows.",
      "level": 2
    },
    {
      "id": "29.2",
      "text": "Hastings explains his logical deduction based on Mary Marvell receiving similar letters.",
      "level": 2
    },
    {
      "id": "30",
      "text": "Lady Yardley confirms her letters were mailed, not delivered by hand, but had a peculiar scent reminiscent of incense, suggesting an Eastern origin.",
      "level": 1
    },
    {
      "id": "31",
      "text": "Lady Yardley regrettably admits to destroying the letters, initially dismissing them as a foolish prank.",
      "level": 1
    },
    {
      "id": "32",
      "text": "Hastings informs Poirot about Lady Yardley's visit and their conversation.",
      "level": 1
    },
    {
      "id": "33",
      "text": "Poirot is pleased with the development and checks the 'Peerage' for information on the Yardley family.",
      "level": 1
    },
    {
      "id": "34",
      "text": "Poirot decides to call Lord Yardley and arrange a meeting for the next morning.",
      "level": 1
    },
    {
      "id": "35",
      "text": "Poirot states he is intervening out of personal curiosity, not for Mary Marvell, as she disregarded his advice.",
      "level": 1
    },
    {
      "id": "36",
      "text": "Poirot believes he can protect Lord Yardley's ancestral jewel.",
      "level": 1
    },
    {
      "id": "37",
      "text": "Poirot instructs Hastings on proper book organization, drawing a parallel to establishing order in the investigation.",
      "level": 1
    },
    {
      "id": "38",
      "text": "Lord Yardley arrives, appearing athletic and good-natured.",
      "level": 1
    },
    {
      "id": "39",
      "text": "Lord Yardley confirms receiving strange letters and expresses confusion about their meaning.",
      "level": 1
    },
    {
      "id": "40",
      "text": "Poirot shows Lord Yardley the 'Social Notes' article.",
      "level": 1
    },
    {
      "id": "41",
      "text": "Lord Yardley angrily dismisses the article's claims about the 'Star of the East' having a legend and being from China, stating it came from India.",
      "level": 1
    },
    {
      "id": "42",
      "text": "Poirot requests Lord Yardley to entrust the matter entirely to him to prevent disaster.",
      "level": 1
    },
    {
      "id": "43",
      "text": "Lord Yardley agrees, but expresses concern that the 'nonsense stories' might come true.",
      "level": 1
    },
    {
      "id": "44",
      "text": "Poirot asks if the film deal at Yardley Manor with Rolf is finalized.",
      "level": 1
    },
    {
      "id": "45",
      "text": "Lord Yardley admits the deal is not settled and reveals he is heavily in debt and considering selling the 'Star of the East' to finance his recovery, despite his dislike for filming on his estate.",
      "level": 1
    },
    {
      "id": "46",
      "text": "Poirot correctly guesses Lord Yardley's intention to sell the gem.",
      "level": 1
    },
    {
      "id": "47",
      "text": "Lord Yardley confirms he is looking for a buyer through Hatton Garden's Hofberg.",
      "level": 1
    },
    {
      "id": "48",
      "text": "Poirot inquires if Lady Yardley approves of selling the gem.",
      "level": 1
    },
    {
      "id": "49",
      "text": "Lord Yardley states Lady Yardley strongly opposes selling the gem but fully supports the filming project.",
      "level": 1
    },
    {
      "id": "50",
      "text": "Poirot arranges for them to visit Yardley Manor that evening.",
      "level": 1
    },
    {
      "id": "51",
      "text": "Poirot asks Lord Yardley to allow him to keep his diamond for safekeeping.",
      "level": 1
    },
    {
      "id": "52",
      "text": "Poirot and Hastings arrive at Yardley Manor and are shown into the hall.",
      "level": 1
    },
    {
      "id": "53",
      "text": "They find Lady Yardley with her children and Lord Yardley present.",
      "level": 1
    },
    {
      "id": "54",
      "text": "Poirot explains his visit is regarding Mary Marvell's commission and asks Lady Yardley about the postmarks on her letters.",
      "level": 1
    },
    {
      "id": "55",
      "text": "Lady Yardley regrets not keeping the letters, having not taken them seriously.",
      "level": 1
    },
    {
      "id": "56",
      "text": "Lord Yardley offers them to stay the night, which Poirot accepts.",
      "level": 1
    },
    {
      "id": "57",
      "text": "Poirot plays with the children and then they go to change for dinner.",
      "level": 1
    },
    {
      "id": "58",
      "text": "A telegram from Hofberg arrives, informing Lord Yardley that a buyer for the diamond has been found (an American returning home) and will collect it that night.",
      "level": 1
    },
    {
      "id": "59",
      "text": "Lady Yardley expresses her hope that Lord Yardley doesn't sell the heirloom.",
      "level": 1
    },
    {
      "id": "60",
      "text": "Lady Yardley decides to wear the diamond necklace to dinner, remarking on its size and ugliness.",
      "level": 1
    },
    {
      "id": "61",
      "text": "As Lady Yardley reaches for the light switch, the lights go out, a door slams, and a woman screams.",
      "level": 1
    },
    {
      "id": "62",
      "text": "Lord Yardley recognizes the scream as his wife's and rushes to investigate.",
      "level": 1
    },
    {
      "id": "63",
      "text": "In the darkness, they find Lady Yardley on the floor with a red mark on her neck, indicating the necklace was snatched.",
      "level": 1
    },
    {
      "id": "64",
      "text": "Lady Yardley regains consciousness and murmurs 'Chinese man, side door'.",
      "level": 1
    },
    {
      "id": "65",
      "text": "Lord Yardley and Hastings rush to the side door and find the necklace, but the 'Star of the East' is missing.",
      "level": 1
    },
    {
      "id": "66",
      "text": "Hastings deduces the thieves were after the diamond.",
      "level": 1
    },
    {
      "id": "67",
      "text": "They discover the side door was unlocked and find a silk ribbon from a Chinese robe snagged on it.",
      "level": 1
    },
    {
      "id": "68",
      "text": "Their pursuit of the thief is unsuccessful.",
      "level": 1
    },
    {
      "id": "69",
      "text": "Lady Yardley recounts the incident, identifying the attacker as a Chinese man with a queue and embroidered robe.",
      "level": 1
    },
    {
      "id": "70",
      "text": "A man from Hofberg arrives, stating the buyer is arriving that night.",
      "level": 1
    },
    {
      "id": "71",
      "text": "Hastings suggests they return to London, feeling the case is not going well.",
      "level": 1
    },
    {
      "id": "72",
      "text": "Poirot acknowledges the setback but maintains his stance.",
      "level": 1
    },
    {
      "id": "73",
      "text": "Hastings emphasizes the immediate need to return to London to protect Mary Marvell's diamond.",
      "level": 1
    },
    {
      "id": "74",
      "text": "Poirot agrees with Hastings' realization that the thieves will now target the other diamond.",
      "level": 1
    },
    {
      "id": "75",
      "text": "Poirot notes that they still have time before the full moon on Friday.",
      "level": 1
    },
    {
      "id": "76",
      "text": "They leave a note for Lord Yardley and decide to inform Mary Marvell the next morning.",
      "level": 1
    },
    {
      "id": "77",
      "text": "The next morning, the newspaper reports on the Yardley Manor incident, and Poirot believes the Rolfs already know the situation.",
      "level": 1
    },
    {
      "id": "78",
      "text": "A phone call informs Poirot that Mary Marvell's diamond has been stolen.",
      "level": 1
    },
    {
      "id": "79",
      "text": "Hastings realizes the 'full moon' warning was a clever ruse to lower their guard, and Poirot admits his mistake.",
      "level": 1
    },
    {
      "id": "80",
      "text": "They go to the Hotel Majestic, where Gregory Rolf and police are present.",
      "level": 1
    },
    {
      "id": "81",
      "text": "Rolf expresses disbelief at the audacity of the thief.",
      "level": 1
    }
  ],
  "concepts": [
    {
      "name": "Poirot",
      "frequency": 30,
      "context": "The detective character who solves mysteries."
    },
    {
      "name": "Hastings",
      "frequency": 30,
      "context": "The narrator and companion to Poirot."
    },
    {
      "name": "Mary Marvell",
      "frequency": 15,
      "context": "A famous film star and owner of 'The Star of the West' diamond."
    },
    {
      "name": "Gregory Rolf",
      "frequency": 10,
      "context": "Mary Marvell's husband and also a film star."
    },
    {
      "name": "The Star of the West",
      "frequency": 15,
      "context": "A valuable diamond owned by Mary Marvell."
    },
    {
      "name": "The Star of the East",
      "frequency": 8,
      "context": "A valuable diamond owned by the Yardley family."
    },
    {
      "name": "Lord Yardley",
      "frequency": 12,
      "context": "Owner of 'The Star of the East' and the owner of Yardley Manor."
    },
    {
      "name": "Lady Yardley",
      "frequency": 10,
      "context": "Wife of Lord Yardley."
    },
    {
      "name": "Yardley Manor",
      "frequency": 8,
      "context": "The ancestral home of the Yardley family."
    },
    {
      "name": "Chinese man",
      "frequency": 8,
      "context": "A recurring figure associated with the theft of the diamonds."
    },
    {
      "name": "Threatening letters",
      "frequency": 7,
      "context": "Letters received by Mary Marvell and Lady Yardley related to the diamonds."
    },
    {
      "name": "Full moon",
      "frequency": 5,
      "context": "A date mentioned in the threatening letters, which serves as a crucial clue."
    },
    {
      "name": "Theft",
      "frequency": 6,
      "context": "The act of stealing the diamonds."
    },
    {
      "name": "Diamond",
      "frequency": 15,
      "context": "The central objects of value and conflict in the story."
    },
    {
      "name": "Legend",
      "frequency": 4,
      "context": "The mythical stories surrounding the diamonds."
    },
    {
      "name": "San Francisco",
      "frequency": 2,
      "context": "Location where Gregory Rolf acquired 'The Star of the West'."
    },
    {
      "name": "England",
      "frequency": 3,
      "context": "The primary setting for the story."
    },
    {
      "name": "America",
      "frequency": 3,
      "context": "Location of Mary Marvell's fame and Gregory Rolf's past."
    },
    {
      "name": "Hofberg",
      "frequency": 3,
      "context": "A contact helping Lord Yardley find a buyer for the diamond."
    },
    {
      "name": "Hotel Majestic",
      "frequency": 1,
      "context": "Location where Mary Marvell is staying."
    }
  ],
  "relations": [
    {
      "source": "Poirot",
      "target": "Hastings",
      "type": "companion_of"
    },
    {
      "source": "Mary Marvell",
      "target": "The Star of the West",
      "type": "owns"
    },
    {
      "source": "Lord Yardley",
      "target": "The Star of the East",
      "type": "owns"
    },
    {
      "source": "Mary Marvell",
      "target": "Gregory Rolf",
      "type": "is_married_to"
    },
    {
      "source": "Gregory Rolf",
      "target": "Mary Marvell",
      "type": "is_married_to"
    },
    {
      "source": "Lord Yardley",
      "target": "Lady Yardley",
      "type": "is_married_to"
    },
    {
      "source": "Lady Yardley",
      "target": "Lord Yardley",
      "type": "is_married_to"
    },
    {
      "source": "Yardley Manor",
      "target": "Lord Yardley",
      "type": "residence_of"
    },
    {
      "source": "Poirot",
      "target": "Mary Marvell",
      "type": "investigates_for"
    },
    {
      "source": "Poirot",
      "target": "Lord Yardley",
      "type": "investigates_for"
    },
    {
      "source": "Threatening letters",
      "target": "Mary Marvell",
      "type": "received_by"
    },
    {
      "source": "Threatening letters",
      "target": "Lady Yardley",
      "type": "received_by"
    },
    {
      "source": "The Star of the West",
      "target": "Threatening letters",
      "type": "subject_of"
    },
    {
      "source": "The Star of the East",
      "target": "Threatening letters",
      "type": "subject_of"
    },
    {
      "source": "Full moon",
      "target": "Threatening letters",
      "type": "mentioned_in"
    },
    {
      "source": "Chinese man",
      "target": "Threatening letters",
      "type": "associated_with_delivery_of"
    },
    {
      "source": "Chinese man",
      "target": "Theft",
      "type": "perpetrator_of"
    },
    {
      "source": "Theft",
      "target": "The Star of the West",
      "type": "involves"
    },
    {
      "source": "Theft",
      "target": "The Star of the East",
      "type": "involves"
    },
    {
      "source": "Gregory Rolf",
      "target": "San Francisco",
      "type": "bought_gem_in"
    },
    {
      "source": "The Star of the West",
      "target": "San Francisco",
      "type": "bought_in"
    },
    {
      "source": "Mary Marvell",
      "target": "England",
      "type": "travelled_to"
    },
    {
      "source": "Gregory Rolf",
      "target": "England",
      "type": "travelled_to"
    },
    {
      "source": "Poirot",
      "target": "England",
      "type": "resides_in"
    },
    {
      "source": "Hastings",
      "target": "England",
      "type": "resides_in"
    },
    {
      "source": "The Star of the East",
      "target": "India",
      "type": "origin_of"
    },
    {
      "source": "Mary Marvell",
      "target": "Yardley Manor",
      "type": "plans_to_visit"
    },
    {
      "source": "Lady Yardley",
      "target": "Yardley Manor",
      "type": "resides_in"
    },
    {
      "source": "Gregory Rolf",
      "target": "Lady Yardley",
      "type": "met_in"
    },
    {
      "source": "America",
      "target": "Lady Yardley",
      "type": "met_in"
    },
    {
      "source": "Hofberg",
      "target": "Lord Yardley",
      "type": "assists_with_sale_for"
    },
    {
      "source": "Lord Yardley",
      "target": "The Star of the East",
      "type": "plans_to_sell"
    },
    {
      "source": "Lady Yardley",
      "target": "The Star of the East",
      "type": "opposes_sale_of"
    },
    {
      "source": "Poirot",
      "target": "Yardley Manor",
      "type": "visits"
    },
    {
      "source": "Hastings",
      "target": "Yardley Manor",
      "type": "visits"
    },
    {
      "source": "Theft",
      "target": "Lady Yardley",
      "type": "victim_of"
    },
    {
      "source": "Theft",
      "target": "The Star of the East",
      "type": "successful_in"
    },
    {
      "source": "Theft",
      "target": "The Star of the West",
      "type": "successful_in"
    },
    {
      "source": "Poirot",
      "target": "Mary Marvell",
      "type": "inform_about_theft_of"
    },
    {
      "source": "Poirot",
      "target": "Gregory Rolf",
      "type": "meets_at"
    },
    {
      "source": "Hotel Majestic",
      "target": "Mary Marvell",
      "type": "staying_at"
    },
    {
      "source": "The Star of the East",
      "target": "Legend",
      "type": "subject_of"
    },
    {
      "source": "The Star of the West",
      "target": "Legend",
      "type": "subject_of"
    },
    {
      "source": "Chinese man",
      "target": "Legend",
      "type": "associated_with"
    },
    {
      "source": "Full moon",
      "target": "Deception",
      "type": "used_for"
    },
    {
      "source": "Poirot",
      "target": "Error",
      "type": "made"
    },
    {
      "source": "Hastings",
      "target": "Deduction",
      "type": "made"
    }
  ],
  "hierarchy": {
    "main_topics": [
      "Introduction of Characters and Setting",
      "The Case of the Stolen Diamonds",
      "Investigation and Deductions",
      "Confrontation and Resolution (partial)"
    ],
    "structure": "The document is structured as a narrative, likely from a novel or short story, detailing an investigation by Hercule Poirot and Captain Hastings. It begins with an observational scene, introduces the main characters and the central mystery involving valuable diamonds, and progresses through Poirot's methodical investigation, including interviews and deductions, culminating in a series of thefts and attempted resolutions."
  }
}