{
  "propositions": [
    {
      "id": "1",
      "text": "The story begins with a description of celestial anomalies in August 1985, coinciding with the birth of a boy in a northern Chinese village.",
      "level": 1
    },
    {
      "id": "1.1",
      "text": "The anomalies included a 'guest star' entering the Big Dipper, a meteor shower, the Yellow River overflowing, and an earthquake.",
      "level": 2
    },
    {
      "id": "1.2",
      "text": "The newborn boy was the first male child in the Liu family, symbolizing the continuation of the lineage.",
      "level": 2
    },
    {
      "id": "2",
      "text": "A Taoist priest is invited to read the baby's fortune.",
      "level": 1
    },
    {
      "id": "2.1",
      "text": "The priest is struck by the baby's unusual aura.",
      "level": 2
    },
    {
      "id": "2.2",
      "text": "The baby's father, worried due to the earlier death of his daughter, asks about potential issues.",
      "level": 2
    },
    {
      "id": "2.3",
      "text": "A terrifying scream emanates from the room where the baby is.",
      "level": 2
    },
    {
      "id": "2.4",
      "text": "The priest and father rush in, but the baby appears normal.",
      "level": 2
    },
    {
      "id": "2.5",
      "text": "After examining the baby's features and birth date, the priest leaves abruptly.",
      "level": 2
    },
    {
      "id": "3",
      "text": "Eighteen years later, a purple meteor streaks across the sky.",
      "level": 1
    },
    {
      "id": "3.1",
      "text": "An old Taoist priest is observing the sky on Kunlun Mountain.",
      "level": 2
    },
    {
      "id": "3.2",
      "text": "A powerful figure named Xiao Chongtian appears and questions the priest.",
      "level": 2
    },
    {
      "id": "3.3",
      "text": "The priest confirms he already knew the outcome eighteen years ago.",
      "level": 2
    },
    {
      "id": "3.4",
      "text": "The priest mentions that a star is missing from the sky and that a great opportunity has arrived.",
      "level": 2
    },
    {
      "id": "3.5",
      "text": "The priest instructs Xiao Chongtian to implant the 'Great Light Sword' into the boy, despite Xiao Chongtian's objections.",
      "level": 2
    },
    {
      "id": "3.6",
      "text": "The priest emphasizes the urgency and the need to protect the child at all costs.",
      "level": 2
    },
    {
      "id": "3.7",
      "text": "The old priest's head is severed from his body, and he dies with a strange smile.",
      "level": 2
    },
    {
      "id": "4",
      "text": "Liu Junlin wakes up from a nightmare about being chased by ghosts, relieved to have escaped with the help of a winged tiger.",
      "level": 1
    },
    {
      "id": "4.1",
      "text": "He is annoyed with his roommate, Xue Zhenghu, for switching beds.",
      "level": 2
    },
    {
      "id": "4.2",
      "text": "Xue Zhenghu is described as a jovial but eccentric person who dabbles in mystical things.",
      "level": 2
    },
    {
      "id": "4.3",
      "text": "Liu Junlin discovers Xue Zhenghu is unnaturally cold and stiff.",
      "level": 2
    },
    {
      "id": "4.4",
      "text": "Black blood seeps from Xue Zhenghu's eyes, nose, and ears.",
      "level": 2
    },
    {
      "id": "4.5",
      "text": "Xue Zhenghu suddenly sits up and confronts Liu Junlin, who falls off the bed.",
      "level": 2
    },
    {
      "id": "4.6",
      "text": "Xue Zhenghu, seemingly unaffected by the blood, blames heatstroke and goes to the school infirmary.",
      "level": 2
    },
    {
      "id": "5",
      "text": "Liu Junlin walks to class and is approached by a girl asking for his phone number, a common occurrence due to his resemblance to a celebrity.",
      "level": 1
    },
    {
      "id": "5.1",
      "text": "He encounters his friend Xu Guangda, who laments his own lack of popularity.",
      "level": 2
    },
    {
      "id": "5.2",
      "text": "A commotion draws their attention to Building 7, where a crowd has gathered, and police cars and an ambulance are present.",
      "level": 2
    },
    {
      "id": "5.3",
      "text": "A student informs them that someone has jumped from the 29th floor.",
      "level": 2
    },
    {
      "id": "5.4",
      "text": "The body is described as being unrecognizable.",
      "level": 2
    },
    {
      "id": "5.5",
      "text": "Xu Guangda shares a rumor that the deceased was from the journalism department and that the 7th building is the only one over five stories high.",
      "level": 2
    },
    {
      "id": "5.6",
      "text": "Liu Junlin is unsettled by these events.",
      "level": 2
    },
    {
      "id": "5.7",
      "text": "They see Xue Zhenghu performing a ritual by a bloodstain, drawing symbols with prayer beads and chanting.",
      "level": 2
    },
    {
      "id": "5.8",
      "text": "Xue Zhenghu claims the place is filled with 'evil energy' and that the student was killed by a vengeful spirit on the 29th floor.",
      "level": 2
    },
    {
      "id": "5.9",
      "text": "Tang Chunming dismisses Xue Zhenghu's claims and invites Liu Junlin to investigate the 29th floor via a secret passage.",
      "level": 2
    },
    {
      "id": "5.10",
      "text": "Liu Junlin declines Tang Chunming's invitation, feeling uneasy.",
      "level": 2
    },
    {
      "id": "6",
      "text": "Liu Junlin has another nightmare, this time involving his deceased grandmother and a crying child.",
      "level": 1
    },
    {
      "id": "6.1",
      "text": "He is awakened by his phone, receiving a text from Su Que asking to study together.",
      "level": 2
    },
    {
      "id": "6.2",
      "text": "He politely declines the invitation, mentioning he has a girlfriend.",
      "level": 2
    },
    {
      "id": "6.3",
      "text": "Liu Junlin meets his girlfriend, He Xiaoyi, who has short hair.",
      "level": 2
    },
    {
      "id": "6.4",
      "text": "He Xiaoyi explains that all the girls in their department have cut their hair due to a campus legend about strange deaths.",
      "level": 2
    },
    {
      "id": "6.5",
      "text": "She recounts a terrifying legend about six female students who were found with their tongues cut out and hanged by their hair.",
      "level": 2
    },
    {
      "id": "6.6",
      "text": "Liu Junlin tries to change the subject and they go on a date.",
      "level": 2
    },
    {
      "id": "7",
      "text": "They encounter a beggar on their way back to school who offers a story for ten yuan.",
      "level": 1
    },
    {
      "id": "7.1",
      "text": "The beggar, who sounds like a girl, tells a story about A University's history and a place called 'Baby Ditch'.",
      "level": 2
    },
    {
      "id": "7.2",
      "text": "The legend states that during the Qing Dynasty, discarded female infants were thrown into this ditch. Later, the school was built there.",
      "level": 2
    },
    {
      "id": "7.3",
      "text": "A mysterious path allegedly appears at midnight, and those who walk it are found dead with their organs removed and stomachs filled with hair.",
      "level": 2
    },
    {
      "id": "7.4",
      "text": "Liu Junlin interrupts the story, pointing out a flaw in the logic about hair on infants.",
      "level": 2
    },
    {
      "id": "7.5",
      "text": "The beggar collapses, revealing it was a prank with a bamboo pole and a radio.",
      "level": 2
    },
    {
      "id": "7.6",
      "text": "He Xiaoyi is visibly shaken and mentions she has to go to the archives to help organize documents.",
      "level": 2
    },
    {
      "id": "7.7",
      "text": "Liu Junlin asks her to investigate the school's early history, which she finds unusual.",
      "level": 2
    },
    {
      "id": "7.8",
      "text": "Su Que appears and expresses playful jealousy about Liu Junlin being with another girl.",
      "level": 2
    },
    {
      "id": "7.9",
      "text": "Su Que mentions she was going to tell him about the student who jumped but decides not to, seeing his apparent lack of concern.",
      "level": 2
    },
    {
      "id": "7.10",
      "text": "Liu Junlin, feeling a sense of impending doom, agrees to have dinner with Su Que.",
      "level": 2
    },
    {
      "id": "8",
      "text": "During dinner, Tang Chunming joins Liu Junlin and Su Que.",
      "level": 1
    },
    {
      "id": "8.1",
      "text": "Tang Chunming reveals he obtained classified police files with the help of his uncle.",
      "level": 2
    },
    {
      "id": "8.2",
      "text": "The files detail the autopsy report of the student who jumped, confirming the absence of internal organs and the presence of hair in the stomach.",
      "level": 2
    },
    {
      "id": "8.3",
      "text": "Liu Junlin is disturbed by the recurring theme of hair, connecting it to the beggar's story.",
      "level": 2
    },
    {
      "id": "8.4",
      "text": "Su Que explains that her grandmother, a former student leader, knows about a school legend called 'Baby Death Ditch'.",
      "level": 2
    },
    {
      "id": "8.5",
      "text": "The legend recounts how the school was built on a burial ground, and in the first year of construction, workers died mysteriously, with their organs removed and stomachs filled with hair.",
      "level": 2
    },
    {
      "id": "8.6",
      "text": "A 30-story building, Building 7, was later constructed on the 'Baby Ditch' site to suppress the vengeful spirits.",
      "level": 2
    },
    {
      "id": "8.7",
      "text": "For twenty years, there were no incidents. Then, students began dying on the 29th floor of Building 7 with the same gruesome injuries. This pattern continued every five years until it stopped.",
      "level": 2
    },
    {
      "id": "8.8",
      "text": "The recent suicide is the first death in twenty years.",
      "level": 2
    },
    {
      "id": "8.9",
      "text": "Tang Chunming believes it's a murder, not a suicide, and that someone is trying to replicate the old legend.",
      "level": 2
    },
    {
      "id": "9",
      "text": "Liu Junlin and Su Que leave the restaurant, and Liu Junlin encounters He Xiaoyi, who is visibly angry and throws a package at him before running off.",
      "level": 1
    },
    {
      "id": "9.1",
      "text": "Su Que finds the situation amusing and also departs.",
      "level": 2
    },
    {
      "id": "9.2",
      "text": "Back in the dorm, during a 'lying down chat' session, Huang Xu poses a riddle about a man who commits suicide after hearing a fisherman's comment.",
      "level": 2
    },
    {
      "id": "9.3",
      "text": "Liu Junlin, connecting the riddle to the recurring theme of hair, correctly guesses the answer: hair.",
      "level": 2
    },
    {
      "id": "9.4",
      "text": "He is deeply disturbed by this realization.",
      "level": 2
    },
    {
      "id": "10",
      "text": "Liu Junlin remembers the package He Xiaoyi threw at him, which contains old 'Top Secret' files.",
      "level": 1
    },
    {
      "id": "10.1",
      "text": "One file details the 'Ancient Tomb Blood Robe' incident that occurred before Building 7 was built.",
      "level": 2
    },
    {
      "id": "10.2",
      "text": "During construction on the southwest corner, dozens of workers disappeared.",
      "level": 2
    },
    {
      "id": "10.3",
      "text": "Their bodies were found sitting on large plates, having died at the same time with different fatal injuries but no signs of struggle.",
      "level": 2
    },
    {
      "id": "10.4",
      "text": "Rumors spoke of people in blood-red clothing sitting in a circle and blowing into the necks of those in front of them.",
      "level": 2
    },
    {
      "id": "10.5",
      "text": "Liu Junlin feels compelled to visit the former construction site, now a forbidden area.",
      "level": 2
    },
    {
      "id": "10.6",
      "text": "In the overgrown area, the surroundings suddenly darken, and he finds himself surrounded by dozens of identical, tall grave mounds that weren't there before.",
      "level": 2
    },
    {
      "id": "10.7",
      "text": "He trips and finds a red robe, seemingly the 'Ancient Tomb Blood Robe' from the legend.",
      "level": 2
    },
    {
      "id": "10.8",
      "text": "A hand touches his neck from behind.",
      "level": 2
    }
  ],
  "concepts": [
    {
      "name": "《青丝道》",
      "frequency": 1,
      "context": "The title of the story."
    },
    {
      "name": "Celestial Anomalies",
      "frequency": 1,
      "context": "In August 1985, celestial anomalies such as a guest star, meteor shower, and earthquake preceded the birth of the protagonist."
    },
    {
      "name": "Birth of a Male Heir",
      "frequency": 1,
      "context": "The protagonist's birth as the first male heir in the Liu family is significant for lineage continuation."
    },
    {
      "name": "Taoist Priest",
      "frequency": 3,
      "context": "A Taoist priest is involved in predicting the protagonist's future and seems to have foreknowledge of events. He appears both in the prologue and later observing the sky."
    },
    {
      "name": "Prophecy/Fortune Telling",
      "frequency": 2,
      "context": "The Taoist priest attempts to read the baby's fortune and later observes celestial signs."
    },
    {
      "name": "Supernatural Events",
      "frequency": 5,
      "context": "The narrative is filled with supernatural events, including celestial anomalies, strange deaths, ghostly encounters, and mystical rituals."
    },
    {
      "name": "Liu Junlin",
      "frequency": 16,
      "context": "The protagonist of the story, who experiences nightmares and becomes entangled in mysterious events."
    },
    {
      "name": "Xue Zhenghu",
      "frequency": 6,
      "context": "Liu Junlin's roommate, who exhibits eccentric behavior and is involved in a strange incident of bleeding from orifices."
    },
    {
      "name": "Mysterious Deaths",
      "frequency": 7,
      "context": "Several mysterious deaths occur throughout the story, including a student jumping from a building and the ancient tomb incident."
    },
    {
      "name": "Campus Legend",
      "frequency": 3,
      "context": "The story features campus legends, such as the 'Baby Ditch' and the 'Ancient Tomb Blood Robe', which seem to be coming true."
    },
    {
      "name": "Building 7",
      "frequency": 4,
      "context": "A prominent 30-story building on campus where mysterious deaths have occurred on the 29th floor."
    },
    {
      "name": "Hair",
      "frequency": 7,
      "context": "Hair is a recurring motif associated with the mysterious deaths, appearing in nightmares, legends, and autopsy reports."
    },
    {
      "name": "He Xiaoyi",
      "frequency": 7,
      "context": "Liu Junlin's girlfriend, who has recently cut her hair due to campus legends and becomes distressed by the events."
    },
    {
      "name": "Su Que",
      "frequency": 8,
      "context": "A lively female character who seems to know more about the unfolding events and initiates contact with Liu Junlin."
    },
    {
      "name": "Tang Chunming",
      "frequency": 5,
      "context": "A friend of Liu Junlin who acts as a budding detective, investigating the mysterious deaths with help from his police uncle."
    },
    {
      "name": "Archives",
      "frequency": 2,
      "context": "The university archives are a source of information about the school's past and the mysterious incidents."
    },
    {
      "name": "Ancient Tomb",
      "frequency": 2,
      "context": "An incident involving an ancient tomb and murdered workers, described in the archives."
    },
    {
      "name": "Blood Robe",
      "frequency": 2,
      "context": "The 'Ancient Tomb Blood Robe' is a significant artifact mentioned in the archives and possibly encountered by Liu Junlin."
    },
    {
      "name": "Conspiracy",
      "frequency": 2,
      "context": "Liu Junlin begins to feel that he is caught in a larger conspiracy."
    },
    {
      "name": "Investigation",
      "frequency": 3,
      "context": "Tang Chunming and Liu Junlin are actively investigating the mysterious events."
    },
    {
      "name": "Nightmares",
      "frequency": 3,
      "context": "Liu Junlin experiences vivid and disturbing nightmares that seem to foreshadow events."
    },
    {
      "name": "Kunlun Mountain",
      "frequency": 1,
      "context": "The location where the old Taoist priest observes the sky eighteen years after the protagonist's birth."
    },
    {
      "name": "Xiao Chongtian",
      "frequency": 2,
      "context": "A powerful figure who appears on Kunlun Mountain and interacts with the old Taoist priest."
    },
    {
      "name": "Great Light Sword",
      "frequency": 1,
      "context": "A mystical sword that the old Taoist priest instructs to be implanted into the protagonist."
    },
    {
      "name": "Baby Ditch",
      "frequency": 3,
      "context": "A historical location on campus associated with infanticide and vengeful spirits, forming a central part of a campus legend."
    },
    {
      "name": "Vengeful Spirits",
      "frequency": 2,
      "context": "The legends suggest that vengeful spirits inhabit certain areas of the campus, linked to past tragedies."
    },
    {
      "name": "Riddle",
      "frequency": 1,
      "context": "A riddle posed in the dorm room that Liu Junlin solves, further connecting him to the theme of hair."
    }
  ],
  "relations": [
    {
      "source": "Celestial Anomalies",
      "target": "Birth of a Male Heir",
      "type": "precedes"
    },
    {
      "source": "Birth of a Male Heir",
      "target": "Taoist Priest",
      "type": "related_to"
    },
    {
      "source": "Taoist Priest",
      "target": "Prophecy/Fortune Telling",
      "type": "performs"
    },
    {
      "source": "Prophecy/Fortune Telling",
      "target": "Supernatural Events",
      "type": "involves"
    },
    {
      "source": "Supernatural Events",
      "target": "Liu Junlin",
      "type": "affects"
    },
    {
      "source": "Liu Junlin",
      "target": "Nightmares",
      "type": "experiences"
    },
    {
      "source": "Liu Junlin",
      "target": "Xue Zhenghu",
      "type": "roommate_of"
    },
    {
      "source": "Xue Zhenghu",
      "target": "Mysterious Deaths",
      "type": "involved_in"
    },
    {
      "source": "Mysterious Deaths",
      "target": "Campus Legend",
      "type": "related_to"
    },
    {
      "source": "Campus Legend",
      "target": "Building 7",
      "type": "features"
    },
    {
      "source": "Building 7",
      "target": "Hair",
      "type": "associated_with"
    },
    {
      "source": "Hair",
      "target": "Mysterious Deaths",
      "type": "motif_in"
    },
    {
      "source": "Liu Junlin",
      "target": "He Xiaoyi",
      "type": "boyfriend_of"
    },
    {
      "source": "He Xiaoyi",
      "target": "Hair",
      "type": "cuts"
    },
    {
      "source": "He Xiaoyi",
      "target": "Su Que",
      "type": "acquaintance_of"
    },
    {
      "source": "Liu Junlin",
      "target": "Su Que",
      "type": "acquaintance_of"
    },
    {
      "source": "Su Que",
      "target": "Archives",
      "type": "utilizes"
    },
    {
      "source": "Archives",
      "target": "Campus Legend",
      "type": "contains_information_about"
    },
    {
      "source": "Archives",
      "target": "Ancient Tomb",
      "type": "details"
    },
    {
      "source": "Ancient Tomb",
      "target": "Blood Robe",
      "type": "involves"
    },
    {
      "source": "Liu Junlin",
      "target": "Conspiracy",
      "type": "suspects"
    },
    {
      "source": "Liu Junlin",
      "target": "Investigation",
      "type": "participates_in"
    },
    {
      "source": "Tang Chunming",
      "target": "Investigation",
      "type": "leads"
    },
    {
      "source": "Tang Chunming",
      "target": "Archives",
      "type": "obtains_files_from"
    },
    {
      "source": "Tang Chunming",
      "target": "Baby Ditch",
      "type": "researches"
    },
    {
      "source": "Baby Ditch",
      "target": "Vengeful Spirits",
      "type": "haunted_by"
    },
    {
      "source": "Vengeful Spirits",
      "target": "Mysterious Deaths",
      "type": "cause_of"
    },
    {
      "source": "Liu Junlin",
      "target": "Riddle",
      "type": "solves"
    },
    {
      "source": "Riddle",
      "target": "Hair",
      "type": "solution_involves"
    },
    {
      "source": "Kunlun Mountain",
      "target": "Taoist Priest",
      "type": "location_of"
    },
    {
      "source": "Taoist Priest",
      "target": "Xiao Chongtian",
      "type": "interacts_with"
    },
    {
      "source": "Xiao Chongtian",
      "target": "Great Light Sword",
      "type": "instructed_to_use"
    },
    {
      "source": "Great Light Sword",
      "target": "Liu Junlin",
      "type": "to_be_implanted_in"
    },
    {
      "source": "Liu Junlin",
      "target": "Ancient Tomb",
      "type": "visits"
    },
    {
      "source": "Ancient Tomb",
      "target": "Blood Robe",
      "type": "found_at"
    },
    {
      "source": "Blood Robe",
      "target": "Mysterious Deaths",
      "type": "associated_with"
    }
  ],
  "hierarchy": {
    "main_topics": [
      "Prologue: The Birth and Foreboding",
      "Eighteen Years Later: The Celestial Watcher",
      "Chapter 1: The Dorm Incident and the Jump",
      "Chapter 2: Nightmares and Campus Legends",
      "Chapter 3: The Truth of 'Baby Ditch'",
      "Chapter 4: Echoes of the Ancient Tomb"
    ],
    "structure": "The document is structured with a prologue setting up the mystical origins of the protagonist and a future prophecy, followed by numbered chapters that delve into unfolding mysteries on the university campus. Each chapter introduces new elements and characters that contribute to the overarching narrative of supernatural events and historical secrets."
  }
}