{
  "propositions": [
    {
      "id": "1",
      "text": "The narrator, Feng Yixi, is a 29-year-old Guangzhou native, working in Beijing, who experiences a series of terrifying and unimaginable events starting in 2004.",
      "level": 1
    },
    {
      "id": "1.1",
      "text": "His name, Feng Yixi, is considered strange by the narrator, as \"Yixi\" sounds like \"Yi Ming Gui Xi\" (to die).",
      "level": 2
    },
    {
      "id": "1.2",
      "text": "His father explained that his maternal uncle, a writer, gave him the name.",
      "level": 2
    },
    {
      "id": "1.3",
      "text": "The narrator had a successful career, reaching the position of department manager in a foreign company, and was in a good relationship with his girlfriend, Han Wenna.",
      "level": 2
    },
    {
      "id": "1.4",
      "text": "In early 2004, during a business trip to Hangzhou, the narrator visited Lingyin Temple.",
      "level": 2
    },
    {
      "id": "1.5",
      "text": "He encountered a fortune teller outside the temple and, despite not being superstitious, was intrigued by the practice.",
      "level": 2
    },
    {
      "id": "1.6",
      "text": "The fortune teller predicted great misfortune for the narrator based on the character '一' (one) that he wrote.",
      "level": 3
    },
    {
      "id": "1.7",
      "text": "The fortune teller advised caution, good deeds, and going with the flow to overcome potential hardship.",
      "level": 3
    },
    {
      "id": "1.8",
      "text": "Returning to Beijing, the narrator became addicted to gambling on football matches, losing heavily and accumulating a debt of over 400,000 yuan.",
      "level": 2
    },
    {
      "id": "1.9",
      "text": "He lost all his savings, including money intended for his wedding and from his parents, leaving him with only a little over 1,000 yuan.",
      "level": 3
    },
    {
      "id": "1.10",
      "text": "Devastated and ashamed, he broke up with Han Wenna via text message and fled to Tianjin.",
      "level": 2
    },
    {
      "id": "1.11",
      "text": "In Tianjin, he sought refuge with his close friend Chai Yong, nicknamed 'Fei Lao' (Fatty), who works at a bank.",
      "level": 2
    },
    {
      "id": "1.12",
      "text": "Fei Lao, despite his own wife being away, offered the narrator a place to stay and financial assistance.",
      "level": 3
    },
    {
      "id": "1.13",
      "text": "The narrator found a cheap rental apartment in Tianjin, which was advertised as a 'fierce house' (凶宅) where someone had died.",
      "level": 2
    },
    {
      "id": "1.14",
      "text": "Despite the ominous description, the narrator, driven by financial necessity and a sense of defiance, decided to rent it.",
      "level": 3
    },
    {
      "id": "1.15",
      "text": "Upon entering the apartment, the narrator experienced a chilling sensation.",
      "level": 3
    },
    {
      "id": "1.16",
      "text": "Fei Lao helped the narrator move in and clean the apartment.",
      "level": 2
    },
    {
      "id": "1.17",
      "text": "While cleaning, they discovered a black and white photograph nailed to the inside of a cabinet with six long, rusty coffin nails, driven through the eyes, ears, nose, and mouth.",
      "level": 3
    },
    {
      "id": "1.18",
      "text": "They identified the photograph as a 'will portrait' (遗像) and, out of respect, burned it.",
      "level": 4
    },
    {
      "id": "1.19",
      "text": "The narrator had a disturbing experience where he felt drawn into the eyes of the woman in the photograph as it burned.",
      "level": 4
    },
    {
      "id": "1.20",
      "text": "Later that evening, while drinking with Fei Lao, the narrator heard a woman's voice whispering about death.",
      "level": 2
    },
    {
      "id": "1.21",
      "text": "He dismissed it as the effects of alcohol, but the voice persisted in his mind even after he returned to his room.",
      "level": 3
    },
    {
      "id": "1.22",
      "text": "The narrator had a terrifying encounter with a 'hooking ghost' (勾死鬼) dressed in yellow, who attempted to strangle him.",
      "level": 2
    },
    {
      "id": "1.23",
      "text": "He believes a sandalwood necklace, a gift from Han Wenna, protected him from the ghost.",
      "level": 3
    },
    {
      "id": "1.24",
      "text": "The narrator decides to stay in the apartment despite its unsettling nature, attributing his previous experiences to stress or hallucination.",
      "level": 2
    },
    {
      "id": "1.25",
      "text": "He learns about his neighbors, including a young woman named Liu Fengcai, a university student.",
      "level": 2
    },
    {
      "id": "1.26",
      "text": "The narrator tells a frightening ghost story to his neighbors Yang Bin and Yang Qin, which scares them.",
      "level": 2
    },
    {
      "id": "1.27",
      "text": "Fei Lao informs the narrator about a job opportunity and provides him with a new phone card.",
      "level": 2
    },
    {
      "id": "1.28",
      "text": "Upon returning to his apartment late at night, the narrator sees Liu Fengcai squatting in the yard, which he initially misinterprets.",
      "level": 2
    },
    {
      "id": "1.29",
      "text": "The next morning, the neighborhood is in an uproar because Liu Fengcai has gone missing.",
      "level": 2
    },
    {
      "id": "1.30",
      "text": "The narrator had seen Liu Fengcai in the yard the previous night but doesn't immediately report it, fearing he was mistaken or that it's irrelevant.",
      "level": 3
    },
    {
      "id": "1.31",
      "text": "While playing video games, the narrator and Yang Bin get caught in a 'ghost hitting wall' (鬼打墙) phenomenon, repeatedly encountering the same black garbage bin with the number 9999.",
      "level": 2
    },
    {
      "id": "1.32",
      "text": "They attempt to escape by jumping over walls but find themselves back in the same alley.",
      "level": 3
    }
  ],
  "concepts": [
    {
      "name": "Feng Yixi",
      "frequency": 1,
      "context": "Protagonist of the story, a 29-year-old man who experiences supernatural events."
    },
    {
      "name": "Han Wenna",
      "frequency": 1,
      "context": "Feng Yixi's girlfriend, described as beautiful, model-like, kind, and good-natured."
    },
    {
      "name": "Chai Yong (Fei Lao)",
      "frequency": 1,
      "context": "Feng Yixi's close friend in Tianjin, who helps him financially and with finding a job."
    },
    {
      "name": "Lingyin Temple",
      "frequency": 1,
      "context": "A famous temple in Hangzhou visited by Feng Yixi."
    },
    {
      "name": "Fortune teller",
      "frequency": 1,
      "context": "An old man Feng Yixi meets outside Lingyin Temple who predicts misfortune."
    },
    {
      "name": "Gambling",
      "frequency": 1,
      "context": "Feng Yixi's addiction to football betting that leads to his financial ruin."
    },
    {
      "name": "Fierce house (凶宅)",
      "frequency": 1,
      "context": "The apartment Feng Yixi rents in Tianjin, known to be a place where someone died."
    },
    {
      "name": "Coffin nails",
      "frequency": 1,
      "context": "Found nailed to a photograph in the fierce house, adding to the ominous atmosphere."
    },
    {
      "name": "Will portrait (遗像)",
      "frequency": 1,
      "context": "The burned photograph found in the apartment."
    },
    {
      "name": "Hooking ghost (勾死鬼)",
      "frequency": 1,
      "context": "A supernatural entity that attempts to lure Feng Yixi to his death."
    },
    {
      "name": "Sandalwood necklace",
      "frequency": 1,
      "context": "A protective amulet from Han Wenna that seemingly saves Feng Yixi from the ghost."
    },
    {
      "name": "Yang Bin",
      "frequency": 1,
      "context": "A young boy Feng Yixi befriends in Tianjin, who helps him and gets caught in supernatural events."
    },
    {
      "name": "Yang Qin",
      "frequency": 1,
      "context": "Yang Bin's older sister, who also rents an apartment in the same building."
    },
    {
      "name": "Liu Fengcai",
      "frequency": 1,
      "context": "The daughter of Liu Shifu, a neighbor, who goes missing under mysterious circumstances."
    },
    {
      "name": "Ghost hitting wall (鬼打墙)",
      "frequency": 1,
      "context": "A supernatural phenomenon where one is trapped in a loop, unable to find their way out."
    },
    {
      "name": "Garbage bin (number 9999)",
      "frequency": 1,
      "context": "A recurring object in the 'ghost hitting wall' phenomenon."
    }
  ],
  "relations": [
    {
      "source": "Feng Yixi",
      "target": "Han Wenna",
      "type": "girlfriend"
    },
    {
      "source": "Feng Yixi",
      "target": "Chai Yong (Fei Lao)",
      "type": "friend"
    },
    {
      "source": "Feng Yixi",
      "target": "Fortune teller",
      "type": "consulted"
    },
    {
      "source": "Feng Yixi",
      "target": "Gambling",
      "type": "addicted to"
    },
    {
      "source": "Feng Yixi",
      "target": "Fierce house",
      "type": "rents"
    },
    {
      "source": "Fierce house",
      "target": "Coffin nails",
      "type": "contains"
    },
    {
      "source": "Fierce house",
      "target": "Will portrait",
      "type": "contained"
    },
    {
      "source": "Feng Yixi",
      "target": "Hooking ghost",
      "type": "confronted by"
    },
    {
      "source": "Sandalwood necklace",
      "target": "Feng Yixi",
      "type": "protects"
    },
    {
      "source": "Feng Yixi",
      "target": "Yang Bin",
      "type": "befriends"
    },
    {
      "source": "Feng Yixi",
      "target": "Yang Qin",
      "type": "interacts with"
    },
    {
      "source": "Yang Bin",
      "target": "Liu Fengcai",
      "type": "neighbor"
    },
    {
      "source": "Liu Fengcai",
      "target": "Missing",
      "type": "status"
    },
    {
      "source": "Feng Yixi",
      "target": "Ghost hitting wall",
      "type": "experienced"
    },
    {
      "source": "Yang Bin",
      "target": "Ghost hitting wall",
      "type": "experienced"
    },
    {
      "source": "Ghost hitting wall",
      "target": "Garbage bin (number 9999)",
      "type": "characterized by"
    }
  ],
  "hierarchy": {
    "main_topics": [
      "Narrator's misfortunes and descent into supernatural encounters",
      "Supernatural events and their impact on the narrator",
      "Themes of fate, superstition, and resilience"
    ],
    "structure": "The document is structured as a first-person narrative, presented in chapters, detailing the protagonist's personal downfall and subsequent immersion into a world of the supernatural. It follows a chronological progression of events, starting with his life in Beijing, his encounter with a fortune teller, his financial ruin due to gambling, his escape to Tianjin, and his experiences in a 'fierce house,' culminating in increasingly terrifying supernatural occurrences and a mystery involving a missing neighbor."
  }
}