{
  "propositions": [
    {
      "id": "1",
      "text": "The narrator dislikes the sound of cicadas, finding it eerie and maddening.",
      "level": 1
    },
    {
      "id": "1.1",
      "text": "He associates this sound with the arrival of the hot season.",
      "level": 2
    },
    {
      "id": "2",
      "text": "The narrator's three-year-old sister died shortly after her fourth birthday.",
      "level": 1
    },
    {
      "id": "2.1",
      "text": "He keeps a portion of her remains in a glass cup on his desk.",
      "level": 2
    },
    {
      "id": "2.2",
      "text": "The sight of her remains triggers memories and can lead to emotional breakdown.",
      "level": 2
    },
    {
      "id": "3",
      "text": "On July 20th, the narrator hears a terrifying, unprecedented wind sound outside his classroom window.",
      "level": 1
    },
    {
      "id": "3.1",
      "text": "He describes the sound as if mixed with the cries of monstrous creatures.",
      "level": 2
    },
    {
      "id": "4",
      "text": "The teacher, Iwamura, is giving instructions about summer break, including contact information.",
      "level": 1
    },
    {
      "id": "4.1",
      "text": "The narrator is intensely focused on staying quiet and suppressing a scream.",
      "level": 2
    },
    {
      "id": "5",
      "text": "The narrator draws on his desk, but his hand is unsteady, producing shaky lines.",
      "level": 1
    },
    {
      "id": "5.1",
      "text": "His classmate, Hachigaoka, asks what he's drawing, leading to a brief, tense exchange.",
      "level": 2
    },
    {
      "id": "6",
      "text": "The teacher warns about the dangers of the sea during summer break.",
      "level": 1
    },
    {
      "id": "7",
      "text": "A sudden gust of wind shakes the window, causing the narrator to drop his pencil and look outside.",
      "level": 1
    },
    {
      "id": "7.1",
      "text": "He witnesses S-kun, a classmate, being blown past the second-floor classroom window by the wind, appearing like a piece of paper.",
      "level": 2
    },
    {
      "id": "7.2",
      "text": "S-kun's eyes are wide and fixed on the classroom, showing loneliness.",
      "level": 3
    },
    {
      "id": "8",
      "text": "The teacher asks if anyone can deliver materials and homework to S-kun's home, as he is absent due to illness.",
      "level": 1
    },
    {
      "id": "9",
      "text": "The narrator, without consciously deciding to, raises his hand to volunteer.",
      "level": 1
    },
    {
      "id": "10",
      "text": "Some classmates whisper about the narrator's relationship with S-kun.",
      "level": 1
    },
    {
      "id": "11",
      "text": "Ibizer, a classmate, warns the narrator about the dangers on the way to S-kun's house, referencing recent discoveries of animal carcasses.",
      "level": 1
    },
    {
      "id": "11.1",
      "text": "These carcasses (four dogs, four cats) were found in various locations around N town.",
      "level": 2
    },
    {
      "id": "11.2",
      "text": "The discovery of the last carcass was five days prior to the current day.",
      "level": 3
    },
    {
      "id": "11.3",
      "text": "The reported cause was 'malicious mischief,' but the teacher suggested it could be accidents or pollution.",
      "level": 4
    },
    {
      "id": "11.4",
      "text": "Two common characteristics of the dead animals were found: their hind legs were twisted backwards at the joint, and their mouths were stuffed with white soap.",
      "level": 4
    },
    {
      "id": "12",
      "text": "The narrator walks towards S-kun's house, carrying the school materials.",
      "level": 1
    },
    {
      "id": "12.1",
      "text": "He recalls writing a free composition about his sister's birth, which received positive feedback from the teacher.",
      "level": 2
    },
    {
      "id": "13",
      "text": "The teacher, Iwamura, catches up to him and lends him a handkerchief.",
      "level": 1
    },
    {
      "id": "14",
      "text": "The narrator follows a narrow path, smelling a foul odor, and discovers a dead cat in an abandoned car.",
      "level": 1
    },
    {
      "id": "14.1",
      "text": "The cat's body is contorted, with its hind legs unnaturally twisted, and its mouth stuffed with soap.",
      "level": 2
    },
    {
      "id": "14.2",
      "text": "He realizes this is the same modus operandi as the animal mutilations.",
      "level": 3
    },
    {
      "id": "15",
      "text": "He runs in panic to S-kun's house, located at the end of a narrow path through a bamboo grove.",
      "level": 1
    },
    {
      "id": "16",
      "text": "Upon arrival, he finds S-kun's house in a state of neglect, with a broken doorbell.",
      "level": 1
    },
    {
      "id": "16.1",
      "text": "S-kun's dog, Dajikichi, barks ferociously at him, unlike its usual behavior.",
      "level": 2
    },
    {
      "id": "17",
      "text": "He enters S-kun's house and finds S-kun hanging from a rope tied to a closet door, suspended by a grid window.",
      "level": 1
    },
    {
      "id": "17.1",
      "text": "S-kun's body is swaying, and he notices a foul-smelling liquid dripping from his legs.",
      "level": 2
    },
    {
      "id": "17.2",
      "text": "He is overcome with horror and fear, collapsing on the floor.",
      "level": 3
    },
    {
      "id": "18",
      "text": "He flees from S-kun's house, deeply disturbed, and sees the sunflowers in the yard all facing the room where S-kun was found.",
      "level": 1
    },
    {
      "id": "19",
      "text": "He rushes back to school and confides in the teachers, who are alarmed by what he describes.",
      "level": 1
    },
    {
      "id": "20",
      "text": "The police are contacted, and the narrator is to be taken home by a teacher.",
      "level": 1
    },
    {
      "id": "21",
      "text": "At home, the narrator tells his younger sister, Mika, what he saw at S-kun's house.",
      "level": 1
    },
    {
      "id": "22",
      "text": "Mika recognizes S-kun from a previous encounter and asks why he died.",
      "level": 1
    },
    {
      "id": "23",
      "text": "The narrator reflects on his relationship with S-kun, questioning if it was truly a good one.",
      "level": 1
    },
    {
      "id": "24",
      "text": "He discovers S-kun's composition titled 'The Evil King' among the items he was supposed to deliver.",
      "level": 1
    },
    {
      "id": "24.1",
      "text": "The composition tells a story about a king who consumes 'hope' by extracting people's eyeballs through bamboo tubes.",
      "level": 2
    },
    {
      "id": "24.2",
      "text": "The composition contains a hidden message or code marked by faint 'x' symbols.",
      "level": 3
    },
    {
      "id": "25",
      "text": "The story shifts to Kuse Taizo, who is recording temperature and humidity data in a forest as part of a research project.",
      "level": 1
    },
    {
      "id": "26",
      "text": "He has been doing this work for a year after retiring from his previous job.",
      "level": 1
    }
  ],
  "concepts": [
    {
      "name": "Cicadas",
      "frequency": 3,
      "context": "The narrator associates their sound with the arrival of summer and finds it disturbing."
    },
    {
      "name": "Sister",
      "frequency": 7,
      "context": "The narrator's younger sister died, and her memory significantly impacts him. He also cares for his living younger sister, Mika."
    },
    {
      "name": "Summer",
      "frequency": 5,
      "context": "The season is a recurring backdrop, associated with heat, cicadas, and the main events of the story."
    },
    {
      "name": "Wind",
      "frequency": 6,
      "context": "A powerful and unnatural wind plays a role in the events, notably in the abduction of S-kun and the general atmosphere of unease."
    },
    {
      "name": "S-kun",
      "frequency": 17,
      "context": "A classmate who is absent from school and later found deceased under mysterious circumstances."
    },
    {
      "name": "Classroom",
      "frequency": 3,
      "context": "The setting for the initial events and discussions among students and teachers."
    },
    {
      "name": "Teacher (Iwamura)",
      "frequency": 8,
      "context": "The narrator's teacher, who assigns him the task of delivering materials to S-kun and plays a supportive role."
    },
    {
      "name": "Animal Carcasses",
      "frequency": 4,
      "context": "The discovery of mutilated animal bodies in N town foreshadows a darker event."
    },
    {
      "name": "Soap",
      "frequency": 3,
      "context": "A recurring detail found in the mouths of dead animals and later implied in S-kun's story."
    },
    {
      "name": "Abandoned Car",
      "frequency": 1,
      "context": "The location where the narrator finds a dead cat, confirming the pattern of animal mutilation."
    },
    {
      "name": "House",
      "frequency": 8,
      "context": "The setting for key discoveries and interactions, particularly S-kun's house and the narrator's own home."
    },
    {
      "name": "Dog (Dajikichi)",
      "frequency": 4,
      "context": "S-kun's dog, which exhibits unusual aggression towards the narrator."
    },
    {
      "name": "Rope",
      "frequency": 3,
      "context": "The means by which S-kun is suspended, and also part of the mechanism in S-kun's story."
    },
    {
      "name": "Sunflowers",
      "frequency": 4,
      "context": "A prominent visual element, all facing the room where S-kun is found, adding to the unsettling atmosphere."
    },
    {
      "name": "School",
      "frequency": 6,
      "context": "The central institution where the story begins and where the narrator seeks help and understanding."
    },
    {
      "name": "Teachers (general)",
      "frequency": 5,
      "context": "They are involved in receiving the narrator's account and initiating further action."
    },
    {
      "name": "Police",
      "frequency": 2,
      "context": "They are called to investigate the events at S-kun's house."
    },
    {
      "name": "Mika",
      "frequency": 10,
      "context": "The narrator's younger sister, who shows remarkable insight and interacts with the narrator about the events."
    },
    {
      "name": "Composition ('The Evil King')",
      "frequency": 4,
      "context": "S-kun's written work, which contains a disturbing narrative and a potential hidden message."
    },
    {
      "name": "Hope",
      "frequency": 3,
      "context": "The central theme of S-kun's story, portrayed as a consumable substance."
    },
    {
      "name": "Eyeballs",
      "frequency": 2,
      "context": "The 'food' the king in S-kun's story consumes."
    },
    {
      "name": "Kuse Taizo",
      "frequency": 2,
      "context": "A character introduced at the end, involved in data collection in a forest, suggesting a possible connection or parallel narrative."
    },
    {
      "name": "Forest",
      "frequency": 2,
      "context": "The setting for Kuse Taizo's activity and a place of potential hidden events."
    }
  ],
  "relations": [
    {
      "source": "Cicadas",
      "target": "Summer",
      "type": "associated_with"
    },
    {
      "source": "Sister",
      "target": "Death",
      "type": "subject_of"
    },
    {
      "source": "Sister",
      "target": "Memory",
      "type": "triggers"
    },
    {
      "source": "Wind",
      "target": "S-kun",
      "type": "affects"
    },
    {
      "source": "S-kun",
      "target": "Absence",
      "type": "subject_of"
    },
    {
      "source": "S-kun",
      "target": "Death",
      "type": "subject_of"
    },
    {
      "source": "Teacher (Iwamura)",
      "target": "S-kun",
      "type": "assigns_task_related_to"
    },
    {
      "source": "Animal Carcasses",
      "target": "Soap",
      "type": "found_with"
    },
    {
      "source": "Animal Carcasses",
      "target": "Hind Legs Twisted",
      "type": "characteristic_of"
    },
    {
      "source": "Abandoned Car",
      "target": "Dead Cat",
      "type": "location_of"
    },
    {
      "source": "Dead Cat",
      "target": "Soap",
      "type": "found_in_mouth_of"
    },
    {
      "source": "House",
      "target": "S-kun",
      "type": "belongs_to"
    },
    {
      "source": "Dog (Dajikichi)",
      "target": "S-kun",
      "type": "owned_by"
    },
    {
      "source": "Dog (Dajikichi)",
      "target": "Aggression",
      "type": "exhibits_towards"
    },
    {
      "source": "Rope",
      "target": "S-kun",
      "type": "used_to_suspend"
    },
    {
      "source": "Sunflowers",
      "target": "S-kun's Room",
      "type": "facing"
    },
    {
      "source": "School",
      "target": "Narrator",
      "type": "attended_by"
    },
    {
      "source": "School",
      "target": "Teachers",
      "type": "staffed_by"
    },
    {
      "source": "Police",
      "target": "Investigation",
      "type": "conducts"
    },
    {
      "source": "Mika",
      "target": "Narrator",
      "type": "sister_of"
    },
    {
      "source": "Composition ('The Evil King')",
      "target": "S-kun",
      "type": "written_by"
    },
    {
      "source": "Composition ('The Evil King')",
      "target": "Hope",
      "type": "theme_of"
    },
    {
      "source": "Hope",
      "target": "Eyeballs",
      "type": "represented_by"
    },
    {
      "source": "Kuse Taizo",
      "target": "Forest",
      "type": "works_in"
    },
    {
      "source": "Forest",
      "target": "Data Collection",
      "type": "site_of"
    }
  ],
  "hierarchy": {
    "main_topics": [
      "The Narrator's Personal Trauma and Sensitivities",
      "The Mystery of S-kun's Death and the Animal Mutilations",
      "The Impact of Events on the Narrator and His Sister",
      "Unraveling S-kun's Story through his Composition",
      "Parallel Narrative of Kuse Taizo and Data Collection"
    ],
    "structure": "The document is structured into chapters or sections, following a chronological progression of events and the narrator's experiences and reflections. It moves from his personal anxieties to a specific incident at school, his investigation into S-kun's situation, and finally to S-kun's written work and a seemingly disconnected subplot."
  }
}