{
  "propositions": [
    {
      "id": "1",
      "text": "On the evening of March 20, 2003, in Portland, Oregon, a young man carrying a gift box rushed to meet his loved one.",
      "level": 1
    },
    {
      "id": "1.1",
      "text": "He checked his watch frequently and hurried his pace, muttering, 'Hope I'm not late, my darling.'",
      "level": 2
    },
    {
      "id": "1.2",
      "text": "He then got into a waiting taxi.",
      "level": 2
    },
    {
      "id": "2",
      "text": "At 7:40 PM, Calvin East Street was unusually deserted.",
      "level": 1
    },
    {
      "id": "2.1",
      "text": "Only the coffee shop owner, Merv and Mrs. Martha, remained.",
      "level": 2
    },
    {
      "id": "3",
      "text": "A news broadcast announced that the police, with FBI assistance, were investigating the 'Mask Killer' serial murders.",
      "level": 1
    },
    {
      "id": "3.1",
      "text": "The broadcast warned citizens to be cautious due to the killer's potential activity.",
      "level": 2
    },
    {
      "id": "4",
      "text": "The coffee shop owner lamented the drop in customers due to the murders.",
      "level": 1
    },
    {
      "id": "4.1",
      "text": "He offered Martha a free coffee and advised her to go home early, emphasizing her beauty and the need for caution.",
      "level": 2
    },
    {
      "id": "5",
      "text": "Martha was distressed as her fiancé, Eli, hadn't answered her calls.",
      "level": 1
    },
    {
      "id": "5.1",
      "text": "She worried he might be involved in something or worse, referencing the news broadcast.",
      "level": 2
    },
    {
      "id": "6",
      "text": "The first two murders occurred on March 1st, with bodies found naked and their faces stripped of skin.",
      "level": 1
    },
    {
      "id": "6.1",
      "text": "The victims' bodies were mutilated: male genitalia removed, and a metal rod inserted into the female victim's body.",
      "level": 2
    },
    {
      "id": "6.2",
      "text": "The message 'mask' was written in the victims' blood on a nearby wall at both locations.",
      "level": 2
    },
    {
      "id": "7",
      "text": "This modus operandi was unprecedented in criminal history.",
      "level": 1
    },
    {
      "id": "8",
      "text": "On March 12th, two more bodies were discovered, killed by gunshots and similarly mutilated.",
      "level": 1
    },
    {
      "id": "8.1",
      "text": "The killer's preference for firearms distinguished him from typical serial killers.",
      "level": 2
    },
    {
      "id": "9",
      "text": "The four victims were unrelated and had no common characteristics, making the murders appear indiscriminate.",
      "level": 1
    },
    {
      "id": "10",
      "text": "The murders had plunged Portland into a state of fear and quieted its nightlife.",
      "level": 1
    },
    {
      "id": "11",
      "text": "Martha, who had developed a habit of walking to work, felt deep fear for the first time in three years.",
      "level": 1
    },
    {
      "id": "11.1",
      "text": "She considered calling a taxi but felt it might not be safe, recalling a colleague's joke about the killer being a taxi driver.",
      "level": 2
    },
    {
      "id": "11.2",
      "text": "She regretted rejecting the coffee shop owner's offer for a ride home.",
      "level": 2
    },
    {
      "id": "12",
      "text": "After receiving no answer on her fiancé's phone, Martha called their home.",
      "level": 1
    },
    {
      "id": "12.1",
      "text": "She hoped he had simply forgotten her birthday.",
      "level": 2
    },
    {
      "id": "12.2",
      "text": "She was met with their answering machine, which deepened her despair.",
      "level": 2
    },
    {
      "id": "13",
      "text": "Martha remained unaware of Eli's whereabouts and why he hadn't picked her up.",
      "level": 1
    },
    {
      "id": "13.1",
      "text": "The familiar streets of Portland felt strange and eerie in the pouring rain.",
      "level": 2
    },
    {
      "id": "14",
      "text": "Martha tried to stay calm, hoping for good luck, and worried more about Eli than herself.",
      "level": 1
    },
    {
      "id": "15",
      "text": "On the second floor of the building where Martha was sheltering, a man tapped a table, musing about the '5th' victim.",
      "level": 1
    },
    {
      "id": "16",
      "text": "He then looked out the window and saw a young man with an umbrella emerge from the corridor below.",
      "level": 1
    },
    {
      "id": "17",
      "text": "Martha encountered the young man, who offered to help her.",
      "level": 1
    },
    {
      "id": "17.1",
      "text": "He introduced himself as a law student, Eli and Martha's neighbor, who had been at the library researching the recent cases.",
      "level": 2
    },
    {
      "id": "17.2",
      "text": "He offered to give her a ride home, showing his student ID and driver's license.",
      "level": 2
    },
    {
      "id": "18",
      "text": "Martha, despite her fear, cautiously accepted his offer, rationalizing that it wouldn't make a difference if he were a bad person.",
      "level": 1
    },
    {
      "id": "19",
      "text": "During their walk, Martha learned his name was Diate.",
      "level": 1
    },
    {
      "id": "20",
      "text": "Diate asked about her boyfriend, Eli, and Martha expressed her worry and sadness.",
      "level": 1
    },
    {
      "id": "21",
      "text": "Diate reassured her that Eli would be fine and then discussed his father being a police officer and his interest in law and criminal cases.",
      "level": 1
    },
    {
      "id": "22",
      "text": "He began to talk about the 'Bellflower' serial rape-murder case in Britain.",
      "level": 1
    },
    {
      "id": "23",
      "text": "Martha noticed Diate slowing down and turning to face her.",
      "level": 1
    },
    {
      "id": "23.1",
      "text": "He told her she was beautiful and began to breathe heavily.",
      "level": 2
    },
    {
      "id": "24",
      "text": "Martha's phone rang; it was the landlord, Anthony, with concerning news about Eli.",
      "level": 1
    },
    {
      "id": "25",
      "text": "Diate suddenly grabbed Martha's arm, his eyes flashing with evil, stating Eli couldn't come and it was just her and him.",
      "level": 1
    },
    {
      "id": "26",
      "text": "Martha struggled to free herself, but Diate's strength was immense.",
      "level": 1
    },
    {
      "id": "27",
      "text": "In her desperation, Martha reached into her bag and felt something cold.",
      "level": 1
    },
    {
      "id": "28",
      "text": "A loud noise followed, and Diate fell to the ground, dead.",
      "level": 1
    },
    {
      "id": "29",
      "text": "Martha screamed, dropped the object, and collapsed.",
      "level": 1
    },
    {
      "id": "30",
      "text": "Anthony's voice was still heard from the dropped phone, informing her Eli was in critical condition at the hospital.",
      "level": 1
    },
    {
      "id": "31",
      "text": "About half an hour later, a black Buick stopped at the scene.",
      "level": 1
    },
    {
      "id": "31.1",
      "text": "A man in a long coat emerged, looked around cautiously, and then went into a small supermarket.",
      "level": 2
    },
    {
      "id": "31.2",
      "text": "He gestured on the glass window with a gloved hand, then left.",
      "level": 2
    },
    {
      "id": "32",
      "text": "After the Buick departed, a young boy came out of the shadows and looked at the supermarket window.",
      "level": 1
    },
    {
      "id": "33",
      "text": "Written on the glass in large letters was: 'maskwillbebacksoon'.",
      "level": 1
    },
    {
      "id": "34",
      "text": "The next day, March 21st, Ed Samlan, a detective, began his day early.",
      "level": 1
    },
    {
      "id": "34.1",
      "text": "He examined photos of the murder victims, noting their disfigured faces and mutilated bodies.",
      "level": 2
    },
    {
      "id": "35",
      "text": "Samlan reflected on his past success in solving a serial killer case 13 years ago.",
      "level": 1
    },
    {
      "id": "36",
      "text": "Despite his age and declining memory and stamina, he remained dedicated to his work.",
      "level": 1
    },
    {
      "id": "37",
      "text": "He was heading to the Levain Street area because an elderly man had reported seeing 'mask' written on a supermarket window.",
      "level": 1
    },
    {
      "id": "38",
      "text": "During his drive, Samlan contemplated the nature of passion and resilience.",
      "level": 1
    },
    {
      "id": "39",
      "text": "He arrived at Levain Street before 6 AM, finding minimal onlookers and his junior partner, Carlos.",
      "level": 1
    },
    {
      "id": "40",
      "text": "Carlos appeared nervous as he directed Samlan to the scene.",
      "level": 1
    },
    {
      "id": "41",
      "text": "Samlan was reminded of the movie 'Se7en' by Carlos's appearance.",
      "level": 1
    },
    {
      "id": "42",
      "text": "His good mood vanished upon seeing the large, blood-written message on the deep red wall: 'maskwillbebacksoon'.",
      "level": 1
    },
    {
      "id": "43",
      "text": "He instructed the crime scene technicians and requested backup.",
      "level": 1
    },
    {
      "id": "44",
      "text": "Samlan interviewed the elderly witness, Mr. Jonathan, who discovered the message with his dog, Mark.",
      "level": 1
    },
    {
      "id": "44.1",
      "text": "Mr. Jonathan explained his routine and how Mark alerted him to the writing on the glass.",
      "level": 2
    },
    {
      "id": "45",
      "text": "The witness provided information about his morning routine and the approximate time he notified the police.",
      "level": 1
    },
    {
      "id": "46",
      "text": "Samlan and Carlos began interviewing residents about the previous night.",
      "level": 1
    },
    {
      "id": "47",
      "text": "A resident mentioned the supermarket owner, Mark, and a past incident where Mark was angered by a man named Jonathan whose dog also was named Mark.",
      "level": 1
    },
    {
      "id": "48",
      "text": "The resident confirmed Mark usually closed late but had closed early recently due to lack of business.",
      "level": 1
    },
    {
      "id": "49",
      "text": "None of the interviewed residents reported any unusual activity, attributing it to the heavy rain.",
      "level": 1
    },
    {
      "id": "50",
      "text": "Samlan shared a story about his former mentor's meticulous approach to crime solving, emphasizing the importance of the process.",
      "level": 1
    },
    {
      "id": "51",
      "text": "At 7:30 AM, Dr. Waller's psychological clinic was preparing for the day's appointments.",
      "level": 1
    },
    {
      "id": "52",
      "text": "Dr. Waller found a matchbox in the wastebasket, which he found curious.",
      "level": 1
    },
    {
      "id": "53",
      "text": "Samlan and Carlos interviewed Mrs. Carlyle, a single mother, and her son, Eddie.",
      "level": 1
    },
    {
      "id": "53.1",
      "text": "Eddie, a pale and small boy, stared at Samlan and stated, 'Black. Black man. Black car, wearing long black clothes, drawing black on the glass.'",
      "level": 2
    },
    {
      "id": "54",
      "text": "Mrs. Carlyle became agitated and insisted Eddie hadn't seen anything, rushing him out.",
      "level": 1
    },
    {
      "id": "55",
      "text": "Eddie waved goodbye to Carlos, calling him 'white man'.",
      "level": 1
    },
    {
      "id": "56",
      "text": "Samlan mused that if Eddie's statement was true, the 'black man' might refer to skin color.",
      "level": 1
    },
    {
      "id": "57",
      "text": "Samlan visited Mr. Jonathan again.",
      "level": 1
    },
    {
      "id": "57.1",
      "text": "Mr. Jonathan shared the story of his dog, Mark, and how it befriended a young Chinese man named Seth Waller, a psychologist.",
      "level": 2
    },
    {
      "id": "57.2",
      "text": "Mark would eat lunch at Waller's clinic, enjoying the food, described as 'authentic Chinese flavor'.",
      "level": 2
    },
    {
      "id": "58",
      "text": "At the clinic, Eddie was playing with cat figurines instead of the sand tray.",
      "level": 1
    },
    {
      "id": "59",
      "text": "Eddie described a 'black cat' drawing on glass, writing 'something is back' before leaving.",
      "level": 1
    }
  ],
  "concepts": [
    {
      "name": "Mask Killer",
      "frequency": 13,
      "context": "The perpetrator of a series of brutal murders, characterized by face stripping and mutilation."
    },
    {
      "name": "Martha",
      "frequency": 13,
      "context": "A young woman waiting for her fiancé, Eli, who becomes a potential victim of the Mask Killer."
    },
    {
      "name": "Eli",
      "frequency": 6,
      "context": "Martha's fiancé, who is absent and later reported to be in critical condition."
    },
    {
      "name": "Samlan",
      "frequency": 11,
      "context": "Detective Ed Samlan, a seasoned investigator working on the Mask Killer case."
    },
    {
      "name": "Carlos",
      "frequency": 6,
      "context": "Detective Samlan's younger partner."
    },
    {
      "name": "Portland",
      "frequency": 8,
      "context": "The city where the murders and events of the story take place."
    },
    {
      "name": "Murder",
      "frequency": 10,
      "context": "The violent killing of individuals, a central theme of the narrative."
    },
    {
      "name": "Investigation",
      "frequency": 7,
      "context": "The process of seeking truth and apprehending criminals by law enforcement."
    },
    {
      "name": "Fear",
      "frequency": 5,
      "context": "The emotional state of the characters and the public due to the murders."
    },
    {
      "name": "Diate",
      "frequency": 5,
      "context": "A young man who initially appears helpful but reveals himself to be a dangerous individual."
    },
    {
      "name": "Mark",
      "frequency": 6,
      "context": "Mr. Jonathan's dog, which plays a role in discovering clues and forming relationships."
    },
    {
      "name": "Mr. Jonathan",
      "frequency": 5,
      "context": "An elderly war veteran and friend of the dog Mark, who provides information to the police."
    },
    {
      "name": "Eddie",
      "frequency": 6,
      "context": "Mrs. Carlyle's young son, who makes cryptic statements about a 'black man'."
    },
    {
      "name": "Mrs. Carlyle",
      "frequency": 5,
      "context": "Eddie's mother, who is protective and anxious about her son."
    },
    {
      "name": "Seth Waller",
      "frequency": 4,
      "context": "A psychologist who befriends Mr. Jonathan and Mark, and whose clinic is a point of interest."
    },
    {
      "name": "Blood",
      "frequency": 4,
      "context": "A key element used by the killer for messages and as a representation of violence."
    },
    {
      "name": "Message",
      "frequency": 4,
      "context": "Written words left by the killer, often in blood, conveying threats or statements."
    },
    {
      "name": "Glass",
      "frequency": 4,
      "context": "A surface used by the killer for leaving messages."
    },
    {
      "name": "Car",
      "frequency": 3,
      "context": "A mode of transportation used by characters and potentially by the killer."
    },
    {
      "name": "Rain",
      "frequency": 4,
      "context": "The weather, which contributes to the atmosphere and can obscure evidence."
    }
  ],
  "relations": [
    {
      "source": "Mask Killer",
      "target": "Murder",
      "type": "is_a_perpetrator_of"
    },
    {
      "source": "Mask Killer",
      "target": "Face Stripping",
      "type": "employs_method"
    },
    {
      "source": "Mask Killer",
      "target": "Mutilation",
      "type": "employs_method"
    },
    {
      "source": "Martha",
      "target": "Eli",
      "type": "is_waiting_for"
    },
    {
      "source": "Martha",
      "target": "Fear",
      "type": "experiences"
    },
    {
      "source": "Martha",
      "target": "Diate",
      "type": "interacts_with"
    },
    {
      "source": "Eli",
      "target": "Critical Condition",
      "type": "is_in"
    },
    {
      "source": "Samlan",
      "target": "Investigation",
      "type": "conducts"
    },
    {
      "source": "Samlan",
      "target": "Mask Killer",
      "type": "investigates"
    },
    {
      "source": "Carlos",
      "target": "Samlan",
      "type": "is_partner_of"
    },
    {
      "source": "Portland",
      "target": "Murder",
      "type": "is_location_of"
    },
    {
      "source": "Diate",
      "target": "Danger",
      "type": "poses"
    },
    {
      "source": "Diate",
      "target": "Martha",
      "type": "attacks"
    },
    {
      "source": "Mark",
      "target": "Mr. Jonathan",
      "type": "is_owned_by"
    },
    {
      "source": "Mark",
      "target": "Seth Waller",
      "type": "befriends"
    },
    {
      "source": "Mr. Jonathan",
      "target": "Investigation",
      "type": "assists"
    },
    {
      "source": "Eddie",
      "target": "Black Man",
      "type": "reports_seeing"
    },
    {
      "source": "Eddie",
      "target": "Mrs. Carlyle",
      "type": "is_son_of"
    },
    {
      "source": "Mrs. Carlyle",
      "target": "Anxiety",
      "type": "experiences"
    },
    {
      "source": "Seth Waller",
      "target": "Psychology",
      "type": "practices"
    },
    {
      "source": "Blood",
      "target": "Message",
      "type": "is_used_for"
    },
    {
      "source": "Glass",
      "target": "Message",
      "type": "is_surface_for"
    },
    {
      "source": "Car",
      "target": "Mask Killer",
      "type": "may_be_used_by"
    },
    {
      "source": "Rain",
      "target": "Atmosphere",
      "type": "contributes_to"
    },
    {
      "source": "Rain",
      "target": "Evidence",
      "type": "obscures"
    }
  ],
  "hierarchy": {
    "main_topics": [
      "The Mask Killer and the Investigation",
      "Martha's Personal Ordeal",
      "Detective Samlan's Experience and Methods",
      "The Enigmatic Clues and Characters"
    ],
    "structure": "The document is structured into three volumes, 'Vol 1. 面具归来' (The Mask Returns), 'Vol 2. 萨姆兰的骄傲' (Samlan's Pride), and 'Vol 3. 小猫家族' (Little Cat Family). Each volume progresses the narrative chronologically and introduces new characters and plot points. Vol 1 sets the scene and introduces the main characters and the mystery. Vol 2 delves deeper into the investigation and introduces Detective Samlan. Vol 3 explores character backstories and the child's cryptic statements, leading to further investigative threads."
  }
}