{
  "propositions": [
    {
      "id": "1",
      "text": "亚拉喇嘛 and 吕竞男 discuss a new clue regarding the \"lighted castle.\"",
      "level": 1
    },
    {
      "id": "1.1",
      "text": "The clue mentions the greatest messenger bringing the lighted castle to the Paba La temple.",
      "level": 2
    },
    {
      "id": "1.2",
      "text": "The clue states that Yi Xiwobo did not want to give up the lighted castle and recreated it, then sent the sacred light to a hidden place.",
      "level": 2
    },
    {
      "id": "1.3",
      "text": "This hidden place is described as a mysterious country with towering trees, dense forests, dangerous animals and plants, and people who eat human flesh.",
      "level": 2
    },
    {
      "id": "1.4",
      "text": "The architecture is described as grand, with temples like towering pyramids.",
      "level": 2
    },
    {
      "id": "1.5",
      "text": "The script is described as a combination of head shapes and animal/plant images.",
      "level": 2
    },
    {
      "id": "2",
      "text": "吕竞男 questions if the description refers to pyramids in a forest instead of a desert.",
      "level": 1
    },
    {
      "id": "3",
      "text": "亚拉 confirms it's a tropical rainforest and that the castle was preserved in another civilization's temple.",
      "level": 1
    },
    {
      "id": "3.1",
      "text": "The king of that civilization promised to keep the sacred castle imprisoned in darkness.",
      "level": 2
    },
    {
      "id": "4",
      "text": "吕竞男 expresses disbelief, questioning how ancient people could have crossed the Pacific to reach America and return.",
      "level": 1
    },
    {
      "id": "5",
      "text": "亚拉 argues that ancient people might have possessed capabilities unknown to modern people, referencing \"Shan Hai Jing\" and legends of Shang Dynasty people crossing the sea.",
      "level": 1
    },
    {
      "id": "6",
      "text": "吕竞男 wonders what the \"lighted castle\" is.",
      "level": 1
    },
    {
      "id": "7",
      "text": "亚拉 speculates it's not a large item and proposes crossing the rainforest as the next training test.",
      "level": 1
    },
    {
      "id": "8",
      "text": "吕竞男 expresses surprise at the location, noting that Maya civilization is typically associated with the Yucatan Peninsula.",
      "level": 1
    },
    {
      "id": "9",
      "text": "亚拉 explains that recent discoveries suggest a civilization distinct from the Inca, with advanced pottery, tribal characteristics, roads, bridges, farming areas, temples, and altars, located in the Amazon rainforest.",
      "level": 1
    },
    {
      "id": "9.1",
      "text": "Further discoveries include Maya-like astronomical observatories and massive, skillfully constructed stone structures, contradicting the notion of the region being uninhabited before 1492.",
      "level": 2
    },
    {
      "id": "9.2",
      "text": "The research suggests ancient Maya were capable of crossing the Andes into the Amazon jungle, following the Amazon River.",
      "level": 2
    },
    {
      "id": "9.3",
      "text": "Archaeological teams across Amazon countries are searching based on this theory, with recent surprising discoveries.",
      "level": 2
    },
    {
      "id": "10",
      "text": "吕竞男 questions the danger and the feasibility of finding the object in the vast Amazon basin.",
      "level": 1
    },
    {
      "id": "11",
      "text": "亚拉 reveals a newly discovered, large \"dead city\" in the area, believed to contain a temple.",
      "level": 1
    },
    {
      "id": "12",
      "text": "They decide to split into two groups for the test.",
      "level": 1
    },
    {
      "id": "13",
      "text": "吕竞男 asks if they will tell the trainees the truth.",
      "level": 1
    },
    {
      "id": "14",
      "text": "亚拉 decides not to tell them the truth for now, citing strange events during 卓木强巴's previous trip to Hoh Xil.",
      "level": 1
    },
    {
      "id": "15",
      "text": "吕竞男 doubts they will find the ruins and wonders if the location is certain.",
      "level": 1
    },
    {
      "id": "16",
      "text": "亚拉 believes the Living Buddha will guide them and insists on going to the ruins.",
      "level": 1
    },
    {
      "id": "17",
      "text": "亚拉 reflects on the Maya and the thousand-year wait mentioned by 德尼喇嘛.",
      "level": 1
    },
    {
      "id": "18",
      "text": "A shadow observes 吕竞男 from outside her window.",
      "level": 1
    },
    {
      "id": "19",
      "text": "卓木强巴 trains rigorously, feeling his physical and experience are at their peak.",
      "level": 1
    },
    {
      "id": "20",
      "text": "He anticipates the upcoming mid-term exam, wondering about its nature.",
      "level": 1
    },
    {
      "id": "21",
      "text": "During his training, 卓木强巴 is shot at.",
      "level": 1
    },
    {
      "id": "21.1",
      "text": "He narrowly avoids the second shot.",
      "level": 2
    },
    {
      "id": "22",
      "text": "卓木强巴 calls out for help, identifying the attacker as a highly trained individual.",
      "level": 1
    },
    {
      "id": "23",
      "text": "张立 and 岳阳 are the first to emerge from the barracks.",
      "level": 1
    },
    {
      "id": "24",
      "text": "唐敏 asks if 卓木强巴 is injured.",
      "level": 1
    },
    {
      "id": "25",
      "text": "方新教授 provides assault rifles to 张立.",
      "level": 1
    },
    {
      "id": "26",
      "text": "卓木强巴 and 张立 pursue the attacker, who is heading towards the western hills.",
      "level": 1
    },
    {
      "id": "27",
      "text": "The attacker disappears, and 卓木强巴 and 张立 take cover.",
      "level": 1
    },
    {
      "id": "28",
      "text": "张立 climbs a tree to get a better vantage point and signals the attacker's location.",
      "level": 1
    },
    {
      "id": "29",
      "text": "Other team members, including 巴桑, 艾力克, 方新教授, 亚拉, and 吕竞男, arrive.",
      "level": 1
    },
    {
      "id": "30",
      "text": "They form a perimeter to surround the attacker, planning to capture him alive using a tear gas grenade.",
      "level": 1
    },
    {
      "id": "31",
      "text": "Smoke grenades are deployed from the center, obscuring the attacker's position.",
      "level": 1
    },
    {
      "id": "32",
      "text": "Two gunshots are heard, indicating the attacker's escape.",
      "level": 1
    },
    {
      "id": "33",
      "text": "The attacker continues to fire and throw grenades, making pursuit difficult.",
      "level": 1
    },
    {
      "id": "34",
      "text": "卓木强巴 throws an alligator hunting knife at the attacker, which is embedded but doesn't stop him.",
      "level": 1
    },
    {
      "id": "35",
      "text": "The pursuers slow down, knowing a cliff lies ahead.",
      "level": 1
    },
    {
      "id": "36",
      "text": "The attacker, revealed to be 牛二娃, shouts that he only wants revenge on 卓木强巴.",
      "level": 1
    },
    {
      "id": "37",
      "text": "卓木强巴 recognizes 牛二娃 from a previous encounter in Hoh Xil.",
      "level": 1
    },
    {
      "id": "38",
      "text": "牛二娃 throws grenades and uses a smoke bomb to escape.",
      "level": 1
    },
    {
      "id": "39",
      "text": "牛二娃 escapes down the cliff, and another shot is fired from an unknown direction.",
      "level": 1
    },
    {
      "id": "40",
      "text": "After the enemy leaves, 岳阳 questions 卓木强巴 about the attacker.",
      "level": 1
    },
    {
      "id": "41",
      "text": "卓木强巴 recounts his history with 牛二娃, expressing confusion about how he was found and why he's more skilled now.",
      "level": 1
    },
    {
      "id": "42",
      "text": "The team members reflect on their own strength and capabilities.",
      "level": 1
    },
    {
      "id": "43",
      "text": "吕竞男 questions 卓木强巴's confidence in his abilities, especially if the attacker is linked to their rivals.",
      "level": 1
    },
    {
      "id": "44",
      "text": "唐敏 defends their intent to capture alive, while 吕竞男 announces the mid-term exam location.",
      "level": 1
    },
    {
      "id": "45",
      "text": "莫金 and 马索 discuss the incident with 牛二娃.",
      "level": 1
    },
    {
      "id": "45.1",
      "text": "莫金 is angry that 牛二娃 almost jeopardized his plan.",
      "level": 2
    },
    {
      "id": "46",
      "text": "牛二娃 brings news that interests 莫金.",
      "level": 1
    },
    {
      "id": "47",
      "text": "莫金 is informed about 牛二娃's injury.",
      "level": 1
    },
    {
      "id": "48",
      "text": "莫金 learns of a significant clue from 牛二娃.",
      "level": 1
    },
    {
      "id": "49",
      "text": "莫金 requests a detailed map of North America.",
      "level": 1
    },
    {
      "id": "50",
      "text": "莫金 excitedly circles a location on the map, believing it to be the target.",
      "level": 1
    },
    {
      "id": "51",
      "text": "莫金 reveals his intention to travel to Colombia.",
      "level": 1
    },
    {
      "id": "51.1",
      "text": "He believes a treasure was taken to the Americas and disappeared with the Maya civilization.",
      "level": 2
    },
    {
      "id": "51.2",
      "text": "He has been searching for clues related to this treasure for a long time.",
      "level": 2
    },
    {
      "id": "51.3",
      "text": "He believes the newly discovered Maya ruins might hold the key.",
      "level": 2
    },
    {
      "id": "52",
      "text": "莫金 asserts that ancient Maya were capable of crossing the Andes and building cities in the Amazon.",
      "level": 1
    },
    {
      "id": "53",
      "text": "He believes the treasure is a mirror.",
      "level": 1
    },
    {
      "id": "54",
      "text": "莫金 suspects the trainees are secretly collecting clues while pretending to train.",
      "level": 1
    },
    {
      "id": "55",
      "text": "He plans to go to Puerto Asis and intercept them.",
      "level": 1
    },
    {
      "id": "56",
      "text": "吕竞男 announces the details of the mid-term exam: two groups, starting from Puerto Putumayo, no modern transportation, avoiding border patrols, ending in Santa Maria, Peru.",
      "level": 1
    },
    {
      "id": "56.1",
      "text": "The journey is about 200 kilometers and has a ten-day limit.",
      "level": 2
    },
    {
      "id": "57",
      "text": "吕竞男 warns of potential resistance if the escaped attacker overheard the plan.",
      "level": 1
    },
    {
      "id": "58",
      "text": "张立 questions why their rivals would interfere with a training exercise.",
      "level": 1
    },
    {
      "id": "59",
      "text": "卓木强巴 contemplates the meaning of \"getting ahead of them.\"",
      "level": 1
    },
    {
      "id": "60",
      "text": "The trainees begin gathering information about South America, particularly Colombia, Peru, and Ecuador.",
      "level": 1
    },
    {
      "id": "61",
      "text": "张立 finds the exam easy due to the short distance.",
      "level": 1
    },
    {
      "id": "62",
      "text": "岳阳 emphasizes the challenge of the Amazon rainforest.",
      "level": 1
    },
    {
      "id": "63",
      "text": "张立 compares it to Xishuangbanna.",
      "level": 1
    },
    {
      "id": "64",
      "text": "卓木强巴 inquires about 张立's knowledge of the Amazon.",
      "level": 1
    },
    {
      "id": "65",
      "text": "张立 mentions piranhas and its status as the largest rainforest.",
      "level": 1
    },
    {
      "id": "66",
      "text": "巴桑 dismisses 张立's limited understanding.",
      "level": 1
    },
    {
      "id": "67",
      "text": "岳阳 elaborates on the Amazon's biodiversity and the Amazon River's scale.",
      "level": 1
    },
    {
      "id": "68",
      "text": "卓木强巴 adds to the information about the rich biodiversity.",
      "level": 1
    },
    {
      "id": "69",
      "text": "巴桑 refers to the Amazon as the \"Green Hell.\"",
      "level": 1
    },
    {
      "id": "70",
      "text": "张立 is excited by a picture of unclothed indigenous women.",
      "level": 1
    },
    {
      "id": "71",
      "text": "岳阳 corrects him, revealing the accompanying text describes cannibals.",
      "level": 1
    },
    {
      "id": "72",
      "text": "卓木强巴 expresses concern about the extreme danger of the location.",
      "level": 1
    },
    {
      "id": "73",
      "text": "张立 notes the difficulty of progressing without familiar tools.",
      "level": 1
    },
    {
      "id": "74",
      "text": "卓木强巴 clarifies that only weapons are restricted, not tools.",
      "level": 1
    },
    {
      "id": "75",
      "text": "He demonstrates his advanced atomic watch, highlighting its features.",
      "level": 1
    },
    {
      "id": "76",
      "text": "张立 asks if his army dagger can be brought.",
      "level": 1
    },
    {
      "id": "77",
      "text": "卓木强巴 mentions his beloved alligator hunting knife.",
      "level": 1
    },
    {
      "id": "78",
      "text": "唐敏 arrives, showing concern for 卓木强巴.",
      "level": 1
    },
    {
      "id": "79",
      "text": "卓木强巴 reassures her.",
      "level": 1
    },
    {
      "id": "80",
      "text": "唐敏 expresses her fear of the jungle and her commitment to 卓木强巴.",
      "level": 1
    },
    {
      "id": "81",
      "text": "卓木强巴 comforts her, mentioning Fang Xin and Mullah will look after her.",
      "level": 1
    },
    {
      "id": "82",
      "text": "唐敏 warns 卓木强巴 about the dangers and his mischievous teammates.",
      "level": 1
    },
    {
      "id": "83",
      "text": "吕竞男 calls 卓木强巴 out, giving him a stern warning to be careful.",
      "level": 1
    },
    {
      "id": "84",
      "text": "张立 and 岳阳 discuss 卓木强巴's attractiveness and his past divorce.",
      "level": 1
    },
    {
      "id": "85",
      "text": "Puerto Asis is described as a remote town with a history of conflict.",
      "level": 1
    },
    {
      "id": "86",
      "text": "莫金 meets with a local influential figure named Weto in Puerto Asis.",
      "level": 1
    },
    {
      "id": "87",
      "text": "莫金 asks Weto to delay the Chinese team at Puerto Putumayo.",
      "level": 1
    },
    {
      "id": "88",
      "text": "Weto agrees to help, and they discuss the possibility of acquiring more African crystals.",
      "level": 1
    },
    {
      "id": "89",
      "text": "莫金 discards the cocaine he purchased, explaining it's not a profitable or safe item to carry.",
      "level": 1
    },
    {
      "id": "90",
      "text": "莫金 explains his strategy of using local armed groups and drug traffickers to hinder the Chinese team.",
      "level": 1
    },
    {
      "id": "91",
      "text": "The team flies to Quito and hires a local interpreter named Kesar.",
      "level": 1
    },
    {
      "id": "92",
      "text": "Kesar is an Indo-European mixed-race man who teaches English and has translation experience.",
      "level": 1
    },
    {
      "id": "93",
      "text": "Most of their equipment had to be left behind due to strict customs.",
      "level": 1
    },
    {
      "id": "94",
      "text": "Kesar is surprised by the extensive shopping list.",
      "level": 1
    },
    {
      "id": "95",
      "text": "They are advised that more tools can be purchased in Puerto Putumayo.",
      "level": 1
    },
    {
      "id": "96",
      "text": "Puerto Putumayo is described as a developing port town, with the surrounding jungle being the true wilderness.",
      "level": 1
    },
    {
      "id": "97",
      "text": "The team plans to settle in Puerto Putumayo for a day to prepare before heading to Santa Maria via the river.",
      "level": 1
    },
    {
      "id": "98",
      "text": "Kesar will not accompany them into the jungle, citing its extreme danger.",
      "level": 1
    },
    {
      "id": "99",
      "text": "They are settled into the home of a local man named Holman.",
      "level": 1
    },
    {
      "id": "100",
      "text": "卓木强巴 and 巴桑, with Kesar, go to purchase mountaineering equipment.",
      "level": 1
    },
    {
      "id": "101",
      "text": "张立 and 岳阳, with Holman, go to purchase weapons and other supplies.",
      "level": 1
    },
    {
      "id": "102",
      "text": "卓木强巴 and 巴桑 have a smooth shopping experience in town.",
      "level": 1
    },
    {
      "id": "103",
      "text": "During a break at an ice bar, a group of indigenous men causes a disturbance.",
      "level": 1
    },
    {
      "id": "104",
      "text": "The indigenous men, decorated with tribal markings, are arguing with a woman.",
      "level": 1
    },
    {
      "id": "105",
      "text": "卓木强巴 intervenes when one of the men is about to hit the woman.",
      "level": 1
    },
    {
      "id": "106",
      "text": "The man challenges 卓木强巴 to an arm wrestle.",
      "level": 1
    },
    {
      "id": "107",
      "text": "卓木强巴 loses the first round due to miscalculation.",
      "level": 1
    },
    {
      "id": "108",
      "text": "卓木强巴 wins the second round by using his left arm, which is stronger.",
      "level": 1
    },
    {
      "id": "109",
      "text": "The indigenous man's sister, Baba-Tu, explains her brother respects strong men and was impressed by 卓木强巴's strength.",
      "level": 1
    },
    {
      "id": "110",
      "text": "Baba-Tu advises them about dangerous directions for exploration.",
      "level": 1
    },
    {
      "id": "111",
      "text": "They encounter a snake charmer in the street.",
      "level": 1
    }
  ],
  "concepts": [
    {
      "name": "亚拉喇嘛",
      "frequency": 13,
      "context": "A key character involved in planning and discussing the expedition, often guiding the trainees."
    },
    {
      "name": "吕竞男",
      "frequency": 11,
      "context": "A significant character involved in discussions, planning, and announcing the training tests."
    },
    {
      "name": "光照下的城堡",
      "frequency": 9,
      "context": "The central mysterious object or location being sought after."
    },
    {
      "name": "亚马逊丛林",
      "frequency": 14,
      "context": "The primary setting for the next phase of the adventure, described as dangerous and mysterious."
    },
    {
      "name": "玛雅文明",
      "frequency": 7,
      "context": "An ancient civilization linked to the clues and potential location of the treasure."
    },
    {
      "name": "卓木强巴",
      "frequency": 26,
      "context": "The main protagonist, undergoing rigorous training and facing direct challenges."
    },
    {
      "name": "中期考试",
      "frequency": 4,
      "context": "The upcoming training exercise or challenge for the team."
    },
    {
      "name": "牛二娃",
      "frequency": 9,
      "context": "An antagonist with a personal vendetta against 卓木强巴."
    },
    {
      "name": "莫金",
      "frequency": 11,
      "context": "A rival figure who is also searching for the treasure and manipulating events."
    },
    {
      "name": "马索",
      "frequency": 8,
      "context": "莫金's associate, assisting him in his plans."
    },
    {
      "name": "普图马约",
      "frequency": 8,
      "context": "A key location for the start of the expedition and a place where preparations are made."
    },
    {
      "name": "圣玛丽亚",
      "frequency": 2,
      "context": "The destination for the expedition."
    },
    {
      "name": "克萨",
      "frequency": 7,
      "context": "The hired interpreter who assists the team in Ecuador."
    },
    {
      "name": "印第安人",
      "frequency": 7,
      "context": "Indigenous people encountered, with specific tribal customs and beliefs mentioned."
    },
    {
      "name": "张立",
      "frequency": 11,
      "context": "A member of 卓木强巴's team, often involved in combat and discussions."
    },
    {
      "name": "岳阳",
      "frequency": 6,
      "context": "A member of 卓木强巴's team, involved in discussions and providing information."
    },
    {
      "name": "巴桑",
      "frequency": 6,
      "context": "A member of 卓木强巴's team, characterized by his stoicism."
    },
    {
      "name": "唐敏",
      "frequency": 4,
      "context": "A character who shows concern for 卓木强巴."
    },
    {
      "name": "方新教授",
      "frequency": 3,
      "context": "A character providing equipment and support to the team."
    },
    {
      "name": "工具",
      "frequency": 5,
      "context": "Essential items for survival and progress in the jungle."
    },
    {
      "name": "地图",
      "frequency": 3,
      "context": "A tool used for navigation and planning."
    },
    {
      "name": "韦托",
      "frequency": 3,
      "context": "A local contact in Puerto Asis who assists 莫金."
    },
    {
      "name": "巴巴-兔",
      "frequency": 3,
      "context": "An indigenous woman with an influential brother, who interacts with 卓木强巴."
    },
    {
      "name": "蜜熊-利爪",
      "frequency": 1,
      "context": "Baba-Tu's brother, a strong indigenous warrior."
    }
  ],
  "relations": [
    {
      "source": "亚拉喇嘛",
      "target": "吕竞男",
      "type": "discusses_with"
    },
    {
      "source": "光照下的城堡",
      "target": "帕巴拉神庙",
      "type": "mentioned_in_context_of"
    },
    {
      "source": "光照下的城堡",
      "target": "亚马逊丛林",
      "type": "speculated_location_of"
    },
    {
      "source": "亚马逊丛林",
      "target": "玛雅文明",
      "type": "associated_with"
    },
    {
      "source": "卓木强巴",
      "target": "中期考试",
      "type": "participates_in"
    },
    {
      "source": "卓木强巴",
      "target": "牛二娃",
      "type": "has_conflict_with"
    },
    {
      "source": "莫金",
      "target": "卓木强巴",
      "type": "rival_of"
    },
    {
      "source": "莫金",
      "target": "光照下的城堡",
      "type": "seeks"
    },
    {
      "source": "莫金",
      "target": "哥伦比亚",
      "type": "plans_to_go_to"
    },
    {
      "source": "吕竞男",
      "target": "中期考试",
      "type": "announces"
    },
    {
      "source": "普图马约",
      "target": "卓木强巴",
      "type": "starting_point_for"
    },
    {
      "source": "普图马约",
      "target": "克萨",
      "type": "hires_interpreter_in"
    },
    {
      "source": "卓木强巴",
      "target": "工具",
      "type": "needs"
    },
    {
      "source": "印第安人",
      "target": "巴巴-兔",
      "type": "member_of"
    },
    {
      "source": "卓木强巴",
      "target": "巴巴-兔",
      "type": "interacts_with"
    },
    {
      "source": "蜜熊-利爪",
      "target": "巴巴-兔",
      "type": "brother_of"
    },
    {
      "source": "韦托",
      "target": "莫金",
      "type": "assists"
    },
    {
      "source": "韦托",
      "target": "普图马约",
      "type": "located_in"
    },
    {
      "source": "克萨",
      "target": "卓木强巴",
      "type": "translates_for"
    },
    {
      "source": "张立",
      "target": "卓木强巴",
      "type": "team_member_of"
    },
    {
      "source": "岳阳",
      "target": "卓木强巴",
      "type": "team_member_of"
    },
    {
      "source": "巴桑",
      "target": "卓木强巴",
      "type": "team_member_of"
    },
    {
      "source": "唐敏",
      "target": "卓木强巴",
      "type": "concerned_about"
    }
  ],
  "hierarchy": {
    "main_topics": [
      "Chapter 8: Departure! Amazon Jungle!",
      "The Search for the Lighted Castle",
      "The Amazon Expedition Preparation",
      "Encounter in Puerto Putumayo"
    ],
    "structure": "The document follows a narrative structure, beginning with exposition and dialogue about a new clue, moving into preparation and training, then detailing an unexpected attack and its aftermath. The latter part of the document focuses on rival activities and the detailed preparations for the upcoming expedition into the Amazon, culminating in initial encounters and challenges upon arrival in Puerto Putumayo."
  }
}