{
  "propositions": [
    {
      "id": "1",
      "text": "The story is set in December 1967, during a severe cold spell in a city considered the gateway to the capital.",
      "level": 1
    },
    {
      "id": "1.1",
      "text": "The Cultural Revolution's storm reached its peak in this year, even affecting Hong Kong.",
      "level": 2
    },
    {
      "id": "1.2",
      "text": "The 'down to the countryside' movement caused widespread unease.",
      "level": 2
    },
    {
      "id": "1.3",
      "text": "Urban life offered relative advantages compared to rural areas, with some guarantee of food and oil.",
      "level": 2
    },
    {
      "id": "1.4",
      "text": "The shadow of '度荒' (1959-1961 famine) was deeply imprinted on people's minds.",
      "level": 2
    },
    {
      "id": "2",
      "text": "Zhang Guozhong, a member of the school's revolutionary committee, was tasked with writing an article criticizing feudal superstition.",
      "level": 1
    },
    {
      "id": "2.1",
      "text": "Zhang Guozhong was a former student and now a teacher at a vocational school.",
      "level": 2
    },
    {
      "id": "2.2",
      "text": "Vocational school admission in that era was more difficult than current university admissions.",
      "level": 2
    },
    {
      "id": "2.3",
      "text": "Graduates of vocational schools were considered intellectual.",
      "level": 2
    },
    {
      "id": "3",
      "text": "Zhang Guozhong found it difficult to write a critique of the 'Mao Shan Tu Zhi' (Mao Shan Illustrated Record), a Qing Dynasty book confiscated from the school's party secretary.",
      "level": 1
    },
    {
      "id": "3.1",
      "text": "The book contained methods for subduing demons and ghosts, martial arts diagrams, unfamiliar plants and artifacts, and bizarre usage instructions.",
      "level": 2
    },
    {
      "id": "3.2",
      "text": "It also described peculiar methods for treating human ailments, such as drinking oil with ancient coins or using soil from eaves.",
      "level": 2
    },
    {
      "id": "4",
      "text": "Criticism required evidence and justification, explaining where and why something was bad and its negative impact.",
      "level": 1
    },
    {
      "id": "4.1",
      "text": "Critiquing fictional works like 'Strange Tales from a Chinese Studio' was easier.",
      "level": 2
    },
    {
      "id": "4.2",
      "text": "The 'Mao Shan Tu Zhi' seemed harmless, but the revolutionary committee demanded it be portrayed as a major tumor that had poisoned Chinese civilization for millennia.",
      "level": 2
    },
    {
      "id": "4.3",
      "text": "Zhang Guozhong struggled to find justification for this extreme criticism, as the book didn't describe human sacrifice or violence.",
      "level": 2
    },
    {
      "id": "5",
      "text": "After two weeks of reviewing the book, Zhang Guozhong's grandfather advised him that the book's writings were true and suggested he test them.",
      "level": 1
    },
    {
      "id": "5.1",
      "text": "Zhang Guozhong's family had been estranged from his grandfather due to his being labeled a 'traitor'.",
      "level": 2
    },
    {
      "id": "5.2",
      "text": "The grandfather lived in isolation in the attic due to the family's need to sever ties to avoid trouble.",
      "level": 2
    },
    {
      "id": "5.3",
      "text": "The grandfather's suggestion sparked an idea in Zhang Guozhong: to test the book's methods on someone with similar symptoms.",
      "level": 2
    },
    {
      "id": "6",
      "text": "Zhang Guozhong's search for a person with symptoms matching the book's descriptions was largely unsuccessful after visiting many households.",
      "level": 1
    },
    {
      "id": "6.1",
      "text": "He received news that Wei Lao Er, the school's party secretary, had died by suicide.",
      "level": 2
    },
    {
      "id": "6.2",
      "text": "Wei Lao Er's wife had gone mad but remained coherent, rambling about her husband's past.",
      "level": 2
    },
    {
      "id": "6.3",
      "text": "The revolutionary committee asked Zhang Guozhong to help interrogate Wei Lao Er's wife to write a critique.",
      "level": 2
    },
    {
      "id": "6.4",
      "text": "Zhang Guozhong saw this as an opportunity to test the 'Mao Shan Tu Zhi' as his wife's symptoms seemed to align with the book's descriptions.",
      "level": 2
    },
    {
      "id": "7",
      "text": "Upon arriving at Wei Lao Er's home, Zhang Guozhong found it in disarray and his wife in a state of delirium.",
      "level": 1
    },
    {
      "id": "7.1",
      "text": "Wei Lao Er's wife spoke about her past contributions and denied being a traitor.",
      "level": 2
    },
    {
      "id": "7.2",
      "text": "Xiao Liu, a member of the revolutionary committee, was puzzled by her coherent yet delusional speech, wondering if she was feigning madness to defend Wei Lao Er.",
      "level": 2
    },
    {
      "id": "8",
      "text": "Wei Lao Er's wife continued to assert her innocence, referencing her party introducer, Wang Xiangsheng.",
      "level": 1
    },
    {
      "id": "8.1",
      "text": "The students present noted the accuracy of her statement, questioning if Wei Lao Er had told her this before his death.",
      "level": 2
    },
    {
      "id": "8.2",
      "text": "They dismissed this possibility, as Wei Lao Er had been confined to the school's dormitory.",
      "level": 2
    },
    {
      "id": "8.3",
      "text": "Zhang Guozhong addressed her as 'Secretary Wei', causing surprise among the others.",
      "level": 2
    },
    {
      "id": "9",
      "text": "Zhang Guozhong convinced the others that Wei Lao Er's wife was genuinely insane and that the best approach was to humor her.",
      "level": 1
    },
    {
      "id": "9.1",
      "text": "He proposed to try a method from his hometown for treating nervous disorders.",
      "level": 2
    },
    {
      "id": "10",
      "text": "Zhang Guozhong applied vinegar-soaked pomelo leaves to Wei Lao Er's wife's forehead, a technique learned from the 'Mao Shan Tu Zhi'.",
      "level": 1
    },
    {
      "id": "10.1",
      "text": "The woman exhibited some physical reactions and then calmed down.",
      "level": 2
    },
    {
      "id": "10.2",
      "text": "Upon waking, she appeared disoriented, asking where she was.",
      "level": 2
    },
    {
      "id": "10.3",
      "text": "Zhang Guozhong attributed her recovery to a folk remedy, but privately, this event shook his conviction that the 'Mao Shan Tu Zhi' was fake, suspecting a coincidence.",
      "level": 2
    },
    {
      "id": "11",
      "text": "The story of Zhang Guozhong's 'cure' spread, but the remedy proved ineffective for other diagnosed mental health patients.",
      "level": 1
    },
    {
      "id": "11.1",
      "text": "Zhang Guozhong felt the opportunity to prove the book's falsehood was wasted and needed to find another case.",
      "level": 2
    },
    {
      "id": "11.2",
      "text": "His grandfather again suggested seeking cases in rural areas, where such occurrences were more common.",
      "level": 2
    },
    {
      "id": "12",
      "text": "Zhang Guozhong traveled to Li Village, a relatively traditional rural area near Tianjin.",
      "level": 1
    },
    {
      "id": "12.1",
      "text": "The village maintained traditional customs and a lifestyle distinct from urban fringe areas.",
      "level": 2
    },
    {
      "id": "12.2",
      "text": "Despite being established as a production team, the village had been largely untouched by the Cultural Revolution's fervor.",
      "level": 2
    },
    {
      "id": "13",
      "text": "The village leader, Captain Li, mistook Zhang Guozhong for a shaman and informed him about Li Daming, who was suffering from '撞客' (a phenomenon interpreted as spirit possession).",
      "level": 1
    },
    {
      "id": "13.1",
      "text": "Li Daming's daughter was promised to anyone who could cure her father.",
      "level": 2
    },
    {
      "id": "13.2",
      "text": "Captain Li saw Zhang Guozhong as a potential suitor if he succeeded.",
      "level": 2
    },
    {
      "id": "14",
      "text": "Zhang Guozhong learned about '撞客', which medically is termed 'hysteria' but in rural belief is seen as ghost possession.",
      "level": 1
    },
    {
      "id": "15",
      "text": "He was warmly received by the villagers, who prepared a celebratory meal for him.",
      "level": 1
    },
    {
      "id": "16",
      "text": "After being plied with alcohol, Zhang Guozhong fell asleep and woke to find Li Daming's daughter by his bedside.",
      "level": 1
    },
    {
      "id": "17",
      "text": "Zhang Guozhong felt conflicted, as he was there to disprove the 'Mao Shan Tu Zhi' but was being treated as a savior.",
      "level": 1
    },
    {
      "id": "17.1",
      "text": "He decided to proceed, hoping for a lucky outcome like before, partly out of obligation for the villagers' hospitality.",
      "level": 2
    },
    {
      "id": "18",
      "text": "Li Daming was reportedly afflicted after an ancient coffin was unearthed during dike excavation two years prior.",
      "level": 1
    },
    {
      "id": "18.1",
      "text": "He spoke in classical Chinese, claiming to be a Jinshi (successful candidate in the imperial examinations).",
      "level": 2
    },
    {
      "id": "18.2",
      "text": "His condition had led to extreme weight loss, with his daughter and relatives assisting with household chores.",
      "level": 2
    },
    {
      "id": "19",
      "text": "Zhang Guozhong attempted to interrogate Li Daming using his revolutionary committee interrogation style.",
      "level": 1
    },
    {
      "id": "19.1",
      "text": "Li Daming responded in character, identifying himself as Cheng Mingke, styled Xiangzhang, a hermit and a Jinshi from the Jiaqing era.",
      "level": 2
    },
    {
      "id": "19.2",
      "text": "Li Erya, Li Daming's daughter, was impressed by Zhang Guozhong's assertiveness, seeing it as a sign of his considerable 'skill' compared to previous practitioners.",
      "level": 2
    },
    {
      "id": "20",
      "text": "Zhang Guozhong planned to use the vinegar and pomelo leaf method again, but first intended to interrogate Li Daming to demonstrate his efforts.",
      "level": 1
    },
    {
      "id": "21",
      "text": "The provided text appears to be a repetition of previously processed content, including the interaction with Wei Lao Er's wife.",
      "level": 1
    },
    {
      "id": "22",
      "text": "The repetition suggests a narrative loop or a mistake in the provided text segmentation.",
      "level": 1
    },
    {
      "id": "23",
      "text": "The narrative then shifts to a new scene with characters Dai Jinshuang and Old Liu Tou, discussing Ge Min and Wang Ji, who are 'no longer human'.",
      "level": 1
    },
    {
      "id": "23.1",
      "text": "Dai Jinshuang's presence causes a compass to behave erratically, indicating an unusual energy.",
      "level": 2
    },
    {
      "id": "23.2",
      "text": "Old Liu Tou urges Dai Jinshuang to speak directly about what happened.",
      "level": 2
    },
    {
      "id": "24",
      "text": "Dai Jinshuang reveals that Liu Zhaotong found one of the iron coffins to have 'yang energy' (positive energy/life force) while transporting them.",
      "level": 1
    },
    {
      "id": "24.1",
      "text": "This phenomenon is inexplicable by traditional Mao Shan theories.",
      "level": 2
    },
    {
      "id": "24.2",
      "text": "Liu Zhaotong refrained from opening the coffin, but Dai Jinshuang lacked the same restraint.",
      "level": 2
    },
    {
      "id": "25",
      "text": "Zhang Guozhong infers that Dai Jinshuang opened Ge Min's coffin because it also had 'yang energy'.",
      "level": 1
    },
    {
      "id": "25.1",
      "text": "Dai Jinshuang states his motive was to check if Ge Min was truly dead, fearing he was buried alive due to a coma.",
      "level": 2
    },
    {
      "id": "26",
      "text": "The narrative mentions that a group of villagers from the mountains performed the Mao Shan technique of 'Ju Hun Da Zhen' (Great Soul Gathering Formation).",
      "level": 1
    },
    {
      "id": "26.1",
      "text": "The coffin at the formation's core contained 'Immortal Ge'.",
      "level": 2
    }
  ],
  "concepts": [
    {
      "name": "Cultural Revolution",
      "frequency": 3,
      "context": "Mentioned as the backdrop of the story, influencing the social and political climate."
    },
    {
      "name": "Mao Shan Tu Zhi",
      "frequency": 8,
      "context": "The central object of Zhang Guozhong's critique, a book detailing supernatural and mystical practices."
    },
    {
      "name": "Zhang Guozhong",
      "frequency": 14,
      "context": "The protagonist, tasked with criticizing the 'Mao Shan Tu Zhi', who is also experimenting with its methods."
    },
    {
      "name": "Revolutionary Committee",
      "frequency": 7,
      "context": "The governing body that assigns Zhang Guozhong his task and oversees political critiques."
    },
    {
      "name": "Feudal superstition",
      "frequency": 2,
      "context": "The target of Zhang Guozhong's required article, representing traditional beliefs the regime opposed."
    },
    {
      "name": "Wei Lao Er",
      "frequency": 8,
      "context": "The school's party secretary who dies by suicide, leading to his wife's mental breakdown and Zhang Guozhong's experiment."
    },
    {
      "name": "Wei Lao Er's wife",
      "frequency": 9,
      "context": "Suffers from mental illness and becomes the subject of Zhang Guozhong's test using methods from the 'Mao Shan Tu Zhi'."
    },
    {
      "name": "撞客",
      "frequency": 4,
      "context": "A rural term for a condition interpreted as spirit possession, which Zhang Guozhong seeks to treat."
    },
    {
      "name": "Li Daming",
      "frequency": 4,
      "context": "The individual suffering from '撞客' in Li Village, whose case Zhang Guozhong investigates."
    },
    {
      "name": "Dai Jinshuang",
      "frequency": 5,
      "context": "A character who reveals information about unusual energy in coffins and 'Immortal Ge'."
    },
    {
      "name": "Yang energy",
      "frequency": 3,
      "context": "An unusual energy detected in a coffin, unexplained by traditional theories."
    },
    {
      "name": "Ge Min",
      "frequency": 3,
      "context": "A character whose coffin contains 'yang energy' and is referred to as 'Immortal Ge'."
    },
    {
      "name": "Mao Shan",
      "frequency": 3,
      "context": "The school of mystical thought and practice associated with the book and its practitioners."
    }
  ],
  "relations": [
    {
      "source": "Cultural Revolution",
      "target": "Feudal superstition",
      "type": "opposes"
    },
    {
      "source": "Mao Shan Tu Zhi",
      "target": "Feudal superstition",
      "type": "is_an_example_of"
    },
    {
      "source": "Zhang Guozhong",
      "target": "Mao Shan Tu Zhi",
      "type": "tasked_with_criticizing"
    },
    {
      "source": "Zhang Guozhong",
      "target": "Mao Shan Tu Zhi",
      "type": "tests_methods_of"
    },
    {
      "source": "Zhang Guozhong",
      "target": "Revolutionary Committee",
      "type": "is_member_of"
    },
    {
      "source": "Revolutionary Committee",
      "target": "Wei Lao Er",
      "type": "investigates"
    },
    {
      "source": "Wei Lao Er's wife",
      "target": "Wei Lao Er",
      "type": "is_spouse_of"
    },
    {
      "source": "Wei Lao Er's wife",
      "target": "Mao Shan Tu Zhi",
      "type": "symptoms_match"
    },
    {
      "source": "Zhang Guozhong",
      "target": "Wei Lao Er's wife",
      "type": "treats_using_Mao_Shan_methods"
    },
    {
      "source": "撞客",
      "target": "Hysteria",
      "type": "is_rural_term_for"
    },
    {
      "source": "Li Daming",
      "target": "撞客",
      "type": "suffers_from"
    },
    {
      "source": "Zhang Guozhong",
      "target": "Li Daming",
      "type": "attempts_to_treat"
    },
    {
      "source": "Dai Jinshuang",
      "target": "Yang energy",
      "type": "discovers_in_coffin"
    },
    {
      "source": "Ge Min",
      "target": "Yang energy",
      "type": "coffin_has"
    },
    {
      "source": "Ge Min",
      "target": "Immortal Ge",
      "type": "is_also_called"
    },
    {
      "source": "Ju Hun Da Zhen",
      "target": "Mao Shan",
      "type": "is_a_technique_of"
    },
    {
      "source": "Dai Jinshuang",
      "target": "Liu Zhaotong",
      "type": "receives_information_from"
    }
  ],
  "hierarchy": {
    "main_topics": [
      "Historical and Social Context (1967 China)",
      "Critique of Traditional Beliefs ('Mao Shan Tu Zhi')",
      "Supernatural Encounters and Medical Mysteries",
      "The Nature of Belief and Evidence"
    ],
    "structure": "The document is structured chronologically, following Zhang Guozhong's investigative journey. It begins with the socio-political context, introduces the central conflict of critiquing a mystical text, follows his attempts to test its efficacy, and concludes with the introduction of new characters and unfolding mysteries related to 'yang energy' and 'Immortal Ge'. The narrative moves from urban settings to rural ones."
  }
}