{
  "propositions": [
    {
      "id": "1",
      "text": "The protagonist plans to investigate the background of 'Mian You Ping' by gathering information, with Fatty responsible for equipment preparation.",
      "level": 1
    },
    {
      "id": "1.1",
      "text": "The protagonist realizes that official channels might be the best way to understand 'Mian You Ping''s background, possibly through archival records from an 80s archaeological team.",
      "level": 2
    },
    {
      "id": "1.1.1",
      "text": "Accessing personnel archives from that era is difficult due to confidentiality and the likely classified nature of the archaeological project.",
      "level": 3
    },
    {
      "id": "1.2",
      "text": "The protagonist identifies a potential lead by finding an old research institute merged into a university campus.",
      "level": 2
    },
    {
      "id": "1.2.1",
      "text": "The university is undergoing relocation, increasing the urgency to access the archives.",
      "level": 3
    },
    {
      "id": "1.3",
      "text": "After significant effort and connections, the protagonist gains access to the archives with the help of an institute employee named Du Juanshan.",
      "level": 2
    },
    {
      "id": "1.3.1",
      "text": "Du Juanshan warns that old archives are difficult to access and advises against high expectations.",
      "level": 3
    },
    {
      "id": "1.4",
      "text": "The protagonist searches the dark, dusty archive basement, filled with shelves of old document bags.",
      "level": 2
    },
    {
      "id": "1.4.1",
      "text": "Archives from 1995 onwards have been moved, leaving only long-term, unaccessed documents.",
      "level": 3
    },
    {
      "id": "1.5",
      "text": "Despite meticulous searching by year, no documents related to the 'Xisha archaeological project' are found.",
      "level": 2
    },
    {
      "id": "1.6",
      "text": "Du Juanshan suggests the archives might be in a classified section or destroyed.",
      "level": 2
    },
    {
      "id": "1.7",
      "text": "The protagonist leaves frustrated, considering the possibility that 'Mian You Ping' is truly disconnected from the world.",
      "level": 2
    },
    {
      "id": "1.8",
      "text": "The protagonist notices a locked door leading to an older archive level, dating back to before the 1950s, sealed during the Cultural Revolution.",
      "level": 2
    },
    {
      "id": "2",
      "text": "Upon closer inspection, the protagonist discovers the chain on the door to the older archive level has been cut, and a seal has been applied later.",
      "level": 1
    },
    {
      "id": "2.1",
      "text": "The protagonist notices a seal on the door with the inscription: 'July 6, 1990, XX University Archaeological Research Institute Seal.'",
      "level": 2
    },
    {
      "id": "2.1.1",
      "text": "The protagonist recognizes the handwriting on the seal as their own.",
      "level": 3
    },
    {
      "id": "2.2",
      "text": "The protagonist, disbelieving, returns to the university late at night with Wang Meng to verify the seal.",
      "level": 2
    },
    {
      "id": "2.3",
      "text": "The protagonist confirms the handwriting is their own, leading to profound confusion and a resurgence of past head-splitting pain.",
      "level": 2
    },
    {
      "id": "2.3.1",
      "text": "The protagonist recalls a video of someone resembling them crawling in Golmud and a previous statement by 'Third Uncle' about 'Wen Jin' not being simple.",
      "level": 3
    },
    {
      "id": "2.4",
      "text": "The protagonist decides to investigate the area behind the seal, hypothesizing a connection between 'themselves' and the research institute.",
      "level": 2
    },
    {
      "id": "2.5",
      "text": "They force open the rusted chain and enter the lower level, which is a cluttered storage room.",
      "level": 2
    },
    {
      "id": "2.6",
      "text": "Following footprints, they discover large wooden boxes and, behind one, a hidden alcove containing piles of archives.",
      "level": 2
    },
    {
      "id": "3",
      "text": "Within the hidden archives, the protagonist finds a damaged document detailing the 'Shangsi Zhangjiapu Site Archaeological Project Outsourced Personnel Subsidy Table'.",
      "level": 1
    },
    {
      "id": "3.1",
      "text": "Wang Meng observes that the placement of some files suggests they were used as a makeshift seat, with cigarette butts indicating someone sat there for an extended period.",
      "level": 2
    },
    {
      "id": "3.2",
      "text": "The protagonist, by replicating their own file-handling habits, deduces the position where the person was likely examining documents.",
      "level": 2
    },
    {
      "id": "3.3",
      "text": "The protagonist discovers a set of architectural drawings labeled 'Yangshilei' (a renowned Qing Dynasty designer family), indicating a connection to the Zhangjiapu site, possibly from the Qing Dynasty.",
      "level": 2
    },
    {
      "id": "3.3.1",
      "text": "The 'Yangshilei' drawings depict a large courtyard house, likely belonging to a high-ranking official or person of influence.",
      "level": 3
    },
    {
      "id": "3.3.2",
      "text": "Some of the drawings are missing, suggesting they were taken by the individual who examined the archives.",
      "level": 3
    },
    {
      "id": "3.4",
      "text": "The protagonist finds a cage-like structure in the storage room, questioning its purpose.",
      "level": 2
    },
    {
      "id": "3.5",
      "text": "The protagonist researches the 'Shangsi Zhangjiapu site' and 'Yangshilei' but finds limited online information.",
      "level": 2
    },
    {
      "id": "3.6",
      "text": "The protagonist consults an elder acquaintance, a former garden design institute employee specializing in ancient architecture repair, about the 'Yangshilei' drawings.",
      "level": 2
    },
    {
      "id": "3.7",
      "text": "The elder identifies the house design as a 'dark room,' intended to avoid sunlight, leading to speculation about the inhabitant's condition.",
      "level": 2
    },
    {
      "id": "3.8",
      "text": "The elder suggests the design might resemble requirements for an 'yizhuang' (a place for storing coffins and ancestral tablets) but notes the house's scale suggests otherwise, likely a Ming or Qing dynasty residence.",
      "level": 2
    },
    {
      "id": "3.9",
      "text": "The elder shares a legend about 'Yangshilei' designing parts for secret Manchu imperial tombs outside of the Great Wall, potentially in the Changbai Mountains or Xiao Hinggan Mountains.",
      "level": 2
    },
    {
      "id": "4",
      "text": "Two brokers, Ruan and Fang, approach the protagonist, expressing interest in purchasing the 'Yangshilei' drawing on behalf of a mysterious woman known as 'Huo Xiangu' (Grandmother Huo).",
      "level": 1
    },
    {
      "id": "4.1",
      "text": "The protagonist recognizes the broker Ruan as having 'coffin calluses,' suggesting he might be involved in grave robbing.",
      "level": 2
    },
    {
      "id": "4.2",
      "text": "The protagonist politely refuses to sell the drawing, stating it has personal use and that selling it at the offered price would damage their reputation.",
      "level": 2
    },
    {
      "id": "4.3",
      "text": "The brokers persist, asking the protagonist to name their price.",
      "level": 2
    },
    {
      "id": "4.4",
      "text": "The protagonist suggests a face-to-face meeting with their principal to discuss the matter.",
      "level": 2
    },
    {
      "id": "4.5",
      "text": "The brokers reveal their principal is 'Huo Laotai' (Old Madam Huo), also known as 'Huo Xiangu,' a prominent and reclusive figure in Beijing's underground antique circles, and the third daughter of the influential Huo family from the 'Nine Gates of Changsha.'",
      "level": 2
    },
    {
      "id": "4.6",
      "text": "The elder acquaintance, Zheng Fuzhong, reveals his connection to the Huo family and offers to facilitate a meeting.",
      "level": 2
    },
    {
      "id": "4.7",
      "text": "The protagonist decides to bring Fatty and 'Mian You Ping' to the meeting, despite concerns about their reliability.",
      "level": 2
    },
    {
      "id": "4.8",
      "text": "The meeting is scheduled at the 'Xinyue Hotel' (New Moon Hotel) in Beijing, a high-end establishment for antique collectors.",
      "level": 2
    },
    {
      "id": "5",
      "text": "At the Xinyue Hotel, the protagonist, Fatty, and 'Mian You Ping' encounter a person who seems familiar to the protagonist.",
      "level": 1
    },
    {
      "id": "5.1",
      "text": "The hotel staff notes the unusual presence of 'Mian You Ping' and guides the group away from the familiar individual.",
      "level": 2
    },
    {
      "id": "5.2",
      "text": "Fatty informs the protagonist that the Xinyue Hotel hosts high-stakes auctions and that Huo Xiangu is likely attending one.",
      "level": 2
    }
  ],
  "concepts": [
    {
      "name": "Mian You Ping",
      "frequency": 10,
      "context": "The subject of the protagonist's investigation into his background and identity."
    },
    {
      "name": "Protagonist",
      "frequency": 30,
      "context": "The narrator of the story, actively investigating 'Mian You Ping''s past and uncovering personal mysteries."
    },
    {
      "name": "Fatty",
      "frequency": 15,
      "context": "The protagonist's companion, responsible for logistics and often providing comic relief and worldly insights."
    },
    {
      "name": "Third Uncle",
      "frequency": 4,
      "context": "A mysterious figure whose past actions and statements are relevant to the ongoing investigation."
    },
    {
      "name": "Archives",
      "frequency": 12,
      "context": "Key locations and sources of information, central to the investigation, particularly old and potentially classified records."
    },
    {
      "name": "Archaeological Team",
      "frequency": 5,
      "context": "A specific group from the 1980s whose records are sought, possibly linked to 'Mian You Ping'."
    },
    {
      "name": "Research Institute",
      "frequency": 6,
      "context": "The institution whose merged archives become a crucial lead in the investigation."
    },
    {
      "name": "University",
      "frequency": 5,
      "context": "The location where the old research institute's archives are housed, facing relocation."
    },
    {
      "name": "Du Juanshan",
      "frequency": 4,
      "context": "An employee who assists the protagonist in accessing the archives."
    },
    {
      "name": "Seal",
      "frequency": 8,
      "context": "A significant clue found on a locked door, bearing the protagonist's own handwriting from 1990."
    },
    {
      "name": "Handwriting",
      "frequency": 7,
      "context": "The protagonist's own writing on the seal, creating a profound personal mystery."
    },
    {
      "name": "Yangshilei",
      "frequency": 15,
      "context": "A Qing Dynasty architectural design family whose drawings are discovered, linked to an archaeological site and a secretive house design."
    },
    {
      "name": "Zhangjiapu Site",
      "frequency": 3,
      "context": "An archaeological site in Shangsi, Guangxi, linked to the Yangshilei drawings and a subsidy table."
    },
    {
      "name": "Dark Room",
      "frequency": 2,
      "context": "A feature of the Yangshilei house design, indicating a deliberate avoidance of sunlight."
    },
    {
      "name": "Huo Xiangu",
      "frequency": 8,
      "context": "A mysterious and influential woman who wants to purchase the Yangshilei drawing, head of the influential Huo family."
    },
    {
      "name": "Brokers (Ruan, Fang)",
      "frequency": 5,
      "context": "Intermediaries negotiating the purchase of the drawing for Huo Xiangu."
    },
    {
      "name": "Xinyue Hotel",
      "frequency": 4,
      "context": "A high-end Beijing establishment for antique collectors, where the meeting with Huo Xiangu is scheduled."
    },
    {
      "name": "Wang Meng",
      "frequency": 3,
      "context": "Another companion of the protagonist, often tasked with physical assistance."
    },
    {
      "name": "Old Elder Acquaintance (Zheng Fuzhong)",
      "frequency": 5,
      "context": "A knowledgeable elder who provides historical context and assists in arranging the meeting with Huo Xiangu."
    },
    {
      "name": "Manchu Imperial Tombs",
      "frequency": 2,
      "context": "A legendary burial site outside the Great Wall, potentially designed by Yangshilei, as suggested by the elder."
    }
  ],
  "relations": [
    {
      "source": "Protagonist",
      "target": "Mian You Ping",
      "type": "investigates"
    },
    {
      "source": "Protagonist",
      "target": "Fatty",
      "type": "collaborates with"
    },
    {
      "source": "Protagonist",
      "target": "Archives",
      "type": "searches"
    },
    {
      "source": "Protagonist",
      "target": "Seal",
      "type": "discovers own handwriting on"
    },
    {
      "source": "Protagonist",
      "target": "Yangshilei drawings",
      "type": "finds"
    },
    {
      "source": "Protagonist",
      "target": "Huo Xiangu",
      "type": "negotiates with"
    },
    {
      "source": "Protagonist",
      "target": "Wang Meng",
      "type": "accompanies"
    },
    {
      "source": "Protagonist",
      "target": "Old Elder Acquaintance",
      "type": "consults"
    },
    {
      "source": "Fatty",
      "target": "Protagonist",
      "type": "assists"
    },
    {
      "source": "Archives",
      "target": "Research Institute",
      "type": "belong to"
    },
    {
      "source": "Research Institute",
      "target": "University",
      "type": "merged into"
    },
    {
      "source": "Du Juanshan",
      "target": "Protagonist",
      "type": "assists"
    },
    {
      "source": "Yangshilei drawings",
      "target": "Zhangjiapu Site",
      "type": "relates to"
    },
    {
      "source": "Yangshilei drawings",
      "target": "Dark Room",
      "type": "depicts"
    },
    {
      "source": "Yangshilei drawings",
      "target": "Manchu Imperial Tombs",
      "type": "potentially designed for"
    },
    {
      "source": "Huo Xiangu",
      "target": "Brokers",
      "type": "employs"
    },
    {
      "source": "Huo Xiangu",
      "target": "Xinyue Hotel",
      "type": "frequents"
    },
    {
      "source": "Old Elder Acquaintance",
      "target": "Protagonist",
      "type": "advises"
    },
    {
      "source": "Old Elder Acquaintance",
      "target": "Yangshilei",
      "type": "provides knowledge on"
    }
  ],
  "hierarchy": {
    "main_topics": [
      "Investigation into Mian You Ping",
      "Discovery of Personal Mysteries",
      "Archaeological and Historical Clues",
      "Encounter with Powerful Figures"
    ],
    "structure": "The document is structured as a chronological narrative detailing an investigation that uncovers personal mysteries, historical secrets, and leads to interactions with powerful, enigmatic individuals. It progresses through a series of discoveries and encounters, building suspense."
  }
}