{
  "propositions": [
    {
      "id": "1",
      "text": "A narrative about \"Huanghe Guiguan 4 - Mawang Guiyao (Grand Finale)\" by Nanpaisanshu.",
      "level": 1
    },
    {
      "id": "1.1",
      "text": "The story is available for download and reading on TXT Xiaoshuotxt.com.",
      "level": 2
    },
    {
      "id": "2",
      "text": "Chapter 1: Longguai.",
      "level": 1
    },
    {
      "id": "2.1",
      "text": "The narrator and companions encounter a moving coffin.",
      "level": 2
    },
    {
      "id": "2.1.1",
      "text": "The narrator is frozen with fear, questioning the reanimation of an ancient corpse.",
      "level": 3
    },
    {
      "id": "2.2",
      "text": "A hidden mechanism triggers, causing the narrator to fall into darkness.",
      "level": 2
    },
    {
      "id": "2.2.1",
      "text": "The narrator experiences a feeling of falling into hell, contemplating an end to his terror-filled life.",
      "level": 3
    },
    {
      "id": "2.3",
      "text": "The narrator lands in water, tasting familiar rotten sand and soil.",
      "level": 2
    },
    {
      "id": "2.3.1",
      "text": "He manages to resurface, his headlamp providing a dim light.",
      "level": 3
    },
    {
      "id": "2.4",
      "text": "The narrator calls out for his companions (Shaoye, Yatu, Huang Zhihua) but receives no response.",
      "level": 2
    },
    {
      "id": "2.4.1",
      "text": "He suspects they were separated by the mechanism.",
      "level": 3
    },
    {
      "id": "2.5",
      "text": "While swimming, the narrator feels a tap on his back.",
      "level": 2
    },
    {
      "id": "2.5.1",
      "text": "He turns to find nothing but darkness and water.",
      "level": 3
    },
    {
      "id": "2.5.2",
      "text": "He touches the spot and feels something sensitive that quickly recoils and drops into the water.",
      "level": 3
    },
    {
      "id": "2.5.3",
      "text": "Fear washes over him, but after a moment, he draws his bronze sword.",
      "level": 3
    },
    {
      "id": "2.5.4",
      "text": "He hears a groan-like sound as he slashes the water.",
      "level": 3
    },
    {
      "id": "2.6",
      "text": "He hears Shaoye calling him and swims towards the sound.",
      "level": 2
    },
    {
      "id": "2.7",
      "text": "He encounters a seemingly solid water barrier and finds Shaoye and Huang Zhihua on a platform.",
      "level": 2
    },
    {
      "id": "2.7.1",
      "text": "Their flashlights are weak and flickering.",
      "level": 3
    },
    {
      "id": "2.8",
      "text": "Shaoye asks if he's seen Yatu.",
      "level": 2
    },
    {
      "id": "2.8.1",
      "text": "The narrator is shocked to learn Yatu is not with them.",
      "level": 3
    },
    {
      "id": "2.9",
      "text": "Huang Zhihua, looking weary, confirms Yatu is missing.",
      "level": 2
    },
    {
      "id": "2.10",
      "text": "The narrator urges them to find Yatu, fearing her fate in the dark underground world.",
      "level": 2
    },
    {
      "id": "2.11",
      "text": "Shaoye claims they've searched everywhere.",
      "level": 2
    },
    {
      "id": "2.12",
      "text": "The narrator recalls a golden maiden image seen previously, resembling Yatu.",
      "level": 2
    },
    {
      "id": "2.12.1",
      "text": "He dismisses the thought, trying to comfort himself that Yatu will be fine, despite the uncanny resemblance.",
      "level": 3
    },
    {
      "id": "2.13",
      "text": "He questions who was standing next to Yatu when the mechanism activated.",
      "level": 2
    },
    {
      "id": "2.13.1",
      "text": "Huang Zhihua states Yatu was in front of him.",
      "level": 3
    },
    {
      "id": "2.14",
      "text": "He asks if Yatu fell with them, which Huang Zhihua cannot confirm due to the chaos.",
      "level": 2
    },
    {
      "id": "2.15",
      "text": "Shaoye asks if anyone heard Yatu cry out during the fall, to which both the narrator and Huang Zhihua reply 'no'.",
      "level": 2
    },
    {
      "id": "2.16",
      "text": "The narrator suggests finding a way up.",
      "level": 2
    },
    {
      "id": "2.17",
      "text": "Shaoye despairs, shaking his head.",
      "level": 2
    },
    {
      "id": "2.18",
      "text": "The narrator inspects the ceiling, which remains dark and appears endless.",
      "level": 2
    },
    {
      "id": "2.19",
      "text": "A loud rumbling sound, like thunder, emanates from the water.",
      "level": 2
    },
    {
      "id": "2.20",
      "text": "A lightning flash illuminates the dark, turbid water.",
      "level": 2
    },
    {
      "id": "2.21",
      "text": "Huang Zhihua curses the apparent thunder and lightning.",
      "level": 2
    },
    {
      "id": "2.22",
      "text": "The narrator recalls a similar phenomenon with thunder and rain in the tomb chamber.",
      "level": 2
    },
    {
      "id": "2.23",
      "text": "Shaoye points to a disturbance on the water's surface.",
      "level": 2
    },
    {
      "id": "2.24",
      "text": "A massive creature emerges from the water.",
      "level": 2
    },
    {
      "id": "2.24.1",
      "text": "It has a huge body with golden-yellow scales and resembles a Chinese dragon.",
      "level": 3
    },
    {
      "id": "2.25",
      "text": "Shaoye identifies it as a 'Dragon'.",
      "level": 2
    },
    {
      "id": "2.26",
      "text": "The narrator contemplates the existence of dragons and the possibility of it being related to 'Huashe Longgu' (化蛇龙骨).",
      "level": 2
    },
    {
      "id": "2.27",
      "text": "Huang Zhihua fires his gun at the creature.",
      "level": 2
    },
    {
      "id": "2.28",
      "text": "A terrifying roar erupts, shaking the underground world.",
      "level": 2
    },
    {
      "id": "2.29",
      "text": "The wounded creature reveals its head, described as monstrous with scaled, tentacled, dragon-like horns, glowing green eyes, and a snake-like tongue with fangs.",
      "level": 2
    },
    {
      "id": "2.30",
      "text": "The narrator internally questions its species, calling it a 'monster'.",
      "level": 2
    },
    {
      "id": "2.31",
      "text": "Shaoye speculates it's a hybrid of a dragon and snake.",
      "level": 2
    },
    {
      "id": "2.32",
      "text": "Huang Zhihua suggests it might be a dragon and fish hybrid.",
      "level": 2
    },
    {
      "id": "2.33",
      "text": "Huang Zhihua fires three more shots, hitting the creature's head and eye, but it continues to approach.",
      "level": 2
    },
    {
      "id": "2.34",
      "text": "Shaoye suggests running, but they are on a water platform with no escape route in the water.",
      "level": 2
    },
    {
      "id": "2.35",
      "text": "The narrator draws his bronze sword to protect the others.",
      "level": 2
    },
    {
      "id": "2.36",
      "text": "The narrator has a horrifying thought: the water platform might be an altar for sacrificing to the creature.",
      "level": 2
    },
    {
      "id": "2.37",
      "text": "He attacks the approaching dragon-monster.",
      "level": 2
    },
    {
      "id": "2.38",
      "text": "Huang Zhihua jumps into the water with his bayonet to attack.",
      "level": 2
    },
    {
      "id": "2.39",
      "text": "The narrator is knocked away by the dragon-monster.",
      "level": 2
    },
    {
      "id": "2.40",
      "text": "Shaoye screams for help as Huang Zhihua emerges from the dragon-monster's mouth.",
      "level": 2
    },
    {
      "id": "2.41",
      "text": "The dragon-monster roars, and Huang Zhihua tries to escape.",
      "level": 2
    },
    {
      "id": "2.42",
      "text": "The narrator, despite his pain, lunges towards the dragon-monster.",
      "level": 2
    },
    {
      "id": "2.43",
      "text": "A surge of power lifts the narrator into the air, allowing him to attack the dragon-monster's head.",
      "level": 2
    },
    {
      "id": "2.44",
      "text": "He thrusts his bronze sword towards the dragon-monster's throat, prepared to die with it.",
      "level": 2
    },
    {
      "id": "2.45",
      "text": "He falls into the water near the dragon-monster, which seemingly spares him.",
      "level": 2
    },
    {
      "id": "2.46",
      "text": "Huang Zhihua pulls the narrator back, and they face the dragon-monster.",
      "level": 2
    },
    {
      "id": "2.47",
      "text": "The narrator suggests Huang Zhihua help Shaoye find an exit while he distracts the monster.",
      "level": 2
    },
    {
      "id": "2.48",
      "text": "Huang Zhihua expresses despair, believing they are trapped.",
      "level": 2
    },
    {
      "id": "2.49",
      "text": "The narrator insists it's not a dragon but an unknown underground creature and there must be an exit.",
      "level": 2
    },
    {
      "id": "2.50",
      "text": "The dragon-monster stealthily approaches the narrator.",
      "level": 2
    },
    {
      "id": "2.51",
      "text": "The narrator attacks the dragon-monster's head in anger.",
      "level": 2
    },
    {
      "id": "2.52",
      "text": "The dragon-monster dodges the sword and lunges at the narrator.",
      "level": 2
    },
    {
      "id": "2.53",
      "text": "Huang Zhihua intervenes, stabbing at the dragon-monster's throat.",
      "level": 2
    },
    {
      "id": "2.54",
      "text": "The narrator swings his sword at the dragon-monster's abdomen.",
      "level": 2
    },
    {
      "id": "2.55",
      "text": "The narrator's headlamp suddenly emits a blinding white light, causing temporary blindness.",
      "level": 2
    },
    {
      "id": "2.56",
      "text": "He realizes all their lights have failed.",
      "level": 2
    },
    {
      "id": "2.57",
      "text": "He can hear Huang Zhihua's heavy breathing nearby.",
      "level": 2
    },
    {
      "id": "2.58",
      "text": "He calls out to Huang Zhihua, stating he can't see.",
      "level": 2
    },
    {
      "id": "2.59",
      "text": "Huang Zhihua confirms their lighting tools were destroyed, not their eyesight.",
      "level": 2
    },
    {
      "id": "2.60",
      "text": "Shaoye's weak voice asks if they are alright.",
      "level": 2
    },
    {
      "id": "2.61",
      "text": "The narrator replies loudly, relieved that it's not his eyes.",
      "level": 2
    },
    {
      "id": "2.62",
      "text": "Shaoye's flashlight emits a faint orange light.",
      "level": 2
    },
    {
      "id": "2.63",
      "text": "The dragon-monster has disappeared.",
      "level": 2
    },
    {
      "id": "2.64",
      "text": "Huang Zhihua asks about the dragon-monster's whereabouts.",
      "level": 2
    },
    {
      "id": "2.65",
      "text": "The narrator urges them to find an exit and Yatu.",
      "level": 2
    },
    {
      "id": "2.66",
      "text": "He feels something under him and Huang Zhihua exclaims the monster is below.",
      "level": 2
    },
    {
      "id": "2.67",
      "text": "The narrator is thrown into the air by a massive wave, with the dragon-monster's roars.",
      "level": 2
    },
    {
      "id": "2.68",
      "text": "He is bound by the dragon-monster's long tentacles around his waist, wrist, and neck.",
      "level": 2
    },
    {
      "id": "2.69",
      "text": "He struggles, but the tentacles tighten, and he experiences immense pain.",
      "level": 2
    },
    {
      "id": "2.70",
      "text": "He hallucinates a scene of war and bloodshed.",
      "level": 2
    },
    {
      "id": "2.71",
      "text": "He realizes these are hallucinations and the dragon-monster is still present.",
      "level": 2
    },
    {
      "id": "2.72",
      "text": "The dragon-monster's tentacles suddenly loosen, and something else binds him.",
      "level": 2
    },
    {
      "id": "2.73",
      "text": "He recognizes it as the 'Huashé' (化蛇).",
      "level": 2
    },
    {
      "id": "2.74",
      "text": "The dragon-monster bites at the Huashé's tail.",
      "level": 2
    },
    {
      "id": "2.75",
      "text": "The Huashé throws the narrator into the air and attacks the dragon-monster.",
      "level": 2
    },
    {
      "id": "2.76",
      "text": "The narrator swims towards Huang Zhihua, who is trying to rescue him.",
      "level": 2
    },
    {
      "id": "2.77",
      "text": "Shaoye acts as a flashlight.",
      "level": 2
    },
    {
      "id": "2.78",
      "text": "The two monsters clash, and the narrator is caught by the Huashé's tail.",
      "level": 2
    },
    {
      "id": "2.79",
      "text": "He is pulled towards the water platform.",
      "level": 2
    },
    {
      "id": "2.80",
      "text": "Shaoye expresses relief that they are alive.",
      "level": 2
    },
    {
      "id": "2.81",
      "text": "The narrator wonders where the exit is and if Yatu was eaten by one of the monsters.",
      "level": 2
    },
    {
      "id": "3",
      "text": "Chapter 2: Crystal Palace.",
      "level": 1
    },
    {
      "id": "3.1",
      "text": "Shaoye urges them to run from the fighting monsters.",
      "level": 2
    },
    {
      "id": "3.2",
      "text": "The narrator angrily refuses, citing the lack of escape routes and Yatu's disappearance.",
      "level": 2
    },
    {
      "id": "3.3",
      "text": "He observes the vast underground water body capable of sustaining such monsters.",
      "level": 2
    },
    {
      "id": "3.4",
      "text": "The dragon-monster gains the upper hand against the Huashé.",
      "level": 2
    },
    {
      "id": "3.5",
      "text": "The narrator feels an inexplicable urge to help the Huashé.",
      "level": 2
    },
    {
      "id": "3.6",
      "text": "He jumps back into the water towards the fighting monsters.",
      "level": 2
    },
    {
      "id": "3.7",
      "text": "Shaoye shouts in alarm.",
      "level": 2
    },
    {
      "id": "3.8",
      "text": "The narrator attacks the dragon-monster's head with his bronze sword.",
      "level": 2
    },
    {
      "id": "3.9",
      "text": "The dragon-monster, surprised by the intervention, roars in pain.",
      "level": 2
    },
    {
      "id": "3.10",
      "text": "The narrator retreats as the monsters separate.",
      "level": 2
    },
    {
      "id": "3.11",
      "text": "The Huashé turns to attack the narrator, who is angered by the betrayal.",
      "level": 2
    },
    {
      "id": "3.12",
      "text": "The Huashé dives into the water, then lifts the narrator into the air.",
      "level": 2
    },
    {
      "id": "3.13",
      "text": "Shaoye and Huang Zhihua watch from the platform.",
      "level": 2
    },
    {
      "id": "3.14",
      "text": "The narrator, standing on the Huashé, stabs the dragon-monster's throat.",
      "level": 2
    },
    {
      "id": "3.15",
      "text": "The dragon-monster shrinks to human size and disappears into the water.",
      "level": 2
    },
    {
      "id": "3.16",
      "text": "The narrator is shocked by the dragon-monster's retreat.",
      "level": 2
    },
    {
      "id": "3.17",
      "text": "He prepares to attack the Huashé, which also dives into the water, taking him with it.",
      "level": 2
    },
    {
      "id": "3.18",
      "text": "He is submerged in the cold, turbid water, tasting familiar rotten sand and soil.",
      "level": 2
    },
    {
      "id": "3.19",
      "text": "The Huashé inexplicably vanishes.",
      "level": 2
    },
    {
      "id": "3.20",
      "text": "The narrator realizes the creatures are not entirely real and are tied to the ancient tomb.",
      "level": 2
    },
    {
      "id": "3.21",
      "text": "Something pulls his leg underwater.",
      "level": 2
    },
    {
      "id": "3.22",
      "text": "He kicks out and steps on something round, possibly a head.",
      "level": 2
    },
    {
      "id": "3.23",
      "text": "He surfaces, gasping for air, and is urged by Shaoye and Huang Zhihua to climb onto the platform.",
      "level": 2
    },
    {
      "id": "3.24",
      "text": "Huang Zhihua complains about the narrator's recklessness.",
      "level": 2
    },
    {
      "id": "3.25",
      "text": "The narrator is disturbed by the feeling of a non-human entity underwater.",
      "level": 2
    },
    {
      "id": "3.26",
      "text": "He recalls the sixteen characters related to 'Huashé Longgu'.",
      "level": 2
    },
    {
      "id": "3.27",
      "text": "Shaoye points to a green shadow on the water.",
      "level": 2
    },
    {
      "id": "3.28",
      "text": "Huang Zhihua fires a flare, illuminating a floating corpse of a child in green clothing.",
      "level": 2
    },
    {
      "id": "3.29",
      "text": "The narrator is suspicious of the child's corpse, questioning its preservation over millennia.",
      "level": 2
    },
    {
      "id": "3.30",
      "text": "The corpse vanishes as the flare dies out.",
      "level": 2
    },
    {
      "id": "3.31",
      "text": "The narrator prefers encountering monsters over ghosts.",
      "level": 2
    },
    {
      "id": "3.32",
      "text": "He asks if anyone has a working headlamp to investigate underwater.",
      "level": 2
    },
    {
      "id": "3.33",
      "text": "Huang Zhihua offers his headlamp.",
      "level": 2
    },
    {
      "id": "3.34",
      "text": "The narrator prepares to dive, with Shaoye tying a rope around his waist as a safety measure.",
      "level": 2
    },
    {
      "id": "3.35",
      "text": "He recalls the death of Dan Jun, who was pulled up as a corpse from the Yellow River eye.",
      "level": 2
    },
    {
      "id": "3.36",
      "text": "He thinks of Yatu and his unexpressed feelings for her.",
      "level": 2
    },
    {
      "id": "3.37",
      "text": "He dives into the water, heading towards a discovered structure.",
      "level": 2
    },
    {
      "id": "3.38",
      "text": "He sees the outline of a palace-like structure underwater.",
      "level": 2
    },
    {
      "id": "3.39",
      "text": "The rope around his waist is suddenly pulled taut.",
      "level": 2
    },
    {
      "id": "3.40",
      "text": "He realizes the rope is being pulled from underwater, not by Shaoye.",
      "level": 2
    },
    {
      "id": "3.41",
      "text": "He understands how Dan Jun might have died.",
      "level": 2
    },
    {
      "id": "3.42",
      "text": "He cuts the rope with his bronze sword and attempts to surface.",
      "level": 2
    },
    {
      "id": "3.43",
      "text": "A pale, grinning face appears before him.",
      "level": 2
    },
    {
      "id": "3.44",
      "text": "He swings his sword at the figure and surfaces, gasping for air.",
      "level": 2
    },
    {
      "id": "3.45",
      "text": "He tells Shaoye and Huang Zhihua about the presence of something underwater.",
      "level": 2
    },
    {
      "id": "3.46",
      "text": "He realizes Shaoye and Huang Zhihua are gone, leaving him in darkness with only one dim headlamp.",
      "level": 2
    }
  ],
  "concepts": [
    {
      "name": "Huanghe Guiguan 4 - Mawang Guiyao",
      "frequency": 1,
      "context": "Title of the story."
    },
    {
      "name": "Nanpaisanshu",
      "frequency": 1,
      "context": "Author of the story."
    },
    {
      "name": "TXT Xiaoshuotxt.com",
      "frequency": 2,
      "context": "Website for reading and downloading the novel."
    },
    {
      "name": "Dragon",
      "frequency": 6,
      "context": "A monstrous creature encountered in the water, identified as a 'Long'."
    },
    {
      "name": "Coiffin",
      "frequency": 2,
      "context": "An object that moves on its own, initiating the events."
    },
    {
      "name": "Narrator",
      "frequency": 16,
      "context": "The first-person protagonist of the story."
    },
    {
      "name": "Shaoye",
      "frequency": 10,
      "context": "A companion of the narrator."
    },
    {
      "name": "Yatu",
      "frequency": 6,
      "context": "A missing female companion of the narrator."
    },
    {
      "name": "Huang Zhihua",
      "frequency": 12,
      "context": "A companion of the narrator, a soldier."
    },
    {
      "name": "Underground world",
      "frequency": 7,
      "context": "The dark, watery environment where the story unfolds."
    },
    {
      "name": "Bronze sword",
      "frequency": 6,
      "context": "The narrator's primary weapon."
    },
    {
      "name": "Headlamp",
      "frequency": 7,
      "context": "A light source used by the characters in the dark."
    },
    {
      "name": "Mechanism",
      "frequency": 3,
      "context": "A hidden trap or device that causes events to unfold."
    },
    {
      "name": "Huashé",
      "frequency": 9,
      "context": "Another creature encountered, described as a 'snake' or 'nine-tailed snake'."
    },
    {
      "name": "Water",
      "frequency": 22,
      "context": "The dominant element of the underground environment."
    },
    {
      "name": "Platform",
      "frequency": 6,
      "context": "A raised area on the water where characters take refuge."
    },
    {
      "name": "Monster",
      "frequency": 4,
      "context": "A general term for the terrifying creatures encountered."
    },
    {
      "name": "Rope",
      "frequency": 3,
      "context": "Used as a safety line by Shaoye."
    },
    {
      "name": "Dan Jun",
      "frequency": 3,
      "context": "A past associate of the narrator who died in the Yellow River."
    },
    {
      "name": "Crystal Palace",
      "frequency": 1,
      "context": "The title of the second chapter, possibly referring to an underwater structure."
    },
    {
      "name": "Child corpse",
      "frequency": 2,
      "context": "A mysterious green-clad corpse found floating on the water."
    },
    {
      "name": "Palace",
      "frequency": 1,
      "context": "A structure discovered underwater."
    }
  ],
  "relations": [
    {
      "source": "Huanghe Guiguan 4 - Mawang Guiyao",
      "target": "Nanpaisanshu",
      "type": "written_by"
    },
    {
      "source": "TXT Xiaoshuotxt.com",
      "target": "Huanghe Guiguan 4 - Mawang Guiyao",
      "type": "hosts"
    },
    {
      "source": "Narrator",
      "target": "Shaoye",
      "type": "is_companion_of"
    },
    {
      "source": "Narrator",
      "target": "Yatu",
      "type": "is_companion_of"
    },
    {
      "source": "Narrator",
      "target": "Huang Zhihua",
      "type": "is_companion_of"
    },
    {
      "source": "Dragon",
      "target": "Water",
      "type": "inhabits"
    },
    {
      "source": "Huashé",
      "target": "Water",
      "type": "inhabits"
    },
    {
      "source": "Coiffin",
      "target": "Mechanism",
      "type": "triggered_by"
    },
    {
      "source": "Narrator",
      "target": "Bronze sword",
      "type": "wields"
    },
    {
      "source": "Narrator",
      "target": "Headlamp",
      "type": "uses"
    },
    {
      "source": "Shaoye",
      "target": "Rope",
      "type": "uses"
    },
    {
      "source": "Dragon",
      "target": "Huashé",
      "type": "fights"
    },
    {
      "source": "Narrator",
      "target": "Dragon",
      "type": "attacks"
    },
    {
      "source": "Narrator",
      "target": "Huashé",
      "type": "attacks"
    },
    {
      "source": "Huashé",
      "target": "Narrator",
      "type": "attacks"
    },
    {
      "source": "Dragon",
      "target": "Narrator",
      "type": "attacks"
    },
    {
      "source": "Narrator",
      "target": "Child corpse",
      "type": "observes"
    },
    {
      "source": "Narrator",
      "target": "Palace",
      "type": "discovers"
    },
    {
      "source": "Rope",
      "target": "Narrator",
      "type": "binds"
    },
    {
      "source": "Narrator",
      "target": "Rope",
      "type": "cuts"
    },
    {
      "source": "Dan Jun",
      "target": "Yellow River",
      "type": "died_in"
    },
    {
      "source": "Narrator",
      "target": "Yatu",
      "type": "has_feelings_for"
    }
  ],
  "hierarchy": {
    "main_topics": [
      "Narrative Introduction",
      "Chapter 1: Longguai",
      "Chapter 2: Crystal Palace"
    ],
    "structure": "The document is structured as a novel chapter by chapter. It begins with an introduction and then details events within specific chapters, focusing on the narrator's experiences, encounters with monsters, and the search for companions."
  }
}