{
  "propositions": [
    {
      "id": "1",
      "text": "A group of four travelers are in the deep mountains of Huangmu Mountain.",
      "level": 1
    },
    {
      "id": "1.1",
      "text": "The travelers are discussing a task to be performed under specific, eerie conditions (moon obscured by clouds).",
      "level": 2
    },
    {
      "id": "1.1.1",
      "text": "One traveler, 'San Ge' (Third Brother), emphasizes the old rule of not opening a tomb without moonlight.",
      "level": 3
    },
    {
      "id": "1.1.2",
      "text": "Another traveler, 'A Ji', questions the practicality of such rules, suggesting it would lead to unemployment during rainy weather.",
      "level": 3
    },
    {
      "id": "1.2",
      "text": "A conflict arises between 'Xiao Qi' (the young man) and 'A Ji' due to A Ji's dismissive remarks.",
      "level": 2
    },
    {
      "id": "1.3",
      "text": "'San Ge' intervenes and decides to leave, stating they are hired and if their methods are doubted, they will not proceed.",
      "level": 2
    },
    {
      "id": "1.4",
      "text": "The胖子 (fat man) tries to smooth things over and apologizes for A Ji's behavior.",
      "level": 2
    },
    {
      "id": "1.5",
      "text": "'San Ge' agrees to proceed with the job but asserts his authority and the need to follow his rules.",
      "level": 2
    },
    {
      "id": "1.6",
      "text": "They begin digging and after two hours, they excavate a deep hole.",
      "level": 2
    },
    {
      "id": "1.7",
      "text": "They hit something, indicating they have found the tomb entrance.",
      "level": 2
    },
    {
      "id": "1.8",
      "text": "'San Ge' instructs them to first secure the entrance before entering.",
      "level": 2
    },
    {
      "id": "1.8.1",
      "text": "A steel reinforcing bar is driven into the ground, and a rope is tied to it.",
      "level": 3
    },
    {
      "id": "1.9",
      "text": "'San Ge' warns the 洪胖子 (Hong Fatty) not to go down, but Hong Fatty insists on entering to see the artifacts.",
      "level": 2
    },
    {
      "id": "1.10",
      "text": "They enter the pit, with 'San Ge' leading, followed by Hong Fatty and A Ji, and Xiao Qi bringing up the rear.",
      "level": 2
    },
    {
      "id": "1.11",
      "text": "A loud bang and a powerful pull on the rope occur from within the pit.",
      "level": 2
    },
    {
      "id": "1.12",
      "text": "The rope breaks, and a horrifying sound, like a coffin lid being pushed open, emanates from the pit.",
      "level": 2
    },
    {
      "id": "1.13",
      "text": "The next day, the area appears undisturbed except for the broken rope and the steel bar hanging into the dark pit.",
      "level": 2
    },
    {
      "id": "2",
      "text": "The narrator, Lu Chaosheng, encounters traffic troubles and arrives late to work.",
      "level": 1
    },
    {
      "id": "2.1",
      "text": "He is unexpectedly called into the director's office.",
      "level": 2
    },
    {
      "id": "2.2",
      "text": "He learns he is likely to be promoted to a full director position.",
      "level": 2
    },
    {
      "id": "2.3",
      "text": "His girlfriend, Xia Xue, teases him about his lateness and potential promotion.",
      "level": 2
    },
    {
      "id": "2.4",
      "text": "Lu Chaosheng goes to meet Xia Xue's father, Professor Xia Guangpu, a renowned archaeologist.",
      "level": 2
    },
    {
      "id": "2.5",
      "text": "Professor Xia shows Lu Chaosheng a photograph of a mountain range, identifying it as 'Bai Long Guo Shui' (White Dragon Enveloping Water), a concept related to feng shui.",
      "level": 2
    },
    {
      "id": "2.6",
      "text": "Professor Xia explains the principles of feng shui, emphasizing its potential contribution to archaeology when used correctly.",
      "level": 2
    },
    {
      "id": "2.7",
      "text": "He then shows photographs of a bronze tiger artifact.",
      "level": 2
    },
    {
      "id": "2.8",
      "text": "Lu Chaosheng identifies it as a military tally (hu fu) but notes it appears to be made of brass and lacks the usual dividing seam.",
      "level": 2
    },
    {
      "id": "2.9",
      "text": "Professor Xia reveals that the tiger's stripe is a disguised seam, making it difficult to detect.",
      "level": 2
    },
    {
      "id": "2.10",
      "text": "Lu Chaosheng inquires about the owner of the tiger tally and its origin.",
      "level": 2
    },
    {
      "id": "2.11",
      "text": "Professor Xia explains that the tally might not be from the same period as its owner and that the symbols on it could be a code.",
      "level": 2
    },
    {
      "id": "2.12",
      "text": "They discuss the possibilities of the tally being used for communication with special forces or as a symbol of status.",
      "level": 2
    },
    {
      "id": "2.13",
      "text": "Professor Xia invites Lu Chaosheng to join an expedition to uncover the secrets of the tiger tally.",
      "level": 2
    },
    {
      "id": "2.14",
      "text": "Lu Chaosheng initially hesitates due to his impending promotion but eventually agrees.",
      "level": 2
    },
    {
      "id": "2.15",
      "text": "Xia Xue also decides to join the expedition to write her doctoral dissertation.",
      "level": 2
    },
    {
      "id": "2.16",
      "text": "Professor Xia reveals that the tiger tally was obtained from a tomb raider who has gone mad.",
      "level": 2
    },
    {
      "id": "2.17",
      "text": "Professor Xia recounts the story of the tomb raiders and the discovery of the tiger tally.",
      "level": 2
    },
    {
      "id": "2.18",
      "text": "The expedition team is formed, including Lu Chaosheng, Xia Xue, Xia Wenhai (Professor Xia's son), Zheng Chusheng, Wen Hua, and Professor Ma Ke (a Chinese-born Cambridge professor).",
      "level": 2
    },
    {
      "id": "2.19",
      "text": "The team travels to Wuan and then proceeds to Huangmu Mountain.",
      "level": 2
    },
    {
      "id": "2.20",
      "text": "During the trek up Huangmu Mountain, they encounter difficult terrain and superstitions.",
      "level": 2
    },
    {
      "id": "2.21",
      "text": "Xia Wenhai uses a modified Luoyang shovel, which concerns Professor Xia.",
      "level": 2
    },
    {
      "id": "2.22",
      "text": "They learn about the legend of 'Hou Tiao Ya' (Monkey Jump Cliff) and its dangerous reputation.",
      "level": 2
    },
    {
      "id": "3",
      "text": "A group of four individuals, described as tomb robbers, are present in a dark, desolate area.",
      "level": 1
    },
    {
      "id": "3.1",
      "text": "They are engaged in an activity that involves digging or excavation.",
      "level": 2
    },
    {
      "id": "3.2",
      "text": "The presence of a strong flashlight suggests the darkness and the need for illumination.",
      "level": 2
    },
    {
      "id": "3.3",
      "text": "The dialogue reveals tension and a power dynamic between the individuals, particularly between a younger person ('Xiao Qi') and an older, more experienced figure ('San Ge').",
      "level": 2
    },
    {
      "id": "3.4",
      "text": "The phrase '不见月头不开洞' (don't open the hole without seeing the moon) indicates a ritualistic or traditional aspect to their work.",
      "level": 2
    },
    {
      "id": "3.5",
      "text": "There's a conflict with another individual, 'A Ji', who is portrayed as boastful and dismissive.",
      "level": 2
    },
    {
      "id": "3.6",
      "text": "The group is hired for a job by someone referred to as 'Hong Ge' (Brother Hong).",
      "level": 2
    },
    {
      "id": "3.7",
      "text": "The excavation leads to the discovery of what appears to be a tomb entrance.",
      "level": 2
    },
    {
      "id": "3.8",
      "text": "A hazardous event occurs within the excavated pit, involving a loud noise, a powerful force, and the breaking of a rope.",
      "level": 2
    },
    {
      "id": "3.9",
      "text": "The sounds suggest something being opened or disturbed, leading to a sense of dread.",
      "level": 2
    },
    {
      "id": "4",
      "text": "The narrator, Lu Chaosheng, is dealing with everyday life, including traffic, work, and his relationship.",
      "level": 1
    },
    {
      "id": "4.1",
      "text": "He is on the verge of a significant career advancement (promotion).",
      "level": 2
    },
    {
      "id": "4.2",
      "text": "He meets his girlfriend, Xia Xue, and her family, particularly her father, Professor Xia Guangpu.",
      "level": 2
    },
    {
      "id": "4.3",
      "text": "Professor Xia is deeply involved in archaeology and has a keen interest in ancient artifacts and their historical context.",
      "level": 2
    },
    {
      "id": "4.4",
      "text": "A key artifact, a bronze tiger tally, becomes the focus of discussion and investigation.",
      "level": 2
    },
    {
      "id": "4.5",
      "text": "The tiger tally is unusual and presents a puzzle due to its construction and markings.",
      "level": 2
    },
    {
      "id": "4.6",
      "text": "The artifact is linked to feng shui, tomb raiding, and potentially secret military operations.",
      "level": 2
    },
    {
      "id": "4.7",
      "text": "A planned archaeological expedition to Huangmu Mountain is initiated, driven by the discovery of the tiger tally.",
      "level": 2
    },
    {
      "id": "4.8",
      "text": "The expedition team is composed of academics, professionals, and individuals with personal connections.",
      "level": 2
    },
    {
      "id": "4.9",
      "text": "The journey to Huangmu Mountain involves logistical challenges and encounters with local folklore and potential dangers.",
      "level": 2
    },
    {
      "id": "5",
      "text": "The narrative describes a group of individuals engaged in activities related to archaeology and potentially tomb raiding.",
      "level": 1
    },
    {
      "id": "5.1",
      "text": "The focus is on a specific location, Huangmu Mountain, and its historical significance.",
      "level": 2
    },
    {
      "id": "5.2",
      "text": "The presence of a 'tiger tally' artifact is a central element, hinting at military or political power.",
      "level": 2
    },
    {
      "id": "5.3",
      "text": "Discussions involve academic research, historical context, and practical application in archaeology.",
      "level": 2
    },
    {
      "id": "5.4",
      "text": "The narrative blends elements of scholarly investigation with elements of mystery and potential danger.",
      "level": 2
    },
    {
      "id": "5.5",
      "text": "Personal relationships and rivalries are interwoven with the unfolding events.",
      "level": 2
    },
    {
      "id": "5.6",
      "text": "The story is set to unfold with an expedition to a remote and possibly perilous location.",
      "level": 2
    }
  ],
  "concepts": [
    {
      "name": "盗墓",
      "frequency": 3,
      "context": "The act of tomb raiding, a central theme of the narrative."
    },
    {
      "name": "迷津",
      "frequency": 1,
      "context": "Title of the work, suggesting a complex or puzzling situation."
    },
    {
      "name": "皇母山",
      "frequency": 5,
      "context": "The primary location where initial events and later the expedition take place."
    },
    {
      "name": "三哥",
      "frequency": 5,
      "context": "A character, seemingly experienced in tomb raiding, who leads the initial operation."
    },
    {
      "name": "小齐",
      "frequency": 4,
      "context": "A younger member of the tomb-raiding group."
    },
    {
      "name": "胖子",
      "frequency": 4,
      "context": "A character who is involved in the tomb-raiding operation, attempts to mediate disputes."
    },
    {
      "name": "阿基",
      "frequency": 4,
      "context": "A subordinate of the 胖子, described as aggressive and later subdued."
    },
    {
      "name": "洪哥",
      "frequency": 2,
      "context": "The person who hired the tomb raiders."
    },
    {
      "name": "虎符",
      "frequency": 13,
      "context": "A crucial artifact, a bronze tiger tally, central to the plot and archaeological investigation."
    },
    {
      "name": "风水",
      "frequency": 4,
      "context": "The concept of geomancy, discussed in relation to archaeology and locating sites."
    },
    {
      "name": "夏光普",
      "frequency": 11,
      "context": "The narrator's professor and future father-in-law, a renowned archaeologist."
    },
    {
      "name": "夏雪",
      "frequency": 13,
      "context": "The narrator's girlfriend, daughter of Professor Xia, who joins the expedition."
    },
    {
      "name": "卢潮生",
      "frequency": 14,
      "context": "The narrator, a protagonist facing career advancement and embarking on an archaeological expedition."
    },
    {
      "name": "考古",
      "frequency": 9,
      "context": "The field of archaeology, central to the plot and the motivations of Professor Xia and his colleagues."
    },
    {
      "name": "雷晓阳",
      "frequency": 10,
      "context": "A rival for Xia Xue's affection and a member of the expedition team."
    },
    {
      "name": "夏文海",
      "frequency": 8,
      "context": "Professor Xia's son, also involved in archaeology, and a member of the expedition."
    },
    {
      "name": "郑楚生",
      "frequency": 5,
      "context": "A friend of the narrator and a member of the expedition team."
    },
    {
      "name": "马可",
      "frequency": 4,
      "context": "A Chinese-born Cambridge professor invited to join the expedition."
    },
    {
      "name": "工作组",
      "frequency": 2,
      "context": "The archaeological team formed for the expedition."
    },
    {
      "name": "航拍",
      "frequency": 3,
      "context": "Aerial photography, used to identify potential archaeological sites."
    },
    {
      "name": "盗墓人",
      "frequency": 1,
      "context": "A tomb raider, who provides the tiger tally artifact."
    }
  ],
  "relations": [
    {
      "source": "三哥",
      "target": "胖子",
      "type": "associate"
    },
    {
      "source": "小齐",
      "target": "三哥",
      "type": "subordinate"
    },
    {
      "source": "阿基",
      "target": "胖子",
      "type": "subordinate"
    },
    {
      "source": "洪哥",
      "target": "三哥",
      "type": "employer"
    },
    {
      "source": "卢潮生",
      "target": "夏雪",
      "type": "romantic_interest"
    },
    {
      "source": "夏雪",
      "target": "夏光普",
      "type": "daughter_of"
    },
    {
      "source": "夏光普",
      "target": "卢潮生",
      "type": "mentor"
    },
    {
      "source": "夏光普",
      "target": "虎符",
      "type": "investigates"
    },
    {
      "source": "卢潮生",
      "target": "虎符",
      "type": "examines"
    },
    {
      "source": "虎符",
      "target": "风水",
      "type": "related_to"
    },
    {
      "source": "虎符",
      "target": "盗墓",
      "type": "found_in"
    },
    {
      "source": "夏光普",
      "target": "考古",
      "type": "practitioner"
    },
    {
      "source": "皇母山",
      "target": "考古",
      "type": "site_of"
    },
    {
      "source": "夏文海",
      "target": "夏光普",
      "type": "son_of"
    },
    {
      "source": "雷晓阳",
      "target": "夏雪",
      "type": "rival_for_affection"
    },
    {
      "source": "卢潮生",
      "target": "雷晓阳",
      "type": "rival"
    },
    {
      "source": "工作组",
      "target": "皇母山",
      "type": "expedition_to"
    },
    {
      "source": "航拍",
      "target": "皇母山",
      "type": "used_to_survey"
    },
    {
      "source": "盗墓人",
      "target": "虎符",
      "type": "obtained_from"
    },
    {
      "source": "三哥",
      "target": "皇母山",
      "type": "operates_in"
    }
  ],
  "hierarchy": {
    "main_topics": [
      "Tomb Raiding and Discovery",
      "Archaeological Investigation and Artifact Analysis",
      "Personal Relationships and Career Ambitions",
      "Journey to Huangmu Mountain"
    ],
    "structure": "The document begins with a mysterious tomb raiding incident, transitions to the protagonist's personal life and career prospects, then focuses on the analysis of an ancient artifact (tiger tally), and finally details the preparation and commencement of an archaeological expedition to Huangmu Mountain. The narrative interweaves elements of suspense, academic inquiry, and interpersonal dynamics."
  }
}