{
  "propositions": [
    {
      "id": "1",
      "text": "A female corpse is found floating in the Yangtze River.",
      "level": 1
    },
    {
      "id": "1.1",
      "text": "The corpse is identified as a woman between 23 and 25 years old.",
      "level": 2
    },
    {
      "id": "1.1.1",
      "text": "She is approximately 1.63 meters tall and weighs around 45 kilograms.",
      "level": 3
    },
    {
      "id": "1.1.2",
      "text": "Her facial features are distorted due to prolonged submersion.",
      "level": 3
    },
    {
      "id": "1.2",
      "text": "No identification or signs of struggle are found on the body.",
      "level": 2
    },
    {
      "id": "1.3",
      "text": "The forensic pathologist estimates the body has been in the water for three to four days.",
      "level": 2
    },
    {
      "id": "1.4",
      "text": "The initial assessment suggests suicide or an accident, but murder is also a possibility.",
      "level": 2
    },
    {
      "id": "2",
      "text": "The autopsy report reveals crucial details about the victim's death.",
      "level": 1
    },
    {
      "id": "2.1",
      "text": "Foam mixed with blood is found in the victim's mouth and nose.",
      "level": 2
    },
    {
      "id": "2.2",
      "text": "Livor mortis is pale red.",
      "level": 2
    },
    {
      "id": "2.3",
      "text": "Piloerection (goosebumps) indicates exposure to cold water, common in water submersion cases.",
      "level": 2
    },
    {
      "id": "2.4",
      "text": "Drowning is estimated to have occurred approximately 4 days prior, consistent with floating corpse phenomena.",
      "level": 2
    },
    {
      "id": "2.5",
      "text": "No semen is detected, but sedative components are present.",
      "level": 2
    },
    {
      "id": "2.6",
      "text": "No significant external marks are found on the body.",
      "level": 2
    },
    {
      "id": "2.7",
      "text": "The cause of death is preliminarily determined to be homicide.",
      "level": 2
    },
    {
      "id": "2.8",
      "text": "The presence of drowned liquid in the gastrointestinal tract suggests the victim swallowed it before or during drowning.",
      "level": 2
    },
    {
      "id": "2.8.1",
      "text": "Ingestion into the small intestine indicates prolonged drowning or forceful submersion.",
      "level": 3
    },
    {
      "id": "2.9",
      "text": "Bleeding in the sternocleidomastoid muscles suggests the victim struggled while alive in the water.",
      "level": 2
    },
    {
      "id": "2.10",
      "text": "Diatoms in the lungs further confirm drowning.",
      "level": 2
    },
    {
      "id": "3",
      "text": "The victim is believed to have ingested sleeping pills before being pushed into the water.",
      "level": 1
    },
    {
      "id": "3.1",
      "text": "She may have woken up in the water and struggled, leading to drowning.",
      "level": 2
    },
    {
      "id": "3.2",
      "text": "The discovery of the body four days later remains a mystery.",
      "level": 2
    },
    {
      "id": "4",
      "text": "The case is officially named the '6·12 Floating Corpse Case'.",
      "level": 1
    },
    {
      "id": "5",
      "text": "The investigation focuses on identifying the victim and the scene of the crime.",
      "level": 1
    },
    {
      "id": "5.1",
      "text": "Jiang Yiming and Wu Jiang are tasked with finding the crime scene.",
      "level": 2
    },
    {
      "id": "5.2",
      "text": "Zuo Li and Xiao Ke are assigned to identify the victim's source (corpse origin).",
      "level": 2
    },
    {
      "id": "5.3",
      "text": "Facial reconstruction is performed, and appeals are made to the public for identification.",
      "level": 2
    },
    {
      "id": "5.4",
      "text": "Searches are conducted for missing persons and individuals with prior offenses, particularly sex offenders.",
      "level": 2
    },
    {
      "id": "6",
      "text": "The victim is identified as Qu Liping.",
      "level": 1
    },
    {
      "id": "6.1",
      "text": "Her father, Qu Qing, a teacher, identifies her after seeing her photo from Malaysia.",
      "level": 2
    },
    {
      "id": "6.1.1",
      "text": "Qu Liping recently graduated from university and worked as a tour guide.",
      "level": 3
    },
    {
      "id": "6.1.2",
      "text": "Her father describes her as a well-behaved, kind, and gentle person with no known enemies.",
      "level": 3
    },
    {
      "id": "7",
      "text": "Evidence at the crime scene suggests a potential romantic involvement.",
      "level": 1
    },
    {
      "id": "7.1",
      "text": "Rotten rose petals are found, possibly left by the killer as a memento.",
      "level": 2
    },
    {
      "id": "7.2",
      "text": "An empty wine bottle of Zhangyu Cabernet is discovered, indicating recent consumption.",
      "level": 2
    },
    {
      "id": "7.3",
      "text": "Footprints of a man and a woman are found, but are partially degraded by rain.",
      "level": 2
    },
    {
      "id": "7.4",
      "text": "The wine bottle yields a partial fingerprint belonging to Qu Liping, confirming she was drinking.",
      "level": 2
    },
    {
      "id": "7.5",
      "text": "The male footprints are analyzed and suggest a young man, approximately 1.7 meters tall and weighing 60 kg.",
      "level": 2
    },
    {
      "id": "8",
      "text": "The investigation leads to Gu Zhong, a former boyfriend of Qu Liping.",
      "level": 1
    },
    {
      "id": "8.1",
      "text": "Gu Zhong admits to a past relationship with Qu Liping, which ended a year prior.",
      "level": 2
    },
    {
      "id": "8.2",
      "text": "He claims their breakup was due to differences in upbringing and personality.",
      "level": 2
    },
    {
      "id": "8.3",
      "text": "He provides an alibi for June 9th, stating he was with Hong Kong friends.",
      "level": 2
    },
    {
      "id": "8.4",
      "text": "Witnesses confirm Gu Zhong's alibi, effectively clearing him.",
      "level": 2
    },
    {
      "id": "9",
      "text": "A key witness provides information about Qu Liping's last known hours.",
      "level": 1
    },
    {
      "id": "9.1",
      "text": "An elderly man collecting herbs near Tianjing Reservoir reports seeing a young couple arguing on the evening of June 9th.",
      "level": 2
    },
    {
      "id": "9.2",
      "text": "He describes the man as wearing a white tracksuit.",
      "level": 2
    },
    {
      "id": "9.3",
      "text": "He did not recognize the woman but confirms the man was a young man, around 20 years old.",
      "level": 2
    },
    {
      "id": "10",
      "text": "The investigation identifies a potential new boyfriend, Ouyang Shui.",
      "level": 1
    },
    {
      "id": "10.1",
      "text": "Mi Miemi, a friend of Qu Liping, reveals that Qu Liping had a new, handsome boyfriend named Ouyang Shui, a department manager at an insurance company.",
      "level": 2
    },
    {
      "id": "10.2",
      "text": "Ouyang Shui lived in the 'Zai Shui Yi Fang' residential area.",
      "level": 2
    },
    {
      "id": "11",
      "text": "Ouyang Shui is identified as the likely suspect and subsequently dies in a car accident.",
      "level": 1
    },
    {
      "id": "11.1",
      "text": "Ouyang Shui has been absent from work for four days, claiming to be on a trip to Huangshan.",
      "level": 2
    },
    {
      "id": "11.2",
      "text": "His parents confirm he left for a trip to Huangshan.",
      "level": 2
    },
    {
      "id": "11.3",
      "text": "News of Ouyang Shui's death in a car accident at Yin Yang Mountain reaches the police.",
      "level": 2
    },
    {
      "id": "11.4",
      "text": "The accident report suggests fatigue driving as the cause, with no signs of brake tampering.",
      "level": 2
    },
    {
      "id": "11.5",
      "text": "Jiang Yiming suspects foul play, believing the accident may have been staged.",
      "level": 2
    },
    {
      "id": "12",
      "text": "Forensic examination of Ouyang Shui's car reveals tampering with the brakes.",
      "level": 1
    },
    {
      "id": "12.1",
      "text": "A fresh fingerprint is found on the car's splash guard, likely belonging to the perpetrator.",
      "level": 2
    },
    {
      "id": "13",
      "text": "The case then takes a turn towards a different crime.",
      "level": 1
    },
    {
      "id": "13.1",
      "text": "Zuo Li and Xiao Ke are dispatched to investigate a burglary at Ali Network Company.",
      "level": 2
    },
    {
      "id": "13.2",
      "text": "The company is a top-ranked enterprise, and its president, Tang Yuan, is a prominent figure.",
      "level": 2
    },
    {
      "id": "13.3",
      "text": "The stolen item is a valuable network program file.",
      "level": 2
    },
    {
      "id": "13.4",
      "text": "The theft involved bypassing multiple security systems, suggesting an inside job.",
      "level": 2
    },
    {
      "id": "13.5",
      "text": "A blood-engorged mosquito is found at the crime scene, which Zuo Li collects as evidence.",
      "level": 2
    }
  ],
  "concepts": [
    {
      "name": "Female Corpse",
      "frequency": 6,
      "context": "Found floating in the river, subject of the initial investigation."
    },
    {
      "name": "Investigation",
      "frequency": 18,
      "context": "The primary activity of the police team in solving the case."
    },
    {
      "name": "Autopsy Report",
      "frequency": 2,
      "context": "Provides crucial evidence regarding the cause and time of death."
    },
    {
      "name": "Forensic",
      "frequency": 4,
      "context": "Relating to scientific analysis of evidence, e.g., pathologist, examination."
    },
    {
      "name": "Homicide",
      "frequency": 2,
      "context": "The initial determination of the victim's death as murder."
    },
    {
      "name": "Victim Identification",
      "frequency": 4,
      "context": "The process of identifying the deceased, leading to Qu Liping's identity."
    },
    {
      "name": "Crime Scene",
      "frequency": 5,
      "context": "The location where the crime occurred, and where evidence is sought."
    },
    {
      "name": "Evidence",
      "frequency": 11,
      "context": "Physical clues and forensic findings used to solve the case (footprints, fingerprints, wine bottle, petals, mosquito)."
    },
    {
      "name": "Suspect",
      "frequency": 7,
      "context": "Individuals believed to be involved in the crime, undergoing investigation (Gu Zhong, Ouyang Shui)."
    },
    {
      "name": "Witness",
      "frequency": 5,
      "context": "Individuals providing testimony or information about the events (residents, Mi Miemi, elderly man)."
    },
    {
      "name": "Car Accident",
      "frequency": 6,
      "context": "Ouyang Shui's death, which is suspected to be a staged murder."
    },
    {
      "name": "Tampering",
      "frequency": 2,
      "context": "Deliberate alteration of evidence, specifically the car brakes."
    },
    {
      "name": "Fingerprint",
      "frequency": 4,
      "context": "A key piece of evidence for identification, found on the wine bottle and car."
    },
    {
      "name": "Footprints",
      "frequency": 2,
      "context": "Physical evidence at the crime scene indicating the presence of individuals."
    },
    {
      "name": "Burglary",
      "frequency": 1,
      "context": "A separate crime investigated by the team, involving a network company."
    },
    {
      "name": "Network Program",
      "frequency": 1,
      "context": "The valuable stolen item from Ali Network Company."
    },
    {
      "name": "Security System",
      "frequency": 2,
      "context": "The systems protecting the network company, bypassed during the burglary."
    },
    {
      "name": "Mosquito",
      "frequency": 1,
      "context": "A piece of evidence found at the burglary scene."
    }
  ],
  "relations": [
    {
      "source": "Female Corpse",
      "target": "Investigation",
      "type": "is_subject_of"
    },
    {
      "source": "Investigation",
      "target": "Autopsy Report",
      "type": "uses"
    },
    {
      "source": "Investigation",
      "target": "Forensic",
      "type": "involves"
    },
    {
      "source": "Autopsy Report",
      "target": "Homicide",
      "type": "indicates"
    },
    {
      "source": "Victim Identification",
      "target": "Qu Liping",
      "type": "identifies"
    },
    {
      "source": "Qu Liping",
      "target": "Female Corpse",
      "type": "is"
    },
    {
      "source": "Crime Scene",
      "target": "Evidence",
      "type": "contains"
    },
    {
      "source": "Evidence",
      "target": "Fingerprint",
      "type": "includes"
    },
    {
      "source": "Evidence",
      "target": "Footprints",
      "type": "includes"
    },
    {
      "source": "Suspect",
      "target": "Investigation",
      "type": "is_subject_of"
    },
    {
      "source": "Gu Zhong",
      "target": "Suspect",
      "type": "is_a"
    },
    {
      "source": "Ouyang Shui",
      "target": "Suspect",
      "type": "is_a"
    },
    {
      "source": "Witness",
      "target": "Investigation",
      "type": "provides_information_to"
    },
    {
      "source": "Car Accident",
      "target": "Ouyang Shui",
      "type": "happened_to"
    },
    {
      "source": "Car Accident",
      "target": "Tampering",
      "type": "suspected_to_involve"
    },
    {
      "source": "Tampering",
      "target": "Brakes",
      "type": "affects"
    },
    {
      "source": "Fingerprint",
      "target": "Victim Identification",
      "type": "aids"
    },
    {
      "source": "Fingerprint",
      "target": "Suspect Identification",
      "type": "aids"
    },
    {
      "source": "Footprints",
      "target": "Crime Scene",
      "type": "found_at"
    },
    {
      "source": "Burglary",
      "target": "Investigation",
      "type": "is_subject_of"
    },
    {
      "source": "Network Program",
      "target": "Burglary",
      "type": "is_stolen_in"
    },
    {
      "source": "Security System",
      "target": "Burglary",
      "type": "is_bypassed_in"
    },
    {
      "source": "Mosquito",
      "target": "Burglary",
      "type": "is_evidence_from"
    }
  ],
  "hierarchy": {
    "main_topics": [
      "The Discovery and Initial Investigation of a Drowned Woman",
      "Autopsy and Forensic Analysis Revealing Homicide",
      "Victim Identification and Early Suspect Elimination",
      "Discovery of New Evidence and Identification of a Prime Suspect",
      "The Death of the Suspect and Further Investigation into Foul Play",
      "An Unrelated Burglary Case"
    ],
    "structure": "The document follows a chronological narrative structure, detailing the progression of a murder investigation. It begins with the discovery of a body, moves through forensic analysis, victim identification, suspect investigation, and the eventual, albeit complex, resolution of the murder. A separate subplot concerning a burglary is introduced towards the end."
  }
}