{
  "propositions": [
    {
      "id": "1",
      "text": "清末民初，是段改朝换代的动荡年月，纲常败坏，法纪弛废，绿林盗贼多如牛毛。",
      "level": 1
    },
    {
      "id": "1.1",
      "text": "仅在京津两地，就先后出现过四个比较有名的飞贼剧盗，做下了许多惊天动地的大案子，为祸不小。",
      "level": 2
    },
    {
      "id": "1.1.1",
      "text": "但无论什么大事小情，只要在民间流传开来，就免不了会被改头换面、添油加醋，关于这四个贼人的传说也是如此。",
      "level": 3
    },
    {
      "id": "1.1.1.1",
      "text": "他们成为了当时大街小巷、酒楼茶肆里纷纷谈论的热门话题，更从中衍生出许多评书、唱曲、戏文，加之各种小报上连篇累牍的不断报道，几乎是家喻户晓、老少皆知。",
      "level": 4
    },
    {
      "id": "1.1.1.1.1",
      "text": "可实际上，这四贼并没有传说中那样富有神秘色彩，但是能有如此作为，总有些出众之处，也不是安分守己之人可比的。",
      "level": 5
    },
    {
      "id": "2",
      "text": "四贼之首，也就是最早成名之人，还要属康小八。",
      "level": 1
    },
    {
      "id": "2.1",
      "text": "这位康八爷其实算不上飞贼，此人家中极穷，本是个游手好闲的地痞无赖，居住在京东康家营一带，因为机缘巧合，被他从英国公使身边偷了柄转轮洋枪在手，从此狂得都快不知道自己姓什么了，到处杀人劫财。",
      "level": 2
    },
    {
      "id": "2.1.1",
      "text": "康小八心黑手狠，看谁不顺眼就对谁开枪，身上不知背了几十条人命。",
      "level": 3
    },
    {
      "id": "2.1.1.1",
      "text": "单说有一回康小八去剃头，剃着半截他问剃头匠：“听说过康八爷吗？”剃头的顺口答道：“知道，那小子不是个东西。”康小八心中暗暗地怒，又问：“怎么不是个东西？你认识他？”剃头匠说：“不认识，听说他净胡来。”康小八说：“好，今儿就让你认识认识。”说着话就掏出六响洋枪来，把那个剃头匠当场打死了。",
      "level": 4
    },
    {
      "id": "2.1.2",
      "text": "康小八杀人如麻，积案累累，但他胆小心邪，杀的人越多，就越是疑心有人要暗算报复他，黑夜里走路，听见后边有脚步声比他快，也不问来人是谁，立刻回头就是一枪。",
      "level": 3
    },
    {
      "id": "2.1.3",
      "text": "后来康八爷耍到头了，终于被五城练勇拿住，给剐在了菜市口了。",
      "level": 3
    },
    {
      "id": "2.1.4",
      "text": "民国时有不少好事之徒，为了哗众取宠、耸动视听，硬把康小八归入绿林盗贼之中，为他写了新戏，茶楼书场和三流传奇小说里也多有讲他的，想不到在戏文评书里，竟然将此人演义成了武功高强的江洋大盗，都能和窦尔敦、赵四虎之类的绿林豪杰相提并论了。",
      "level": 3
    },
    {
      "id": "3",
      "text": "四贼中排在第二位的是宋锡朋，此人成名的时间，与康八爷大闹北京城的年代相去不远。",
      "level": 1
    },
    {
      "id": "3.1",
      "text": "不过宋锡朋不是北京人氏，他祖居在天津卫南大寺附近，自幼跟个老回回习武，天生气力过人，能够单手举起百斤石锁，围着场子走上一圈，也照样面不改色，更有一身横练的硬功夫，刀砍一道白印，枪扎一个白点，人送绰号“石佛宋”，曾经在镖局里做过几年镖师。",
      "level": 2
    },
    {
      "id": "3.1.1",
      "text": "后来山东闹义和团的时候，各路拳民打着扶清灭洋的旗号北上进京，石佛宋也凭着一身真功夫入伙做了大师兄。",
      "level": 3
    },
    {
      "id": "3.1.2",
      "text": "庚子年剿灭拳匪，义和团遭到残酷镇压，许多人都被官府捉去砍了，宋锡朋逃亡在外，做起了土匪草寇，他又聚集了一伙水贼，到天津劫夺盐道船舱里装官银。",
      "level": 3
    },
    {
      "id": "3.1.2.1",
      "text": "这种银子旧时称为“皇杠”，都是一百两一个的大元宝，十个装一鞘。",
      "level": 4
    },
    {
      "id": "3.1.2.2",
      "text": "宋锡朋精于用镖，百发百中，甩手镖下打死了五名官军，一劫就劫了三十万两“皇杠”，自知惹下了弥天大罪，当即与同伙分赃银，潜逃到沧州隐姓埋名。",
      "level": 4
    },
    {
      "id": "3.1.3",
      "text": "一年后，宋锡朋以为风声过去了，便暗中回天津寻亲，没想到刚一露面，就让“采访局”的人盯上了。",
      "level": 3
    },
    {
      "id": "3.1.3.1",
      "text": "这次他再想走可走不脱了，只好当街亮出家伙动起手来，终因寡不敌众，被缉盗捕快一涌而上按翻在地，来了个生擒活捉。",
      "level": 4
    },
    {
      "id": "3.1.4",
      "text": "这件大案惊动了朝廷上下，紫禁城里的慈禧太后正闲得难受，听说在天津鼓楼拿住了使镖的巨贼，于是想要看看他究竟是怎样一条英雄好汉。",
      "level": 3
    },
    {
      "id": "3.1.4.1",
      "text": "李总管就命御前侍卫给宋锡朋戴上手铐脚镣押到殿前，请太后老佛爷一观。",
      "level": 4
    },
    {
      "id": "3.1.4.2",
      "text": "不过您想想，惹下重罪的囚徒落到这个地步，他还能精神得了吗？所以慈禧看后很是失望，只是不冷不热地说了句：“敢情就是这么一个人啊。”",
      "level": 4
    },
    {
      "id": "3.1.5",
      "text": "没过几天，宋锡朋便被断成“斩立决”，解到法场内枭首示众，人头在城门楼子上悬挂了整整两个月。",
      "level": 3
    },
    {
      "id": "4",
      "text": "四贼之三，是民国初年在北平城里做案的燕子李三。",
      "level": 1
    },
    {
      "id": "4.1",
      "text": "据说李三爷幼年贫苦，曾遁入空门出家为僧，艺成后才还俗，平生以擅长轻功著称，可以施展“蹬萍渡水”等独门绝技，飞檐走壁，高来高去，不留踪迹，堪与江南神偷赵华阳齐名。",
      "level": 2
    },
    {
      "id": "4.1.1",
      "text": "他仅用一个晚上，就接连偷盗了八大商号，并在现场留下“燕子镖”为凭，一时之间，名声大噪。",
      "level": 3
    },
    {
      "id": "4.1.2",
      "text": "事实上燕子李三未必有此神通，不过他也的确有几分真本事，此贼惯能攀爬，蹿房越脊不在话下，作案时脚上要穿五六双袜子，为的是轻而不滑，落地悄无声息，而且他素有贼智，机巧过人，官府虽然围捕多次，却始终未能将他擒获。",
      "level": 3
    },
    {
      "id": "4.1.3",
      "text": "但李三爷身上染有烟瘾，每天都要吸足了上等“芙蓉膏”才有精神，有一回也该着他倒霉，寻思着“灯下黑，最危险的地方反而最稳妥”，夜里就躲在侦缉队办案的房顶上歇着，后半晌烟瘾发作难熬，就用洋火点起了随身带的烟枪。",
      "level": 3
    },
    {
      "id": "4.1.3.1",
      "text": "结果不巧被街上巡逻的侦缉队发觉了，那侦缉队长看见一片漆黑的夜晚，房顶上忽然亮了一下，显得极不寻常，料定是有飞贼藏身，立刻在暗中布置人马，从四面八方围住房屋，来了个瓮中捉鳖，燕子李三毕竟不是能飞的真燕子，只好束手就擒。",
      "level": 4
    },
    {
      "id": "4.1.4",
      "text": "天刚蒙蒙亮，侦缉队就将人犯押送至南城监狱，官府担心李三用“缩骨法”逃脱，就挑断了他双脚后根的两条大筋，又拿锁链串了琵琶骨，使他变成了残废人，又加之烟瘾折磨，还没等到临刑，李三爷就先屈死在了狱中。",
      "level": 3
    },
    {
      "id": "5",
      "text": "四贼中的最后一位，其实是对同胞兄弟，兄长是人称“滚地雷”的田化星，二弟是“坐地炮”田化峰。",
      "level": 1
    },
    {
      "id": "5.1",
      "text": "那时正好有大批军阀盗掘皇陵，军阀部队挖到康熙皇帝的景陵时，炸开了墓门，却不料地宫里涌出大量阴冷的黑水，怎么排也排不空，工兵们无法进入，只好暂时放弃。",
      "level": 2
    },
    {
      "id": "5.1.1",
      "text": "谁成想这件事被一伙山贼草寇知道了，土匪头子正是田化星，他是旗人出身，得过“十三节地躺鞭”真传，常自诩胆大包天，世间没有他不敢做的事情。",
      "level": 3
    },
    {
      "id": "5.1.2",
      "text": "大概是深受旧时说书唱戏等民间曲艺影响，田化星知道以前有段“杨香武三盗九龙杯”的故事——据说康熙皇帝有件价值连城的宝物，唤作“九龙杯”。",
      "level": 3
    },
    {
      "id": "5.1.2.1",
      "text": "那是个玲珑剔透、雕琢精湛、巧夺天工的玉杯，每当在杯中倒满琼浆玉液，杯底就会显出九条蛟龙，活灵活现的旋转翻腾，历历在目，越看越真，世人称此奇景为“九龙闹海”。",
      "level": 4
    },
    {
      "id": "5.1.3",
      "text": "田化星听族中老人们说起过，真正的玉杯虽然没有传说中那样离奇，但玉质洁白无暇、细腻透明，雕镂工艺精湛非凡，教人叹为观止，也绝对是一件稀世的皇家珍宝，而且景陵里确实藏有九龙杯陪葬。",
      "level": 3
    },
    {
      "id": "5.1.4",
      "text": "他对此动了贪心，跟手下弟兄们商量要去盗墓，并且说：“眼下这空子，正是个发横财的机会，机不可失，时不再来。",
      "level": 3
    },
    {
      "id": "5.1.4.1",
      "text": "如果咱们兄弟盗得了景陵珍宝，别的东西我全不要，只要康熙爷身边的九龙杯，其余的你们大伙随便分。”",
      "level": 4
    },
    {
      "id": "5.1.5",
      "text": "众人一拍即合，当晚趁着月明星稀，群盗各带器械闯进陵区，这伙人远比军阀熟悉当地的地形，没废多大力气，就找到位置截断了水脉，随后冒死潜入陵寝地宫，打算把皇帝和嫔妃的棺椁一一撬开，以便搜寻明器宝货，谁知田化星刚撬开一块椁板，借马灯照进去，就见那棺中躺着的死人冲着他发笑。",
      "level": 3
    },
    {
      "id": "5.1.5.1",
      "text": "有道是：“做贼的心虚，盗墓的怕鬼”，或许是自己吓唬自己，可那时灯烛恍惚，谁也说不清到底发生了什么，反正田化星吃这一惊，非同小可，被吓得双脚发软瘫倒在地上，脸色惨白，牙关打颤，抖成了一团，三更里被几个同伙抬回家中，连口热汤也灌不进去，不等到五更天就一命归阴了。",
      "level": 4
    },
    {
      "id": "5.1.6",
      "text": "田化星虽然两腿一蹬“呜呼哀哉”了，可他二弟田化峰仍是不顾死活，转过天来再次夜探景陵地宫，终于盗得了“九龙杯”，但在打开内椁的时候，忽然从椁中冒出一股绿色火焰，将他的眼睛灼瞎了一只，面容也给毁了大半，从此落了个“鬼脸”的绰号。",
      "level": 3
    },
    {
      "id": "5.1.7",
      "text": "不出半年，包括“鬼脸”田化峰在内的这伙盗贼，便都在河北保定被官府擒获，就地执行了枪决，贼人所盗珍宝尽数得以追缴，但景陵中的宝物，随后竟在官库中全部下落不明，至今查不到去向，留下好大一个谜团。",
      "level": 3
    },
    {
      "id": "6",
      "text": "前边所说的这四个盗贼，虽然俱是绿林出身，惹下的案子也曾一度震动天下，但要论起资历和本事来，最多仅属三流脚色，只不过他们的事迹流传广了，在民间传说中增添了许多传奇和演义成份，都被看成是侠盗之流。",
      "level": 1
    },
    {
      "id": "6.1",
      "text": "然而这绿林手段，可大可小，上者盗内府宝器，中者盗大院珍物，下者盗民间财货。",
      "level": 2
    },
    {
      "id": "6.1.1",
      "text": "真正有本事有作为的人物，却往往埋没于草莽尘埃之中，未必能在历史上留下踪迹。",
      "level": 3
    },
    {
      "id": "6.1.2",
      "text": "以前在湖南洞庭湖里就有一路字号称为“雁团”的盗贼，始于清朝末年，首领姓张，排行第三，人称“贼魔”，曾在军中为官，据传此人有神鬼难测之术，可与古代“白猿公、红线女、昆仑奴”之类的人物相提并论。",
      "level": 3
    },
    {
      "id": "6.1.3",
      "text": "到了民国之时，旧姓张家传到了张葫芦这辈儿，由于前人数代积藏，家底殷厚，早已收拾起手段，不再轻易使用，而是迁回祖籍，在平津等地开了几家当铺，做起了正经生意。",
      "level": 3
    },
    {
      "id": "6.1.4",
      "text": "以前大户人家都有家庙，里面供着“宅仙”，这宅仙是各种各样，根据各地风俗不同，供什么东西的都有，有供五通神的，也有供奉金珠宝玉的，而张家供的是一只“铜猫”，是件灵验异常的古物。",
      "level": 3
    },
    {
      "id": "6.1.4.1",
      "text": "但没成想的是，张葫芦在搬家的时候，竟把家中供养的“宅仙”给遗失了，结果难免有祸事找上门来，家道渐渐衰落。",
      "level": 4
    },
    {
      "id": "6.1.5",
      "text": "有句老话说得好——同行是冤家，当初北平城里最大的“盛源当铺”，东家姓穆，为人贪得无厌，与官府多有勾结，把同开当铺的张葫芦视为了眼中钉肉中刺，而且他还无意中得知，张家地窖里藏有许多罕见的古董，都是从古墓山陵或皇宫内苑里盗取出来的稀世奇珍，便起心要谋占这份产业，千方百计害掉了张家好几条人命，两家为此结了很深的梁子。",
      "level": 3
    },
    {
      "id": "6.1.6",
      "text": "那时的张葫佬年轻气盛，受欺不过之时，竟找个月黑风高的晚上，作起了“暗行人”，潜入穆宅，杀了仇家老少十一口，统统割下人头，又顺路把警察局长的脑袋也剁了下来。",
      "level": 3
    },
    {
      "id": "6.1.6.1",
      "text": "随即施展祖传绝技蝎子倒爬城，将这一十二颗血淋淋的首级，拴成一串，全部悬挂在了城楼子的檐角上。",
      "level": 4
    },
    {
      "id": "6.1.6.2",
      "text": "最后张葫芦还觉得不解恨，一把火烧毁了“盛源当铺”总号，才肯罢手。",
      "level": 4
    },
    {
      "id": "6.1.7",
      "text": "这回案子作得太大了，天底下再无容身之所。",
      "level": 3
    },
    {
      "id": "6.1.7.1",
      "text": "按以往的绿林惯例，在惹下如此大祸之后，也只有远走高飞，才能躲过海捕通缉。",
      "level": 4
    },
    {
      "id": "6.1.7.2",
      "text": "那时仅有的几条出路，无非就是“下南洋、走西口、闯关东”。",
      "level": 4
    },
    {
      "id": "6.1.8",
      "text": "张葫芦不得不舍了家产，背着老娘来到山东地面上，漂洋过海逃到关外，从此隐姓埋名，改用了母亲的姓氏，是复姓“司马”，同时为求生计，仍旧重操祖业，上山做了“马达子”。",
      "level": 3
    },
    {
      "id": "6.1.9",
      "text": "后来到了东北实行土改，民主联军剿匪的时候，张葫芦和他的弟兄们弃械投降，被部队收编，参加了三下江南、四保临江等战役，跟着大军自北而南，入关后直取两广。",
      "level": 3
    },
    {
      "id": "6.1.9.1",
      "text": "这期间哪怕没有功劳，也有十分的苦劳，但因为张葫芦出身绿林，底子不清，在军中始终得不到重用，解放后被安排到长沙工作，并且安家落户，娶妻结婚，１953年得了个儿子。",
      "level": 4
    },
    {
      "id": "6.1.9.2",
      "text": "可张葫芦对旧事从不敢提，惟恐说出来牵连甚大，惹来不必要的麻烦，所以给儿子起名时，户口本上写的是“司马灰”。",
      "level": 4
    },
    {
      "id": "6.1.10",
      "text": "因为绿林中人，大多是作触犯官禁的举动，常年在刀尖子上打滚，说不定哪天就把身家性命赔进去了，对能够推测吉凶祸福的“金点先生”格外信服，所以张葫芦特意从老家请人来给儿子批了八字，按早年间的说法，命是死的，运却是活的，人的名字是一个人的终生代号，必须合着命里格局，才能够助涨运势，其后代虽然是隐姓埋名，那也得有些讲究才对。",
      "level": 3
    },
    {
      "id": "6.1.11",
      "text": "时下虽然是新社会，但张葫芦毕竟出身草莽，观念比较陈旧，对这路会算命的金点先生格外信服，而且这种信服是根深蒂固、渗入骨髓之中的，怎么改朝换代也难转变。",
      "level": 3
    },
    {
      "id": "6.1.11.1",
      "text": "只见那老先生摇头晃脑地掐指算了半天，最后算出这孩子的八字属土，是个“土命”，按照八门命格来讲，“中央戊己土”刚好列在第八，若以动物八仙的排位顺序，第八家恰是灰家，也就是老鼠。",
      "level": 4
    },
    {
      "id": "6.1.11.2",
      "text": "以前戏班子里都供“灰八爷”，为的是防止耗子把箱中道具服饰啃坏了，民间俗传“灰八爷属土”，所以得叫“司马灰”。",
      "level": 4
    },
    {
      "id": "6.1.12",
      "text": "张葫芦乍舌不下，他说“司马灰”这名字倒是响亮，但别人初闻此名，必然会以为司马灰的“灰”字，用的是“光辉显赫、辉煌灿烂”之辉，谁也想不到竟是以“灰暗、灰烬、骨灰”的灰字为名，这个灰字可……可真是取得太有门道了，但盼他将来能有一番作为才好。",
      "level": 3
    },
    {
      "id": "6.1.13",
      "text": "张葫芦毕竟出身于绿林旧姓，总觉得新式学校里教的东西没多大用处，也不想让祖宗的手段失传，于是几年后就把司马灰送到北京，跟着本家一位隐居在京的“文武先生”学艺，从此下苦功，起五更、爬半夜，熬过两灯油，颇得了些真实传授，直到他十三岁时师傅去世，葬在京郊白马山，这才算告一段落。",
      "level": 3
    },
    {
      "id": "7",
      "text": "正如司马灰经常所说的一句话：“倒霉——是一种永远都不会错过的运气。”",
      "level": 1
    },
    {
      "id": "7.1",
      "text": "十五岁那年，司马灰的父母都被打成了右派，先后在学习班里因病去逝，走得匆忙，甚至连句话也没来得及交代。",
      "level": 2
    },
    {
      "id": "7.1.1",
      "text": "当时没有任何一个人来告诉司马灰应该去哪上学、到哪里吃饭，也没人理会他是死是活，等到把家中能够变卖的东西都卖光了，从里到外再也一无所有，才知道今后只能靠自己了。",
      "level": 3
    },
    {
      "id": "7.1.2",
      "text": "他为了找条活路，只好跑到以前连做梦也梦不到的“黑屋”去谋生。",
      "level": 3
    },
    {
      "id": "7.1.2.1",
      "text": "“黑屋”并不是一间黑色的房屋，而是远郊一个小镇的别名，镇子恰好位于两片秃山夹裆，风不调雨不顺，人穷地瘦，非常偏僻。",
      "level": 4
    },
    {
      "id": "7.1.2.2",
      "text": "战争时期，这里曾经遭受过飞机轰炸，随后又发生了一场大火，房倒屋塌，遍地狼藉，浓烈的硝烟把残垣断壁都熏黑了，所以当地人以“黑屋”相称。",
      "level": 4
    },
    {
      "id": "7.1.2.3",
      "text": "直至十年动乱，“黑屋”地区也未得到重建，这么多年以来，从没有任何正式居民回来居住。",
      "level": 4
    },
    {
      "id": "7.1.2.4",
      "text": "但是由于黑屋废墟当中有条铁路贯穿，每天都有数趟运送货物的火车经过，所以吃铁路的人多来投奔此处，久而久久，就逐渐演变成了社会底层人口的聚集之地。",
      "level": 4
    },
    {
      "id": "7.1.2.4.1",
      "text": "当然这里面免不了是龙蛇混杂、泥沙俱下，其中包括了“无家可归的孤儿、四处流浪的拾荒者、从乡下跑到城市里的农民、在铁道上捡煤渣的、在江边码头上抗大包的、卖烤甘薯的”，甚至还有“受不了在边远地区插队之苦，私自逃回来的知识青年”。",
      "level": 5
    },
    {
      "id": "7.1.2.4.2",
      "text": "他们在“黑屋”里结成帮派，大多依靠掏窑挖洞，以及在黑市上做些小买卖为生，没有正经职业，当然其中也不乏拧门撬锁、扒火车的贼偷，更有“平地抠饼、抄手拿佣”的地痞无赖。",
      "level": 5
    },
    {
      "id": "7.1.2.4.3",
      "text": "在“黑屋”地区出没之辈，几乎都是被排斥在社会体系以外的人，政府不让做的事情他们全做，但是外界正进行得轰轰烈烈的政治斗争，却始终与此地绝缘，就连帖大字报的都不到这里来。",
      "level": 5
    },
    {
      "id": "7.1.2.4.4",
      "text": "每当有外人来驱赶搜查之时，黑屋帮便一哄而散，等到风声过去了，便又会重新聚集。",
      "level": 5
    },
    {
      "id": "7.1.2.4.5",
      "text": "各方势力都对他们无可奈何，只好对其睁一只眼闭一只眼，再说只要别捅出大漏子来，谁又会理会这些被抛弃在城市边缘的“社会渣子”。",
      "level": 5
    },
    {
      "id": "7.1.2.5",
      "text": "司马灰所在的团伙里，都是一群年龄在十四五岁左右的半大孩子，其中有男有女，他们大部分都是父母受到冲击的右派子女，当兵插队都还不够年龄，在社会上东游西荡，即没工作也没学上，更找不到亲戚朋友可以投奔，真可以说是“姥姥不疼舅舅不爱，仗母娘见了踹三脚，连狗都嫌”。",
      "level": 4
    },
    {
      "id": "7.1.2.5.1",
      "text": "这群半大的孩子，虽然有些人可以领到生活费，但那点钱根本不敷使用，求生的本能迫使他们组成团伙杀向社会，因为时下流行的口号是“毛泽东思想如同春风吹遍大地”，故此号称“春风战斗团”，并且都在毛主席像前庄严发了誓：“今后要团结起来，同甘共苦干革命”。",
      "level": 5
    },
    {
      "id": "7.1.2.5.2",
      "text": "事实上只不过以此为借口，明目张胆地到处捣乱、惹祸，搅得一个地方上鸡犬不宁，城里的革命群众见了他们，没有一个不骂的。",
      "level": 5
    },
    {
      "id": "7.1.2.5.3",
      "text": "“春风战斗团”的性质，有几分近似于历史上盘踞在英国雾都伦敦的“童党”，成员年龄普遍偏低，并且都对社会具有一定的危害性质。",
      "level": 5
    },
    {
      "id": "7.1.2.5.4",
      "text": "最后这伙“春风战斗团”在城里混不下去，于是便成群结队地流窜到“黑屋”附近，先后与地痞们打了几场群架，虽然吃了不小的亏，但所谓“不打不成交”，最后双方竟奇迹般地达成了谅解和共识，经过反复谈判磋商，终于明确划分出各自的地盘，混乱的局面暂时稳定了下来。",
      "level": 5
    },
    {
      "id": "8",
      "text": "司马灰在“春风战斗团”中，有个最要好的朋友，名叫罗大海，也是一身英武气质，其父罗万山在是个从军队转业到地方法院工作的干部，后来由于工作调动，举家从东北迁到湖南，砸烂工检法的时候，罗万山被押去蹲了牛棚。",
      "level": 1
    },
    {
      "id": "8.1",
      "text": "剩下罗大海举目无亲，只得混迹街头，这小子仗着体格魁梧，相貌堂堂，身高和体力都超出同龄人许多，又爱管闲事，专要打抱不平，所以在同伙中很有号召力。",
      "level": 2
    },
    {
      "id": "8.1.1",
      "text": "只是他小时候在东北把嘴冻坏了，造成说起话来口齿不太清楚，可偏偏话多，因此得了绰号“罗大舌头”。",
      "level": 3
    },
    {
      "id": "8.2",
      "text": "由于司马灰自幼拜过“文武先生”，学了些绿林本事在身，他不仅身手敏捷利落，胆色出众，而且能言善道，又懂得解放前那套江湖辞令，知道“行帮各派，义气为先”。",
      "level": 2
    },
    {
      "id": "8.2.1",
      "text": "占据在黑屋地区的市井之徒中，有不少从旧社会走过来的人，只有司马灰才能与他们搭得上话。",
      "level": 3
    },
    {
      "id": "8.2.2",
      "text": "所以司马灰和罗大海就成了“春风团”的首领，带领着数以百计的少年男女，整天在废墟铁道旁呼啸来去，席卷城郊，犹如一股骤起的飓风。",
      "level": 3
    },
    {
      "id": "8.3",
      "text": "“春风团”虽然与“黑屋帮”商量好了以铁道为界，互不相侵，但罗大海等人的生存问题，并未就此得以解决，他们自居身份，绝不甘心去铁路上拾煤渣，或是从事下等的体力劳动。",
      "level": 2
    },
    {
      "id": "8.3.1",
      "text": "幸好司马灰心眼多，脑子来得快，还是由他想了个点子，他让众人将家里剩下的家私都搬回来，纳入棚屋临建，以此作为活动的据点，并且让年纪小的孩子们利用家庭背景之便，回到各自所属的机关食堂“顺手牵羊”。",
      "level": 3
    },
    {
      "id": "8.3.1.1",
      "text": "这是个苦肉计，即使被人发现了也不要紧，因为派出去的都是十来岁的孩子，工作人员又大都与其父母是相识的同事，谁也不能忍心去抓他们，多半还会把自己打来的饭菜分给这些小孩。",
      "level": 4
    },
    {
      "id": "8.3.2",
      "text": "如此试了几天，各个食堂果然都肯把剩饭留给这些孩子，司马灰见此计可行，就在破墙根里搭了几个炉灶，并偷来几口大锅，食物不够的时候就再加些烂菜叶子，干的上屉蒸，稀的下锅煮，混成大杂烩，因为里边包括了诸多食堂不同口味的残羹剩饭，炖热了之后倒也香气四溢，所以美其名日“六国饭店”。",
      "level": 3
    },
    {
      "id": "8.3.3",
      "text": "不过司马灰等人可不想吃这种东西，而是转卖给铁道另一边的“黑屋帮”，那些人都是常年累月从事着极其繁重的体力劳动，肚子里没什么油水，而且这辈子从来就没吃过机关大院食堂，看见“六国饭店”的锅子里食物丰富，漂着一层油花，远比自己的伙食强过许多，便肯纷纷掏腰包买上一大碗，连干带稀吃得就别提有多香了，没钱的则用东西作为交换，司马灰发明的“六国饭店”，每天都要卖个锅底朝天，供不应求。",
      "level": 3
    },
    {
      "id": "8.3.3.1",
      "text": "他们的这一举动，极大缓解了铁道两侧的相互敌视情绪，而且得以获取利润囤积物资，维持自己这伙人的生活所需。",
      "level": 4
    },
    {
      "id": "8.4",
      "text": "如此过完了整个春天，白昼越来越长，转眼间就进入了酷暑季节。",
      "level": 2
    },
    {
      "id": "8.4.1",
      "text": "这些日子以来，始终没有降雨，骄阳似火，风干物燥。",
      "level": 3
    },
    {
      "id": "8.4.2",
      "text": "快到中午的时候，也是黑屋地区一天里最清静的时候，大多数人都去干活挣饭了，只有几个女孩子，在忙碌着拾柴烧水，准备煮些昨天的剩饭，给留下来的人吃。",
      "level": 3
    },
    {
      "id": "8.4.3",
      "text": "当天早上，罗大海在野地里布下绳套，套到了一头拱地乱撞的半大野猪，带回黑屋里宰了，开膛剥皮，收拾了下水，全都血淋淋地用钩子钓住，剁下来的猪头顺手扔在了木板子上，准备晚上烧锅肉给大家改善伙食，等中午忙完了，就坐在木棚前的青石板上歇息乘凉。",
      "level": 3
    },
    {
      "id": "8.4.4",
      "text": "这会儿“罗大舌头”早已热得汗流浃背，但仍然歪扣着一顶抢来的破军帽舍不得摘下来，嘴里叼着跟烟卷，一边抽烟一边对司马灰夸夸其谈，话题无非就是等他爹官复原职重新参加工作之后，他是要如何收拾当初给他老罗家帖大字报的那些杂碎。",
      "level": 3
    },
    {
      "id": "8.4.5",
      "text": "司马灰虽然年纪不大，但是经历的坎坷已不算少，使得他对社会的逆反心理格外严重，对此早已不抱任何希望，只是顺口答音，跟罗大海有一句没一句的闲扯。",
      "level": 3
    },
    {
      "id": "8.4.6",
      "text": "正这时，就见由路口走来一个老头。",
      "level": 3
    },
    {
      "id": "8.4.7",
      "text": "司马灰耳目敏锐，有什么风吹草动都躲不开他，稍加打量，就觉得来人有些古怪。",
      "level": 3
    },
    {
      "id": "8.4.8",
      "text": "再仔细一看，只见那老头是个拾破烂的打扮，显得土里土气，而且十分面生，应该是从黑屋废墟外面来的，看样子大约有五十多岁的年纪，小个子不高，生得贼眉pyridazine眼，嘴边留着狗油胡，脖子上挂了串打狗饼，头上顶着八块瓦的一顶破帽子，手里拎把粪叉子，肩上还背了个鼓鼓囊囊的麻布大口袋，身穿老皮袄，前襟系着一排疙瘩栓，长裤子长袄，脚蹬一双踢死牛的厚底黑布鞋，鞋口露着白袜边。",
      "level": 3
    },
    {
      "id": "8.4.8.1",
      "text": "眼下正是骄阳似火的三伏天，看他这身不知冷热的打扮也是反常。",
      "level": 4
    },
    {
      "id": "8.4.9",
      "text": "那拾荒的老头，两眼贼溜溜地在街上东瞧西看，等走到司马灰所在的木棚前，忽然停下了脚步，假意蹲下来提鞋，同时伸头探脑地向棚内张望。",
      "level": 3
    },
    {
      "id": "8.4.10",
      "text": "他这举动瞒得过旁人，却瞒不过司马灰。",
      "level": 3
    },
    {
      "id": "8.4.11",
      "text": "司马灰见此人的行为和打扮全都十分诡异，立刻警觉其来，同时开口问了一句：“看爷们儿脸生，是打哪来的？”",
      "level": 3
    },
    {
      "id": "8.4.12",
      "text": "那拾荒的老头闻言赶忙站直了身子，他拿眼角一扫，已看出司马灰和罗大海是这片废墟棚屋里的团头，马上咧着嘴挤些笑在老脸上，对二人说道：“爷们儿可不敢当，俺姓赵，老家是关东的，从来也没个大号，相识的都管俺叫赵老憋，解放前流落到此，这些年就城里城外混迹各处，靠着捡荒拾茅篮度日。",
      "level": 3
    },
    {
      "id": "8.4.12.1",
      "text": "今天来到贵宝地，是想在黑市上换些生活必需品。”",
      "level": 4
    },
    {
      "id": "8.4.13",
      "text": "司马灰听他说得还算通明，心中却并未减轻戒备之意，再次盘问赵老憋道：“赵师傅穿的这叫什么？大热的天，你就不怕捂坏了身子？”",
      "level": 3
    },
    {
      "id": "8.4.14",
      "text": "赵老憋微微一怔，随即答道：“你们后生不懂，咱穿的这是英雄如意氅，四通八达，到处有风凉。”",
      "level": 3
    },
    {
      "id": "8.4.15",
      "text": "司马灰一听这倒像是些跑江湖的话，现在哪还有人这样说话？不由得更加奇怪了，便又问道：“看您老说话不俗，腿脚也挺利索，但走在破砖烂瓦的废墟里，就不怕崴了脚、迷了路？”",
      "level": 3
    },
    {
      "id": "8.4.16",
      "text": "赵老憋听出对方话里有话，但他似乎不太相信这些话能从司马灰嘴里说出，他也是有意试探，就把脚按前后叉开，站了个不丁不八的步子，答道：“咱这脚底板儿厚实，站得牢，踏得稳，走路走的是逍遥快活步。”",
      "level": 3
    },
    {
      "id": "8.4.17",
      "text": "二人之间的这番对话，全都合着《江湖海底眼》里的暗语，把一旁的罗大舌头听得晕头转向，但赵老憋和司马灰却都已暗中有了些分寸，各自不敢小觑了对方。",
      "level": 3
    },
    {
      "id": "8.4.18",
      "text": "那赵老憋似乎没有任何要走的意思，他说赤日炎炎，路上走得又乏又渴，想跟二位“团头”借个地方歇歇脚，再讨口水喝，他嘴上这么说着，也没等任何人答应，就自己蹲到了棚子跟前。",
      "level": 3
    },
    {
      "id": "8.4.19",
      "text": "司马灰想看看此人到底想做什么，所以并未推阻，还递给赵老憋一个海碗，里面是早上新沏的“老荫茶”。",
      "level": 3
    },
    {
      "id": "8.4.20",
      "text": "赵老憋说了个“谢”字，接过碗来一口气喝个净，把碗底朝天一亮，赞道：“还是这生了茶虫的老荫茶最解渴。”",
      "level": 3
    },
    {
      "id": "8.4.20.1",
      "text": "说完就掏出烟袋锅来，在底下磕了几磕，又填满烟丝，划根火柴点燃了，叭哒叭哒地抽个不停，还没话找话地跟司马灰和罗大海聊了几句，最后总算将话头绕到了正题。",
      "level": 4
    },
    {
      "id": "8.4.21",
      "text": "这个赵老憋自称早年间跑江湖谋生，熟悉人情世故，现在跟城里有些特殊渠道，不仅能走后门，而且可以在黑市上搞到许多好东西。",
      "level": 3
    },
    {
      "id": "8.4.21.1",
      "text": "经过刚才的交谈，他发现司马灰年纪虽轻，却颇懂些昔时规矩，想必也是从旧姓人家里出来的，很是难得。",
      "level": 4
    },
    {
      "id": "8.4.21.2",
      "text": "俗话说得好“光头的进庙、戴帽的归班”，这内行人碰上内行人，就算是进家了，所以他愿意让司马灰和罗大海跟着自己沾点光。",
      "level": 4
    },
    {
      "id": "8.4.22",
      "text": "赵老憋说着话，就象变戏法似的，从他那个破麻袋里，翻出三条高级香烟来，嘻皮笑脸地摆到地上。",
      "level": 3
    },
    {
      "id": "8.4.23",
      "text": "罗大海家里底子深，是个见过世面的人，一看就知道这种烟是仅限于供应高级干部的，普通老百姓根本见不到，即使在黑市上也不好找，有钱都难买。",
      "level": 3
    },
    {
      "id": "8.4.23.1",
      "text": "这家伙出手不凡，一亮就是三条，罗大舌头顿时双眼冒光，忙伸手去拿，嘴里还说：“咱今天毕竟是萍水相逢，头一回见面您老就这么大方，真让我们受之有愧，您是哪个单位的？回头我们一定要写封表扬信，感谢您对我们慷慨无私的援助。”",
      "level": 4
    },
    {
      "id": "8.4.24",
      "text": "赵老憋拦住罗大海刚伸到香烟上的手：“且慢，俺这东西也来得不易，但不管咋个说，咱爷们儿能见着都是有缘，今后就交个朋友来往，彼此之间互通有无。",
      "level": 3
    },
    {
      "id": "8.4.24.1",
      "text": "两位团头，你们看看，能不能让俺用这三条好烟，换你们棚子里的一件……一件东西？”",
      "level": 4
    },
    {
      "id": "8.4.25",
      "text": "罗大海哈哈一笑：“老赵啊老赵，不瞒你说，我们兄弟现在可真是‘黄鼠狼子被人剁掉了尾巴尖儿——周身上下再没半根值钱的毛’，只要你不嫌弃我们棚屋里这堆破烂，看什么东西合适就尽管拿走。”",
      "level": 3
    },
    {
      "id": "8.4.26",
      "text": "司马灰见此情形，不禁暗暗称奇，虽然也想留下那三条香烟，但他头脑还算清醒，在旁拦住赵老憋说：“先别急着成交，你得先说清楚了，到底想换棚屋里的哪件东西。”",
      "level": 3
    },
    {
      "id": "8.4.27",
      "text": "赵老憋似是急不可耐，他眼珠子一转，又从麻袋里摸出一大包卤猪耳朵，还有四听牛肉罐头，都堆在地下说道：“究竟想换哪件东西，还得进棚去挑挑看看才知道。",
      "level": 3
    },
    {
      "id": "8.4.27.1",
      "text": "但俺赵老憋也提前把话撂在这，这些个吃的和纸烟，仅换一样就够了，绝不多拿。”",
      "level": 4
    },
    {
      "id": "8.4.28",
      "text": "司马灰已看出赵老憋大有势在必得之意，哪还没到哪呢，他就自己主动把筹码越开越高，有道是“一赶三不买，一赶三不卖，上赶着的，从来不是买卖”，肯用这么多紧俏稀缺货品来换的，绝非等闲之物，怎能轻易答允。",
      "level": 3
    },
    {
      "id": "8.4.29",
      "text": "而且司马灰还想起一件事情，他当初在北边，曾听过“蛮子憋宝”的传说，凡是风水好的地方，都有宝物埋藏，那可全是天地造化的奇珍异宝，暗中受鬼神所护。",
      "level": 3
    },
    {
      "id": "8.4.29.1",
      "text": "倘若随便触动，难免要招灾惹祸，必须以奇门古术摄之，才能到手。",
      "level": 4
    },
    {
      "id": "8.4.29.2",
      "text": "所以对外从不能说是盗宝、掘藏，而是要说“憋宝”。",
      "level": 4
    },
    {
      "id": "8.4.30",
      "text": "据说“憋宝”之术起源于江西地区，想学这套本事，必须是由小练起，打婴儿刚一降生落地，就得关在暗无天日的地窨子里，等到一百天头上才抱出来，从此这孩子的眼力就异于常人，能够无宝不识，他们管这叫“开地眼”，至于此类传说的真假，外人就难以得知了。",
      "level": 3
    },
    {
      "id": "8.4.31",
      "text": "司马灰见这赵老憋的装扮和举动格外奇特，显得神秘莫测，与听过的种种传说不谋而合，看来多半就是个身怀憋宝异术的奇人。",
      "level": 3
    },
    {
      "id": "8.4.31.1",
      "text": "只不过自己居住的这座棚屋里，箸长碗短，桌椅板凳都不完整，全然不似过日子的人家模样。",
      "level": 4
    },
    {
      "id": "8.4.31.2",
      "text": "也确如罗大海先前所言，棚内连个囫囵的茶碗也找不出一只，哪里会有什么宝物？",
      "level": 4
    },
    {
      "id": "8.4.31.3",
      "text": "赵老憋想要的到底是件什么东西？何况他初来乍道，又是如何发现此地藏着珍异之物？",
      "level": 4
    },
    {
      "id": "9",
      "text": "司马灰从这赵老憋行事格外出人意料，竟然愿意拿值钱的香烟和罐头，换取一个污糟腐旧的屠肉案板，愈发觉得此事不同寻常了。",
      "level": 1
    },
    {
      "id": "9.1",
      "text": "黑屋废墟里到处都是无主之物，谁捡到就是谁的了，棚中这块屠案，本是一段通体的朽木桩子，约有一抱多粗，周围用三道麻绳箍住，常年被血污油腻浸润，木案的颜色早已变了，被捡来后就当作菜板使用，现在没人知道它的具体来历，但看起来除了使用的年头非常多之外，也别无它异。",
      "level": 2
    },
    {
      "id": "9.1.1",
      "text": "平白无故的，怎么会有人看上此物？",
      "level": 3
    },
    {
      "id": "9.2",
      "text": "司马灰一寻思：“这肉案肯定是个什么宝物，我倘若此时被蝇头小利所动，轻易将它换给了赵老憋，不管换多少东西都是吃亏，得先找些借口显得奇货可居。”",
      "level": 2
    },
    {
      "id": "9.2.1",
      "text": "于是他顺口胡说：“老赵师傅，你有所不知，其实我们家本是在北京城里开肉铺的，专以屠猪宰羊为业，这朽木案板虽然普通，却是家里留下来传辈儿的东西，不仅我用着十分顺手，而且‘见鞍思马、睹物思人’，一看见它就想起我们家去世多年的老太爷来了。",
      "level": 3
    },
    {
      "id": "9.2.1.1",
      "text": "那还要追溯到光绪年间，义和团围攻东交民巷，引来八国联军打进了北京城，这伙洋鬼子都是蛮夷化外之地来的，哪有好个鸟啊，到了咱中国自然是烧杀抢掠，无恶不作，打瞎子、骂聋子、踢寡妇门、挖绝户坟、专揍没主儿的狗，你就数吧，凡是缺德的事，没有他们干不出来的，结果一路就抢到我们家来了，几个洋兵瞅见我们家养的大花猫不错，就想抢回去献给他们的女王陛下，惹得我们家老太爷是冲冠一怒，说想当初慈禧太后老佛爷看中了我们家这只猫，拿仨格格来换，都没舍得给她，你们那位番邦老娘们儿又算老几？",
      "level": 4
    },
    {
      "id": "9.2.1.2",
      "text": "他盛怒之下，就跑到街上去扶清灭洋去了，抱着块屠肉案子见着外国人就砸，仅在这块木头板子底下，也不知放翻了多少洋兵洋将。",
      "level": 4
    },
    {
      "id": "9.2.1.3",
      "text": "后来传到我爹那辈儿，落在江西参加了工农红军，一直将它保留至今。",
      "level": 4
    },
    {
      "id": "9.2.1.4",
      "text": "在别人眼里也许这木头疙瘩不值什么，但对我来说，它简直就是我们家经历中国近代革命史的见证，是个割舍不开的念想，每天摆在眼前早请示晚汇报，看不见它我就心里发慌，连北在哪边都找不着了，一日不见如隔三秋，倘若三日不见，着急上火那都是轻的，我说这些话可没有半句虚言，掉在地上能摔八瓣，你要是不信，就找块豆付来，我一脑袋撞出脑浆子来给您瞧瞧。”",
      "level": 4
    },
    {
      "id": "9.2.2",
      "text": "罗大舌头在旁听得好笑，也趁机跟着起哄抬价，蹿叨赵老憋最少再拿三条高级香烟出来，才能将东西换走。",
      "level": 3
    },
    {
      "id": "9.3",
      "text": "赵老憋闻言目瞪口呆，还以为是自己走眼了，他又盯着屠板纳纳地看了半晌，摇了摇头表示不信，并且抖开麻袋让那二人看看，里边已经没有值钱的东西了：“不可能再给你们加码了。”",
      "level": 2
    },
    {
      "id": "9.4",
      "text": "司马灰见事已至此，索性就把话挑明了：“咱是水贼碰上了钻舱的，还使什么狗刨儿啊？干脆就谁都别糊弄谁了。",
      "level": 2
    },
    {
      "id": "9.4.1",
      "text": "你这套我们全懂，以前没少见识过，说话也不用藏着掖着再兜圈子了。",
      "level": 3
    },
    {
      "id": "9.4.2",
      "text": "我们早就看出来你赵老憋是个憋宝的，否则哪有好端端的活人，会在自己脖子上挂串打狗饼。”",
      "level": 3
    },
    {
      "id": "9.4.2.1",
      "text": "“打狗饼”这东西，是种药饼子，可以用来驱赶猫狗。",
      "level": 4
    },
    {
      "id": "9.4.2.2",
      "text": "在早年间，农村死了人，停尸的时候，往往会给尸体颈中挂上这么一串，以防饿狗啃坏了尸首，或是野猫爬过来让死人诈了尸。",
      "level": 4
    },
    {
      "id": "9.4.2.3",
      "text": "憋宝的人常在深山老林或荒坟野地里出没，为了驱避毒蛇和野兽，也都有携带“打狗饼”的习惯。",
      "level": 4
    },
    {
      "id": "9.4.3",
      "text": "赵老憋也看出这司马灰虽然不过十五六岁，却是个鬼灵精，知道的事也多，轻易唬不住他，但绝没料到这小子竟能窥破自己行藏，不禁暗自吃了一惊，佩服地说：“这位团头好眼力，想不到现在这年月，还会有人知道咱憋宝的行当。”",
      "level": 3
    },
    {
      "id": "9.4.4",
      "text": "事到如今，赵老憋也只好坦言相告，承认自己确实是憋宝的，今天也是撞大运，无意间在黑屋废墟发现了这块屠案，真是“踏破铁鞋无觅处，得来全不费工夫”。",
      "level": 3
    },
    {
      "id": "9.4.4.1",
      "text": "最后他告诉司马灰和罗大海：“咱爷们儿当着真人不说假话，有啥说啥，你们这块屠肉的旧木头案子，确实是个罕见之物，但这天下虽大，除了俺赵老憋之外，却再没有第二个人还能识货。",
      "level": 4
    },
    {
      "id": "9.4.4.2",
      "text": "今天时候不早了，咱们先就此别过，你们二人好好合计合计。",
      "level": 4
    },
    {
      "id": "9.4.4.3",
      "text": "既然已经把话说到这个份上了，俺也就不能让你们太吃亏，俺在城里还藏着一件好东西，明天也带过来。",
      "level": 4
    },
    {
      "id": "9.4.4.4",
      "text": "你们到时候要是认准了还不肯换，俺也就别无话了，抬腿就走，走了就再也不回来了，有句老话咋个说的来着？‘过了这个村，可就没有这个店’，到时候你们俩别后悔。”",
      "level": 4
    },
    {
      "id": "9.5",
      "text": "司马灰和罗大海点头同意，二人目送赵老憋离开“黑屋”，便立刻回到棚内，举着煤油灯，把这块糟烂油腻的案板子摆在地上，颠过来倒过来看了半天，但他俩翻来覆去，也没从中瞧出什么子丑寅卯，满肚子都是疑惑。",
      "level": 2
    },
    {
      "id": "9.5.1",
      "text": "当晚思前想后，彻夜难眠。",
      "level": 3
    },
    {
      "id": "10",
      "text": "转天一大早，赵老憋果然又寻上门来，这回在他的麻布口袋里，多出了一件油光毛亮的皮袍子，皮毛黑中透红，有几分像是貂皮，却更为轻薄。",
      "level": 1
    },
    {
      "id": "10.1",
      "text": "不过司马灰和罗大海两人别说貂皮了，长这么大连貂毛也没见过半根，便不懂装懂地问赵老憋：“这是什么皮子？溜光油滑的瞅着还真不错，牛皮的？”",
      "level": 2
    },
    {
      "id": "10.2",
      "text": "赵老憋颇为得意，有几分卖弄地说：“俺这件皮袍子的来历可是不凡。”",
      "level": 2
    },
    {
      "id": "10.2.1",
      "text": "随即给二人讲起了来历，说是解放前他到长白山里挖参，晚上就借宿在木把的木营子中。",
      "level": 3
    },
    {
      "id": "10.2.1.1",
      "text": "那木营子中养了一只老猫，斑斓如虎，肥大憨健，更是灵动非凡，上树能掏鸟窝，下树能逮耗子。",
      "level": 4
    },
    {
      "id": "10.2.1.2",
      "text": "赵老憋在林场子里住得久了，也就与它厮混熟了，常常给这老猫喂些吃食。",
      "level": 4
    },
    {
      "id": "10.2.1.3",
      "text": "可后来每天早上进山时，都会看到那只猫趴在树上，气喘吁吁，显得筋疲力尽，连猫尾巴都懒得动上一动，一连数日都是如此。",
      "level": 4
    },
    {
      "id": "10.2.2",
      "text": "赵老憋心说这可怪了，憋宝的人眼贼，一看之下，料定此猫必有所奇遇，就打定主意要看个究竟，于是暗中跟踪观察，发现只要天一擦黑，这只老猫就去山神庙，从门缝里钻进去就躲在墙角的黑暗中，潜伏起来一动不动。",
      "level": 3
    },
    {
      "id": "10.2.3",
      "text": "等到夜深人静的时候，山神庙的房梁上便发出一阵响动，旋即有只体大如犬的巨鼠，两目闪烁如炬，自梁上而下，爬到神位跟前，将鼠尾伸进灯盏里，偷喝供奉在那里的灯油，并且抱着牛油蜡烛乱啃，发出“嘁嘁嚓嚓”的声音。",
      "level": 3
    },
    {
      "id": "10.2.4",
      "text": "这时那老猫突然从角落里蹿出，与硕鼠相互激斗，但那巨鼠虽大不蠢，而且极其凶残猛恶，丝毫不惧天敌，老猫虽然矫捷，却也奈何它不得，两个翻来覆去斗个不休，真是你死我活、各使神通，难分高下。",
      "level": 3
    },
    {
      "id": "10.2.5",
      "text": "赵老憋借着月光窥得真切，才知此猫每晚必来与这巨鼠相争，所以天亮后累得脱了力。",
      "level": 3
    },
    {
      "id": "10.2.5.1",
      "text": "他偷看这场宿敌之间的恶战看得入了神，也跟着全身发紧，无意间碰倒了一扇破门板。",
      "level": 4
    },
    {
      "id": "10.2.5.2",
      "text": "那巨鼠正自全神贯注的与老猫恶斗，忽听身后传来异响，受着惊吓，只不过稍稍一分神，便露出些许破绽，被老猫扑倒咬断了喉管，顿时血如泉涌，将庙堂地上的石砖都染遍了，挣扎了好一阵子，终于翻出白眼，咽气而亡，这正是“到头分胜败，毕竟有雌雄”。",
      "level": 4
    },
    {
      "id": "10.2.6",
      "text": "赵老憋是博物识宝的行家，知道这巨鼠积年累月的吃油啃蜡，成了气候，道行毕竟不浅，便摸出刀子剥掉鼠皮，回去加些材料，做成了一件皮袄。",
      "level": 3
    },
    {
      "id": "10.2.6.1",
      "text": "到了寒冬腊月里，关外滴水成冰，但只要穿上这老鼠皮袄，哪怕是里边光着脊梁板儿，在三九严寒当中，额头上也会热得冒汗。",
      "level": 4
    },
    {
      "id": "10.2.6.2",
      "text": "只不过他对外人，从不肯说这是百年老鼠皮，而是称其为‘火龙驹’。”",
      "level": 4
    },
    {
      "id": "10.3",
      "text": "赵老憋对司马灰和罗大海说，别看现在酷暑炎热，但等到秋风起，树叶黄，天上大雁“嘎儿嘎儿”叫着往南飞的时候，你们仍住在黑屋破棚子里，可就难保不会受到阴冷潮湿之气侵害，身上迟早要落下病根，到时必定离不开俺这件“火龙驹皮袄”。",
      "level": 2
    },
    {
      "id": "10.4",
      "text": "司马灰心知这件皮袄已是赵老憋出的“底牌”了，反正凭自己的眼力和见识，根本看不出那旧木墩子是个什么宝物，不如就换给此人罢了，当即答允下来。",
      "level": 2
    },
    {
      "id": "10.4.1",
      "text": "但他又对赵老憋说：“这桩生意跟你做了倒也无妨，可老师傅您得敞亮点，别让我们吃糊涂亏，应该把这块屠肉木案的来龙去脉，全都说清楚了，以及你究竟是如何发现此物有异，拿去了又有什么用途？",
      "level": 3
    },
    {
      "id": "10.4.1.1",
      "text": "如果有一处讲不清，我司马灰豁着把它当堂劈碎了烧火，也绝不肯让你白捡这天大的便宜。”",
      "level": 4
    },
    {
      "id": "10.5",
      "text": "赵老憋十分为难地说：“司马团头，你的理岔了，古话咋说的——‘绣取鸳鸯凭君看，莫把金针渡与人’，咱们两下交易，是以物换物，又不曾亏失了你半分一毫，咋能硬要套问俺的底细？”",
      "level": 2
    },
    {
      "id": "10.6",
      "text": "司马灰和罗大海虽然在社会上闯荡了几时，却毕竟都是少年心性，好奇心重，凡事都要查个水落石出才算完，不打听明白了，连晚上睡觉都睡不安稳，二人软磨硬泡，死说活求，非逼着赵老憋交底不可，并且发了誓，事后绝不变卦反悔，也不会当叛徒出首告秘。",
      "level": 2
    },
    {
      "id": "10.7",
      "text": "赵老憋碰上这两位只好自认倒霉了，不得不交出几分实底：世间都说憋宝的蛮子眼尖，事实也确是如此，他昨天中午路过黑屋废墟，一眼瞥过去，发觉有片棚户不同寻常。",
      "level": 2
    },
    {
      "id": "10.7.1",
      "text": "识宝的眼力是门功夫，更是经验，怎么讲呢？",
      "level": 3
    },
    {
      "id": "10.7.1.1",
      "text": "其实真要说穿了，也没有民间传言中的那么邪乎，并不是还离得好远，就已看见木棚子里金光闪闪，而是憋宝的人极善观察，往往能够发现常人难以察觉的细微之处。",
      "level": 4
    },
    {
      "id": "10.7.2",
      "text": "赵老憋由打跟前一走，就发觉这座木棚附近，存在着许多反常的迹象。",
      "level": 3
    },
    {
      "id": "10.7.3",
      "text": "照理说，这么炎热的天气，黑屋地区垃圾堆得都成了山，罗大海又剔剥了一头野猪，弄得遍地都是血腥，周围该当是蚊蝇盘旋，嗡嗡扰乱不休才对。",
      "level": 3
    },
    {
      "id": "10.7.3.1",
      "text": "可是司马灰与罗大海身后的棚屋周围，不见半只飞蝇，这不是怪事吗？",
      "level": 4
    },
    {
      "id": "10.7.4",
      "text": "赵老憋料定这附近可能藏有宝物，当即停下脚步，谎称讨碗水喝，趁机坐在木棚门前，向四处仔细打量起来，最后把目光落在了剁肉的朽木案板之上。",
      "level": 3
    },
    {
      "id": "10.7.5",
      "text": "那肉案是截老木头桩子，四周拿麻绳箍着，案上摆着死不闭眼的一颗猪首，鲜血滴落在案面上，也不见血水向外流淌，竟都缓缓渗到木桩的缝隙中去了。",
      "level": 3
    },
    {
      "id": "10.7.6",
      "text": "赵老憋一眼就断定在这污糟油腻的木案之内，必然有些奇异。",
      "level": 3
    },
    {
      "id": "10.7.7",
      "text": "这块作为肉案的木头墩子，当年定是取自一株大树，在那株树木在被人砍伐之前，树身上已生有虫孔木隙，恰巧里面钻进去了一条细小的蜈蚣。",
      "level": 3
    },
    {
      "id": "10.7.7.1",
      "text": "因为它在树里住得久了，体形渐大，难以再从先前进来的窟窿里脱身，以至被困在树内，木性属阴，经络中含有汁液，养着蜈蚣多年不死。",
      "level": 4
    },
    {
      "id": "10.7.8",
      "text": "后来经人伐树取材，把藏有蜈蚣的这段木头，削作了肉铺中屠肉放血的案板。",
      "level": 3
    },
    {
      "id": "10.7.9",
      "text": "树中蜈蚣得以不断吸噬猪血，年深日久，在体内结出了一枚“定风珠”，因为据说蜈蚣珠能治痛风，才得此名，倒不是取西经三调笆蕉扇时用的那枚珠子。",
      "level": 3
    },
    {
      "id": "10.7.10",
      "text": "而后这段肉案木墩被屠户抛弃，不知怎么就遗落在了黑屋废墟，里面的老蜈蚣早已饿死了，但珠子应该还在。",
      "level": 3
    },
    {
      "id": "10.7.11",
      "text": "这定风珠是阴腐血气凝结为丹，才使得周围蚊蝇莫近，赵老憋所求之物，正是此珠。",
      "level": 3
    }
  ],
  "concepts": [
    {
      "name": "清末民初",
      "frequency": 1,
      "context": "Describes the historical period."
    },
    {
      "name": "动荡年月",
      "frequency": 1,
      "context": "Characterizes the period of dynastic change."
    },
    {
      "name": "绿林盗贼",
      "frequency": 4,
      "context": "Refers to bandits and outlaws, a central theme."
    },
    {
      "name": "飞贼",
      "frequency": 2,
      "context": "A type of thief known for agility."
    },
    {
      "name": "剧盗",
      "frequency": 1,
      "context": "A term for notorious criminals."
    },
    {
      "name": "康小八",
      "frequency": 4,
      "context": "The first of the 'Four Thieves', a notorious criminal."
    },
    {
      "name": "转轮洋枪",
      "frequency": 1,
      "context": "A type of firearm."
    },
    {
      "name": "宋锡朋",
      "frequency": 4,
      "context": "The second of the 'Four Thieves', known as 'Stone Buddha Song'."
    },
    {
      "name": "石佛宋",
      "frequency": 1,
      "context": "Nickname for Song Xipeng."
    },
    {
      "name": "义和团",
      "frequency": 2,
      "context": "A historical anti-foreign movement."
    },
    {
      "name": "皇杠",
      "frequency": 1,
      "context": "Official silver transported by salt officials."
    },
    {
      "name": "慈禧太后",
      "frequency": 2,
      "context": "A prominent historical figure."
    },
    {
      "name": "燕子李三",
      "frequency": 4,
      "context": "The third of the 'Four Thieves', known for his lightness skill."
    },
    {
      "name": "轻功",
      "frequency": 1,
      "context": "A martial arts skill involving lightness and agility."
    },
    {
      "name": "芙蓉膏",
      "frequency": 1,
      "context": "A type of opium or drug."
    },
    {
      "name": "滚地雷",
      "frequency": 2,
      "context": "Nickname of Tian Huaxing, one of the 'Four Thieves'."
    },
    {
      "name": "坐地炮",
      "frequency": 2,
      "context": "Nickname of Tian Huafeng, brother of 'Rolling Thunder'."
    },
    {
      "name": "田化星",
      "frequency": 2,
      "context": "One of the 'Four Thieves', elder brother."
    },
    {
      "name": "田化峰",
      "frequency": 1,
      "context": "One of the 'Four Thieves', younger brother."
    },
    {
      "name": "景陵",
      "frequency": 3,
      "context": "The tomb of Emperor Kangxi."
    },
    {
      "name": "九龙杯",
      "frequency": 4,
      "context": "A legendary imperial treasure."
    },
    {
      "name": "雁团",
      "frequency": 1,
      "context": "A group of bandits from Dongting Lake."
    },
    {
      "name": "张葫芦",
      "frequency": 6,
      "context": "A character who moves from banditry to legitimate business, eventually adopting the surname Sima."
    },
    {
      "name": "宅仙",
      "frequency": 1,
      "context": "A household deity."
    },
    {
      "name": "盛源当铺",
      "frequency": 2,
      "context": "A pawnshop that was a rival to the Zhang family."
    },
    {
      "name": "穆",
      "frequency": 1,
      "context": "The surname of the owner of 'Shengyuan Pawnshop'."
    },
    {
      "name": "蝎子倒爬城",
      "frequency": 1,
      "context": "A martial arts technique."
    },
    {
      "name": "南洋",
      "frequency": 1,
      "context": "Refers to Southeast Asia, a place of escape."
    },
    {
      "name": "走西口",
      "frequency": 1,
      "context": "A historical migration route."
    },
    {
      "name": "闯关东",
      "frequency": 1,
      "context": "A historical migration route to Manchuria."
    },
    {
      "name": "马达子",
      "frequency": 1,
      "context": "A term related to banditry or hunting."
    },
    {
      "name": "司马",
      "frequency": 5,
      "context": "The surname adopted by Zhang Hulu."
    },
    {
      "name": "土改",
      "frequency": 1,
      "context": "Land reform."
    },
    {
      "name": "民主联军",
      "frequency": 1,
      "context": "The democratic allied forces."
    },
    {
      "name": "司马灰",
      "frequency": 7,
      "context": "The son of Zhang Hulu (Sima Hulu)."
    },
    {
      "name": "金点先生",
      "frequency": 2,
      "context": "A fortune teller or diviner."
    },
    {
      "name": "土命",
      "frequency": 1,
      "context": "A person's element in traditional Chinese astrology."
    },
    {
      "name": "灰家",
      "frequency": 1,
      "context": "Refers to rats, associated with the element earth in the zodiac."
    },
    {
      "name": "灰八爷",
      "frequency": 1,
      "context": "A deity worshipped in opera troupes, associated with rats."
    },
    {
      "name": "文武先生",
      "frequency": 2,
      "context": "A teacher of both literary and martial arts."
    },
    {
      "name": "倒霉",
      "frequency": 1,
      "context": "Bad luck."
    },
    {
      "name": "黑屋",
      "frequency": 9,
      "context": "A place name, a desolate area where marginalized people gather."
    },
    {
      "name": "右派",
      "frequency": 2,
      "context": "Individuals labeled as political dissidents."
    },
    {
      "name": "十年动乱",
      "frequency": 1,
      "context": "Refers to the Cultural Revolution."
    },
    {
      "name": "社会底层",
      "frequency": 1,
      "context": "Marginalized members of society."
    },
    {
      "name": "龙蛇混杂",
      "frequency": 1,
      "context": "A mixed bag of people, often with criminal elements."
    },
    {
      "name": "春风战斗团",
      "frequency": 4,
      "context": "A gang of young people led by Sima Hui and Luo Dahai."
    },
    {
      "name": "罗大海",
      "frequency": 6,
      "context": "Sima Hui's best friend in the 'Spring Wind Combat Group'."
    },
    {
      "name": "罗大舌头",
      "frequency": 2,
      "context": "Nickname for Luo Dahai due to his unclear speech."
    },
    {
      "name": "江湖",
      "frequency": 1,
      "context": "The world of vagrants and criminals; the underworld."
    },
    {
      "name": "六国饭店",
      "frequency": 2,
      "context": "A makeshift eatery created by Sima Hui's group."
    },
    {
      "name": "野猪",
      "frequency": 2,
      "context": "An animal that Luo Dahai hunted."
    },
    {
      "name": "赵老憋",
      "frequency": 11,
      "context": "A mysterious old man encountered in 'Black House' who is a 'treasure憋' (concealer/keeper)."
    },
    {
      "name": "打狗饼",
      "frequency": 3,
      "context": "A medicinal cake used to ward off dogs and potentially other creatures."
    },
    {
      "name": "憋宝",
      "frequency": 5,
      "context": "The art of concealing or guarding treasures, often with supernatural elements."
    },
    {
      "name": "江湖海底眼",
      "frequency": 1,
      "context": "A book or set of principles related to underworld jargon."
    },
    {
      "name": "团头",
      "frequency": 2,
      "context": "Leader of a group or gang."
    },
    {
      "name": "定风珠",
      "frequency": 2,
      "context": "A legendary pearl found in a centipede, said to have medicinal properties."
    },
    {
      "name": "火龙驹",
      "frequency": 2,
      "context": "The name Zhao Laobie gives to the rat-skin coat."
    }
  ],
  "relations": [
    {
      "source": "绿林盗贼",
      "target": "康小八",
      "type": "is_a"
    },
    {
      "source": "绿林盗贼",
      "target": "宋锡朋",
      "type": "is_a"
    },
    {
      "source": "绿林盗贼",
      "target": "燕子李三",
      "type": "is_a"
    },
    {
      "source": "绿林盗贼",
      "target": "滚地雷",
      "type": "is_a"
    },
    {
      "source": "绿林盗贼",
      "target": "坐地炮",
      "type": "is_a"
    },
    {
      "source": "康小八",
      "target": "飞贼",
      "type": "is_a"
    },
    {
      "source": "宋锡朋",
      "target": "石佛宋",
      "type": "has_nickname"
    },
    {
      "name": "轻功",
      "type": "skilled_in"
    },
    {
      "name": "滚地雷",
      "type": "has_nickname"
    },
    {
      "name": "坐地炮",
      "type": "has_nickname"
    },
    {
      "name": "景陵",
      "type": "attempts_to_rob"
    },
    {
      "name": "景陵",
      "type": "robs"
    },
    {
      "name": "九龙杯",
      "type": "desires"
    },
    {
      "name": "九龙杯",
      "type": "steals"
    },
    {
      "name": "绿林",
      "type": "comes_from"
    },
    {
      "name": "当铺",
      "type": "opens"
    },
    {
      "name": "穆",
      "type": "rivals"
    },
    {
      "name": "司马",
      "target": "张葫芦",
      "type": "adopted_by"
    },
    {
      "name": "司马灰",
      "target": "司马",
      "type": "surname_is"
    },
    {
      "name": "司马灰",
      "target": "张葫芦",
      "type": "son_of"
    },
    {
      "name": "司马灰",
      "target": "文武先生",
      "type": "studies_under"
    },
    {
      "name": "司马灰",
      "target": "黑屋",
      "type": "moves_to"
    },
    {
      "name": "司马灰",
      "target": "右派",
      "type": "parents_are"
    },
    {
      "name": "司马灰",
      "target": "春风战斗团",
      "type": "is_leader_of"
    },
    {
      "name": "罗大海",
      "target": "春风战斗团",
      "type": "is_leader_of"
    },
    {
      "name": "罗大海",
      "target": "罗大舌头",
      "type": "has_nickname"
    },
    {
      "name": "司马灰",
      "target": "罗大海",
      "type": "is_friend_of"
    },
    {
      "name": "司马灰",
      "target": "六国饭店",
      "type": "creates"
    },
    {
      "name": "罗大海",
      "target": "野猪",
      "type": "hunts"
    },
    {
      "name": "赵老憋",
      "target": "黑屋",
      "type": "appears_in"
    },
    {
      "name": "赵老憋",
      "target": "憋宝",
      "type": "practices"
    },
    {
      "name": "赵老憋",
      "target": "打狗饼",
      "type": "wears"
    },
    {
      "name": "赵老憋",
      "target": "屠肉案板",
      "type": "desires"
    },
    {
      "name": "赵老憋",
      "target": "火龙驹",
      "type": "offers_as_trade"
    },
    {
      "name": "屠肉案板",
      "target": "定风珠",
      "type": "contains"
    },
    {
      "name": "司马灰",
      "target": "屠肉案板",
      "type": "trades_for"
    },
    {
      "name": "罗大海",
      "target": "屠肉案板",
      "type": "trades_for"
    },
    {
      "name": "憋宝",
      "target": "定风珠",
      "type": "seeks"
    }
  ],
  "hierarchy": {
    "main_topics": [
      "The Four Thieves",
      "The Legend of Zhang Hulu and Sima Hui",
      "Life in 'Black House'"
    ],
    "structure": "The document begins with an introduction to the era and the concept of 'Four Thieves'. It then details each of the Four Thieves individually: Kang Xiaoba, Stone Buddha Song, Swallow Li San, and the Rolling Thunder and Sitting Cannon brothers. Following this, it introduces a more significant figure, Zhang Hulu, and traces his lineage and the origins of Sima Hui. The narrative then shifts to Sima Hui's life in 'Black House' with his gang, the 'Spring Wind Combat Group', and his encounter with Zhao Laobie, who is seeking a hidden treasure."
  }
}