{
  "propositions": [
    {
      "id": "1",
      "text": "The story begins with the narrator and his friend Chouyu trying to get their friend Hao to reveal the mystery of his three-day disappearance.",
      "level": 1
    },
    {
      "id": "1.1",
      "text": "They conspire to get Hao drunk and then physically pressure him into confessing.",
      "level": 2
    },
    {
      "id": "1.2",
      "text": "Hao eventually confesses that he went to a specific place and has something to show them.",
      "level": 2
    },
    {
      "id": "1.3",
      "text": "Hao retrieves a wooden box containing a bronze artifact wrapped in red cloth.",
      "level": 2
    },
    {
      "id": "1.4",
      "text": "The bronze artifact is identified as an ancient lamp with five monstrous faces around its rim.",
      "level": 2
    },
    {
      "id": "1.5",
      "text": "Hao claims the lamp is worth at least five million yuan and is a Qin Dynasty artifact with a historical anecdote attached.",
      "level": 2
    },
    {
      "id": "2",
      "text": "The anecdote concerns General Meng Tian and his forced suicide during the reign of Qin Er Shi (Hu Hai).",
      "level": 1
    },
    {
      "id": "2.1",
      "text": "Meng Tian requested to light a lamp from his hometown before drinking the poison, to guide his soul.",
      "level": 2
    },
    {
      "id": "2.2",
      "text": "However, when the messenger returned to collect Meng Tian's body, he was gone.",
      "level": 2
    },
    {
      "id": "3",
      "text": "Hao reveals that the bronze lamp is the very artifact Meng Tian used before his disappearance.",
      "level": 1
    },
    {
      "id": "4",
      "text": "Hao admits he bought the lamp from an old man running a pharmacy for only three thousand yuan.",
      "level": 1
    },
    {
      "id": "4.1",
      "text": "He also claims the old man possesses many other valuable items.",
      "level": 2
    },
    {
      "id": "5",
      "text": "The narrator and Chouyu decide to rob the old man, planning to travel to his remote pharmacy.",
      "level": 1
    },
    {
      "id": "6",
      "text": "Their journey is interrupted by a sudden, heavy rainstorm.",
      "level": 1
    },
    {
      "id": "7",
      "text": "Hao explains that the old man is eccentric and only sells his treasures after hearing a terrifying story.",
      "level": 1
    },
    {
      "id": "7.1",
      "text": "Hao recounts his own experience of buying the lamp after telling a ghost story.",
      "level": 2
    },
    {
      "id": "8",
      "text": "Hao begins to tell his ghost story, starting with his cousin and her magician boyfriend.",
      "level": 1
    },
    {
      "id": "8.1",
      "text": "The cousin, a successful professional, was hesitant to marry until she met a magician.",
      "level": 2
    },
    {
      "id": "8.2",
      "text": "The narrator initially distrusts the magician, viewing him as a trickster.",
      "level": 2
    },
    {
      "id": "8.3",
      "text": "The narrator witnesses the magician's impressive tricks, including a vanishing act where he himself temporarily disappears from the stage.",
      "level": 2
    },
    {
      "id": "8.4",
      "text": "The magician then attempts his signature trick: 'wall-piercing'.",
      "level": 2
    },
    {
      "id": "8.5",
      "text": "During the wall-piercing trick, the magician enters a solid wall but never reappears.",
      "level": 2
    },
    {
      "id": "8.6",
      "text": "The narrator and his cousin rush backstage to find the magician's assistant trying to break down the wall, but the magician is gone.",
      "level": 2
    },
    {
      "id": "8.7",
      "text": "The cousin remembers that the magician's tricks are linked to two specific lamps, one of which was in his dressing room.",
      "level": 2
    },
    {
      "id": "8.8",
      "text": "They find the second lamp in the magician's home, and as they approach it, the room plunges into darkness, and they find themselves in a desolate, foggy, open space populated by ghosts.",
      "level": 2
    },
    {
      "id": "8.9",
      "text": "A female ghost appears, explaining that she and her husband were trapped in the lamps and helped the magician perform his feats using ancient powers.",
      "level": 2
    },
    {
      "id": "8.10",
      "text": "The magician disappeared because his assistant stole one of the lamps, breaking the connection and trapping him between dimensions.",
      "level": 2
    },
    {
      "id": "8.11",
      "text": "The female ghost leads the narrator to a remote pharmacy, the 'Ciji Tang Old Pharmacy', where she claims the assistant brought the stolen lamp.",
      "level": 2
    },
    {
      "id": "8.12",
      "text": "Inside the pharmacy, the narrator confronts the old man, who denies stealing the lamp and demands proof of the ghosts.",
      "level": 2
    },
    {
      "id": "8.13",
      "text": "The narrator invents a story about killing his cousin and faking her death to trick the old man, making him believe the ghosts are real.",
      "level": 2
    },
    {
      "id": "8.14",
      "text": "The story concludes with a recorded scream being played, convincing the old man to sell the lamp to Hao.",
      "level": 2
    },
    {
      "id": "9",
      "text": "The narrator and Chouyu express their disbelief and impatience with Hao's storytelling.",
      "level": 1
    },
    {
      "id": "10",
      "text": "Hao explains that the ghost story was a fabricated tale to scare the old man and that he had pre-recorded the scream.",
      "level": 1
    }
  ],
  "concepts": [
    {
      "name": "Mystery",
      "frequency": 2,
      "context": "The narrator and Chouyu's attempt to uncover the mystery of Hao's disappearance."
    },
    {
      "name": "Deception",
      "frequency": 3,
      "context": "The narrator and Chouyu's methods to make Hao confess; Hao's fabricated ghost story."
    },
    {
      "name": "Ancient Artifact",
      "frequency": 4,
      "context": "The bronze lamp, its historical significance, and its purported powers."
    },
    {
      "name": "Qin Dynasty",
      "frequency": 2,
      "context": "The historical period of the bronze lamp and the story of Meng Tian."
    },
    {
      "name": "Historical Anecdote",
      "frequency": 3,
      "context": "The story of Meng Tian's forced suicide and the lamp's association with it."
    },
    {
      "name": "Greed",
      "frequency": 3,
      "context": "The narrator and Chouyu's desire for wealth from the lamp and other treasures; Hao's desire for wealth."
    },
    {
      "name": "Supernatural",
      "frequency": 7,
      "context": "Ghosts, ghost stories, supernatural powers (wall-piercing, five ghosts moving), trapped souls."
    },
    {
      "name": "Magic",
      "frequency": 6,
      "context": "The magician's tricks, especially the wall-piercing and vanishing acts, and their connection to the supernatural."
    },
    {
      "name": "Ghost Story",
      "frequency": 4,
      "context": "The narrative device used by Hao to obtain the lamp; the elements of horror and suspense."
    },
    {
      "name": "Pharmacy",
      "frequency": 3,
      "context": "The setting of the old man's shop, both in reality and within Hao's story."
    },
    {
      "name": "Betrayal",
      "frequency": 1,
      "context": "The magician's assistant betraying him by stealing the lamp."
    },
    {
      "name": "Sacrifice",
      "frequency": 1,
      "context": "The cousin's implied willingness for the narrator to be sacrificed for her happiness; the narrator's own 'sacrifice' of going to catch the thief."
    },
    {
      "name": "Ingenuity",
      "frequency": 1,
      "context": "Hao's cleverness in concocting a story and using a recorded scream."
    }
  ],
  "relations": [
    {
      "source": "Mystery",
      "target": "Hao",
      "type": "associated_with"
    },
    {
      "source": "Deception",
      "target": "Narrator",
      "type": "employed_by"
    },
    {
      "source": "Deception",
      "target": "Chouyu",
      "type": "employed_by"
    },
    {
      "source": "Deception",
      "target": "Hao",
      "type": "employed_in_story_of"
    },
    {
      "source": "Ancient Artifact",
      "target": "Bronze Lamp",
      "type": "is_a"
    },
    {
      "source": "Bronze Lamp",
      "target": "Qin Dynasty",
      "type": "originates_from"
    },
    {
      "source": "Bronze Lamp",
      "target": "Meng Tian",
      "type": "associated_with"
    },
    {
      "source": "Historical Anecdote",
      "target": "Meng Tian",
      "type": "features"
    },
    {
      "source": "Greed",
      "target": "Narrator",
      "type": "motivates"
    },
    {
      "source": "Greed",
      "target": "Chouyu",
      "type": "motivates"
    },
    {
      "source": "Greed",
      "target": "Hao",
      "type": "motivates"
    },
    {
      "source": "Supernatural",
      "target": "Ghosts",
      "type": "includes"
    },
    {
      "source": "Supernatural",
      "target": "Ghost Stories",
      "type": "related_to"
    },
    {
      "source": "Magic",
      "target": "Magician",
      "type": "performed_by"
    },
    {
      "source": "Magic",
      "target": "Bronze Lamp",
      "type": "enabled_by"
    },
    {
      "source": "Ghost Story",
      "target": "Hao",
      "type": "told_by"
    },
    {
      "source": "Ghost Story",
      "target": "Old Man",
      "type": "told_to"
    },
    {
      "source": "Pharmacy",
      "target": "Old Man",
      "type": "owned_by"
    },
    {
      "source": "Betrayal",
      "target": "Magician's Assistant",
      "type": "committed_by"
    },
    {
      "source": "Betrayal",
      "target": "Magician",
      "type": "victim_of"
    },
    {
      "source": "Ingenuity",
      "target": "Hao",
      "type": "demonstrated_by"
    },
    {
      "source": "Bronze Lamp",
      "target": "Two Lamps",
      "type": "part_of_a_set_of"
    },
    {
      "source": "Female Ghost",
      "target": "Male Ghost",
      "type": "spouse_of"
    },
    {
      "source": "Female Ghost",
      "target": "Magician",
      "type": "aided"
    },
    {
      "source": "Magician",
      "target": "Wall-Piercing",
      "type": "performed"
    },
    {
      "source": "Magician",
      "target": "Vanishing Act",
      "type": "performed"
    },
    {
      "source": "Old Man",
      "target": "Ciji Tang Old Pharmacy",
      "type": "runs"
    },
    {
      "source": "Narrator",
      "target": "Cousin",
      "type": "related_to"
    },
    {
      "source": "Cousin",
      "target": "Magician",
      "type": "boyfriend_of"
    }
  ],
  "hierarchy": {
    "main_topics": [
      "Introduction of Mystery and Intrigue",
      "The Ancient Artifact and its History",
      "The Plan for Robbery and the Journey",
      "The Ghost Story as a Deceptive Tool",
      "The Revelation of Hao's Deception"
    ],
    "structure": "The document follows a narrative structure, beginning with the present-day setup, then delving into historical anecdotes and a lengthy ghost story told by Hao, which serves as a tool for deception, and finally concluding with the revelation of Hao's plan and the true nature of his story. The ghost story itself is structured as a nested narrative within the main plot."
  }
}