{
  "propositions": [
    {
      "id": "1",
      "text": "The story is set in Room 4 Anatomical",
      "level": 1
    },
    {
      "id": "1.1",
      "text": "The author considers \"being buried alive\" a compelling theme for suspense writers.",
      "level": 2
    },
    {
      "id": "1.1.1",
      "text": "A terrifying Alfred Hitchcock episode involved a character named Joseph Cotten who was mistakenly declared dead and was about to be autopsied.",
      "level": 3
    },
    {
      "id": "1.1.1.1",
      "text": "He was saved by a tear, revealing he was alive.",
      "level": 4
    },
    {
      "id": "1.1.2",
      "text": "The author was inspired by this story to write a modern narrative.",
      "level": 3
    },
    {
      "id": "1.2",
      "text": "The author expresses doubt about the existence of a \"Peruvian Tree Snake\" but was inspired by Agatha Christie's mention of an \"African Tree Snake\" in her work.",
      "level": 2
    },
    {
      "id": "2",
      "text": "The protagonist wakes up in darkness, disoriented.",
      "level": 1
    },
    {
      "id": "2.1",
      "text": "He hears a faint, rhythmic creaking sound, indicating movement.",
      "level": 2
    },
    {
      "id": "2.2",
      "text": "He smells rubber or plastic film.",
      "level": 2
    },
    {
      "id": "2.3",
      "text": "He experiences clear sensations, not dreams.",
      "level": 2
    },
    {
      "id": "2.4",
      "text": "He questions his identity and what has happened to him.",
      "level": 2
    },
    {
      "id": "2.5",
      "text": "The creaking stops, and he hears crackling sounds from the rubbery material.",
      "level": 2
    },
    {
      "id": "2.6",
      "text": "He overhears a conversation about 'which one' and 'four'.",
      "level": 2
    },
    {
      "id": "2.7",
      "text": "He is moved again, this time slower, hearing soft footsteps.",
      "level": 2
    },
    {
      "id": "2.8",
      "text": "A heavy thud and a faint \"creak\" suggest a door with a pneumatic hinge opening.",
      "level": 2
    },
    {
      "id": "2.9",
      "text": "He tries to shout but his lips are stiff, and his tongue feels immobile.",
      "level": 2
    },
    {
      "id": "2.10",
      "text": "The object he is on rolls again, identifying it as a hospital gurney.",
      "level": 2
    },
    {
      "id": "2.11",
      "text": "He deduces he is in a hospital after some unfortunate incident, possibly related to a past injury.",
      "level": 2
    },
    {
      "id": "2.12",
      "text": "He realizes he cannot see or speak, questioning why nurses would act this way.",
      "level": 2
    },
    {
      "id": "2.13",
      "text": "A new voice calls out, and his gurney is moved.",
      "level": 2
    },
    {
      "id": "2.14",
      "text": "He identifies himself as Howard Courtnall, a stockbroker nicknamed 'Conqueror Howard'.",
      "level": 2
    },
    {
      "id": "2.15",
      "text": "He overhears a conversation involving \"Rusty\" and a woman impatient to leave.",
      "level": 2
    },
    {
      "id": "2.16",
      "text": "He hears a sound he enjoys, like a golf club hitting a ball from a tree.",
      "level": 2
    },
    {
      "id": "2.17",
      "text": "He is grabbed by the shoulders and legs, and lifted, trying to shout but making no sound.",
      "level": 2
    },
    {
      "id": "2.18",
      "text": "He is swung in the air, fearing injury and inability to move his lips or tongue.",
      "level": 2
    },
    {
      "id": "2.19",
      "text": "He fears his tongue might block his airway, leading to suffocation.",
      "level": 2
    },
    {
      "id": "2.20",
      "text": "He overhears Rusty comparing him to Michael Bolton.",
      "level": 2
    },
    {
      "id": "2.21",
      "text": "A third voice, a young boy, describes Michael Bolton as a white singer wanting to be black.",
      "level": 2
    },
    {
      "id": "2.22",
      "text": "Laughter ensues, and he is placed on a padded table.",
      "level": 2
    },
    {
      "id": "2.23",
      "text": "Rusty starts making crackling sounds, and the protagonist fears suffocation again.",
      "level": 2
    },
    {
      "id": "2.24",
      "text": "He questions if he is dead and if this is what death feels like.",
      "level": 2
    },
    {
      "id": "2.25",
      "text": "He feels comfortable but senses terror due to darkness and the rubbery smell, believing he is dead.",
      "level": 2
    },
    {
      "id": "2.26",
      "text": "He recalls his identity as Howard Courtnall, a successful stockbroker and golfer.",
      "level": 2
    },
    {
      "id": "2.27",
      "text": "He realizes he is in a body bag.",
      "level": 2
    },
    {
      "id": "2.28",
      "text": "He hears a request to sign something on a clipboard.",
      "level": 2
    },
    {
      "id": "2.29",
      "text": "He desperately wants to shout but cannot.",
      "level": 2
    },
    {
      "id": "2.30",
      "text": "He wonders if he is breathing, as he doesn't feel it but his lungs seem fine.",
      "level": 2
    },
    {
      "id": "2.31",
      "text": "An inner voice suggests that the desperate need for air indicates he is not dead, as dead lungs don't need air.",
      "level": 2
    },
    {
      "id": "2.32",
      "text": "Rusty asks the doctor about her plans for next Saturday.",
      "level": 2
    },
    {
      "id": "2.33",
      "text": "He questions how he could feel or smell if he were dead, and notes the doctor's plan to wash her dog, Rusty.",
      "level": 2
    },
    {
      "id": "2.34",
      "text": "He hears a tearing sound and is suddenly exposed to bright white light.",
      "level": 2
    },
    {
      "id": "2.35",
      "text": "His eyelids are unable to close, and a young, handsome man with a green surgical cap appears.",
      "level": 2
    },
    {
      "id": "2.36",
      "text": "The man notes his resemblance to Michael Bolton, with some scars.",
      "level": 2
    },
    {
      "id": "2.37",
      "text": "He desperately wants to sing but can only stare.",
      "level": 2
    },
    {
      "id": "2.38",
      "text": "He wonders if he is dead, how he died, and the process of death.",
      "level": 2
    },
    {
      "id": "2.39",
      "text": "He realizes his pupils are not constricting in the light.",
      "level": 2
    },
    {
      "id": "2.40",
      "text": "He calls out for help to the young doctor, pleading.",
      "level": 2
    },
    {
      "id": "2.41",
      "text": "The young doctor turns away, and the intense light is unbearable.",
      "level": 2
    },
    {
      "id": "2.42",
      "text": "He hears a sound like a golf club hitting a ball and feels unwell.",
      "level": 2
    },
    {
      "id": "2.43",
      "text": "Another face, Rusty, appears, described as unintelligent and grinning.",
      "level": 2
    },
    {
      "id": "2.44",
      "text": "Rusty urges him to sing, while the female doctor tells him to stop.",
      "level": 2
    },
    {
      "id": "2.45",
      "text": "Mike explains that the protagonist was found near the 14th hole of a golf club, his leg caught in bushes.",
      "level": 2
    },
    {
      "id": "2.46",
      "text": "He recalls the sound of a golf club hitting bushes and the presence of poisonous ivy.",
      "level": 2
    },
    {
      "id": "2.47",
      "text": "Rusty's interest is in his resemblance to Michael Bolton.",
      "level": 2
    },
    {
      "id": "2.48",
      "text": "The female doctor asks if the attending physician is Kazarian.",
      "level": 2
    },
    {
      "id": "2.49",
      "text": "Mike states that a doctor from the golfing pair, Christ Jennings, found him and signed the initial report.",
      "level": 2
    },
    {
      "id": "2.50",
      "text": "He deduces he is alive because he can smell onions from Rusty's breath.",
      "level": 2
    },
    {
      "id": "2.51",
      "text": "Rusty moves closer, and the protagonist hopes for CPR.",
      "level": 2
    },
    {
      "id": "2.52",
      "text": "Rusty grabs his jaw, proclaiming he is alive and will sing for the \"Michael Bolton fan club of Room 4 Anatomical\".",
      "level": 2
    },
    {
      "id": "2.53",
      "text": "Rusty's fingers tighten, causing pain.",
      "level": 2
    },
    {
      "id": "2.54",
      "text": "The female doctor stops Rusty, who continues singing off-key.",
      "level": 2
    },
    {
      "id": "2.55",
      "text": "A woman in a green uniform, described like \"Cicero Kid\", intervenes and pulls Rusty away.",
      "level": 2
    },
    {
      "id": "2.56",
      "text": "She scolds Rusty for his childish behavior and threatens to report him.",
      "level": 2
    },
    {
      "id": "2.57",
      "text": "The handsome doctor, \"Peter\", tries to de-escalate the situation.",
      "level": 2
    },
    {
      "id": "2.58",
      "text": "Rusty complains about being treated poorly and accuses the doctor of having an episode.",
      "level": 2
    },
    {
      "id": "2.59",
      "text": "The female doctor tells Rusty to leave.",
      "level": 2
    },
    {
      "id": "2.60",
      "text": "Mike asks Rusty to sign the register.",
      "level": 2
    },
    {
      "id": "2.61",
      "text": "He hears footsteps and the sound of soft-soled shoes on tile.",
      "level": 2
    },
    {
      "id": "2.62",
      "text": "He hears the sound of his golf club hitting bushes again.",
      "level": 2
    },
    {
      "id": "2.63",
      "text": "Something hits his left thigh, causing sharp pain.",
      "level": 2
    },
    {
      "id": "2.64",
      "text": "He recalls being zipped into a body bag and being put on a gurney.",
      "level": 2
    },
    {
      "id": "2.65",
      "text": "He suspects he was bitten by a snake or insect while looking for his golf ball.",
      "level": 2
    },
    {
      "id": "2.66",
      "text": "He is in pain but alive, and they don't know.",
      "level": 2
    },
    {
      "id": "2.67",
      "text": "He recognizes Dr. Jennings, who declared him dead.",
      "level": 2
    },
    {
      "id": "2.68",
      "text": "The female doctor, \"Cicero Kid\", closed the door with a bang.",
      "level": 2
    },
    {
      "id": "2.69",
      "text": "Peter comments on Rusty's habit of making noise when closing doors.",
      "level": 2
    },
    {
      "id": "2.70",
      "text": "He hears the clatter of metal tools, anticipating an autopsy.",
      "level": 2
    },
    {
      "id": "2.71",
      "text": "He realizes they intend to dissect him and examine his heart.",
      "level": 2
    },
    {
      "id": "2.72",
      "text": "He desperately tries to communicate that his leg is the problem, not his heart.",
      "level": 2
    },
    {
      "id": "2.73",
      "text": "He sees a stainless steel frame resembling dental equipment, with a saw instead of a drill, identifying it as a \"Gigli saw\" for cutting skulls.",
      "level": 2
    },
    {
      "id": "2.74",
      "text": "He envisions his head being cut off and his brain removed.",
      "level": 2
    },
    {
      "id": "2.75",
      "text": "The female doctor, \"Cicero\", asks if he wants to perform a heart excision.",
      "level": 2
    },
    {
      "id": "2.76",
      "text": "Peter asks if she wants him to do it.",
      "level": 2
    },
    {
      "id": "2.77",
      "text": "Cicero, sounding pleased, confirms and asks for his help.",
      "level": 2
    },
    {
      "id": "2.78",
      "text": "She calls herself his trusted colleague, laughing like scissors cutting air.",
      "level": 2
    },
    {
      "id": "2.79",
      "text": "He recalls the horrific scenes of battlefield dissection rooms in Vietnam.",
      "level": 2
    },
    {
      "id": "2.80",
      "text": "He imagines the use of long, sharp scissors for dissection.",
      "level": 2
    },
    {
      "id": "2.81",
      "text": "A faint, drilling sound is heard.",
      "level": 2
    },
    {
      "id": "2.82",
      "text": "Cicero states, \"No, that's all.\"",
      "level": 2
    },
    {
      "id": "2.83",
      "text": "He protests that they cannot dissect him because he is still breathing.",
      "level": 2
    },
    {
      "id": "2.84",
      "text": "Cicero's response is dismissive: \"Because I want to.\"",
      "level": 2
    },
    {
      "id": "2.85",
      "text": "She instructs Peter that in Katie Allen's dissection room, they start with heart surgery.",
      "level": 2
    },
    {
      "id": "2.86",
      "text": "She emphasizes that hands-on practice is the best way to learn.",
      "level": 2
    },
    {
      "id": "2.87",
      "text": "He realizes he must make a sound or movement to prevent dissection.",
      "level": 2
    },
    {
      "id": "2.88",
      "text": "He concentrates all his strength to push upwards, producing a sound.",
      "level": 2
    },
    {
      "id": "2.89",
      "text": "He makes a low hum, reminiscent of Joseph Cotten's tear saving him.",
      "level": 2
    },
    {
      "id": "2.90",
      "text": "He strains to breathe, exhaling with great effort to make his voice heard.",
      "level": 2
    },
    {
      "id": "2.91",
      "text": "The female doctor asks if he wants music.",
      "level": 2
    },
    {
      "id": "2.92",
      "text": "He hears her mention Martin Stewart and Tony Bonet.",
      "level": 2
    },
    {
      "id": "2.93",
      "text": "She then mentions Rolling Stones records.",
      "level": 2
    },
    {
      "id": "2.94",
      "text": "Peter questions her enthusiasm for the Rolling Stones.",
      "level": 2
    },
    {
      "id": "2.95",
      "text": "He desperately wants them to listen to him, not chatter.",
      "level": 2
    },
    {
      "id": "2.96",
      "text": "He gathers all his energy to make them hear him.",
      "level": 2
    },
    {
      "id": "2.97",
      "text": "The doctor suggests playing the Rolling Stones unless Peter wants to get a Michael Bolton CD for his first heart dissection.",
      "level": 2
    },
    {
      "id": "2.98",
      "text": "Peter emphatically rejects this idea, and they both laugh.",
      "level": 2
    },
    {
      "id": "2.99",
      "text": "Loud music starts playing, and he hears Mick Jagger's voice.",
      "level": 2
    },
    {
      "id": "2.100",
      "text": "Cicero shouts to turn down the music.",
      "level": 2
    },
    {
      "id": "2.101",
      "text": "His sounds from his nose are inaudible amidst the music.",
      "level": 2
    },
    {
      "id": "2.102",
      "text": "Cicero bends over him, wearing a Plexiglass mask and surgical cap.",
      "level": 2
    },
    {
      "id": "2.103",
      "text": "She tells Peter she will undress him and leans over him with a scalpel.",
      "level": 2
    },
    {
      "id": "2.104",
      "text": "He desperately hums, but it's inaudible.",
      "level": 2
    },
    {
      "id": "2.105",
      "text": "The scalpel hovers above him, about to dissect.",
      "level": 2
    },
    {
      "id": "2.106",
      "text": "His polo shirt is cut in half.",
      "level": 2
    },
    {
      "id": "2.107",
      "text": "Peter prepares for his first heart surgery on a living patient, unaware of the situation.",
      "level": 2
    },
    {
      "id": "2.108",
      "text": "He is lifted and sees Peter standing by a table with instruments, including large tissue scissors.",
      "level": 2
    },
    {
      "id": "2.109",
      "text": "He is placed down, his shirt removed, and he feels the cold.",
      "level": 2
    },
    {
      "id": "2.110",
      "text": "He urges the doctor to look at his chest and see him breathing.",
      "level": 2
    },
    {
      "id": "2.111",
      "text": "The doctor looks away and asks if he is a boxer or a jockey.",
      "level": 2
    },
    {
      "id": "2.112",
      "text": "Peter guesses boxer, but the doctor insists jockey.",
      "level": 2
    },
    {
      "id": "2.113",
      "text": "He is indignant, thinking they assume all men over 40 wear boxing shorts.",
      "level": 2
    },
    {
      "id": "2.114",
      "text": "His Bermuda shorts are unfastened and unzipped.",
      "level": 2
    },
    {
      "id": "2.115",
      "text": "He is pushed forward, his back cracking.",
      "level": 2
    },
    {
      "id": "2.116",
      "text": "His underwear and red shorts are removed.",
      "level": 2
    },
    {
      "id": "2.117",
      "text": "The doctor stops, and he feels a glimmer of hope.",
      "level": 2
    },
    {
      "id": "2.118",
      "text": "She asks Peter if male golfers wear Bermuda shorts and moccasins.",
      "level": 2
    },
    {
      "id": "2.119",
      "text": "The rock music is playing \"Save Your Love\".",
      "level": 2
    },
    {
      "id": "2.120",
      "text": "She comments that wearing such shoes is not mandatory by law.",
      "level": 2
    },
    {
      "id": "2.121",
      "text": "Peter mentions being sent to prison for not wearing bowling shoes.",
      "level": 2
    },
    {
      "id": "2.122",
      "text": "She asks if he wants to take his temperature and do a full examination.",
      "level": 2
    },
    {
      "id": "2.123",
      "text": "He shouts \"No!\" in his mind, questioning their actions.",
      "level": 2
    },
    {
      "id": "2.124",
      "text": "Peter expresses concern about the legality of the examination.",
      "level": 2
    },
    {
      "id": "2.125",
      "text": "Katie Allen (Cicero) indicates to Peter that she is aroused.",
      "level": 2
    },
    {
      "id": "2.126",
      "text": "He feels trapped in a \"Big Hospital\" story titled \"Love Blossoms in Room 4 Anatomical\".",
      "level": 2
    },
    {
      "id": "2.127",
      "text": "Katie asks Peter if he wants her to cover for him.",
      "level": 2
    },
    {
      "id": "2.128",
      "text": "She suggests he try it himself and offers to rewind the tape if needed.",
      "level": 2
    },
    {
      "id": "2.129",
      "text": "Peter is surprised by her offer.",
      "level": 2
    },
    {
      "id": "2.130",
      "text": "Katie smiles and mentions \"many secrets in Room 4 Anatomical\".",
      "level": 2
    },
    {
      "id": "2.131",
      "text": "Peter attaches a microphone to a black rope hanging from the ceiling.",
      "level": 2
    },
    {
      "id": "2.132",
      "text": "He feels unprecedented terror, certain they will dissect him.",
      "level": 2
    },
    {
      "id": "2.133",
      "text": "He imagines his heart being removed and thrown onto a scale.",
      "level": 2
    },
    {
      "id": "2.134",
      "text": "He recalls that the brain remains conscious for three minutes after the heart stops.",
      "level": 2
    },
    {
      "id": "2.135",
      "text": "Peter announces, \"Everything is ready, Doctor.\"",
      "level": 2
    },
    {
      "id": "2.136",
      "text": "The dissection procedure has begun.",
      "level": 2
    },
    {
      "id": "2.137",
      "text": "Katie excitedly says, \"Let's flip the pancake,\" and he is quickly turned over.",
      "level": 2
    },
    {
      "id": "2.138",
      "text": "His left arm is violently struck by a steel blade inserted into his muscle, causing unbearable pain.",
      "level": 2
    },
    {
      "id": "2.139",
      "text": "He begs his tongue to bite his skin and draw blood.",
      "level": 2
    },
    {
      "id": "2.140",
      "text": "Katie states, \"It's okay,\" and manipulates his arm.",
      "level": 2
    },
    {
      "id": "2.141",
      "text": "His nose is smashed against the table, and his lungs signal distress.",
      "level": 2
    },
    {
      "id": "2.142",
      "text": "He can't feel himself breathing and fears suffocation.",
      "level": 2
    },
    {
      "id": "2.143",
      "text": "A large object, like a glass ball stick, is forcefully inserted into his rectum.",
      "level": 2
    },
    {
      "id": "2.144",
      "text": "He hums weakly, unable to scream.",
      "level": 2
    },
    {
      "id": "2.145",
      "text": "Peter announces, \"The thermometer is in. The timer is set.\"",
      "level": 2
    },
    {
      "id": "2.146",
      "text": "Katie walks away, leaving Peter to experiment on the \"corpse\".",
      "level": 2
    },
    {
      "id": "2.147",
      "text": "Peter speaks into the microphone, identifying the \"specimen\" as Howard Randolph Courtnall.",
      "level": 2
    },
    {
      "id": "2.148",
      "text": "Katie's voice calls from another room: \"Mary Meade.\"",
      "level": 2
    },
    {
      "id": "2.149",
      "text": "Peter, flustered, explains the specimen's residence is Mary Meade, a subdivision of Derry.",
      "level": 2
    },
    {
      "id": "2.150",
      "text": "Katie tells him his history lesson is over.",
      "level": 2
    },
    {
      "id": "2.151",
      "text": "He wonders what was inserted into his anus and if it's a thermometer for cattle.",
      "level": 2
    },
    {
      "id": "2.152",
      "text": "He deduces the lubricant is used because he is considered dead.",
      "level": 2
    },
    {
      "id": "2.153",
      "text": "Peter consults the ambulance call sheet and a Maine driver's license for information.",
      "level": 2
    },
    {
      "id": "2.154",
      "text": "The doctor who declared him dead was Frank Jennings.",
      "level": 2
    },
    {
      "id": "2.155",
      "text": "He wishes his nose would bleed, begging for it to spurt.",
      "level": 2
    },
    {
      "id": "2.156",
      "text": "He hopes for bleeding, but none occurs.",
      "level": 2
    },
    {
      "id": "2.157",
      "text": "Peter suggests the cause of death might be heart failure.",
      "level": 2
    },
    {
      "id": "2.158",
      "text": "A hand slides down his back to his anus, but doesn't remove the thermometer.",
      "level": 2
    },
    {
      "id": "2.159",
      "text": "The spine appears intact with no notable phenomena.",
      "level": 2
    },
    {
      "id": "2.160",
      "text": "He is angered by their classification of him as a \"notable phenomenon\".",
      "level": 2
    },
    {
      "id": "2.161",
      "text": "He utters a low groan as Peter presses his cheekbones.",
      "level": 2
    },
    {
      "id": "2.162",
      "text": "He wishes for his head to fall, causing his nose to bleed.",
      "level": 2
    },
    {
      "id": "2.163",
      "text": "Peter gently lowers his head, causing his nose to hurt and him to struggle for breath.",
      "level": 2
    },
    {
      "id": "2.164",
      "text": "There are no visible neck injuries or signs of heat.",
      "level": 2
    },
    {
      "id": "2.165",
      "text": "His back and buttocks show no injuries, but there's an old scar on his right thigh, likely from a grenade explosion.",
      "level": 2
    },
    {
      "id": "2.166",
      "text": "This scar ended his military career.",
      "level": 2
    },
    {
      "id": "2.167",
      "text": "He has more significant scars on his chest and abdomen.",
      "level": 2
    },
    {
      "id": "2.168",
      "text": "He pulls out the thermometer, feeling relief.",
      "level": 2
    },
    {
      "id": "2.169",
      "text": "Peter states the temperature is 94.2 degrees, implying he could have lived.",
      "level": 2
    },
    {
      "id": "2.170",
      "text": "Katie reminds him where he was found and suggests 98.6 degrees would be expected.",
      "level": 2
    },
    {
      "id": "2.171",
      "text": "Peter asks if his words sound funny on the tape.",
      "level": 2
    },
    {
      "id": "2.172",
      "text": "Katie says it sounds like a classroom lecture.",
      "level": 2
    },
    {
      "id": "2.173",
      "text": "Peter spreads his gloved hands on his buttocks and feels down his thighs.",
      "level": 2
    },
    {
      "id": "2.174",
      "text": "He tries to convey that the problem is his left leg.",
      "level": 2
    },
    {
      "id": "2.175",
      "text": "He feels his left thigh twitch, like a bee sting or an improperly administered injection.",
      "level": 2
    },
    {
      "id": "2.176",
      "text": "Peter states the corpse is a good example of why wearing shorts for golf is foolish.",
      "level": 2
    },
    {
      "id": "2.177",
      "text": "He observes various insect bites and scratches on the body.",
      "level": 2
    },
    {
      "id": "2.178",
      "text": "Katie encourages Peter to continue.",
      "level": 2
    },
    {
      "id": "2.179",
      "text": "He feels a sharp pain on his left thigh from mosquito bites that appear infected.",
      "level": 2
    },
    {
      "id": "2.180",
      "text": "He hopes the music will end before they dissect him.",
      "level": 2
    },
    {
      "id": "2.181",
      "text": "Katie suggests examining the mosquito bites after the autopsy, unless Peter is nervous.",
      "level": 2
    },
    {
      "id": "2.182",
      "text": "Peter notes that the mosquito bites have swollen and counts twelve on the left foot alone.",
      "level": 2
    },
    {
      "id": "2.183",
      "text": "Katie remarks that he has forgotten his experience of \"escaping the jungle\".",
      "level": 2
    },
    {
      "id": "2.184",
      "text": "Peter mentions he can't recall being injected with Digitin (a cardiac stimulant).",
      "level": 2
    },
    {
      "id": "2.185",
      "text": "They share a brief, dark laugh, characteristic of dissection room humor.",
      "level": 2
    },
    {
      "id": "2.186",
      "text": "The table tilts, indicating it's preparing for fluid drainage into a collection basin.",
      "level": 2
    },
    {
      "id": "2.187",
      "text": "He imagines the feeling of the large scissors piercing his upper abdomen.",
      "level": 2
    },
    {
      "id": "2.188",
      "text": "Peter consults his clipboard and begins the dissection at 5:49 PM on August 20, 1994.",
      "level": 2
    },
    {
      "id": "2.189",
      "text": "He examines the protagonist's teeth and gums, noting the good color and lack of bruising.",
      "level": 2
    },
    {
      "id": "2.190",
      "text": "Peter turns off the recorder, wondering if the man might actually be alive.",
      "level": 2
    }
  ],
  "concepts": [
    {
      "name": "Buried alive",
      "frequency": 2,
      "context": "Theme in suspense fiction, and a specific terrifying episode"
    },
    {
      "name": "Alfred Hitchcock",
      "frequency": 2,
      "context": "Producer of terrifying television episodes"
    },
    {
      "name": "Joseph Cotten",
      "frequency": 2,
      "context": "Character in a Hitchcock episode who was mistakenly thought dead"
    },
    {
      "name": "Autopsy",
      "frequency": 3,
      "context": "The intended procedure for the protagonist, and a general theme"
    },
    {
      "name": "Agatha Christie",
      "frequency": 1,
      "context": "Author who mentioned an African Tree Snake"
    },
    {
      "name": "Tree snake",
      "frequency": 2,
      "context": "A type of reptile mentioned in the story"
    },
    {
      "name": "Darkness",
      "frequency": 3,
      "context": "The initial state of the protagonist"
    },
    {
      "name": "Sound",
      "frequency": 7,
      "context": "Creaking, crackling, thud, footsteps, tearing, drilling, music, clicking, humming"
    },
    {
      "name": "Smell",
      "frequency": 3,
      "context": "Rubber, plastic film, onions"
    },
    {
      "name": "Consciousness",
      "frequency": 5,
      "context": "Protagonist's state of being aware and experiencing sensations"
    },
    {
      "name": "Identity",
      "frequency": 2,
      "context": "Protagonist questions who he is"
    },
    {
      "name": "Hospital",
      "frequency": 2,
      "context": "Setting for part of the narrative"
    },
    {
      "name": "Gurney",
      "frequency": 3,
      "context": "The rolling bed the protagonist is on"
    },
    {
      "name": "Immobility",
      "frequency": 3,
      "context": "Protagonist's inability to move lips, tongue, or speak"
    },
    {
      "name": "Howard Courtnall",
      "frequency": 3,
      "context": "Protagonist's name and identity"
    },
    {
      "name": "Stockbroker",
      "frequency": 2,
      "context": "Protagonist's profession"
    },
    {
      "name": "Conqueror Howard",
      "frequency": 2,
      "context": "Protagonist's nickname"
    },
    {
      "name": "Michael Bolton",
      "frequency": 5,
      "context": "Singer whose resemblance is noted by several characters"
    },
    {
      "name": "Death",
      "frequency": 8,
      "context": "Protagonist questions if he is dead, and the state of being dead"
    },
    {
      "name": "Body bag",
      "frequency": 2,
      "context": "Protagonist realizes he is in one"
    },
    {
      "name": "Light",
      "frequency": 3,
      "context": "Bright white light from overhead fixtures"
    },
    {
      "name": "Doctors/Medical staff",
      "frequency": 15,
      "context": "Several characters involved in the medical setting (Rusty, Mike, Katie Allen, Peter)"
    },
    {
      "name": "Surgical instruments",
      "frequency": 5,
      "context": "Scalpel, scissors, saw, thermometer"
    },
    {
      "name": "Dissection",
      "frequency": 7,
      "context": "The anticipated procedure for the protagonist"
    },
    {
      "name": "Heart surgery",
      "frequency": 2,
      "context": "A procedure mentioned as a starting point"
    },
    {
      "name": "Pain",
      "frequency": 4,
      "context": "Physical pain experienced by the protagonist"
    },
    {
      "name": "Breathing",
      "frequency": 5,
      "context": "Protagonist's struggle to breathe and his questions about it"
    },
    {
      "name": "Music",
      "frequency": 7,
      "context": "Rock music, Rolling Stones, Mick Jagger"
    },
    {
      "name": "Golf",
      "frequency": 6,
      "context": "Protagonist's hobby, and where he was found"
    },
    {
      "name": "Insects/Bites",
      "frequency": 4,
      "context": "Mosquito bites and other scratches"
    },
    {
      "name": "Temperature",
      "frequency": 3,
      "context": "Measurement taken by Peter"
    },
    {
      "name": "Recording",
      "frequency": 5,
      "context": "Microphone and tape recorder used for documentation"
    },
    {
      "name": "Rectum",
      "frequency": 2,
      "context": "Location of thermometer insertion"
    },
    {
      "name": "Scar",
      "frequency": 3,
      "context": "Old injuries on the protagonist's body"
    },
    {
      "name": "Vietnam War",
      "frequency": 2,
      "context": "Protagonist's past experience, and a reference point for dissection rooms"
    }
  ],
  "relations": [
    {
      "source": "Autopsy",
      "target": "Buried alive",
      "type": "is_related_to"
    },
    {
      "source": "Joseph Cotten",
      "target": "Alfred Hitchcock",
      "type": "featured_in"
    },
    {
      "name": "Michael Bolton",
      "target": "Singer",
      "type": "is_a"
    },
    {
      "source": "Howard Courtnall",
      "target": "Stockbroker",
      "type": "is_a"
    },
    {
      "source": "Howard Courtnall",
      "target": "Conqueror Howard",
      "type": "nicknamed"
    },
    {
      "source": "Peter",
      "target": "Doctor",
      "type": "is_a"
    },
    {
      "source": "Katie Allen",
      "target": "Doctor",
      "type": "is_a"
    },
    {
      "source": "Rusty",
      "target": "Medical staff",
      "type": "is_a"
    },
    {
      "source": "Dissection",
      "target": "Surgical instruments",
      "type": "uses"
    },
    {
      "source": "Death",
      "target": "Autopsy",
      "type": "precedes"
    },
    {
      "source": "Consciousness",
      "target": "Breathing",
      "type": "is_dependent_on"
    },
    {
      "source": "Pain",
      "target": "Insects/Bites",
      "type": "caused_by"
    },
    {
      "source": "Scar",
      "target": "Vietnam War",
      "type": "related_to"
    },
    {
      "source": "Recording",
      "target": "Microphone",
      "type": "utilizes"
    },
    {
      "source": "Golf",
      "target": "Golf club",
      "type": "involves"
    },
    {
      "source": "Temperature",
      "target": "Thermometer",
      "type": "measured_by"
    }
  ],
  "hierarchy": {
    "main_topics": [
      "Introduction and Author's Intent",
      "Protagonist's Awakening and Disorientation",
      "Medical Procedures and Identity Crisis",
      "Fear of Dissection and the Struggle for Survival"
    ],
    "structure": "The document is structured as a narrative fiction. It begins with an author's introduction explaining the thematic inspiration and title. The main body of the text is a first-person account of a protagonist's experience of waking up in a confusing and threatening medical environment. The narrative progresses from initial disorientation and fear to a desperate struggle against perceived dissection and a quest to prove he is alive. The structure is chronological and immersive, focusing on the protagonist's sensory experiences, internal monologue, and overheard conversations."
  }
}