{
  "propositions": [
    {
      "id": "1",
      "text": "Captain Crosbie emerges from the bank feeling pleased.",
      "level": 1
    },
    {
      "id": "1.1",
      "text": "He is described as stout, ruddy, with a military moustache, and a swaggering gait.",
      "level": 2
    },
    {
      "id": "1.2",
      "text": "He is described as jovial, good-natured, unmarried, and unremarkable.",
      "level": 2
    },
    {
      "id": "1.3",
      "text": "He buys a newspaper on Bank Street.",
      "level": 2
    },
    {
      "id": "1.4",
      "text": "He walks to Rashid Street, a main street parallel to the Tigris River.",
      "level": 2
    },
    {
      "id": "1.5",
      "text": "He enters an office through a door with a brass plate.",
      "level": 2
    },
    {
      "id": "2",
      "text": "A young Iraqi clerk greets Captain Crosbie.",
      "level": 1
    },
    {
      "id": "2.1",
      "text": "He asks if Mr. Dakin is in his office.",
      "level": 2
    },
    {
      "id": "3",
      "text": "Captain Crosbie enters Mr. Dakin's office.",
      "level": 1
    },
    {
      "id": "3.1",
      "text": "The room is high-ceilinged, sparse, with a primus stove, a low divan, and a shabby table.",
      "level": 2
    },
    {
      "id": "3.2",
      "text": "Mr. Dakin appears weary and indecisive.",
      "level": 2
    },
    {
      "id": "4",
      "text": "Dakin asks Crosbie if he's just arrived from Kirkuk.",
      "level": 1
    },
    {
      "id": "4.1",
      "text": "Crosbie nods and closes the door.",
      "level": 2
    },
    {
      "id": "4.2",
      "text": "The door is revealed to be soundproof.",
      "level": 2
    },
    {
      "id": "5",
      "text": "With the door closed, their demeanour changes; Dakin is revealed to be the superior.",
      "level": 1
    },
    {
      "id": "6",
      "text": "Crosbie asks for news.",
      "level": 1
    },
    {
      "id": "6.1",
      "text": "Dakin sighs and points to a telegram he was translating.",
      "level": 2
    },
    {
      "id": "6.2",
      "text": "Dakin states the meeting will be held in Baghdad.",
      "level": 2
    },
    {
      "id": "6.3",
      "text": "He burns the telegram.",
      "level": 2
    },
    {
      "id": "7",
      "text": "Dakin confirms the meeting is in Baghdad for the 20th of the next month and emphasizes 'absolute secrecy'.",
      "level": 1
    },
    {
      "id": "8",
      "text": "Crosbie mentions the matter has been discussed in the market for three days.",
      "level": 1
    },
    {
      "id": "8.1",
      "text": "Dakin expresses that there are no secrets in the East.",
      "level": 2
    },
    {
      "id": "9",
      "text": "Crosbie questions if the meeting will really happen, specifically if 'Uncle Joe' will attend.",
      "level": 1
    },
    {
      "id": "9.1",
      "text": "Dakin believes 'Uncle Joe' will attend.",
      "level": 2
    },
    {
      "id": "9.2",
      "text": "Dakin suggests an 'understanding' could resolve everything.",
      "level": 2
    },
    {
      "id": "10",
      "text": "Crosbie expresses doubt about achieving any understanding.",
      "level": 1
    },
    {
      "id": "10.1",
      "text": "Dakin suggests that bringing together opposing ideologies might only deepen suspicion.",
      "level": 2
    },
    {
      "id": "10.2",
      "text": "Dakin mentions a third factor: a 'fantastic' story by Carmichael.",
      "level": 2
    },
    {
      "id": "11",
      "text": "Crosbie dismisses Carmichael's story as too fantastic.",
      "level": 1
    },
    {
      "id": "11.1",
      "text": "Dakin recounts his initial disbelief, thinking either Carmichael or the story was not to be trusted.",
      "level": 2
    },
    {
      "id": "11.2",
      "text": "Dakin states Carmichael believes the story and has evidence.",
      "level": 2
    },
    {
      "id": "11.3",
      "text": "Carmichael is going to Baghdad to investigate and obtain proof.",
      "level": 2
    },
    {
      "id": "11.4",
      "text": "Dakin questions the wisdom of sending Carmichael and if he will return.",
      "level": 2
    },
    {
      "id": "12",
      "text": "Crosbie exclaims about 'proof'.",
      "level": 1
    },
    {
      "id": "12.1",
      "text": "Dakin confirms Carmichael has proof.",
      "level": 2
    },
    {
      "id": "13",
      "text": "Dakin explains he knows about the proof due to a prearranged code: 'The camel with the oats is crossing the pass.'",
      "level": 1
    },
    {
      "id": "13.1",
      "text": "This message was relayed by Sarah Hassan.",
      "level": 2
    },
    {
      "id": "14",
      "text": "Carmichael obtained what he needed but is now suspected and being watched.",
      "level": 1
    },
    {
      "id": "14.1",
      "text": "He is being watched at the border and ambushed around embassies and consulates.",
      "level": 2
    },
    {
      "id": "15",
      "text": "Dakin shows Crosbie documents detailing recent killings of individuals matching Carmichael's description.",
      "level": 1
    },
    {
      "id": "15.1",
      "text": "These include a British man shot by brigands, a Kurdish merchant ambushed, and a Kurdish smuggler shot by police.",
      "level": 2
    },
    {
      "id": "15.2",
      "text": "The killers are willing to kill innocent people to get to Carmichael.",
      "level": 2
    },
    {
      "id": "15.3",
      "text": "The danger increases once Carmichael reaches Iraq, with potential informers at embassies, consulates, airports, customs, stations, and hotels.",
      "level": 2
    },
    {
      "id": "16",
      "text": "Crosbie raises his eyebrows at the extensive network.",
      "level": 1
    },
    {
      "id": "16.1",
      "text": "Dakin confirms his suspicion, citing that even their own operations have leaks.",
      "level": 2
    },
    {
      "id": "17",
      "text": "Crosbie asks if Dakin suspects anyone.",
      "level": 1
    },
    {
      "id": "17.1",
      "text": "Dakin shakes his head slowly.",
      "level": 2
    },
    {
      "id": "18",
      "text": "Crosbie sighs and asks if they will proceed.",
      "level": 1
    },
    {
      "id": "18.1",
      "text": "Dakin confirms they will proceed.",
      "level": 2
    },
    {
      "id": "19",
      "text": "Crosbie asks about Crofton Lee.",
      "level": 1
    },
    {
      "id": "19.1",
      "text": "Dakin states Crofton Lee has agreed to come to Baghdad.",
      "level": 2
    },
    {
      "id": "20",
      "text": "Crosbie notes that everyone is coming to Baghdad, including 'Uncle Joe', and expresses concern about potential unrest if the president has an accident.",
      "level": 1
    },
    {
      "id": "21",
      "text": "Dakin insists nothing can go wrong and it is their duty to ensure it.",
      "level": 1
    },
    {
      "id": "22",
      "text": "After Crosbie leaves, Dakin murmurs 'They have arrived in Baghdad...'",
      "level": 1
    },
    {
      "id": "22.1",
      "text": "He draws a circle with 'Baghdad' inside, surrounded by a camel, airplane, ship, and train.",
      "level": 2
    },
    {
      "id": "22.2",
      "text": "He draws a spiderweb with 'Anna Schiller' in the center and a large question mark below.",
      "level": 2
    },
    {
      "id": "23",
      "text": "Dakin leaves his office.",
      "level": 1
    },
    {
      "id": "23.1",
      "text": "On Rashid Street, someone inquires about him and describes him as working for an oil company, being a good man but never getting promoted, lacking drive, and unlikely to get ahead.",
      "level": 2
    },
    {
      "id": "24",
      "text": "Victoria Jones sits glumly in Regent's Park, contemplating the damage caused by misplaced talent.",
      "level": 1
    },
    {
      "id": "24.1",
      "text": "She is described as having virtues (generous, enthusiastic, brave) and faults (prone to lying).",
      "level": 2
    },
    {
      "id": "24.2",
      "text": "Her lies are fluent, natural, and artistic.",
      "level": 2
    },
    {
      "id": "24.3",
      "text": "She prefers fabricating elaborate stories to simple excuses.",
      "level": 2
    },
    {
      "id": "24.4",
      "text": "She wishes for a world with elephants on traffic lines and dangerous men in streets.",
      "level": 2
    },
    {
      "id": "25",
      "text": "Despite being slender and well-proportioned, Victoria has a plain face.",
      "level": 1
    },
    {
      "id": "25.1",
      "text": "A former admirer called her face a 'little rubber face' capable of mimicry.",
      "level": 2
    },
    {
      "id": "26",
      "text": "This mimicry led to her current predicament.",
      "level": 1
    },
    {
      "id": "26.1",
      "text": "She works as a typist for Messrs. Grinholtz, Siemens, and Ledbert.",
      "level": 2
    },
    {
      "id": "26.2",
      "text": "She was bored and imitated Mrs. Grinholtz to her colleagues.",
      "level": 2
    },
    {
      "id": "26.3",
      "text": "She believed Mr. Grinholtz was visiting his solicitor and felt safe to perform.",
      "level": 2
    },
    {
      "id": "27",
      "text": "Her performance is interrupted when Mr. Grinholtz appears at the door.",
      "level": 1
    },
    {
      "id": "27.1",
      "text": "Her colleagues suddenly return to their work.",
      "level": 2
    },
    {
      "id": "27.2",
      "text": "Victoria can only exclaim, 'Oh, my!'",
      "level": 2
    },
    {
      "id": "28",
      "text": "Mr. Grinholtz grunts and enters his office, closing the door and ringing a bell for Victoria.",
      "level": 1
    },
    {
      "id": "29",
      "text": "Her colleagues taunt her about being in trouble.",
      "level": 1
    },
    {
      "id": "29.1",
      "text": "The office boy makes a throat-cutting gesture.",
      "level": 2
    },
    {
      "id": "30",
      "text": "Victoria, maintaining a composed demeanor, enters Mr. Grinholtz's office.",
      "level": 1
    },
    {
      "id": "30.1",
      "text": "She asks if he summoned her.",
      "level": 2
    },
    {
      "id": "31",
      "text": "Mr. Grinholtz states he's tired of her and intends to pay her a week's salary and dismiss her immediately.",
      "level": 1
    },
    {
      "id": "31.1",
      "text": "He asks if she has any reason why he shouldn't.",
      "level": 2
    },
    {
      "id": "32",
      "text": "Victoria, an orphan whose meager salary supports her ill mother, initially considers explaining.",
      "level": 1
    },
    {
      "id": "32.1",
      "text": "Seeing Mr. Grinholtz's unpleasant face, she changes her mind.",
      "level": 2
    },
    {
      "id": "33",
      "text": "Victoria cheerfully agrees with him, stating he is 100% correct if he knew her true meaning.",
      "level": 1
    },
    {
      "id": "34",
      "text": "Mr. Grinholtz is surprised by her agreement and counts coins, finding he is short ninepence.",
      "level": 1
    },
    {
      "id": "35",
      "text": "Victoria kindly suggests he use the money for a cinema or sweets.",
      "level": 1
    },
    {
      "id": "36",
      "text": "Mr. Grinholtz notes the absence of stamps, and Victoria says she never writes letters.",
      "level": 1
    },
    {
      "id": "37",
      "text": "He mentions he'll send her the money later, but Victoria asks for a letter of dismissal instead.",
      "level": 1
    },
    {
      "id": "38",
      "text": "Mr. Grinholtz angrily asks why he should write a letter of dismissal.",
      "level": 1
    },
    {
      "id": "38.1",
      "text": "Victoria states it is natural.",
      "level": 2
    },
    {
      "id": "39",
      "text": "Mr. Grinholtz scribbles a dismissive letter stating Victoria was employed for two months, her shorthand was inaccurate, she made spelling mistakes, and was dismissed for not working during office hours.",
      "level": 1
    },
    {
      "id": "40",
      "text": "Victoria calls it a 'very bad testimonial'.",
      "level": 1
    },
    {
      "id": "40.1",
      "text": "Mr. Grinholtz retorts he did not write it as one.",
      "level": 2
    },
    {
      "id": "41",
      "text": "Victoria suggests he should at least mention her honesty, diligence, and propriety, perhaps adding 'careful'.",
      "level": 1
    },
    {
      "id": "42",
      "text": "Mr. Grinholtz shouts 'Careful?!'",
      "level": 1
    },
    {
      "id": "42.1",
      "text": "Victoria calmly repeats 'Careful.'",
      "level": 2
    },
    {
      "id": "43",
      "text": "Recalling her transcribed letters, Mr. Grinholtz decides caution is better than resentment.",
      "level": 1
    },
    {
      "id": "43.1",
      "text": "He tears up the first letter and rewrites it, stating Victoria left due to redundancy.",
      "level": 2
    },
    {
      "id": "44",
      "text": "Victoria finds it acceptable, though it could be better.",
      "level": 1
    },
    {
      "id": "45",
      "text": "Victoria, with a week's salary (minus ninepence), sits on a bench in Regent's Park.",
      "level": 1
    },
    {
      "id": "46",
      "text": "She habitually eats a simple lunch from a cold-meat counter in the park.",
      "level": 1
    },
    {
      "id": "47",
      "text": "She reflects on considering time and place, and that mimicking the boss's wife was inappropriate.",
      "level": 1
    },
    {
      "id": "47.1",
      "text": "She believes she will find another job and is optimistic about the future.",
      "level": 2
    },
    {
      "id": "48",
      "text": "She throws breadcrumbs to sparrows and notices a young man on the other end of the bench.",
      "level": 1
    },
    {
      "id": "48.1",
      "text": "She finds him handsome, angelic, with a determined chin and striking blue eyes.",
      "level": 2
    },
    {
      "id": "48.2",
      "text": "She suspects he has been admiring her.",
      "level": 2
    },
    {
      "id": "49",
      "text": "Victoria smiles at him, and he responds as if by a string.",
      "level": 1
    },
    {
      "id": "49.1",
      "text": "He asks if she often visits the park.",
      "level": 2
    },
    {
      "id": "49.2",
      "text": "She replies almost daily.",
      "level": 2
    },
    {
      "id": "49.3",
      "text": "He regrets not having come before and asks if she has finished lunch.",
      "level": 2
    },
    {
      "id": "49.4",
      "text": "He suggests they go for sausages.",
      "level": 2
    },
    {
      "id": "50",
      "text": "Victoria declines, stating she is not hungry.",
      "level": 1
    },
    {
      "id": "50.1",
      "text": "She expects him to suggest another time, but he introduces himself as Edward and asks her name.",
      "level": 2
    },
    {
      "id": "51",
      "text": "She is Victoria, and he questions why her family gave her a station name.",
      "level": 1
    },
    {
      "id": "51.1",
      "text": "Victoria corrects him, mentioning Queen Victoria.",
      "level": 2
    },
    {
      "id": "51.2",
      "text": "He asks her surname, which is Jones.",
      "level": 2
    },
    {
      "id": "52",
      "text": "Edward comments that Victoria Jones doesn't flow well.",
      "level": 1
    },
    {
      "id": "52.1",
      "text": "Victoria agrees and suggests names like 'Victoria Sackville-West' for more elegance.",
      "level": 2
    },
    {
      "id": "53",
      "text": "They playfully suggest adding names before Jones, like 'Bedford Jones' and 'Cadisbrooke Jones'.",
      "level": 1
    },
    {
      "id": "54",
      "text": "Edward checks his watch, exclaiming he must return to his boss.",
      "level": 1
    },
    {
      "id": "54.1",
      "text": "He asks Victoria what she does.",
      "level": 2
    },
    {
      "id": "54.2",
      "text": "Victoria replies she is unemployed, having been fired that morning.",
      "level": 2
    },
    {
      "id": "55",
      "text": "Edward expresses sympathy.",
      "level": 1
    },
    {
      "id": "55.1",
      "text": "Victoria states she isn't sorry as she can easily find another job and finds the situation amusing.",
      "level": 2
    },
    {
      "id": "56",
      "text": "She recounts the morning's events, including mimicking Mrs. Grinholtz.",
      "level": 1
    },
    {
      "id": "56.1",
      "text": "Edward is highly entertained and delayed from returning to his boss.",
      "level": 2
    },
    {
      "id": "57",
      "text": "Edward calls her wonderful and suggests she should be on the stage.",
      "level": 1
    },
    {
      "id": "57.1",
      "text": "Victoria advises him to leave if he doesn't want to be fired.",
      "level": 2
    },
    {
      "id": "58",
      "text": "Edward expresses envy for her secretarial skills.",
      "level": 1
    },
    {
      "id": "58.1",
      "text": "Victoria admits she's not an excellent typist but explains that even poor typists can find work in educational or charitable institutions that cannot afford high salaries.",
      "level": 2
    },
    {
      "id": "58.2",
      "text": "She prefers academic work due to the complexity of scientific terms making errors less embarrassing.",
      "level": 2
    },
    {
      "id": "58.3",
      "text": "She asks about his job and guesses he is recently demobilized from the RAF.",
      "level": 2
    },
    {
      "id": "59",
      "text": "Edward confirms and then guesses she guessed correctly about being a fighter pilot.",
      "level": 1
    },
    {
      "id": "59.1",
      "text": "He explains the RAF found him a job, but he feels they don't need intelligent people.",
      "level": 2
    },
    {
      "id": "59.2",
      "text": "He is placed in an office doing data and numerical work, finding it aimless and making him feel useless.",
      "level": 2
    },
    {
      "id": "59.3",
      "text": "He laments not being able to connect with the work, contrasting it with the high purpose of wartime combat, where he received the DFC.",
      "level": 2
    },
    {
      "id": "60",
      "text": "Victoria feels sympathy for him.",
      "level": 1
    },
    {
      "id": "60.1",
      "text": "Edward further elaborates on feeling useless and wanting to leave.",
      "level": 2
    },
    {
      "id": "61",
      "text": "He pulls out a small camera and asks to take a snapshot of Victoria.",
      "level": 1
    },
    {
      "id": "61.1",
      "text": "He reveals he is going to Baghdad tomorrow.",
      "level": 2
    },
    {
      "id": "62",
      "text": "Victoria exclaims in disappointment.",
      "level": 1
    },
    {
      "id": "62.1",
      "text": "Edward explains he was happy to go that morning, wanting to leave the country.",
      "level": 2
    },
    {
      "id": "63",
      "text": "He describes his job as dealing with 'culture and poetry'.",
      "level": 1
    },
    {
      "id": "63.1",
      "text": "His boss, Dr. Raisborn, is a reformer who is opening bookstores, including one in Baghdad.",
      "level": 2
    },
    {
      "id": "63.2",
      "text": "Dr. Raisborn is translating Shakespeare and Milton into Arabic, Kurdish, Persian, and Armenian.",
      "level": 2
    },
    {
      "id": "63.3",
      "text": "Edward finds this foolish, similar to the British Council's efforts, but acknowledges he has a job and shouldn't complain.",
      "level": 2
    },
    {
      "id": "64",
      "text": "Victoria asks what his actual duties are.",
      "level": 1
    },
    {
      "id": "64.1",
      "text": "Edward describes himself as a subordinate, running errands, booking tickets, filling out forms, packing manuscripts, and generally doing odd jobs.",
      "level": 2
    },
    {
      "id": "64.2",
      "text": "He believes it's a 'goodwill movement' for youth reform.",
      "level": 2
    },
    {
      "id": "64.3",
      "text": "He confesses the work is taxing.",
      "level": 2
    },
    {
      "id": "65",
      "text": "Victoria cannot offer encouraging words.",
      "level": 1
    },
    {
      "id": "66",
      "text": "Edward asks Victoria to pose for the camera.",
      "level": 1
    },
    {
      "id": "66.1",
      "text": "He takes two photos.",
      "level": 2
    },
    {
      "id": "67",
      "text": "Victoria feels pleased and self-satisfied.",
      "level": 1
    },
    {
      "id": "68",
      "text": "Edward regrets having to leave so soon after meeting her.",
      "level": 1
    },
    {
      "id": "68.1",
      "text": "He is conflicted about going but has already completed the paperwork and visas.",
      "level": 2
    },
    {
      "id": "68.2",
      "text": "He asks if she thinks the work will be pleasant.",
      "level": 2
    },
    {
      "id": "69",
      "text": "Victoria suggests it might not be as bad as he imagines.",
      "level": 1
    },
    {
      "id": "69.1",
      "text": "Edward expresses doubt and a strange feeling that something is suspicious.",
      "level": 2
    },
    {
      "id": "70",
      "text": "He compares it to a past experience with engine oil where a washer was misplaced.",
      "level": 1
    },
    {
      "id": "70.1",
      "text": "Victoria asks if he thinks Dr. Raisborn is a fake.",
      "level": 2
    },
    {
      "id": "71",
      "text": "Edward can't say, describing Dr. Raisborn as respectable, learned, and associated with important figures.",
      "level": 1
    },
    {
      "id": "71.1",
      "text": "He reiterates it's just a feeling, and time will tell.",
      "level": 2
    },
    {
      "id": "71.2",
      "text": "He bids farewell, hoping she might also come.",
      "level": 2
    },
    {
      "id": "72",
      "text": "Victoria expresses hope that she will go too.",
      "level": 1
    },
    {
      "id": "72.1",
      "text": "Edward asks about her plans.",
      "level": 2
    },
    {
      "id": "72.2",
      "text": "Victoria states she is going to St. Gilderick's office on High Holborn to look for work.",
      "level": 2
    },
    {
      "id": "73",
      "text": "Edward says goodbye, quoting 'Separation is a death' in English.",
      "level": 1
    },
    {
      "id": "73.1",
      "text": "He criticizes the English for their mawkish goodbyes.",
      "level": 2
    },
    {
      "id": "74",
      "text": "Victoria bids him luck.",
      "level": 1
    },
    {
      "id": "74.1",
      "text": "Edward says she won't miss him.",
      "level": 2
    },
    {
      "id": "74.2",
      "text": "Victoria says she will.",
      "level": 2
    },
    {
      "id": "75",
      "text": "Edward notes she is different from other girls and then rushes off as the clock strikes.",
      "level": 1
    },
    {
      "id": "76",
      "text": "Victoria remains on the bench, deep in thought.",
      "level": 1
    },
    {
      "id": "76.1",
      "text": "She has two clear trains of thought: one related to Romeo and Juliet.",
      "level": 2
    },
    {
      "id": "76.2",
      "text": "She feels their situation is similar: instant attraction, setbacks, and parting.",
      "level": 2
    },
    {
      "id": "76.3",
      "text": "She recalls a nursery rhyme about Jumblo and Alice.",
      "level": 2
    },
    {
      "id": "76.4",
      "text": "She relates 'America' in the rhyme to Baghdad.",
      "level": 2
    },
    {
      "id": "77",
      "text": "Victoria stands up, brushes off crumbs, and leaves the park.",
      "level": 1
    },
    {
      "id": "77.1",
      "text": "She makes two decisions: she has fallen in love with Edward and intends to marry him.",
      "level": 2
    },
    {
      "id": "77.2",
      "text": "Her only way to achieve this is to go to Baghdad, where Edward is going.",
      "level": 2
    },
    {
      "id": "77.3",
      "text": "She is confident this can be achieved due to her optimistic and determined nature.",
      "level": 2
    },
    {
      "id": "77.4",
      "text": "She feels the same intensity of emotion about parting as Edward.",
      "level": 2
    },
    {
      "id": "78",
      "text": "Victoria declares to herself, 'I must get to Baghdad!'",
      "level": 1
    },
    {
      "id": "79",
      "text": "Anna Schiller is received with warmth at the Savoy Hotel as a regular customer.",
      "level": 1
    },
    {
      "id": "79.1",
      "text": "They inquire about Mr. Morgensell's health and assure her of satisfactory accommodation.",
      "level": 2
    },
    {
      "id": "79.2",
      "text": "Anna Schiller is presented as a representative of dollars.",
      "level": 2
    },
    {
      "id": "80",
      "text": "After showering and changing, Schiller calls a place in Kensington and takes a taxi to Cartier's jewelry shop on Bond Street.",
      "level": 1
    },
    {
      "id": "81",
      "text": "As Schiller's taxi leaves the Savoy, a short, dark-faced man watching a shop window checks his watch and hails a taxi.",
      "level": 1
    },
    {
      "id": "81.1",
      "text": "This taxi, which passes by a frantic woman with a package, is taken by the man.",
      "level": 2
    },
    {
      "id": "82",
      "text": "Schiller's taxi travels down the Strand, maintaining a distance from the second taxi, which follows within sight.",
      "level": 1
    },
    {
      "id": "82.1",
      "text": "At Trafalgar Square, the second taxi signals from its left window while stopped at a red light.",
      "level": 2
    },
    {
      "id": "82.2",
      "text": "A private car parked near the Admiralty Arch starts up and joins the traffic behind the second taxi.",
      "level": 2
    },
    {
      "id": "83",
      "text": "Schiller's car turns left towards Pall Mall.",
      "level": 1
    },
    {
      "id": "83.1",
      "text": "The dark-faced man's taxi turns right, continuing around Trafalgar Square.",
      "level": 2
    },
    {
      "id": "83.2",
      "text": "The grey Standard car now follows Schiller's taxi.",
      "level": 2
    },
    {
      "id": "83.3",
      "text": "It contains a fair-faced, somewhat vacant young man driving and a well-dressed young woman beside him.",
      "level": 2
    },
    {
      "id": "84",
      "text": "The Standard car follows Schiller's taxi down Piccadilly and onto Bond Street.",
      "level": 1
    },
    {
      "id": "84.1",
      "text": "The car suddenly brakes, and the young woman gets out, saying 'Thank you very much.'",
      "level": 2
    },
    {
      "id": "84.2",
      "text": "She walks on, glancing into windows, and crosses to Cartier's jewelry shop.",
      "level": 2
    },
    {
      "id": "85",
      "text": "Anna Schiller pays for her taxi and enters Cartier's.",
      "level": 1
    },
    {
      "id": "85.1",
      "text": "She selects a sapphire and diamond ring and writes a check from a London bank.",
      "level": 2
    },
    {
      "id": "85.2",
      "text": "The jeweler becomes extremely attentive upon seeing her name.",
      "level": 2
    },
    {
      "id": "85.3",
      "text": "He greets her, asks about Mr. Morgensell, and offers to show her a valuable sapphire he knows Mr. Morgensell is interested in.",
      "level": 2
    },
    {
      "id": "86",
      "text": "Schiller agrees to look at the sapphire.",
      "level": 1
    },
    {
      "id": "86.1",
      "text": "She expresses admiration and promises to tell Mr. Morgensell.",
      "level": 2
    },
    {
      "id": "87",
      "text": "She leaves Cartier's and walks along Bond Street.",
      "level": 1
    },
    {
      "id": "87.1",
      "text": "The young woman, who was pretending to decide on earrings, also leaves the shop.",
      "level": 2
    },
    {
      "id": "88",
      "text": "The grey Standard car, which had turned left on Grafton Street and gone to Piccadilly Circus, reappears on Bond Street.",
      "level": 1
    },
    {
      "id": "88.1",
      "text": "The young woman pretends not to see it.",
      "level": 2
    },
    {
      "id": "89",
      "text": "Anna Schiller turns into Arcade Street and enters a florist's.",
      "level": 1
    },
    {
      "id": "89.1",
      "text": "She orders three dozen long-stemmed roses, a large violet, a dozen lilac branches, and a vase of mimosa.",
      "level": 2
    },
    {
      "id": "89.2",
      "text": "She leaves an address for delivery and pays £12 18s.",
      "level": 2
    },
    {
      "id": "90",
      "text": "The young woman enters and asks the price of a bunch of primroses but does not buy them.",
      "level": 1
    },
    {
      "id": "91",
      "text": "Schiller walks across Bond Street, down Burlington Street, and into Savile Row, entering a tailor's shop.",
      "level": 1
    },
    {
      "id": "91.1",
      "text": "Mr. Burford greets her and discusses fabrics.",
      "level": 2
    },
    {
      "id": "91.2",
      "text": "He mentions using export cloth and asks when she returns to New York.",
      "level": 2
    },
    {
      "id": "91.3",
      "text": "She replies the 23rd and he assures her it will be ready for her flight.",
      "level": 2
    },
    {
      "id": "92",
      "text": "Mr. Burford comments on the poor state of England compared to America.",
      "level": 1
    },
    {
      "id": "92.1",
      "text": "He praises the tailor, Mr. Lantwick, his only reliable employee.",
      "level": 2
    },
    {
      "id": "92.2",
      "text": "He emphasizes British quality and craftsmanship, contrasting it with mass production.",
      "level": 2
    },
    {
      "id": "92.3",
      "text": "He suggests she try on the clothes next week.",
      "level": 2
    },
    {
      "id": "93",
      "text": "Anna Schiller walks out into the street.",
      "level": 1
    },
    {
      "id": "93.1",
      "text": "She hails a taxi back to the Savoy Hotel.",
      "level": 2
    },
    {
      "id": "93.2",
      "text": "Another taxi, with the short, dark-faced man, drives past the Savoy, picks up a stout woman from the hotel entrance, and heads towards the Embankment.",
      "level": 2
    },
    {
      "id": "94",
      "text": "The stout woman asks 'How is it, Louisa? Was her room searched?'",
      "level": 1
    },
    {
      "id": "94.1",
      "text": "Louisa replies, 'Searched, and nothing found.'",
      "level": 2
    },
    {
      "id": "95",
      "text": "Anna Schiller has lunch in the restaurant, at a window table reserved for her.",
      "level": 1
    },
    {
      "id": "95.1",
      "text": "The head waiter inquires about Otto Morgensell's health.",
      "level": 2
    },
    {
      "id": "96",
      "text": "After lunch, Schiller returns to her room.",
      "level": 1
    },
    {
      "id": "96.1",
      "text": "The room is tidied, and new towels are provided.",
      "level": 2
    },
    {
      "id": "96.2",
      "text": "She checks an unlocked suitcase and then unlocks another.",
      "level": 2
    },
    {
      "id": "96.3",
      "text": "Everything appears undisturbed.",
      "level": 2
    },
    {
      "id": "96.4",
      "text": "Her brief case is on top, with a small Leica camera and two film rolls still sealed.",
      "level": 2
    },
    {
      "id": "97",
      "text": "She notices a single golden hair on the briefcase, smiles, and removes it.",
      "level": 1
    },
    {
      "id": "97.1",
      "text": "She dusts the briefcase with powder and wipes it clean, removing any fingerprints.",
      "level": 2
    },
    {
      "id": "97.2",
      "text": "She reflects that it should have had her own fingerprints from earlier that morning.",
      "level": 2
    },
    {
      "id": "98",
      "text": "She smiles again, muttering, 'Well done, but not quite professional enough...'",
      "level": 1
    },
    {
      "id": "99",
      "text": "She packs a small overnight bag and takes a taxi to 16 Elmsleyve Road, Kensington.",
      "level": 1
    },
    {
      "id": "100",
      "text": "At Elmsleyve Road, an elderly woman answers the door with surprise, then a welcoming smile.",
      "level": 1
    },
    {
      "id": "100.1",
      "text": "She says Miss Els will be delighted to see her and is in the study, her mood improved by the anticipation of her visit.",
      "level": 2
    },
    {
      "id": "101",
      "text": "Anna enters a small, old, but comfortable room with armchairs.",
      "level": 1
    },
    {
      "id": "101.1",
      "text": "A woman sitting in a chair jumps up, exclaiming 'Anna, darling!'",
      "level": 2
    },
    {
      "id": "101.2",
      "text": "Anna replies, 'Els.'",
      "level": 2
    },
    {
      "id": "102",
      "text": "They kiss affectionately.",
      "level": 1
    },
    {
      "id": "102.1",
      "text": "Els says, 'Everything is arranged. I'm moving in tonight.'",
      "level": 2
    },
    {
      "id": "102.2",
      "text": "Anna assures her, 'Don't worry, everything will be fine.'",
      "level": 2
    },
    {
      "id": "103",
      "text": "The short, dark-faced man enters a public telephone booth near Kensington High Street station.",
      "level": 1
    },
    {
      "id": "103.1",
      "text": "He dials and asks for the 'Wilhalara Gramophone Company.'",
      "level": 2
    },
    {
      "id": "104",
      "text": "He identifies himself as 'Saunders' from the Tigris.",
      "level": 1
    },
    {
      "id": "104.1",
      "text": "He reports on A.S. (Anna Schiller), who arrived from New York that morning.",
      "level": 2
    },
    {
      "id": "104.2",
      "text": "He details her visits to Cartier's (a £120 ring), Jenny Cant's florist (£12 18s for flowers sent to a private hospital), and Burford and Ivory's tailor (suit and skirt ordered).",
      "level": 2
    },
    {
      "id": "104.3",
      "text": "He notes no suspicious links to these businesses but advises continued attention.",
      "level": 2
    },
    {
      "id": "104.4",
      "text": "He reports A.S.'s Savoy room was searched with no findings.",
      "level": 2
    },
    {
      "id": "104.5",
      "text": "Her briefcase contained publicly available merger documents with Wolfenstein and a camera with two unexposed film rolls, possibly for direct copying or substitution.",
      "level": 2
    },
    {
      "id": "104.6",
      "text": "A.S. took a small travel bag to her sister at 16 Elmsleyve Road, Kensington.",
      "level": 2
    },
    {
      "id": "104.7",
      "text": "Her sister is to stay at the private hospital in Portland Square tonight for internal surgery, confirmed by hospital records.",
      "level": 2
    },
    {
      "id": "104.8",
      "text": "A.S.'s visit appears open and without suspicion of being followed.",
      "level": 2
    },
    {
      "id": "104.9",
      "text": "She will spend the night at the hospital, and her Savoy room is retained.",
      "level": 2
    },
    {
      "id": "104.10",
      "text": "She has booked a return flight to New York for the 23rd.",
      "level": 2
    },
    {
      "id": "105",
      "text": "Saunders adds his opinion that it's all a sham, citing her extravagant spending on flowers.",
      "level": 1
    },
    {
      "id": "106",
      "text": "Victoria, with her characteristic optimism, doesn't consider the possibility of failure.",
      "level": 1
    },
    {
      "id": "106.1",
      "text": "She has fallen in love with the charismatic young man, Edward, who is leaving for Baghdad.",
      "level": 2
    },
    {
      "id": "106.2",
      "text": "She resolves to find a way to go to Baghdad, despite the difficulties.",
      "level": 2
    },
    {
      "id": "107",
      "text": "Victoria walks along Tottenham Court Road, considering how to get to Baghdad.",
      "level": 1
    },
    {
      "id": "107.1",
      "text": "Edward mentioned his work is 'cultural'.",
      "level": 2
    },
    {
      "id": "107.2",
      "text": "She wonders if she could find work with UNESCO, but acknowledges such positions are usually for highly qualified graduates.",
      "level": 2
    },
    {
      "id": "108",
      "text": "She visits a travel agency to inquire about travel to Baghdad.",
      "level": 1
    },
    {
      "id": "108.1",
      "text": "Options include flying, sea travel to Basra, train to Marseilles then ship to Beirut and desert crossing, or via Egypt.",
      "level": 2
    },
    {
      "id": "108.2",
      "text": "A continuous train journey is possible but obtaining a visa is difficult and uncertain.",
      "level": 2
    },
    {
      "id": "108.3",
      "text": "Baghdad is in the sterling area, so money is not an issue regarding currency exchange.",
      "level": 2
    },
    {
      "id": "108.4",
      "text": "The main requirement is £60-£100 in cash.",
      "level": 2
    },
    {
      "id": "109",
      "text": "Victoria only has £3 10s (minus 9d), plus £0 12s, and £5 in her savings bank.",
      "level": 1
    },
    {
      "id": "109.1",
      "text": "Therefore, paying for the trip herself is impossible.",
      "level": 2
    },
    {
      "id": "110",
      "text": "She asks about jobs as a stewardess or waitress, but anticipates high competition.",
      "level": 1
    },
    {
      "id": "111",
      "text": "Victoria visits St. Gilderick's office, where Miss Spencer greets her with familiarity, assuming she's lost her job again.",
      "level": 1
    },
    {
      "id": "111.1",
      "text": "Victoria asserts it was difficult to stay and implies suffering.",
      "level": 2
    },
    {
      "id": "112",
      "text": "Miss Spencer, blushing with pleasure, begins to comment on Mr. Grinholtz's behavior.",
      "level": 1
    },
    {
      "id": "112.1",
      "text": "Victoria cuts her off, saying she can take care of herself, with a forced smile.",
      "level": 2
    },
    {
      "id": "113",
      "text": "Miss Spencer consults her notebook and mentions the St. Leonard's Benevolent Association for Unmarried Mothers needs a typist, with a low salary.",
      "level": 1
    },
    {
      "id": "114",
      "text": "Victoria impulsively asks if there's a possibility of finding a job in Baghdad.",
      "level": 1
    },
    {
      "id": "114.1",
      "text": "Miss Spencer is astonished.",
      "level": 2
    },
    {
      "id": "115",
      "text": "Victoria states her strong desire to go to Baghdad.",
      "level": 1
    },
    {
      "id": "115.1",
      "text": "Miss Spencer asks if she means a secretarial position.",
      "level": 2
    },
    {
      "id": "116",
      "text": "Victoria says any job would do: nurse, cook, or companion to a mentally ill person.",
      "level": 1
    },
    {
      "id": "117",
      "text": "Miss Spencer shakes her head, mentioning a woman who wanted to buy a plane ticket to Australia for her two daughters.",
      "level": 1
    }
  ],
  "concepts": [
    {
      "name": "Captain Crosbie",
      "frequency": 12,
      "context": "An Englishman described at the beginning of the story, a character with a jovial disposition and a military bearing."
    },
    {
      "name": "Baghdad",
      "frequency": 15,
      "context": "The primary setting for a significant upcoming meeting and a destination for several characters."
    },
    {
      "name": "Mr. Dakin",
      "frequency": 10,
      "context": "A weary and indecisive man who appears to be in charge of a secret operation concerning a meeting in Baghdad."
    },
    {
      "name": "Meeting",
      "frequency": 6,
      "context": "A planned event in Baghdad, the details of which are secret and involve high-level political figures."
    },
    {
      "name": "Secrecy",
      "frequency": 3,
      "context": "A key element surrounding the meeting in Baghdad, with emphasis on its difficulty in the East."
    },
    {
      "name": "Carmichael",
      "frequency": 4,
      "context": "A character involved in a 'fantastic' story and possessing crucial 'proof' related to the Baghdad meeting."
    },
    {
      "name": "Proof",
      "frequency": 3,
      "context": "Something Carmichael possesses and is going to Baghdad to retrieve or present."
    },
    {
      "name": "Edward",
      "frequency": 11,
      "context": "A charming young man Victoria meets in the park, who is about to travel to Baghdad for a cultural job."
    },
    {
      "name": "Victoria Jones",
      "frequency": 18,
      "context": "A young woman who loses her job and becomes infatuated with Edward, resolving to go to Baghdad."
    },
    {
      "name": "Job",
      "frequency": 7,
      "context": "A recurring theme for Victoria, who has recently lost hers and is actively seeking new employment."
    },
    {
      "name": "Anna Schiller",
      "frequency": 12,
      "context": "A mysterious woman arriving from New York, seemingly involved in business and intelligence operations, who also travels to Baghdad."
    },
    {
      "name": "Travel",
      "frequency": 9,
      "context": "A significant theme, with characters planning or undertaking journeys to various locations, most notably Baghdad."
    },
    {
      "name": "Surveillance",
      "frequency": 4,
      "context": "Implied and explicit observation of characters, particularly Anna Schiller and Carmichael, by unknown parties."
    },
    {
      "name": "Diplomacy",
      "frequency": 1,
      "context": "Underlying the planned meeting in Baghdad, with discussions of 'understanding' and resolving ideological differences."
    },
    {
      "name": "Intelligence",
      "frequency": 2,
      "context": "Suggested by the coded messages, surveillance, and the search of Anna Schiller's belongings."
    },
    {
      "name": "Misdirection",
      "frequency": 1,
      "context": "Anna Schiller's actions of buying flowers and ordering clothes may be a form of misdirection or cover."
    },
    {
      "name": "Lying",
      "frequency": 2,
      "context": "A prominent trait of Victoria, who fabricates stories, and also hinted at in the deceptive actions of some characters."
    },
    {
      "name": "Optimism",
      "frequency": 3,
      "context": "A defining characteristic of Victoria, who believes she can overcome any obstacle."
    },
    {
      "name": "Suspicion",
      "frequency": 3,
      "context": "A recurring element, both in Dakin's feeling about Dr. Raisborn and in the general atmosphere of espionage."
    },
    {
      "name": "Money",
      "frequency": 4,
      "context": "A practical consideration for travel, and also a symbol of power and influence (Anna Schiller as a 'representative of dollars')."
    },
    {
      "name": "London",
      "frequency": 9,
      "context": "The initial setting for several characters before their journeys, a place of employment and social interactions."
    },
    {
      "name": "New York",
      "frequency": 2,
      "context": "Anna Schiller's origin and destination, implying international connections."
    },
    {
      "name": "Culture",
      "frequency": 2,
      "context": "Edward's stated purpose for going to Baghdad, and a theme of Dr. Raisborn's endeavors."
    }
  ],
  "relations": [
    {
      "source": "Captain Crosbie",
      "target": "Mr. Dakin",
      "type": "interacts_with"
    },
    {
      "source": "Mr. Dakin",
      "target": "Meeting",
      "type": "organizes"
    },
    {
      "source": "Meeting",
      "target": "Baghdad",
      "type": "takes_place_in"
    },
    {
      "source": "Carmichael",
      "target": "Proof",
      "type": "possesses"
    },
    {
      "source": "Proof",
      "target": "Meeting",
      "type": "relates_to"
    },
    {
      "source": "Victoria Jones",
      "target": "Edward",
      "type": "falls_in_love_with"
    },
    {
      "source": "Edward",
      "target": "Baghdad",
      "type": "travels_to"
    },
    {
      "source": "Victoria Jones",
      "target": "Baghdad",
      "type": "desires_to_go_to"
    },
    {
      "source": "Victoria Jones",
      "target": "Job",
      "type": "seeks"
    },
    {
      "source": "Anna Schiller",
      "target": "Baghdad",
      "type": "travels_to"
    },
    {
      "source": "Anna Schiller",
      "target": "Surveillance",
      "type": "is_subject_to"
    },
    {
      "source": "Carmichael",
      "target": "Surveillance",
      "type": "is_subject_to"
    },
    {
      "source": "Travel",
      "target": "Baghdad",
      "type": "destination_for"
    },
    {
      "source": "Mr. Dakin",
      "target": "Intelligence",
      "type": "involved_in"
    },
    {
      "source": "Anna Schiller",
      "target": "Misdirection",
      "type": "employs"
    },
    {
      "source": "Victoria Jones",
      "target": "Lying",
      "type": "exhibits"
    },
    {
      "source": "Mr. Dakin",
      "target": "Suspicion",
      "type": "holds"
    },
    {
      "source": "Edward",
      "target": "Suspicion",
      "type": "has_feeling_of"
    },
    {
      "source": "Anna Schiller",
      "target": "Money",
      "type": "represents"
    },
    {
      "source": "Victoria Jones",
      "target": "Money",
      "type": "lacks_for_travel"
    },
    {
      "source": "Captain Crosbie",
      "target": "London",
      "type": "is_in"
    },
    {
      "source": "Victoria Jones",
      "target": "London",
      "type": "is_in"
    },
    {
      "source": "Anna Schiller",
      "target": "London",
      "type": "is_in"
    },
    {
      "source": "Anna Schiller",
      "target": "New York",
      "type": "originates_from"
    },
    {
      "source": "Edward",
      "target": "Culture",
      "type": "works_in"
    },
    {
      "source": "Dr. Raisborn",
      "target": "Culture",
      "type": "promotes"
    }
  ],
  "hierarchy": {
    "main_topics": [
      "The Baghdad Meeting and Espionage",
      "Victoria's Pursuit of Love and Adventure",
      "Anna Schiller's Mysterious Mission"
    ],
    "structure": "The document is structured into chapters, each focusing on different sets of characters and their interwoven storylines, converging towards the impending meeting in Baghdad. Chapter 1 introduces the intrigue surrounding the meeting. Chapter 2 follows Victoria's personal journey and her decision to go to Baghdad. Chapter 3 details Anna Schiller's activities and hints at her covert operations. Chapter 4 shows Victoria's preparations and determination to reach Baghdad."
  }
}