{
  "propositions": [
    {
      "id": "1",
      "text": "Our ancestors were secret agents of the Qing imperial court, responsible for managing confidential state affairs.",
      "level": 1
    },
    {
      "id": "1.1",
      "text": "The exact nature of these secret affairs is unknown.",
      "level": 2
    },
    {
      "id": "1.2",
      "text": "A prevailing belief is that they were secret agents responsible for locating large imperial tombs.",
      "level": 2
    },
    {
      "id": "1.3",
      "text": "The purpose of locating these tombs was to build new ones based on feng shui principles to stabilize the empire and benefit future generations.",
      "level": 2
    },
    {
      "id": "1.4",
      "text": "An alternative theory suggests that the Qing government was not researching feng shui but rather desecrating ancestral graves to pay off foreign debts.",
      "level": 2
    },
    {
      "id": "2",
      "text": "The Qing government had twelve major secret agents, numbered according to the twelve zodiac animals, who operated independently and reported only to the emperor.",
      "level": 1
    },
    {
      "id": "2.1",
      "text": "During the late Qing dynasty, these agents were controlled by Empress Dowager Cixi.",
      "level": 2
    },
    {
      "id": "2.2",
      "text": "Upon the fall of the Qing dynasty, the whereabouts of these agents became unknown.",
      "level": 2
    },
    {
      "id": "3",
      "text": "Our ancestor, Li Chengfeng, was one of the twelve major secret agents of the Qing dynasty.",
      "level": 1
    },
    {
      "id": "3.1",
      "text": "According to family accounts, after the fall of the Qing dynasty, some agents returned to their hometowns, some joined warlords, some changed professions, and some went abroad to study.",
      "level": 2
    },
    {
      "id": "3.2",
      "text": "After Empress Dowager Cixi's death, the court lost contact with these secret agents, and they left Beijing with their golden tokens of authority.",
      "level": 2
    },
    {
      "id": "4",
      "text": "Li Chengfeng, aware of his sensitive identity, returned to his hometown of Xuzhou to live a peaceful life.",
      "level": 1
    },
    {
      "id": "4.1",
      "text": "However, his secret was exposed, and Yuan Shikai dispatched people to find him, revealing the identities of the twelve major secret agents.",
      "level": 2
    },
    {
      "id": "4.2",
      "text": "Li Chengfeng was compelled to return to Beijing secretly.",
      "level": 2
    },
    {
      "id": "4.3",
      "text": "Yuan Shikai died shortly after, and Li Chengfeng returned to his hometown again.",
      "level": 2
    },
    {
      "id": "5",
      "text": "This time, Li Chengfeng moved to a county in Anhui Province, near Xuzhou.",
      "level": 1
    },
    {
      "id": "5.1",
      "text": "Being in a different province, his identity was less likely to be discovered by warlords.",
      "level": 2
    },
    {
      "id": "5.2",
      "text": "He settled in a village with many families named Li, reestablished his lineage, and purchased a residence, enjoying a relatively peaceful life.",
      "level": 2
    },
    {
      "id": "6",
      "text": "The Republic of China era was a time of hardship, and to sustain themselves, Li Chengfeng purchased several hundred mu of land, making him a significant landowner.",
      "level": 1
    },
    {
      "id": "7",
      "text": "During the Anti-Japanese War, the family's estate was passed down to the great-grandfather's generation.",
      "level": 1
    },
    {
      "id": "7.1",
      "text": "The great-grandfather was a patriotic youth who organized a self-defense force and participated in the Xuzhou Campaign organized by the Kuomintang.",
      "level": 2
    },
    {
      "id": "7.2",
      "text": "After the war, dissatisfied with the Kuomintang's corrupt rule, he refused a position offered by the party and returned home.",
      "level": 2
    },
    {
      "id": "8",
      "text": "After the Huaihai Campaign, Xuzhou was liberated, and the great-grandfather, aware of the government's land policies, voluntarily surrendered his three hundred mu of land.",
      "level": 1
    },
    {
      "id": "8.1",
      "text": "The government did not trouble them due to the voluntary surrender.",
      "level": 2
    },
    {
      "id": "9",
      "text": "After the founding of New China, the family no longer showed signs of being landlords.",
      "level": 1
    },
    {
      "id": "9.1",
      "text": "According to the grandfather, their family's background was so inconspicuous that no one would have guessed they were former landlords, appearing more like \"red and pure\" proletarians.",
      "level": 2
    },
    {
      "id": "10",
      "text": "The family's history of having an ancestor who was a secret agent led to subsequent events.",
      "level": 1
    },
    {
      "id": "11",
      "text": "The story begins in 1953, four years after liberation, a period of economic hardship where cities practiced austerity and rural areas experienced food shortages.",
      "level": 1
    },
    {
      "id": "12",
      "text": "Despite the economic difficulties, marriage became easier for men.",
      "level": 1
    },
    {
      "id": "12.1",
      "text": "While parents desired good matches for their daughters, raising a daughter required food, which was scarce.",
      "level": 2
    },
    {
      "id": "12.2",
      "text": "During times of unrest, families were eager to marry off their daughters, with girls as young as fifteen or sixteen getting married.",
      "level": 2
    },
    {
      "id": "13",
      "text": "The grandfather, at twenty-eight, was still unmarried due to the family's poor economic situation.",
      "level": 1
    },
    {
      "id": "13.1",
      "text": "He explained that he hadn't expected the family's sudden downfall, having gone from being a young master to a landlord class revisionist overnight.",
      "level": 2
    },
    {
      "id": "13.2",
      "text": "Marriage proposals that once flooded their doorstep now required them to seek out potential partners, leading to deep regret.",
      "level": 2
    },
    {
      "id": "14",
      "text": "Marriage is sometimes a matter of fate and cannot be forced.",
      "level": 1
    },
    {
      "id": "15",
      "text": "During New Year's, the village tradition was to distribute pork, with each person receiving two liang.",
      "level": 1
    },
    {
      "id": "15.1",
      "text": "The grandfather's family, consisting of three people (great-grandfather, great-grandmother, and grandfather), received six liang of pork.",
      "level": 2
    },
    {
      "id": "15.2",
      "text": "This small amount of pork was highly coveted by villagers who rarely tasted meat and often went hungry.",
      "level": 2
    },
    {
      "id": "16",
      "text": "Unlike other families who would have cooked the pork before the New Year, the grandfather's family saved it to entertain relatives afterward.",
      "level": 1
    },
    {
      "id": "16.1",
      "text": "However, the six liang of pork seemed insufficient for entertaining guests.",
      "level": 2
    },
    {
      "id": "17",
      "text": "During the New Year, the usually frugal great-grandmother became surprisingly generous.",
      "level": 1
    },
    {
      "id": "17.1",
      "text": "Instead of finely chopping the meat like other women, she cooked it whole and placed it on a platter.",
      "level": 2
    },
    {
      "id": "17.2",
      "text": "When relatives arrived, they felt too awkward to take any meat, and the entire piece was preserved until the fourteenth day of the first lunar month.",
      "level": 2
    },
    {
      "id": "18",
      "text": "On the evening of the fourteenth day, a knock was heard at the door.",
      "level": 1
    },
    {
      "id": "18.1",
      "text": "The grandfather opened the door to find an elderly man collapsed from starvation.",
      "level": 2
    },
    {
      "id": "18.2",
      "text": "The grandfather, being kind-hearted, secretly gave the man the six liang of pork.",
      "level": 2
    },
    {
      "id": "18.3",
      "text": "After eating, the old man did not leave but stayed at their home.",
      "level": 2
    },
    {
      "id": "18.4",
      "text": "The great-grandmother and great-grandfather did not reprimand the grandfather and even provided the old man with two extra blankets.",
      "level": 2
    },
    {
      "id": "19",
      "text": "The next day, the old man chatted with the great-grandfather.",
      "level": 1
    },
    {
      "id": "19.1",
      "text": "They discussed village matters and the difficult times.",
      "level": 2
    },
    {
      "id": "19.2",
      "text": "The conversation turned to their old house and its unique design.",
      "level": 2
    },
    {
      "id": "19.3",
      "text": "Seeing the grandfather about to tidy the vegetable patch, the old man inquired about him, asking the great-grandfather if his son was not yet married.",
      "level": 2
    },
    {
      "id": "20",
      "text": "The great-grandfather replied that their poverty deterred potential suitors.",
      "level": 1
    },
    {
      "id": "21",
      "text": "The old man exclaimed and offered his unmarried, good-looking daughter to the grandfather's son.",
      "level": 1
    },
    {
      "id": "22",
      "text": "Thus, the grandfather married his grandmother.",
      "level": 1
    },
    {
      "id": "22.1",
      "text": "Their story is considered legendary.",
      "level": 2
    },
    {
      "id": "22.2",
      "text": "The grandmother was from Luoyang, Henan, and was reputedly very beautiful.",
      "level": 2
    },
    {
      "id": "22.3",
      "text": "Her marriage to the grandfather was a long-discussed topic in the village, with various interpretations.",
      "level": 2
    },
    {
      "id": "23",
      "text": "The discussion about their marriage was short-lived due to the ongoing hardship and frequent deaths in the village.",
      "level": 1
    },
    {
      "id": "24",
      "text": "However, after their marriage, the family's circumstances gradually improved, and they were sometimes able to help neighbors.",
      "level": 1
    },
    {
      "id": "24.1",
      "text": "The grandmother's family was relatively well-off, and her marriage marked the family's transition to consuming cornmeal.",
      "level": 2
    },
    {
      "id": "24.2",
      "text": "During that era, sorghum flour was a staple for survival, sweet potato flour was a common household grain, cornmeal was considered a comfortable food for workers, and white flour was reserved for high-ranking officials.",
      "level": 2
    },
    {
      "id": "25",
      "text": "The grandmother's generous dowry led to a period of relative prosperity for the family, lasting only two years.",
      "level": 1
    },
    {
      "id": "26",
      "text": "By the winter of 1955, a severe drought caused a drastic reduction in grain yield, leading to widespread food shortages before the twelfth lunar month.",
      "level": 1
    },
    {
      "id": "27",
      "text": "Around the Laba Festival, many villagers began to flee, leaving behind only the elderly and very young.",
      "level": 1
    },
    {
      "id": "27.1",
      "text": "Families were often torn apart, with members fleeing separately.",
      "level": 2
    },
    {
      "id": "27.2",
      "text": "Individuals hoped to reunite by the summer harvest or to avoid burdening their families.",
      "level": 2
    },
    {
      "id": "27.3",
      "text": "The fate of the elderly and children depended on their ability to find food.",
      "level": 2
    },
    {
      "id": "28",
      "text": "By the twenty-fourth day of the twelfth lunar month, news of deaths from starvation became a daily occurrence in the village.",
      "level": 1
    },
    {
      "id": "29",
      "text": "The family managed to survive because the grandmother had hidden two sacks of sweet potato flour under the bed.",
      "level": 1
    },
    {
      "id": "30",
      "text": "During this time, the grandmother became noticeably thinner.",
      "level": 1
    },
    {
      "id": "31",
      "text": "On the fourth day of the first lunar month, according to custom, people visited relatives to bring their daughters home for the New Year.",
      "level": 1
    },
    {
      "id": "31.1",
      "text": "The grandmother's father and brother visited.",
      "level": 2
    },
    {
      "id": "31.2",
      "text": "The grandfather's family could only offer thin porridge made from sweet potato flour, lacking any meat, but they served a generous amount of sweet potato flour.",
      "level": 2
    },
    {
      "id": "32",
      "text": "The village, named Quánjí Village, was large, with over three thousand inhabitants, making it the largest in the town.",
      "level": 1
    },
    {
      "id": "33",
      "text": "In the southeast corner of the village, there was a low-lying area that had been used as a dumping ground for the dead since the Republic of China era, referred to by the older generation as a mass grave.",
      "level": 1
    },
    {
      "id": "33.1",
      "text": "Each year, between thirty to fifty bodies, and sometimes up to a hundred, were disposed of there.",
      "level": 2
    },
    {
      "id": "33.2",
      "text": "The deceased were wrapped in mats if their families could afford them; otherwise, they were only clad in worn, thin clothing.",
      "level": 2
    },
    {
      "id": "33.3",
      "text": "During summer, the heat facilitated the spread of disease, leading to an increased supply of bodies for the mass grave.",
      "level": 2
    },
    {
      "id": "34",
      "text": "In those years, with a high mortality rate, the mass grave was a forbidden and taboo place for the villagers.",
      "level": 1
    },
    {
      "id": "34.1",
      "text": "The taboo extended beyond the sheer number of deceased; it was also associated with numerous strange occurrences, such as sightings of ghost fires and people singing at night.",
      "level": 2
    },
    {
      "id": "34.2",
      "text": "While some of these accounts were rumors, others were eyewitness testimonies, but the truth remains unverified after so many years.",
      "level": 2
    },
    {
      "id": "35",
      "text": "The mass grave instilled fear in children and dread in the elderly, with countless deaths contributing to its eerie reputation and frequent supernatural claims.",
      "level": 1
    },
    {
      "id": "35.1",
      "text": "Daytime offered some respite, but nighttime at the grave site was profoundly unsettling.",
      "level": 2
    },
    {
      "id": "35.2",
      "text": "A common threat used to scare children was, \"If you don't behave, we'll throw you into the mass grave.\"",
      "level": 2
    },
    {
      "id": "36",
      "text": "In the 1950s, with limited productivity, river channel dredging relied solely on manual labor.",
      "level": 1
    },
    {
      "id": "37",
      "text": "Due to the hot summers and rainy season, work was exclusively scheduled for late autumn.",
      "level": 1
    },
    {
      "id": "38",
      "text": "While manual labor was generally undesirable, one year, incentives of grain subsidies attracted a large number of people to participate in river dredging, including almost all able-bodied men who had not fled the village.",
      "level": 1
    },
    {
      "id": "39",
      "text": "At that time, people often worked in teams, with a group claiming responsibility for a plot of land and resting once their daily quota was met.",
      "level": 1
    },
    {
      "id": "40",
      "text": "The grandfather's strength made him a desirable teammate, but his partners often slacked off, leaving him to do the majority of the work.",
      "level": 1
    },
    {
      "id": "40.1",
      "text": "He attributed their lack of energy to the poor food quality.",
      "level": 2
    },
    {
      "id": "41",
      "text": "On the sixteenth day of the first lunar month, after returning from home, the workers were sluggish from inactivity.",
      "level": 1
    },
    {
      "id": "41.1",
      "text": "As darkness fell, their assigned plot remained undug.",
      "level": 2
    },
    {
      "id": "41.2",
      "text": "The others decided to abandon the task, but the grandfather, driven by his strong work ethic, decided to continue working alone.",
      "level": 2
    },
    {
      "id": "42",
      "text": "Around eleven o'clock, feeling the urge to urinate, and noting the bright moonlight and the presence of female workers, he went to a more secluded area.",
      "level": 1
    },
    {
      "id": "43",
      "text": "He crossed the embankment and walked towards the wheat field.",
      "level": 1
    },
    {
      "id": "43.1",
      "text": "Due to his urgency, he wasn't paying close attention and accidentally stepped into a deep pit.",
      "level": 2
    },
    {
      "id": "43.2",
      "text": "The pit was so deep that his foot didn't reach the bottom.",
      "level": 2
    },
    {
      "id": "43.3",
      "text": "Fortunately, he reacted quickly and avoided a sprained ankle.",
      "level": 2
    },
    {
      "id": "43.4",
      "text": "Upon freeing his leg, he discovered the pit was unusually deep and appeared to be man-made rather than water-eroded.",
      "level": 2
    },
    {
      "id": "44",
      "text": "Although his ancestor had avoided discussing his past as a secret agent, he had openly shared such information with his descendants, believing it important to pass down.",
      "level": 1
    },
    {
      "id": "45",
      "text": "Seeing the pit, the grandfather immediately recognized it as a tomb-robbing tunnel.",
      "level": 1
    },
    {
      "id": "45.1",
      "text": "He felt an inexplicable pull, possibly inherited from his ancestors, and suspected a large tomb lay beneath.",
      "level": 2
    },
    {
      "id": "46",
      "text": "In their local dialect, burial artifacts were referred to as \"water goods\" (水货), distinct from the modern meaning.",
      "level": 1
    },
    {
      "id": "46.1",
      "text": "This term originated from the region's abundant groundwater; artifacts buried two meters deep would be submerged.",
      "level": 2
    },
    {
      "id": "47",
      "text": "The grandfather had heard stories of ancient tombs containing artifacts like foreign coins, placed there by the deceased's children.",
      "level": 1
    },
    {
      "id": "47.1",
      "text": "The depth of this tomb suggested it was either very old or belonged to a wealthy family.",
      "level": 2
    },
    {
      "id": "47.2",
      "text": "Even though the tomb had likely been looted, he believed finding even a small artifact would be beneficial.",
      "level": 2
    },
    {
      "id": "47.3",
      "text": "Lacking rope, he couldn't enter immediately.",
      "level": 2
    },
    {
      "id": "47.4",
      "text": "He covered the hole with a large stone and dry grass, planning to return with tools.",
      "level": 2
    },
    {
      "id": "48",
      "text": "The next day, as the grandfather was heading to work by the river, the team leader approached him.",
      "level": 1
    },
    {
      "id": "49",
      "text": "The team leader informed him that the cook had fallen ill with a fever and gone home, appointing the grandfather as the temporary cook.",
      "level": 1
    },
    {
      "id": "50",
      "text": "The grandfather was overjoyed and readily accepted.",
      "level": 1
    },
    {
      "id": "50.1",
      "text": "Cooking was considered a favorable position at the time.",
      "level": 2
    },
    {
      "id": "50.2",
      "text": "Previously, due to his landlord background, he was denied such roles.",
      "level": 2
    },
    {
      "id": "50.3",
      "text": "This new role meant his former teammates would have to work harder.",
      "level": 2
    },
    {
      "id": "51",
      "text": "The cooking at the time was basic, with no specialized skills required, as food consisted mainly of corn cakes and sweet potato flour.",
      "level": 1
    },
    {
      "id": "51.1",
      "text": "Being able to cook it thoroughly was considered an achievement.",
      "level": 2
    },
    {
      "id": "52",
      "text": "As the cook, the grandfather was relieved of strenuous labor and had more free time.",
      "level": 1
    },
    {
      "id": "52.1",
      "text": "This leisure time allowed him to ponder the tomb-robbing tunnel he had discovered the previous night.",
      "level": 2
    },
    {
      "id": "53",
      "text": "Given that others had likely entered, he felt it was unnecessary to go again.",
      "level": 1
    },
    {
      "id": "53.1",
      "text": "However, the family's financial strain motivated him, and he felt guilty for not contributing more, especially seeing his grandmother's efforts.",
      "level": 2
    },
    {
      "id": "54",
      "text": "Driven by a desire to prove himself, he resolved to explore the tomb.",
      "level": 1
    },
    {
      "id": "55",
      "text": "He noted the location of the work site's ropes and borrowed a flashlight and extra batteries from his colleagues.",
      "level": 1
    },
    {
      "id": "56",
      "text": "On the twenty-ninth day of the first lunar month, around one in the morning, he set out with a large kitchen knife, a flashlight, and a twenty-meter rope.",
      "level": 1
    },
    {
      "id": "56.1",
      "text": "To avoid detection, he moved without the flashlight, relying on his sense of direction.",
      "level": 2
    },
    {
      "id": "56.2",
      "text": "Guided by the surrounding trees, he quickly found the stone covering the entrance.",
      "level": 2
    },
    {
      "id": "56.3",
      "text": "Upon removing the stone and shining his light, he saw it was a steeply descending tunnel.",
      "level": 2
    },
    {
      "id": "57",
      "text": "He tied the rope securely to a tree and fastened the other end around his waist.",
      "level": 1
    },
    {
      "id": "58",
      "text": "As he stepped in, a gust of wind swept through, causing him to sneeze.",
      "level": 1
    },
    {
      "id": "58.1",
      "text": "The sudden chill made him fearful, despite his familiarity with handling the deceased at the mass grave; this was his first time entering a tomb at night.",
      "level": 2
    },
    {
      "id": "58.2",
      "text": "However, he resolved to proceed, thinking that dying from fear was worse than starving.",
      "level": 2
    },
    {
      "id": "59",
      "text": "He descended the rope, rappelling about four or five meters.",
      "level": 1
    },
    {
      "id": "59.1",
      "text": "He found himself suspended, indicating he had reached the top of the tomb chamber.",
      "level": 2
    },
    {
      "id": "59.2",
      "text": "Shining his light downwards, he saw the tomb chamber was about ten square meters, with what appeared to be paintings on the walls.",
      "level": 2
    },
    {
      "id": "60",
      "text": "He had never heard of anyone in the vicinity constructing such an elaborate tomb.",
      "level": 1
    },
    {
      "id": "60.1",
      "text": "Considering his family had been the wealthiest landowners in the area for a century, he deduced it was an ancient tomb, likely over a hundred years old.",
      "level": 2
    },
    {
      "id": "61",
      "text": "The family possessed a book titled \"Compendium of Royal Tombs\" (王公陵寝纲目), compiled by his ancestor Li Chengfeng during his tenure as a secret agent, which detailed the locations of royal tombs across the country.",
      "level": 1
    },
    {
      "id": "61.1",
      "text": "The grandfather had only skimmed the section relevant to the surrounding hundred-mile radius and found no record of this particular tomb.",
      "level": 2
    },
    {
      "id": "61.2",
      "text": "Li Chengfeng's book only listed major tombs, implying this one was likely a smaller one.",
      "level": 2
    },
    {
      "id": "62",
      "text": "This was the grandfather's first attempt at tomb raiding.",
      "level": 1
    },
    {
      "id": "62.1",
      "text": "He lacked knowledge of tomb architecture and, due to his great-grandfather's prohibition against entering this line of work, his understanding of tomb raiding was superficial.",
      "level": 2
    },
    {
      "id": "63",
      "text": "As he prepared to descend further, he shone his flashlight downwards and gasped in horror.",
      "level": 1
    },
    {
      "id": "63.1",
      "text": "Two corpses lay directly beneath him: Liu Laoba and Laipihan, both from his village.",
      "level": 2
    },
    {
      "id": "64",
      "text": "At that moment, the grandfather wanted to retreat to the surface.",
      "level": 1
    },
    {
      "id": "64.1",
      "text": "However, his increasing panic caused him to lose his grip on the rope and slide down, landing on Laipihan.",
      "level": 2
    },
    {
      "id": "65",
      "text": "Startled, he quickly stood up and, after composing himself, examined the bodies.",
      "level": 1
    },
    {
      "id": "65.1",
      "text": "They had no apparent wounds, but the ground was covered in blood, creating a terrifying scene.",
      "level": 2
    },
    {
      "id": "65.2",
      "text": "He felt that since he had come this far, he should at least search for some foreign coins before leaving, as it would be a waste to abandon them.",
      "level": 2
    },
    {
      "id": "66",
      "text": "He surveyed the tomb chamber with his flashlight, noting a foul odor but breathable air.",
      "level": 1
    },
    {
      "id": "66.1",
      "text": "Despite this, he felt it was best to leave as soon as possible.",
      "level": 2
    },
    {
      "id": "67",
      "text": "He walked around the chamber, finding it to be rectangular, approximately four meters long and three meters wide.",
      "level": 1
    },
    {
      "id": "67.1",
      "text": "The coffin was located at the rear of the chamber.",
      "level": 2
    },
    {
      "id": "67.2",
      "text": "The coffin appeared to be made of marble, with the lid alone estimated to weigh eight hundred jin.",
      "level": 2
    },
    {
      "id": "68",
      "text": "What he found particularly alarming were sharp knives erected in each of the four corners of the chamber, four knives per corner arranged in rows, with their blades pointing upwards and extremely sharp.",
      "level": 1
    },
    {
      "id": "68.1",
      "text": "He shuddered, thinking that if Liu Laoba and Laipihan hadn't been there, he might have been impaled by them.",
      "level": 2
    },
    {
      "id": "69",
      "text": "Disappointed by the absence of coin jars, he noticed murals on the walls.",
      "level": 1
    },
    {
      "id": "69.1",
      "text": "The murals depicted Buddhist figures with extremely eerie expressions.",
      "level": 2
    },
    {
      "id": "69.2",
      "text": "He felt as though the figures were watching him, causing him to retreat several steps.",
      "level": 2
    },
    {
      "id": "70",
      "text": "Suddenly, he felt something hard press against his shoulder.",
      "level": 1
    },
    {
      "id": "70.1",
      "text": "Frozen in fear, he eventually mustered the courage to turn around.",
      "level": 2
    },
    {
      "id": "70.2",
      "text": "He realized he had bumped into the coffin.",
      "level": 2
    },
    {
      "id": "71",
      "text": "A hissing sound emanated from the chamber, intensifying his fear.",
      "level": 1
    },
    {
      "id": "71.1",
      "text": "He decided he no longer wanted to stay and quickly headed for the exit.",
      "level": 2
    },
    {
      "id": "71.2",
      "text": "Upon reaching the exit, he identified the hissing sound as coming from the coffin.",
      "level": 2
    },
    {
      "id": "72",
      "text": "His immediate thought was, \"Is this a ghost?\"",
      "level": 1
    },
    {
      "id": "73",
      "text": "He scrambled up the rope, but the chamber was high, and he struggled to ascend quickly.",
      "level": 1
    },
    {
      "id": "73.1",
      "text": "The hissing sound seemed to be moving towards him from the coffin, increasing his urgency.",
      "level": 2
    },
    {
      "id": "73.2",
      "text": "Remembering Liu Laoba and Laipihan on the floor, he used their bodies as makeshift steps, allowing him to easily climb the two-meter height.",
      "level": 2
    },
    {
      "id": "74",
      "text": "Just as he felt a surge of relief, his leg was grabbed by something.",
      "level": 1
    },
    {
      "id": "74.1",
      "text": "He mused that perhaps the deceased in the coffin wanted to keep him.",
      "level": 2
    },
    {
      "id": "75",
      "text": "With a surge of adrenaline, he shone his flashlight downwards.",
      "level": 1
    },
    {
      "id": "75.1",
      "text": "To his shock, a green snake, about three meters long and as thick as a child's arm, was coiled around his leg.",
      "level": 2
    },
    {
      "id": "75.2",
      "text": "He realized the hissing had come from this snake.",
      "level": 2
    },
    {
      "id": "76",
      "text": "Knowing it wasn't a ghost, he became bolder.",
      "level": 1
    },
    {
      "id": "76.1",
      "text": "He attempted to shake his leg free, using the snake's own momentum, but the snake was strong.",
      "level": 2
    },
    {
      "id": "76.2",
      "text": "He then tried to smash his leg against the wall, but the dirt wall was ineffective.",
      "level": 2
    },
    {
      "id": "76.3",
      "text": "Recalling that green snakes feared light, he shone his flashlight into its eyes, but the snake seemed unaffected.",
      "level": 2
    },
    {
      "id": "76.4",
      "text": "The snake crawled over his back and escaped through the tunnel opening without biting him.",
      "level": 2
    },
    {
      "id": "77",
      "text": "He breathed a sigh of relief, feeling he had narrowly escaped with his life.",
      "level": 1
    },
    {
      "id": "77.1",
      "text": "Relieved that the snake had not attacked him, he decided to leave the tomb immediately and vowed never to engage in such dangerous activities again.",
      "level": 2
    },
    {
      "id": "78",
      "text": "Before leaving, the grandfather looked back at Liu Laoba and Laipihan, intending to arrange for their burial later.",
      "level": 1
    },
    {
      "id": "78.1",
      "text": "To his surprise, Liu Laoba was gone, only Laipihan remained.",
      "level": 2
    },
    {
      "id": "78.2",
      "text": "This made him uneasy, wondering if Liu Laoba had risen from the dead.",
      "level": 2
    },
    {
      "id": "79",
      "text": "Although his great-grandfather had mentioned the possibility of reanimated corpses in tombs, it was considered a rare phenomenon.",
      "level": 1
    },
    {
      "id": "80",
      "text": "He immediately tried to climb out, but his foot was grabbed again, this time with more force than the snake.",
      "level": 1
    },
    {
      "id": "81",
      "text": "Looking back, he saw Liu Laoba, mouth bloody and a sinister smile on his face, pulling him down.",
      "level": 1
    },
    {
      "id": "81.1",
      "text": "The smile seemed familiar.",
      "level": 2
    },
    {
      "id": "82",
      "text": "Liu Laoba, possessing incredible strength, wrestled the grandfather to the tomb floor, throwing him around like a doll.",
      "level": 1
    },
    {
      "id": "83",
      "text": "After several throws, the grandfather's senses became blurred, but he realized his life was in danger.",
      "level": 1
    },
    {
      "id": "84",
      "text": "He remembered the large kitchen knife he had hidden and, in a desperate move, swung it at Liu Laoba, who was repeating the same action.",
      "level": 1
    },
    {
      "id": "85",
      "text": "Liu Laoba cried out in pain and threw the grandfather towards the wall.",
      "level": 1
    },
    {
      "id": "86",
      "text": "This throw, however, propelled him towards the tunnel opening.",
      "level": 1
    },
    {
      "id": "87",
      "text": "Seizing this chance, he painfully climbed out and quickly sealed the entrance with stones.",
      "level": 1
    },
    {
      "id": "88",
      "text": "Emerging from the tomb, he felt as though he had returned to paradise.",
      "level": 1
    },
    {
      "id": "88.1",
      "text": "Despite the lack of moonlight, the outside world seemed brilliantly lit.",
      "level": 2
    },
    {
      "id": "89",
      "text": "He spent the night on edge, unable to sleep, regretting the loss of his flashlight and knife, feeling like he had lost more than he gained.",
      "level": 1
    },
    {
      "id": "90",
      "text": "The next morning, he discreetly returned to the tomb entrance and was relieved to find the stones still in place.",
      "level": 1
    },
    {
      "id": "91",
      "text": "The following day was a holiday, and most people were planning to visit home.",
      "level": 1
    },
    {
      "id": "91.1",
      "text": "Despite being married for several years, the grandfather was a devoted husband and always returned home on holidays.",
      "level": 2
    },
    {
      "id": "92",
      "text": "Upon arriving home, he sat on the bed, dejected and silent.",
      "level": 1
    },
    {
      "id": "93",
      "text": "His grandmother, noticing his unusual demeanor, approached him.",
      "level": 1
    },
    {
      "id": "93.1",
      "text": "She was alarmed to see his forehead was dark, his arms and legs were bruised, and his eyes lacked their usual spirit, appearing as if he had suffered a serious illness.",
      "level": 2
    },
    {
      "id": "94",
      "text": "His grandmother asked if he had been somewhere he shouldn't have.",
      "level": 1
    },
    {
      "id": "94.1",
      "text": "He admitted to having entered an ancient tomb the previous night.",
      "level": 2
    },
    {
      "id": "95",
      "text": "His grandmother, startled, asked his motive.",
      "level": 1
    },
    {
      "id": "95.1",
      "text": "He confessed he was looking for coins to buy her something nice.",
      "level": 2
    },
    {
      "id": "95.2",
      "text": "Touched by his words, she didn't scold him.",
      "level": 2
    },
    {
      "id": "96",
      "text": "He then recounted the discovery of the tunnel, his descent into the tomb, and the encounter with Liu Laoba and Laipihan.",
      "level": 1
    },
    {
      "id": "97",
      "text": "He mentioned his initial fear of the green snake.",
      "level": 1
    },
    {
      "id": "98",
      "text": "His grandmother explained that the snake was not attacking him but fleeing.",
      "level": 1
    },
    {
      "id": "99",
      "text": "When asked why, she stated that the snake sensed the danger after Liu Laoba's reanimation and prioritized its own escape.",
      "level": 1
    },
    {
      "id": "100",
      "text": "He then questioned why Liu Laoba reanimated but Laipihan did not.",
      "level": 1
    },
    {
      "id": "101",
      "text": "His grandmother revealed that Laipihan had also reanimated.",
      "level": 1
    },
    {
      "id": "102",
      "text": "Surprised, he asked why Laipihan hadn't pursued him.",
      "level": 1
    },
    {
      "id": "103",
      "text": "She explained that the position where they lay was near four knives, suggesting Liu Laoba might have been unaffected or less wounded, while Laipihan was more severely injured.",
      "level": 1
    },
    {
      "id": "103.1",
      "text": "She added that if he had stayed longer, his presence of yang energy might have further empowered Laipihan's yin energy, potentially leading to his demise.",
      "level": 2
    },
    {
      "id": "104",
      "text": "The grandfather, now sweating profusely, asked how she knew all these details.",
      "level": 1
    },
    {
      "id": "105",
      "text": "His great-grandfather entered and revealed that his wife was a descendant of Qiu Wensheng, one of the twelve major secret agents of the Qing dynasty.",
      "level": 1
    },
    {
      "id": "106",
      "text": "The grandfather was astonished to learn that his wife was also from a lineage of secret agents.",
      "level": 1
    },
    {
      "id": "107",
      "text": "He asked her why she married him, and she then explained.",
      "level": 1
    },
    {
      "id": "108",
      "text": "Her grandfather, Qiu Wensheng, like his ancestor, was a secret agent tasked with locating tombs across the empire.",
      "level": 1
    },
    {
      "id": "109",
      "text": "After Empress Dowager Cixi's death, Qiu Wensheng retired to his hometown in Kaifeng.",
      "level": 1
    },
    {
      "id": "110",
      "text": "When Yuan Shikai became president, he invited Qiu Wensheng to his residence.",
      "level": 1
    },
    {
      "id": "110.1",
      "text": "There, Qiu Wensheng met the grandfather's ancestor, and they found they had much in common.",
      "level": 2
    },
    {
      "id": "110.2",
      "text": "They discovered that each had compiled a book: the ancestor's was \"Compendium of Royal Tombs,\" and Qiu Wensheng's was \"River Chart Booklet of Yin and Yang\" (河图小册之阴阳).",
      "level": 2
    },
    {
      "id": "111",
      "text": "The grandmother retrieved a yellowed booklet from a chest under her bed, titled \"River Chart Booklet of Yin and Yang.\"",
      "level": 1
    },
    {
      "id": "111.1",
      "text": "It was an ancient handwritten manuscript containing only the general principles.",
      "level": 2
    },
    {
      "id": "111.2",
      "text": "The content was similar to the \"Compendium of Royal Tombs,\" with the latter organized chronologically and the former by regional classification.",
      "level": 2
    },
    {
      "id": "112",
      "text": "The grandmother explained that this was written by her grandfather, Qiu Wensheng, as the original was burned.",
      "level": 1
    },
    {
      "id": "112.1",
      "text": "The reason for burning it was to prevent the complete excavation of all tombs, which would harm their descendants and bring further calamity.",
      "level": 2
    },
    {
      "id": "112.2",
      "text": "However, regretting the loss of such valuable information, he preserved the general principles in a handwritten copy.",
      "level": 2
    },
    {
      "id": "112.3",
      "text": "The great-grandfather remarked that their ancestor had also burned the \"Compendium of Royal Tombs,\" only keeping a partial copy of the general principles.",
      "level": 2
    },
    {
      "id": "113",
      "text": "Qiu Wensheng settled in Luoyang after Yuan Shikai's death.",
      "level": 1
    },
    {
      "id": "113.1",
      "text": "During the Japanese invasion, he refused to be a subjugated person and committed suicide.",
      "level": 2
    },
    {
      "id": "113.2",
      "text": "His descendants, unwilling to suffer humiliation, joined the Kuomintang army and all died fighting in the war.",
      "level": 2
    },
    {
      "id": "113.3",
      "text": "By the time of the founding of New China, only the grandmother's father remained.",
      "level": 2
    },
    {
      "id": "114",
      "text": "The grandmother's brother lacked intellectual capacity for the studies of yin and yang.",
      "level": 1
    },
    {
      "id": "114.1",
      "text": "Her father, concerned about the family legacy without a successor, remembered the descendants of Li Chengfeng.",
      "level": 2
    },
    {
      "id": "115",
      "text": "Li Chengfeng and Qiu Wensheng had shared their intended places of retirement when they parted ways.",
      "level": 1
    },
    {
      "id": "116",
      "text": "The grandmother's father traveled to the border region of Anhui and Xuzhou, begging for food from house to house.",
      "level": 1
    },
    {
      "id": "116.1",
      "text": "After more than three months, he found their village.",
      "level": 2
    },
    {
      "id": "116.2",
      "text": "Although their house was dilapidated, its feng shui was distinctive.",
      "level": 2
    },
    {
      "id": "116.3",
      "text": "Upon inquiring, he learned that the family had been prominent landowners fifty years prior and had established their lineage in the village at that time.",
      "level": 2
    },
    {
      "id": "116.4",
      "text": "He concluded that this was the residence of Li Chengfeng's descendants.",
      "level": 2
    },
    {
      "id": "116.5",
      "text": "He was surprised by the family's impoverished state but was reassured by the grandfather's kind nature, which he saw as befitting a descendant of a secret agent.",
      "level": 2
    },
    {
      "id": "116.6",
      "text": "He confidently arranged his daughter's marriage to him.",
      "level": 2
    },
    {
      "id": "117",
      "text": "The grandmother explained that she hadn't revealed this information earlier because the time was not right.",
      "level": 1
    },
    {
      "id": "117.1",
      "text": "Having experienced significant ups and downs, she desired a peaceful life and would not have brought up the past otherwise.",
      "level": 2
    },
    {
      "id": "118",
      "text": "She then opened a dowry chest, which the grandfather had never seen before, filled with peculiar objects.",
      "level": 1
    },
    {
      "id": "118.1",
      "text": "These included various oddly shaped knives, bowls with strange symbols, and items used by Taoist priests.",
      "level": 2
    },
    {
      "id": "119",
      "text": "Her grandfather, Qiu Wensheng, could identify tomb locations and predict which ones would surface due to rainfall, leading to the accumulation of many antiques in their family.",
      "level": 1
    },
    {
      "id": "119.1",
      "text": "However, during the Japanese invasion, all their antiques were confiscated, and their relatives were investigated.",
      "level": 2
    },
    {
      "id": "119.2",
      "text": "The Japanese even demolished their house and excavated their residence, searching for antiques in their yard and vegetable patch.",
      "level": 2
    },
    {
      "id": "120",
      "text": "The grandfather, listening to his grandmother's surreal account, felt a sense of deflation.",
      "level": 1
    },
    {
      "id": "120.1",
      "text": "He had believed his father-in-law had stumbled upon their home by chance, not realizing he had sought them out.",
      "level": 2
    },
    {
      "id": "121",
      "text": "His grandmother smiled, admitting she had worried about his appearance before their marriage but found him handsome, like a \"gold ingot falling from heaven.\"",
      "level": 1
    },
    {
      "id": "121.1",
      "text": "She expressed surprise at his courage to venture into tomb raiding when pushed to desperation.",
      "level": 2
    },
    {
      "id": "122",
      "text": "The grandfather was still upset that his wife had kept him in the dark for so long.",
      "level": 1
    },
    {
      "id": "123",
      "text": "His great-grandfather, however, felt the marriage was a suitable match and admitted that without it, he might have forgotten his own father was Li Chengfeng.",
      "level": 1
    },
    {
      "id": "124",
      "text": "In the following days, the grandfather continued to suffer from sleepless nights, fearing the reappearance of Liu Laoba and Laipihan.",
      "level": 1
    },
    {
      "id": "124.1",
      "text": "Even a slight gust of wind would awaken him, leaving him awake until dawn.",
      "level": 2
    },
    {
      "id": "125",
      "text": "His grandmother advised him to sunbathe, believing it would dispel any lingering malevolent energy.",
      "level": 1
    },
    {
      "id": "126",
      "text": "Three days later, the grandfather returned to work.",
      "level": 1
    },
    {
      "id": "126.1",
      "text": "His grandmother accompanied him, bringing her chest.",
      "level": 2
    },
    {
      "id": "126.2",
      "text": "Their mission was to retrieve the kitchen knife and flashlight and to burn the two reanimated corpses.",
      "level": 2
    },
    {
      "id": "127",
      "text": "The grandfather was astonished when his grandmother produced two sets of night-vision clothing, which she said her father had prepared for her before her marriage.",
      "level": 1
    },
    {
      "id": "128",
      "text": "The grandfather truly did not want to return to the tomb, which had become a recurring nightmare.",
      "level": 1
    },
    {
      "id": "128.1",
      "text": "His survival from the previous encounter was attributed to ancestral protection.",
      "level": 2
    },
    {
      "id": "128.2",
      "text": "He feared that if his grandmother couldn't subdue Liu Laoba, they might not return.",
      "level": 2
    },
    {
      "id": "129",
      "text": "However, seeing his grandmother's confidence, he felt he had to accompany her to avoid appearing cowardly.",
      "level": 1
    },
    {
      "id": "130",
      "text": "To avoid detection, they again chose to enter the tomb at night.",
      "level": 1
    },
    {
      "id": "131",
      "text": "The grandmother prepared a thick rope, two flashlights, a peach wood sword, a bag of glutinous rice, and some talismans drawn by her father, said to ward off spirits.",
      "level": 1
    },
    {
      "id": "132",
      "text": "The grandfather suggested borrowing a neighbor's air rifle for bird hunting, but his grandmother refused, stating it would be difficult to explain.",
      "level": 1
    },
    {
      "id": "133",
      "text": "Under the dark, moonless sky, they followed the riverbank to the same location.",
      "level": 1
    },
    {
      "id": "134",
      "text": "Standing by the large stone, the grandfather could hear the branches of the bare trees by the river clashing against each other.",
      "level": 1
    },
    {
      "id": "135",
      "text": "They moved the stone, secured the rope, and the grandfather entered first.",
      "level": 1
    },
    {
      "id": "135.1",
      "text": "The grandmother lit sandalwood incense and placed it at intervals along the sides of the tunnel behind him.",
      "level": 2
    },
    {
      "id": "136",
      "text": "Upon reaching the tomb chamber, they were baffled to find that both Liu Laoba and Laipihan had vanished.",
      "level": 1
    },
    {
      "id": "136.1",
      "text": "They exchanged confused glances, unsure of what to do.",
      "level": 2
    },
    {
      "id": "137",
      "text": "After confirming their absence, the grandmother turned off her flashlight.",
      "level": 1
    },
    {
      "id": "138",
      "text": "She instructed the grandfather to wait at the entrance while she, carrying paste and fire paper, jumped into the tomb chamber.",
      "level": 1
    },
    {
      "id": "139",
      "text": "Familiar with the layout, she skillfully applied paste to the walls and stuck on the fire paper.",
      "level": 1
    },
    {
      "id": "139.1",
      "text": "She then performed a series of acrobatic flips within the tomb and lit four candles in the corners, instantly illuminating the chamber.",
      "level": 2
    },
    {
      "id": "140",
      "text": "The grandfather was impressed by his grandmother's agility, feeling inferior.",
      "level": 1
    },
    {
      "id": "141",
      "text": "Following her lead, he jumped down and asked the purpose of the fire paper, inquiring if it was for offerings to the dead.",
      "level": 1
    },
    {
      "id": "142",
      "text": "His grandmother explained that the Buddhist figures in the murals had the power to captivate the mind.",
      "level": 1
    },
    {
      "id": "142.1",
      "text": "If a tomb contained deceased individuals, they could become zombies when disturbed by tomb raiders, defending the tomb.",
      "level": 2
    },
    {
      "id": "142.2",
      "text": "The reason Liu Laoba and Laipihan attacked him was because he had seen the Buddhist figures.",
      "level": 2
    },
    {
      "id": "143",
      "text": "He found this unsettling and still struggled to believe it.",
      "level": 1
    },
    {
      "id": "143.1",
      "text": "He also wondered why the bodies and his tools were missing, playfully suggesting they might have been embezzled by Liu Laoba and Laipihan.",
      "level": 2
    },
    {
      "id": "144",
      "text": "His grandmother, amused by his remark, stated that someone else must have visited the tomb.",
      "level": 1
    },
    {
      "id": "145",
      "text": "He inquired who it could be.",
      "level": 1
    },
    {
      "id": "146",
      "text": "She suggested it was the original tomb raiders.",
      "level": 1
    },
    {
      "id": "146.1",
      "text": "She theorized that Liu Laoba and Laipihan might have discovered these intruders, leading to their deaths to prevent exposure.",
      "level": 2
    },
    {
      "id": "146.2",
      "text": "The original raiders, realizing the tunnel was inadequately concealed, returned, cleaned up the scene, and took his belongings.",
      "level": 2
    },
    {
      "id": "146.3",
      "text": "She marveled at their ability to easily subdue two zombies.",
      "level": 2
    },
    {
      "id": "147",
      "text": "As his grandmother spoke softly, a piece of fire paper detached from the left wall.",
      "level": 1
    },
    {
      "id": "148",
      "text": "His grandmother found it strange and asked if the paste was not applied properly.",
      "level": 1
    },
    {
      "id": "148.1",
      "text": "The grandfather assured her that the paste was consistently made and should not be the issue.",
      "level": 2
    },
    {
      "id": "149",
      "text": "Suddenly, a gust of cold wind swept through the chamber, chilling them both.",
      "level": 1
    },
    {
      "id": "149.1",
      "text": "The wind made the grandfather feel that something was amiss.",
      "level": 2
    },
    {
      "id": "150",
      "text": "He looked at the fallen fire paper and saw it being blown towards a corner of the tomb wall.",
      "level": 1
    },
    {
      "id": "150.1",
      "text": "As it neared a candle, the paper ignited, filling the chamber with smoke.",
      "level": 2
    },
    {
      "id": "151",
      "text": "Recalling his grandmother's words, he still looked up at the murals.",
      "level": 1
    },
    {
      "id": "151.1",
      "text": "The Buddhist figures on the wall still bore their eerie smiles.",
      "level": 2
    },
    {
      "id": "152",
      "text": "Suddenly, he remembered the green snake and urged his grandmother to leave.",
      "level": 1
    },
    {
      "id": "153",
      "text": "His grandmother replied that the snake had likely also been subdued.",
      "level": 1
    },
    {
      "id": "154",
      "text": "Before she finished speaking, a \"hissing\" sound from beneath the coffin made her shiver.",
      "level": 1
    },
    {
      "id": "154.1",
      "text": "Another gust of cold wind blew from the tunnel opening, extinguishing two candles.",
      "level": 2
    },
    {
      "id": "155",
      "text": "His grandmother exclaimed \"Not good!\" and pulled the grandfather towards the exit.",
      "level": 1
    },
    {
      "id": "156",
      "text": "The grandfather recognized the hissing as the snake's and was less alarmed.",
      "level": 1
    },
    {
      "id": "156.1",
      "text": "He reassured his grandmother that the snake wouldn't bite.",
      "level": 2
    },
    {
      "id": "157",
      "text": "His grandmother countered that the snake had fled previously due to the reanimated corpses, but now it likely had time to confront them.",
      "level": 1
    },
    {
      "id": "158",
      "text": "He agreed and immediately prepared sulfur and saltpeter from his pocket to throw at the snake.",
      "level": 1
    },
    {
      "id": "159",
      "text": "The hissing grew louder, and the green snake emerged from under the coffin, its tongue extending twenty centimeters.",
      "level": 1
    },
    {
      "id": "160",
      "text": "His grandmother, though unafraid of zombies and ghosts, had an aversion to snakes.",
      "level": 1
    },
    {
      "id": "160.1",
      "text": "She drew a sharp knife, a family heirloom with a black blade, ready to strike the snake's vulnerable spot.",
      "level": 2
    },
    {
      "id": "161",
      "text": "The snake's scales gleamed green, both terrifying and repulsive.",
      "level": 1
    },
    {
      "id": "162",
      "text": "The snake lunged at them. As the grandfather was about to throw the saltpeter, the snake veered away and rushed towards the tunnel opening, escaping.",
      "level": 1
    },
    {
      "id": "163",
      "text": "The grandfather laughed, noting the snake's consistent departure and its non-aggressive nature.",
      "level": 1
    },
    {
      "id": "164",
      "text": "He asked if they should return.",
      "level": 1
    },
    {
      "id": "165",
      "text": "His grandmother replied, \"We can't go back.\"",
      "level": 1
    },
    {
      "id": "166",
      "text": "He asked why.",
      "level": 1
    },
    {
      "id": "167",
      "text": "She explained that the snake's frequent presence indicated valuable treasure, which it guarded.",
      "level": 1
    },
    {
      "id": "167.1",
      "text": "She questioned why the snake had fled previously.",
      "level": 2
    },
    {
      "id": "168",
      "text": "He suggested it was scared by the reanimated corpses.",
      "level": 1
    },
    {
      "id": "169",
      "text": "His grandmother's expression became serious. \"That's right,\" she said. \"Last time it was because of the reanimation. This time, the snake avoiding us and fleeing implies another danger.\"",
      "level": 1
    },
    {
      "id": "170",
      "text": "The tomb chamber appeared clean, with no visible bodies.",
      "level": 1
    },
    {
      "id": "170.1",
      "text": "As he pondered, a loud rumble echoed from within the chamber, and the coffin lid shot outwards.",
      "level": 2
    },
    {
      "id": "170.2",
      "text": "It hit resistance at the top and fell back down with a dull thud.",
      "level": 2
    },
    {
      "id": "171",
      "text": "In the flashlight's beam, they saw a gaunt middle-aged man with his hair in a bun sitting up in the coffin, emitting wisps of smoke, which his grandmother recognized as corpse qi.",
      "level": 1
    },
    {
      "id": "171.1",
      "text": "The man wore ancient clothing, suggesting he was an ancient zombie.",
      "level": 2
    },
    {
      "id": "172",
      "text": "They were surprised that the previous tomb raiders had taken everything but this treasure and that this treasure chose their arrival to make an appearance.",
      "level": 1
    },
    {
      "id": "173",
      "text": "He was described as being \"too polite\" by their uncle.",
      "level": 1
    },
    {
      "id": "174",
      "text": "Given that men have stronger yang energy, the grandmother instructed the grandfather to place ink lines around the coffin and scatter a thick layer of glutinous rice.",
      "level": 1
    },
    {
      "id": "175",
      "text": "However, the old zombie seemed unfazed by the ink lines and walked out of the coffin, overturning it.",
      "level": 1
    },
    {
      "id": "176",
      "text": "Amidst the wreckage, they saw a ceramic jar and many bamboo slips.",
      "level": 1
    },
    {
      "id": "176.1",
      "text": "The grandfather speculated the jar contained gold or silver, likely what the green snake had been guarding.",
      "level": 2
    },
    {
      "id": "177",
      "text": "While they were momentarily stunned, the zombie lunged at them.",
      "level": 1
    },
    {
      "id": "178",
      "text": "The confined space made evasion impossible, and the zombie tore a large hole in the grandfather's padded jacket and threw him, causing him pain.",
      "level": 1
    },
    {
      "id": "179",
      "text": "As he fell, he saw the zombie holding a bright, dazzling object in its mouth.",
      "level": 1
    },
    {
      "id": "180",
      "text": "Simultaneously, his grandmother continued scattering glutinous rice and, seeing the grandfather fall, threw down the rice to help him up.",
      "level": 1
    },
    {
      "id": "181",
      "text": "Before the grandfather could rise, the zombie leaped again, closing in on them.",
      "level": 1
    },
    {
      "id": "182",
      "text": "The grandmother, being clever, pulled the grandfather onto the scattered glutinous rice.",
      "level": 1
    },
    {
      "id": "182.1",
      "text": "The zombie appeared to fear the rice, hopping around its perimeter.",
      "level": 2
    },
    {
      "id": "183",
      "text": "The grandfather expected a prolonged standoff, but underestimated his grandmother's skill.",
      "level": 1
    },
    {
      "id": "184",
      "text": "She placed a protective talisman on her palm and, as the zombie approached the rice circle, executed a move called \"Fish Dragon Crouching\" (鱼龙浅卧), slipping under its legs and then seizing its arm from behind.",
      "level": 1
    },
    {
      "id": "185",
      "text": "This technique, \"Locking Corpse Skill\" (锁尸功), was usually foolproof.",
      "level": 1
    },
    {
      "id": "185.1",
      "text": "However, this zombie was incredibly strong and easily broke free.",
      "level": 2
    },
    {
      "id": "186",
      "text": "The grandfather, feeling helpless, watched as the zombie tightly grasped his grandmother.",
      "level": 1
    },
    {
      "id": "186.1",
      "text": "In desperation, he scattered glutinous rice at the zombie.",
      "level": 2
    },
    {
      "id": "187",
      "text": "The rice had an immediate effect, causing black smoke to rise from the zombie.",
      "level": 1
    },
    {
      "id": "187.1",
      "text": "This enraged the zombie, which then focused its attention on the grandfather.",
      "level": 2
    },
    {
      "id": "188",
      "text": "The zombie kicked the coffin lid, sending it flying towards the grandfather, narrowly missing his head and embedding itself in the tomb wall.",
      "level": 1
    },
    {
      "id": "189",
      "text": "The already small tomb chamber felt even more confined with the coffin lid lodged in the wall.",
      "level": 1
    },
    {
      "id": "190",
      "text": "His grandmother drew her peach wood sword and aimed for the zombie's forehead.",
      "level": 1
    },
    {
      "id": "191",
      "text": "The zombie seemed apprehensive of the sword but still advanced towards his grandmother.",
      "level": 1
    },
    {
      "id": "191.1",
      "text": "It grabbed her arm, intending to throw her against the wall to avoid direct contact with the sword.",
      "level": 2
    },
    {
      "id": "192",
      "text": "In a critical moment, the grandfather seized a piece of the broken coffin lid and struck the zombie's head.",
      "level": 1
    },
    {
      "id": "192.1",
      "text": "However, the zombie's head seemed as hard as iron, showing no signs of damage or bleeding.",
      "level": 2
    },
    {
      "id": "193",
      "text": "This blow did seem to loosen the zombie's grip on his grandmother's shoulder.",
      "level": 1
    },
    {
      "id": "194",
      "text": "She used the \"Locking Corpse Skill\" again to relieve the pressure and maneuvered behind the zombie.",
      "level": 1
    },
    {
      "id": "195",
      "text": "She pressed her knee against the base of its spine and used her jade hairpin to stab the top of its head.",
      "level": 1
    },
    {
      "id": "195.1",
      "text": "The zombie expelled a large amount of black gas, and a luminous pearl fell from its mouth, filling the chamber with an intense foul odor.",
      "level": 2
    },
    {
      "id": "196",
      "text": "His grandmother instructed the grandfather to light a talisman and throw it at the zombie, which immediately burst into flames.",
      "level": 1
    },
    {
      "id": "196.1",
      "text": "The tomb chamber filled with the smell of burning flesh mixed with the stench.",
      "level": 2
    },
    {
      "id": "197",
      "text": "After dealing with the ancient zombie, they both exhaled in relief, believing they were finally safe.",
      "level": 1
    },
    {
      "id": "198",
      "text": "They picked up the ceramic jar, intending to take it out of the tomb.",
      "level": 1
    },
    {
      "id": "199",
      "text": "However, upon reaching the tunnel entrance, they saw a pair of lantern-like eyes staring intently at them.",
      "level": 1
    },
    {
      "id": "200",
      "text": "Shining the flashlight forward, his grandmother felt a chill down her spine. The green snake had returned.",
      "level": 1
    },
    {
      "id": "201",
      "text": "The grandfather prepared to throw saltpeter and sulfur at the snake.",
      "level": 1
    },
    {
      "id": "201.1",
      "text": "His grandmother, however, said that their family should no longer take anything from tombs.",
      "level": 2
    },
    {
      "id": "201.2",
      "text": "The grandfather agreed, and they placed the jar back.",
      "level": 2
    },
    {
      "id": "201.3",
      "text": "The green snake then bypassed them and returned to the scattered coffin.",
      "level": 2
    },
    {
      "id": "202",
      "text": "The grandfather was amazed by his grandmother's proficiency in dealing with zombies.",
      "level": 1
    },
    {
      "id": "202.1",
      "text": "He admired her humility, as she never boasted about her abilities.",
      "level": 2
    },
    {
      "id": "202.2",
      "text": "He often found himself smiling wryly, remembering his own attempts to impress her that always fell short.",
      "level": 2
    },
    {
      "id": "203",
      "text": "After leaving the ancient tomb, they did not reseal the entrance, leaving it for the river dredging workers to discover the next day.",
      "level": 1
    },
    {
      "id": "204",
      "text": "At ten o'clock the following morning, news spread from the work site about the discovery of a thousand-year-old tomb by the river.",
      "level": 1
    },
    {
      "id": "204.1",
      "text": "The county cultural bureau had dispatched personnel.",
      "level": 2
    },
    {
      "id": "205",
      "text": "Due to the lack of fingerprint identification technology at the time, it was impossible to determine who had participated in the tomb raiding.",
      "level": 1
    },
    {
      "id": "206",
      "text": "The bodies in the tomb had been incinerated, but many bamboo slips were found, containing legal documents related to governance from the Northern and Southern Dynasties period.",
      "level": 1
    },
    {
      "id": "207",
      "text": "The cultural bureau's announcement did not mention the jar of gold, only a jar of wine.",
      "level": 1
    },
    {
      "id": "207.1",
      "text": "The grandfather's uncle speculated that the bureau concealed the true contents to prevent public unrest.",
      "level": 2
    },
    {
      "id": "208",
      "text": "The green snake was taken away by the municipal animal protection association.",
      "level": 1
    },
    {
      "id": "209",
      "text": "A month later, the cultural bureau concluded that it was a tomb from the Northern and Southern Dynasties period.",
      "level": 1
    },
    {
      "id": "209.1",
      "text": "The tomb's occupant was not explicitly identified but was likely an official responsible for legal documents and judicial matters.",
      "level": 2
    },
    {
      "id": "210",
      "text": "The tomb was constructed according to the hierarchical standards of Eastern Han official residences, exhibiting a style similar to Han Dynasty 'doufu' architecture.",
      "level": 1
    },
    {
      "id": "210.1",
      "text": "Over time, its original form was completely obscured by the earth.",
      "level": 2
    },
    {
      "id": "211",
      "text": "However, the tomb possessed unique characteristics, such as the four knives arranged in a rectangular formation in the corners of the chamber, which was rare in Han tombs.",
      "level": 1
    },
    {
      "id": "211.1",
      "text": "This suggested the tomb's occupant had anticipated tomb raiding.",
      "level": 2
    },
    {
      "id": "212",
      "text": "Although tomb raiders had stolen many burial items, a significant amount of gold and silver, particularly bronze artifacts of high craftsmanship, were hidden behind the tomb walls, making it a valuable discovery.",
      "level": 1
    },
    {
      "id": "213",
      "text": "Years later, the grandfather had no further contact with the ancient tomb but remained perplexed by several unresolved questions.",
      "level": 1
    },
    {
      "id": "214",
      "text": "He wondered how Liu Laoba had entered the tomb, why his smile resembled that in the murals, why the snake lived there and guarded the artifacts, what it ate, and how the first group of tomb raiders had avoided encountering the zombie.",
      "level": 1
    },
    {
      "id": "215",
      "text": "Most puzzling was how the burial items within the coffin remained intact after the outer tomb was looted.",
      "level": 1
    },
    {
      "id": "216",
      "text": "He later asked his grandmother about these matters.",
      "level": 1
    },
    {
      "id": "217",
      "text": "She speculated that the initial tomb raiders numbered three, with some focusing on the murals and others on the burial items.",
      "level": 1
    },
    {
      "id": "217.1",
      "text": "However, the coffin lid was too heavy, and the sealing technology was too advanced for them to open, forcing them to take only the outer burial items.",
      "level": 2
    },
    {
      "id": "218",
      "text": "She believed Liu Laoba and Laipihan were killed by others after being discovered during the tomb raiding.",
      "level": 1
    },
    {
      "id": "218.1",
      "text": "Their failure to encounter the reanimated corpse at that time might have been related to the lunar cycle.",
      "level": 2
    },
    {
      "id": "218.2",
      "text": "Later, the subsequent visitors likely subdued the reanimated corpses to prevent harm to others.",
      "level": 2
    },
    {
      "id": "219",
      "text": "After the incident, the grandfather and grandmother never spoke of it to outsiders, rarely even mentioning it within the family.",
      "level": 1
    },
    {
      "id": "219.1",
      "text": "They strictly warned their descendants against tomb raiding.",
      "level": 2
    },
    {
      "id": "220",
      "text": "By the late 1970s, conditions had relatively improved.",
      "level": 1
    },
    {
      "id": "220.1",
      "text": "Few people survived past seventy, marking the passing of a generation.",
      "level": 2
    },
    {
      "id": "220.2",
      "text": "Although mortality rates were high, the birth rate exceeded the death rate.",
      "level": 2
    },
    {
      "id": "221",
      "text": "The grandfather's fourth uncle was born into this environment.",
      "level": 1
    },
    {
      "id": "221.1",
      "text": "He had an older brother and two older sisters.",
      "level": 2
    },
    {
      "id": "221.2",
      "text": "The fourth uncle was mischievous, prone to fighting, and cared about his reputation.",
      "level": 2
    },
    {
      "id": "221.3",
      "text": "In junior high school, he was known as a \"fighting king\" and was frequently punished by teachers to copy assignments.",
      "level": 2
    },
    {
      "id": "222",
      "text": "Eventually, he was expelled from school after an incident.",
      "level": 1
    },
    {
      "id": "223",
      "text": "It was early summer, with frequent rain.",
      "level": 1
    },
    {
      "id": "223.1",
      "text": "One evening, the fourth uncle, along with several junior high classmates, tied a hemp rope across the road.",
      "level": 2
    },
    {
      "id": "223.2",
      "text": "Though not very strong, the rope was sufficient to trip a cycling teacher.",
      "level": 2
    },
    {
      "id": "223.3",
      "text": "After securing the rope, they hid their bicycles in a ditch and lay down.",
      "level": 2
    },
    {
      "id": "224",
      "text": "The teacher, being nearsighted, couldn't see in the dark and fell when he hit the rope.",
      "level": 1
    },
    {
      "id": "224.1",
      "text": "As the teacher cried out in pain, the fourth uncle and his friends emerged.",
      "level": 2
    },
    {
      "id": "224.2",
      "text": "The fourth uncle helped the teacher up, feigning innocence and asking who would dare tie such a rope and cause their beloved teacher to fall.",
      "level": 2
    },
    {
      "id": "225",
      "text": "However, the teacher was sharp and called all the students present that night to his office for questioning.",
      "level": 1
    },
    {
      "id": "225.1",
      "text": "The truth was soon uncovered.",
      "level": 2
    },
    {
      "id": "226",
      "text": "Knowing he couldn't escape the consequences, the fourth uncle took full responsibility, proposing it as a way to graduate early.",
      "level": 1
    },
    {
      "id": "227",
      "text": "However, the incident did not warrant expulsion.",
      "level": 1
    },
    {
      "id": "227.1",
      "text": "The principal gave the fourth uncle a major demerit.",
      "level": 2
    },
    {
      "id": "228",
      "text": "Clearly dissatisfied with this outcome, the fourth uncle approached the principal and requested to be expelled.",
      "level": 1
    },
    {
      "id": "229",
      "text": "The principal was taken aback and quickly refused, saying it was not possible.",
      "level": 1
    },
    {
      "id": "230",
      "text": "Disappointed, the fourth uncle left the principal's office and dejectedly returned home, carrying a grass basket and announcing he was going to gather pig feed.",
      "level": 1
    },
    {
      "id": "231",
      "text": "He spent the entire afternoon gathering pig feed and returned in the evening.",
      "level": 1
    },
    {
      "id": "231.1",
      "text": "His third aunt was also attending middle school at the time.",
      "level": 2
    },
    {
      "id": "231.2",
      "text": "The fourth uncle knew his grandmother and grandfather must have learned about the incident.",
      "level": 2
    },
    {
      "id": "232",
      "text": "Given their strict upbringing, he expected a severe punishment, like being beaten with a board used for chopping vegetables.",
      "level": 1
    },
    {
      "id": "232.1",
      "text": "Unexpectedly, his grandfather and grandmother did not punish him.",
      "level": 2
    },
    {
      "id": "232.2",
      "text": "Instead, they assigned him the daily tasks of gathering pig feed and guarding the melon patch.",
      "level": 2
    },
    {
      "id": "233",
      "text": "This arrangement delighted the fourth uncle, as he felt he had gained freedom.",
      "level": 1
    },
    {
      "id": "234",
      "text": "The fourth uncle's greatest passion was reading books on feng shui.",
      "level": 1
    },
    {
      "id": "234.1",
      "text": "He once told the narrator, \"I may not have much ability myself, but I will find a good burial site so that my descendants can prosper.\"",
      "level": 2
    },
    {
      "id": "235",
      "text": "He also believed that the graves chosen by the villagers were poorly selected and did not fully utilize the principles of feng shui.",
      "level": 1
    }
  ],
  "concepts": [
    {
      "name": "Secret Agent",
      "frequency": 4,
      "context": "Ancestors' profession, part of Qing imperial court, responsible for confidential state affairs."
    },
    {
      "name": "Tomb",
      "frequency": 15,
      "context": "Focus of ancestor's work, ancient tombs, imperial tombs, specific tomb discovered, construction and features of tomb."
    },
    {
      "name": "Qing Dynasty",
      "frequency": 5,
      "context": "Historical period of secret agents, Empress Dowager Cixi's control, fall of the dynasty."
    },
    {
      "name": "Feng Shui",
      "frequency": 2,
      "context": "Principles for building tombs, principles for choosing burial sites."
    },
    {
      "name": "Li Chengfeng",
      "frequency": 4,
      "context": "Ancestor, one of the twelve secret agents, compiled \"Compendium of Royal Tombs.\""
    },
    {
      "name": "Xuzhou",
      "frequency": 3,
      "context": "Hometown of Li Chengfeng, location of great-grandfather's participation in Xuzhou Campaign, proximity to Anhui."
    },
    {
      "name": "Yuan Shikai",
      "frequency": 3,
      "context": "Exposed Li Chengfeng's identity, invited Qiu Wensheng, died shortly after."
    },
    {
      "name": "Republic of China",
      "frequency": 2,
      "context": "Era of hardship, land purchase by Li Chengfeng."
    },
    {
      "name": "Anti-Japanese War",
      "frequency": 1,
      "context": "Period when great-grandfather was patriotic and organized a self-defense force."
    },
    {
      "name": "Great-grandfather",
      "frequency": 6,
      "context": "Patriotic youth, organized self-defense force, surrendered land, family patriarch."
    },
    {
      "name": "Grandfather",
      "frequency": 25,
      "context": "Protagonist of tomb-raiding narrative, ancestor's descendant, married grandmother, involved in uncovering family history."
    },
    {
      "name": "Grandmother",
      "frequency": 20,
      "context": "Married grandfather, descendant of secret agent Qiu Wensheng, skilled in dealing with supernatural, knowledgeable about family history."
    },
    {
      "name": "1953",
      "frequency": 1,
      "context": "Starting point of the story, period of economic hardship."
    },
    {
      "name": "Economic Hardship",
      "frequency": 5,
      "context": "Characterizes the period after liberation, difficulty in marriage, food shortages, impact on family fortunes."
    },
    {
      "name": "Marriage",
      "frequency": 6,
      "context": "Became easier for men during hardship, arranged marriage of grandfather and grandmother, family expectations."
    },
    {
      "name": "Pork",
      "frequency": 2,
      "context": "New Year's tradition, limited distribution, valuable commodity."
    },
    {
      "name": "Quánjí Village",
      "frequency": 2,
      "context": "The village where the story takes place, largest in the town."
    },
    {
      "name": "Mass Grave",
      "frequency": 4,
      "context": "Location in the village, dumping ground for the dead, associated with strange occurrences."
    },
    {
      "name": "River Dredging",
      "frequency": 4,
      "context": "Manual labor activity, offered grain subsidies, grandfather participated."
    },
    {
      "name": "Tomb-robbing Tunnel",
      "frequency": 6,
      "context": "Discovered by grandfather, appeared to be man-made, led to the tomb."
    },
    {
      "name": "Burial Artifacts",
      "frequency": 4,
      "context": "Referred to as 'water goods', found in tombs, valuable items."
    },
    {
      "name": "Liu Laoba",
      "frequency": 7,
      "context": "Villager found dead in the tomb, reanimated, attacked grandfather and grandmother."
    },
    {
      "name": "Laipihan",
      "frequency": 6,
      "context": "Villager found dead in the tomb, reanimated, attacked grandfather and grandmother."
    },
    {
      "name": "Zombie",
      "frequency": 10,
      "context": "Reanimated corpses found in the tomb, threat to tomb raiders, subdued by grandmother."
    },
    {
      "name": "Green Snake",
      "frequency": 6,
      "context": "Found in the tomb, initially threatened grandfather, later subdued, guarded treasure."
    },
    {
      "name": "Qiu Wensheng",
      "frequency": 5,
      "context": "Grandmother's grandfather, secret agent, compiled \"River Chart Booklet of Yin and Yang.\""
    },
    {
      "name": "River Chart Booklet of Yin and Yang",
      "frequency": 3,
      "context": "Book compiled by Qiu Wensheng, contains general principles of yin and yang related to tombs."
    },
    {
      "name": "Dowry Chest",
      "frequency": 3,
      "context": "Owned by grandmother, contained peculiar objects and family heirlooms."
    },
    {
      "name": "Antiques",
      "frequency": 2,
      "context": "Family possessions accumulated by Qiu Wensheng, confiscated by Japanese soldiers."
    },
    {
      "name": "Japanese Invasion",
      "frequency": 2,
      "context": "Historical event, Qiu Wensheng committed suicide, Japanese confiscated family antiques."
    },
    {
      "name": "Glutinous Rice",
      "frequency": 4,
      "context": "Used by grandmother to ward off zombies, effective against them."
    },
    {
      "name": "Peach Wood Sword",
      "frequency": 2,
      "context": "Weapon used by grandmother against zombies, believed to have spiritual power."
    },
    {
      "name": "Talismans",
      "frequency": 2,
      "context": "Drawn by grandmother's father, used for warding off spirits and burning on zombies."
    },
    {
      "name": "Bamboo Slips",
      "frequency": 3,
      "context": "Found in the tomb, contained legal documents from the Northern and Southern Dynasties."
    },
    {
      "name": "Northern and Southern Dynasties",
      "frequency": 2,
      "context": "Historical period of the tomb's occupant and legal documents found."
    },
    {
      "name": "Fourth Uncle",
      "frequency": 6,
      "context": "Born in the 1970s, mischievous, expelled from school, interested in feng shui."
    },
    {
      "name": "Expulsion",
      "frequency": 2,
      "context": "Fourth uncle's punishment from school, his desire for it."
    },
    {
      "name": "Feng Shui Books",
      "frequency": 2,
      "context": "Fourth uncle's hobby, belief in finding good burial sites for descendants."
    }
  ],
  "relations": [
    {
      "source": "Secret Agent",
      "target": "Qing Dynasty",
      "type": "belongs_to"
    },
    {
      "source": "Secret Agent",
      "target": "Tomb",
      "type": "investigates"
    },
    {
      "source": "Secret Agent",
      "target": "Li Chengfeng",
      "type": "is_a"
    },
    {
      "source": "Li Chengfeng",
      "target": "Secret Agent",
      "type": "was_a"
    },
    {
      "source": "Li Chengfeng",
      "target": "Xuzhou",
      "type": "returned_to"
    },
    {
      "source": "Li Chengfeng",
      "target": "Yuan Shikai",
      "type": "encountered"
    },
    {
      "source": "Yuan Shikai",
      "target": "Li Chengfeng",
      "type": "searched_for"
    },
    {
      "source": "Great-grandfather",
      "target": "Anti-Japanese War",
      "type": "participated_in"
    },
    {
      "source": "Great-grandfather",
      "target": "Xuzhou",
      "type": "participated_in_battle_of"
    },
    {
      "source": "Grandfather",
      "target": "Grandmother",
      "type": "married"
    },
    {
      "source": "Grandmother",
      "target": "Qiu Wensheng",
      "type": "descendant_of"
    },
    {
      "source": "Grandmother",
      "target": "Secret Agent",
      "type": "descendant_of"
    },
    {
      "source": "Grandfather",
      "target": "Tomb",
      "type": "discovered"
    },
    {
      "source": "Grandfather",
      "target": "Liu Laoba",
      "type": "encountered"
    },
    {
      "source": "Grandfather",
      "target": "Laipihan",
      "type": "encountered"
    },
    {
      "source": "Grandfather",
      "target": "Zombie",
      "type": "fought"
    },
    {
      "source": "Grandfather",
      "target": "Green Snake",
      "type": "encountered"
    },
    {
      "source": "Grandmother",
      "target": "Zombie",
      "type": "subdued"
    },
    {
      "source": "Grandmother",
      "target": "Green Snake",
      "type": "encountered"
    },
    {
      "source": "Grandmother",
      "target": "Tomb",
      "type": "explored"
    },
    {
      "source": "Grandmother",
      "target": "Glutinous Rice",
      "type": "used"
    },
    {
      "source": "Grandmother",
      "target": "Peach Wood Sword",
      "type": "used"
    },
    {
      "source": "Grandmother",
      "target": "Talismans",
      "type": "used"
    },
    {
      "source": "Qiu Wensheng",
      "target": "River Chart Booklet of Yin and Yang",
      "type": "compiled"
    },
    {
      "source": "Qiu Wensheng",
      "target": "Secret Agent",
      "type": "was_a"
    },
    {
      "source": "Japanese Invasion",
      "target": "Qiu Wensheng",
      "type": "affected"
    },
    {
      "source": "Fourth Uncle",
      "target": "Expulsion",
      "type": "subject_of"
    },
    {
      "source": "Fourth Uncle",
      "target": "Feng Shui Books",
      "type": "reads"
    },
    {
      "source": "Feng Shui Books",
      "target": "Tomb",
      "type": "related_to"
    },
    {
      "source": "Tomb",
      "target": "Northern and Southern Dynasties",
      "type": "from_period_of"
    },
    {
      "source": "Tomb",
      "target": "Bamboo Slips",
      "type": "contained"
    },
    {
      "source": "Mass Grave",
      "target": "Zombie",
      "type": "associated_with_supernatural"
    },
    {
      "source": "Secret Agent",
      "target": "Qing Dynasty",
      "type": "worked_for"
    },
    {
      "source": "Li Chengfeng",
      "target": "Compendium of Royal Tombs",
      "type": "compiled"
    },
    {
      "source": "Grandmother",
      "target": "Dowry Chest",
      "type": "possessed"
    },
    {
      "source": "Dowry Chest",
      "target": "Antiques",
      "type": "contained"
    },
    {
      "source": "Grandfather",
      "target": "River Dredging",
      "type": "participated_in"
    },
    {
      "source": "Grandfather",
      "target": "Tomb-robbing Tunnel",
      "type": "discovered"
    },
    {
      "source": "Liu Laoba",
      "target": "Zombie",
      "type": "became_a"
    },
    {
      "source": "Laipihan",
      "target": "Zombie",
      "type": "became_a"
    },
    {
      "source": "Grandmother",
      "target": "Locking Corpse Skill",
      "type": "used"
    },
    {
      "source": "Grandmother",
      "target": "Jade Hairpin",
      "type": "used"
    },
    {
      "source": "Grandfather",
      "target": "Kitchen Knife",
      "type": "used"
    },
    {
      "source": "Tomb",
      "target": "Gold",
      "type": "contained"
    },
    {
      "source": "Tomb",
      "target": "Silver",
      "type": "contained"
    },
    {
      "source": "Tomb",
      "target": "Bronze Artifacts",
      "type": "contained"
    },
    {
      "source": "Tomb",
      "target": "Four Knives",
      "type": "featured"
    },
    {
      "source": "Grandfather",
      "target": "Fear",
      "type": "experienced"
    },
    {
      "source": "Grandmother",
      "target": "Courage",
      "type": "demonstrated"
    },
    {
      "source": "Family",
      "target": "History",
      "type": "passed_down"
    },
    {
      "source": "Family",
      "target": "Secret Agent",
      "type": "descended_from"
    },
    {
      "source": "Family",
      "target": "Tomb Raiding",
      "type": "warned_against"
    }
  ],
  "hierarchy": {
    "main_topics": [
      "Ancestral Background and Secret Agents",
      "Family History and Hardship",
      "The Discovery of the Ancient Tomb",
      "Confrontation with the Supernatural",
      "Unraveling Family Secrets"
    ],
    "structure": "The document follows a chronological and narrative structure, beginning with the family's historical origins as secret agents, transitioning to the grandfather's personal experience with tomb raiding during a period of hardship, and culminating in the revelation of hidden family lineage and supernatural encounters. The narrative is divided into chapters that mark shifts in time and focus."
  }
}