{
  "propositions": [
    {
      "id": "1",
      "text": "The narrator wakes up in a hospital after being unconscious for three days, suffering from severe amnesia and aphasia.",
      "level": 1
    },
    {
      "id": "1.1",
      "text": "He experiences dizziness and nausea upon waking.",
      "level": 2
    },
    {
      "id": "1.2",
      "text": "His language ability is completely lost, producing only strange sounds.",
      "level": 2
    },
    {
      "id": "1.3",
      "text": "Doctors attribute this to the aftereffects of a severe concussion.",
      "level": 2
    },
    {
      "id": "2",
      "text": "After four days, the narrator regains some ability to speak and learns he is in Xi'an Red Cross Hospital.",
      "level": 1
    },
    {
      "id": "2.1",
      "text": "He was brought in by armed police, found by villagers by a stream in Lantian.",
      "level": 2
    },
    {
      "id": "2.2",
      "text": "He had sustained approximately twenty bone fractures, likely from falling from a high place.",
      "level": 2
    },
    {
      "id": "2.3",
      "text": "He is informed he will need at least ten to fifteen days to recover before leaving the hospital.",
      "level": 2
    },
    {
      "id": "3",
      "text": "The armed police visit him again, and he learns more about his discovery.",
      "level": 1
    },
    {
      "id": "3.1",
      "text": "He was found on a raft with his wounds already simply treated.",
      "level": 2
    },
    {
      "id": "3.2",
      "text": "The narrator finds it strange that he was on a raft and questions the distance from where he believes he fell.",
      "level": 2
    },
    {
      "id": "4",
      "text": "He fabricates a story about falling while hiking, thanks the police, and calls Wang Meng.",
      "level": 1
    },
    {
      "id": "4.1",
      "text": "Wang Meng arrives the next day, and the narrator pays his medical bills, buys a new phone and laptop.",
      "level": 2
    },
    {
      "id": "5",
      "text": "He inquires about Wang Meng's business and learns his father has been looking for him.",
      "level": 1
    },
    {
      "id": "5.1",
      "text": "He calls home to reassure his mother but learns his father is absent.",
      "level": 2
    },
    {
      "id": "5.2",
      "text": "He also asks about his third uncle, who remains missing.",
      "level": 2
    },
    {
      "id": "6",
      "text": "Feeling bored, the narrator remembers Lao Yang and tries to read Lao Yang's water-damaged diary.",
      "level": 1
    },
    {
      "id": "6.1",
      "text": "He uses the hospital's internet to search for information about the bronze tree he saw.",
      "level": 2
    },
    {
      "id": "7",
      "text": "He receives replies from friends, but most are skeptical.",
      "level": 1
    },
    {
      "id": "7.1",
      "text": "One friend from the US, a friend of his father, suggests the bronze tree might be called a 'pillar' ('zhu') and relates it to an ancient musical instrument.",
      "level": 2
    },
    {
      "id": "7.2",
      "text": "This friend mentions a similar, smaller bronze pillar found in a mine in Panzhihua.",
      "level": 2
    },
    {
      "id": "7.3",
      "text": "The purpose of these pillars is unknown, but they are linked to ancient activities of capturing 'earth dragons (snakes)' based on Shan Hai Jing and minority narratives.",
      "level": 2
    },
    {
      "id": "7.4",
      "text": "These 'earth dragons' are described as 'Candle Jiuyin,' snake-like creatures from deep earth veins with mutated eyes.",
      "level": 2
    },
    {
      "id": "7.5",
      "text": "Ancient people used them to extract blood to create long-lasting light sources.",
      "level": 2
    },
    {
      "id": "8",
      "text": "The narrator questions how encountering these pillars grants strange and terrifying abilities.",
      "level": 1
    },
    {
      "id": "8.1",
      "text": "His father's friend sends him a fragment of a novel detailing an event during the Qianlong era.",
      "level": 2
    },
    {
      "id": "8.2",
      "text": "This event involved the discovery of a white jade dragon-patterned box in a Xi'an mine, leading to a secret meeting and a fire in the Qianqing Palace.",
      "level": 2
    },
    {
      "id": "8.3",
      "text": "Most officials involved met untimely deaths, suggesting a desire to suppress a secret related to the box and potentially the bronze tree's origin.",
      "level": 2
    },
    {
      "id": "9",
      "text": "The narrator muses that digging deeper into the bronze tree's origins is likely impossible.",
      "level": 1
    },
    {
      "id": "10",
      "text": "He receives several letters from his second uncle.",
      "level": 1
    },
    {
      "id": "10.1",
      "text": "His second uncle suggests the minority culture's decorative styles reflect Western Zhou period influences, with a time lag due to limited communication and travel.",
      "level": 2
    },
    {
      "id": "10.2",
      "text": "He speculates the capture of Candle Jiuyin might be related to Qin Shi Huang's tomb construction, possibly for extracting 'dragon oil' for elixirs.",
      "level": 2
    },
    {
      "id": "10.3",
      "text": "Geological surveys suggest a massive metallic object encircling the lowest level of Qin Shi Huang's tomb, a feat likely accomplished by a technologically advanced foreign group.",
      "level": 2
    },
    {
      "id": "11",
      "text": "The narrator dismisses his second uncle's theories, attributing them to his admiration for Qin Shi Huang.",
      "level": 1
    },
    {
      "id": "12",
      "text": "A month later, the narrator is discharged from the hospital and begins to re-integrate into life.",
      "level": 1
    },
    {
      "id": "12.1",
      "text": "He finds an unsigned express letter among his mail.",
      "level": 2
    },
    {
      "id": "13",
      "text": "The letter is from Lao Yang, who claims to be alive again.",
      "level": 1
    },
    {
      "id": "13.1",
      "text": "Lao Yang apologizes for involving the narrator but states he had no other choice.",
      "level": 2
    },
    {
      "id": "13.2",
      "text": "He explains that their relationship must now end as the current situation is complete.",
      "level": 2
    },
    {
      "id": "14",
      "text": "Lao Yang recounts the events three years prior, explaining he was trapped in a stone cave in the Qinling Mountains.",
      "level": 1
    },
    {
      "id": "14.1",
      "text": "He describes the four months spent in darkness as hellish but used the time to understand his ability to manifest things through belief and subconscious direction.",
      "level": 2
    },
    {
      "id": "14.2",
      "text": "He realized this ability fades over time and feared starvation.",
      "level": 2
    },
    {
      "id": "14.3",
      "text": "He successfully replicated himself using this ability and escaped the cave.",
      "level": 2
    },
    {
      "id": "14.4",
      "text": "He then destroyed the original Lao Yang (the '본아' or '본아') in the cave, believing him to be a monster.",
      "level": 2
    },
    {
      "id": "14.5",
      "text": "He took a branch from the bronze tree to prolong his ability and escaped, burying the branch later.",
      "level": 2
    },
    {
      "id": "14.6",
      "text": "He was subsequently arrested while trying to sell an item in Xi'an.",
      "level": 2
    },
    {
      "id": "14.7",
      "text": "He also mentions that possessing this ability significantly impairs his memory, requiring him to write things down.",
      "level": 2
    },
    {
      "id": "14.8",
      "text": "He believes the narrator also possesses a trace of this energy.",
      "level": 2
    },
    {
      "id": "15",
      "text": "The letter includes a photograph of Lao Yang and his mother, who appears strangely unsettling.",
      "level": 1
    },
    {
      "id": "16",
      "text": "Winter arrives, and while resting in the 'Xi Leng Yin She' inner hall, Wang Meng informs him someone is looking for him.",
      "level": 1
    },
    {
      "id": "17",
      "text": "The visitor is a young woman from Hai Shu's side, Qin Hai Ting, who is shivering from the cold.",
      "level": 1
    },
    {
      "id": "17.1",
      "text": "She has brought a cashiers check for the 'fish eye stone' and an invitation to an antique appraisal meeting.",
      "level": 2
    },
    {
      "id": "17.2",
      "text": "Hai Shu wants to discuss something important with the narrator, hinting it relates to the bronze fish.",
      "level": 2
    },
    {
      "id": "18",
      "text": "The narrator finds Hai Shu's mysterious demeanor odd but accepts the invitation.",
      "level": 1
    },
    {
      "id": "19",
      "text": "Hai Shu arrives and is brought to a hotel.",
      "level": 1
    },
    {
      "id": "19.1",
      "text": "After drinks, Hai Shu reveals he found an old newspaper clipping from 1974 detailing the discovery of a snake-brow bronze fish in a Buddhist temple pagoda foundation in Guangxi.",
      "level": 2
    },
    {
      "id": "19.2",
      "text": "This third bronze fish confirms that all three known fish have appeared.",
      "level": 2
    },
    {
      "id": "19.3",
      "text": "The newspaper article is from a short-lived publication and difficult to find.",
      "level": 2
    },
    {
      "id": "20",
      "text": "The article states the fish was found in a relic box within a collapsed pagoda's underground palace.",
      "level": 1
    },
    {
      "id": "20.1",
      "text": "The narrator notes the significant temporal gaps between the discoveries of the three bronze fish.",
      "level": 2
    },
    {
      "id": "21",
      "text": "Hai Shu continues, explaining the story behind the newspaper article involves Chen Pi A Si.",
      "level": 1
    },
    {
      "id": "21.1",
      "text": "Chen Pi A Si was a notorious tomb robber from Changsha, known for his ruthlessness.",
      "level": 2
    },
    {
      "id": "22",
      "text": "Chen Pi A Si, around sixty years old and still sighted, was operating in minority regions of Guangxi during the Cultural Revolution due to his past military service.",
      "level": 1
    },
    {
      "id": "22.1",
      "text": "He heard from local Miao villagers about a collapsed pagoda with a strange cry heard the night it fell.",
      "level": 2
    },
    {
      "id": "22.2",
      "text": "Intrigued by the unusual nature of the collapse, he investigated.",
      "level": 2
    },
    {
      "id": "23",
      "text": "The pagoda was located in a remote basin with dense vegetation, accessible only by rope.",
      "level": 1
    },
    {
      "id": "23.1",
      "text": "Local legends spoke of the pagoda being built to suppress a demon, and its collapse signified the demon's release.",
      "level": 2
    },
    {
      "id": "24",
      "text": "Chen Pi A Si, driven by his intuition and greed, hired a Miao guide.",
      "level": 1
    },
    {
      "id": "24.1",
      "text": "He pretended his student had fallen into the basin to be lowered down by the villagers.",
      "level": 2
    },
    {
      "id": "24.2",
      "text": "The descent was perilous.",
      "level": 2
    },
    {
      "id": "25",
      "text": "Once in the basin, Chen Pi A Si slipped away from the search party to find the pagoda's entrance.",
      "level": 1
    },
    {
      "id": "26",
      "text": "He navigated the dense jungle and ruins of a large temple complex surrounding the pagoda.",
      "level": 1
    },
    {
      "id": "27",
      "text": "He discovered a desiccated Miao corpse with a pulsating abdomen, which, upon being attacked by iron pellets, revealed a nest of ground hornets inside.",
      "level": 1
    },
    {
      "id": "28",
      "text": "Chen Pi A Si narrowly escaped the hornets and found the collapsed pagoda.",
      "level": 1
    },
    {
      "id": "29",
      "text": "He observed that the pagoda's collapse had caused the ground to sink, suggesting a large underground structure ('Mirror Palace' or 'Yin Yang Shuttle').",
      "level": 1
    },
    {
      "id": "30",
      "text": "Despite the potential danger of the hornets and the difficulty of access, Chen Pi A Si decided to enter the underground palace.",
      "level": 1
    },
    {
      "id": "31",
      "text": "He began to dig a tunnel into the palace's roof, which was made of wooden logs.",
      "level": 1
    },
    {
      "id": "32",
      "text": "Upon entering, he found inscriptions in Sanskrit on the wooden ceiling, possibly related to demon suppression.",
      "level": 1
    },
    {
      "id": "33",
      "text": "Below, he discovered numerous layers of identical Buddhist figures (Arhats) facing downwards, with a unique Arhat facing upwards on one of the lower levels.",
      "level": 1
    },
    {
      "id": "34",
      "text": "Chen Pi A Si, fearing the upward-facing Arhat, shot it with iron pellets.",
      "level": 1
    },
    {
      "id": "35",
      "text": "He then used a grappling hook and rope to descend, but the depth was too great to reach the bottom.",
      "level": 1
    },
    {
      "id": "36",
      "text": "He saw a miniature white pagoda on a base of white jade, covered by a translucent 'treasure curtain.'",
      "level": 1
    },
    {
      "id": "37",
      "text": "He realized the pagoda likely contained a set of eight nested treasure boxes for Buddha's relics.",
      "level": 1
    },
    {
      "id": "38",
      "text": "His attention was drawn to a large ground hornet nest extending from a hidden stone door on the palace floor, indicating a connection to another underground structure.",
      "level": 1
    },
    {
      "id": "39",
      "text": "He decided the only way to retrieve the treasure was to use his specialized 'nine-claw hook' fishing technique.",
      "level": 1
    },
    {
      "id": "40",
      "text": "He successfully used the hook to lift the treasure curtain and attempted to hook the miniature pagoda, but it was too heavy.",
      "level": 1
    },
    {
      "id": "41",
      "text": "He noticed four miniature pillars supporting the pagoda's base.",
      "level": 1
    }
  ],
  "concepts": [
    {
      "name": "Narrator",
      "frequency": 14,
      "context": "The central character of the story who experiences amnesia and investigates mysterious occurrences."
    },
    {
      "name": "Hospital",
      "frequency": 4,
      "context": "Where the narrator recovers and begins to gather information."
    },
    {
      "name": "Amnesia",
      "frequency": 2,
      "context": "The narrator's loss of memory after his injury."
    },
    {
      "name": "Aphasia",
      "frequency": 1,
      "context": "The narrator's loss of language ability."
    },
    {
      "name": "Concussion",
      "frequency": 1,
      "context": "The medical diagnosis for the narrator's condition."
    },
    {
      "name": "Armed police",
      "frequency": 2,
      "context": "Rescued the narrator and provided initial information."
    },
    {
      "name": "Villagers",
      "frequency": 1,
      "context": "Found the narrator by a stream."
    },
    {
      "name": "Fractures",
      "frequency": 1,
      "context": "The narrator's numerous bone injuries."
    },
    {
      "name": "Wang Meng",
      "frequency": 4,
      "context": "The narrator's associate who helps him after his release from the hospital."
    },
    {
      "name": "Father",
      "frequency": 3,
      "context": "The narrator's father, who has been trying to contact him."
    },
    {
      "name": "Mother",
      "frequency": 2,
      "context": "The narrator's mother, whom he reassures."
    },
    {
      "name": "Third Uncle",
      "frequency": 2,
      "context": "Another missing family member."
    },
    {
      "name": "Lao Yang",
      "frequency": 11,
      "context": "A character who sends a letter explaining his survival and abilities."
    },
    {
      "name": "Diary",
      "frequency": 1,
      "context": "Lao Yang's damaged diary that the narrator attempts to read."
    },
    {
      "name": "Bronze tree",
      "frequency": 6,
      "context": "A mysterious object the narrator saw and researched."
    },
    {
      "name": "Friends",
      "frequency": 1,
      "context": "People the narrator contacts for information."
    },
    {
      "name": "US friend",
      "frequency": 1,
      "context": "A friend of the narrator's father who provides information about the bronze tree."
    },
    {
      "name": "Pillar (zhu)",
      "frequency": 1,
      "context": "A possible name for the bronze tree."
    },
    {
      "name": "Earth dragons (snakes)",
      "frequency": 1,
      "context": "Creatures linked to the bronze pillars."
    },
    {
      "name": "Candle Jiuyin",
      "frequency": 2,
      "context": "A mythical snake-like creature."
    },
    {
      "name": "Abilities",
      "frequency": 4,
      "context": "Supernatural or unusual powers possessed by characters."
    },
    {
      "name": "Novel fragment",
      "frequency": 1,
      "context": "A historical account sent by the US friend."
    },
    {
      "name": "Qianlong era",
      "frequency": 1,
      "context": "A historical period mentioned in the novel fragment."
    },
    {
      "name": "White jade dragon-patterned box",
      "frequency": 1,
      "context": "An object discovered in a Xi'an mine."
    },
    {
      "name": "Second Uncle",
      "frequency": 2,
      "context": "Another relative who provides theories about the past."
    },
    {
      "name": "Qin Shi Huang",
      "frequency": 1,
      "context": "An ancient Chinese emperor."
    },
    {
      "name": "Tomb construction",
      "frequency": 1,
      "context": "Related to Qin Shi Huang's historical activities."
    },
    {
      "name": "Dragon oil",
      "frequency": 1,
      "context": "A supposed substance extracted from Candle Jiuyin."
    },
    {
      "name": "Express letter",
      "frequency": 1,
      "context": "The anonymous letter from Lao Yang."
    },
    {
      "name": "Qinling Mountains",
      "frequency": 1,
      "context": "Where Lao Yang was trapped."
    },
    {
      "name": "Subconscious",
      "frequency": 1,
      "context": "Related to Lao Yang's abilities."
    },
    {
      "name": "Replication",
      "frequency": 1,
      "context": "Lao Yang's ability to create a copy of himself."
    },
    {
      "name": "Bronze branch",
      "frequency": 1,
      "context": "A part of the bronze tree taken by Lao Yang."
    },
    {
      "name": "Memory",
      "frequency": 3,
      "context": "A recurring issue for Lao Yang and the narrator."
    },
    {
      "name": "Photograph",
      "frequency": 1,
      "context": "Sent with Lao Yang's letter."
    },
    {
      "name": "Winter",
      "frequency": 1,
      "context": "The current season in the story."
    },
    {
      "name": "Xi Leng Yin She",
      "frequency": 1,
      "context": "A location where the narrator rests."
    },
    {
      "name": "Hai Shu",
      "frequency": 5,
      "context": "An antique dealer who provides crucial information."
    },
    {
      "name": "Qin Hai Ting",
      "frequency": 4,
      "context": "Hai Shu's niece who delivers a message."
    },
    {
      "name": "Fish eye stone",
      "frequency": 1,
      "context": "An item for which the narrator receives payment."
    },
    {
      "name": "Antique appraisal meeting",
      "frequency": 1,
      "context": "An event Hai Shu invites the narrator to."
    },
    {
      "name": "Bronze fish",
      "frequency": 4,
      "context": "Mysterious artifacts that are central to the plot."
    },
    {
      "name": "Old newspaper clipping",
      "frequency": 2,
      "context": "Contains information about a bronze fish discovery."
    },
    {
      "name": "Guangxi",
      "frequency": 4,
      "context": "A region where a bronze fish was found."
    },
    {
      "name": "Buddhist temple pagoda",
      "frequency": 2,
      "context": "The location where the third bronze fish was discovered."
    },
    {
      "name": "Underground palace",
      "frequency": 8,
      "context": "A subterranean structure described in the story."
    },
    {
      "name": "Chen Pi A Si",
      "frequency": 18,
      "context": "A legendary tomb robber who found a bronze fish."
    },
    {
      "name": "Cultural Revolution",
      "frequency": 1,
      "context": "A historical period when Chen Pi A Si was active."
    },
    {
      "name": "Miao villagers",
      "frequency": 4,
      "context": "Local people who told Chen Pi A Si about the pagoda."
    },
    {
      "name": "Demon suppression",
      "frequency": 1,
      "context": "A possible purpose of the pagoda."
    },
    {
      "name": "Basin",
      "frequency": 3,
      "context": "The geological formation where the pagoda was located."
    },
    {
      "name": "Jungle",
      "frequency": 3,
      "context": "The environment surrounding the pagoda."
    },
    {
      "name": "Corpse",
      "frequency": 3,
      "context": "A discovery made by Chen Pi A Si."
    },
    {
      "name": "Ground hornets",
      "frequency": 4,
      "context": "Dangerous insects found in the story."
    },
    {
      "name": "Mirror Palace",
      "frequency": 3,
      "context": "An underground structure with a symmetrical above-ground counterpart."
    },
    {
      "name": "Yin Yang Shuttle",
      "frequency": 1,
      "context": "An alternative name for the underground structure."
    },
    {
      "name": "Tunnel",
      "frequency": 2,
      "context": "Chen Pi A Si digs into the underground palace."
    },
    {
      "name": "Sanskrit inscriptions",
      "frequency": 1,
      "context": "Found on the wooden ceiling of the underground palace."
    },
    {
      "name": "Arhats",
      "frequency": 4,
      "context": "Buddhist figures found in the underground palace."
    },
    {
      "name": "Miniature white pagoda",
      "frequency": 2,
      "context": "A significant object found at the bottom of the underground palace."
    },
    {
      "name": "Treasure curtain",
      "frequency": 1,
      "context": "A covering for the miniature pagoda."
    },
    {
      "name": "Buddha's relics",
      "frequency": 1,
      "context": "Presumed contents of the treasure boxes."
    },
    {
      "name": "Eight nested treasure boxes",
      "frequency": 1,
      "context": "A sacred Buddhist container."
    },
    {
      "name": "Hornet nest",
      "frequency": 1,
      "context": "The large nest found by Chen Pi A Si."
    },
    {
      "name": "Stone door",
      "frequency": 1,
      "context": "An entrance to another underground area."
    },
    {
      "name": "Nine-claw hook",
      "frequency": 2,
      "context": "A specialized tool used by Chen Pi A Si."
    },
    {
      "name": "Miniature pillars",
      "frequency": 1,
      "context": "Supporting the miniature pagoda."
    }
  ],
  "relations": [
    {
      "source": "Narrator",
      "target": "Hospital",
      "type": "is_treated_in"
    },
    {
      "source": "Narrator",
      "target": "Amnesia",
      "type": "suffers_from"
    },
    {
      "source": "Narrator",
      "target": "Aphasia",
      "type": "suffers_from"
    },
    {
      "source": "Armed police",
      "target": "Narrator",
      "type": "rescues"
    },
    {
      "source": "Villagers",
      "target": "Narrator",
      "type": "finds"
    },
    {
      "source": "Narrator",
      "target": "Fractures",
      "type": "sustains"
    },
    {
      "source": "Wang Meng",
      "target": "Narrator",
      "type": "assists"
    },
    {
      "source": "Narrator",
      "target": "Father",
      "type": "is_related_to"
    },
    {
      "source": "Narrator",
      "target": "Mother",
      "type": "is_related_to"
    },
    {
      "source": "Narrator",
      "target": "Third Uncle",
      "type": "is_related_to"
    },
    {
      "source": "Narrator",
      "target": "Lao Yang",
      "type": "receives_communication_from"
    },
    {
      "source": "Lao Yang",
      "target": "Diary",
      "type": "owns"
    },
    {
      "source": "Narrator",
      "target": "Bronze tree",
      "type": "researches"
    },
    {
      "source": "Narrator",
      "target": "Friends",
      "type": "consults"
    },
    {
      "source": "US friend",
      "target": "Bronze tree",
      "type": "provides_information_about"
    },
    {
      "source": "US friend",
      "target": "Pillar (zhu)",
      "type": "suggests_name_for"
    },
    {
      "source": "Pillar (zhu)",
      "target": "Earth dragons (snakes)",
      "type": "related_to"
    },
    {
      "source": "Earth dragons (snakes)",
      "target": "Candle Jiuyin",
      "type": "is_a_type_of"
    },
    {
      "source": "Bronze tree",
      "target": "Abilities",
      "type": "grants"
    },
    {
      "source": "US friend",
      "target": "Novel fragment",
      "type": "sends"
    },
    {
      "source": "Novel fragment",
      "target": "Qianlong era",
      "type": "describes_event_in"
    },
    {
      "source": "Qianlong era",
      "target": "White jade dragon-patterned box",
      "type": "involved_with_discovery_of"
    },
    {
      "source": "Second Uncle",
      "target": "Qin Shi Huang",
      "type": "theorizes_about"
    },
    {
      "source": "Qin Shi Huang",
      "target": "Tomb construction",
      "type": "engaged_in"
    },
    {
      "source": "Tomb construction",
      "target": "Dragon oil",
      "type": "involves_extraction_of"
    },
    {
      "source": "Lao Yang",
      "target": "Express letter",
      "type": "sends"
    },
    {
      "source": "Lao Yang",
      "target": "Qinling Mountains",
      "type": "was_trapped_in"
    },
    {
      "source": "Lao Yang",
      "target": "Subconscious",
      "type": "utilizes_for_abilities"
    },
    {
      "source": "Lao Yang",
      "target": "Replication",
      "type": "performs"
    },
    {
      "source": "Replication",
      "target": "Lao Yang",
      "type": "creates_copy_of"
    },
    {
      "source": "Lao Yang",
      "target": "Bronze branch",
      "type": "takes"
    },
    {
      "source": "Lao Yang",
      "target": "Memory",
      "type": "has_impairment_of"
    },
    {
      "source": "Narrator",
      "target": "Memory",
      "type": "affected_by"
    },
    {
      "source": "Lao Yang",
      "target": "Photograph",
      "type": "sends"
    },
    {
      "source": "Narrator",
      "target": "Winter",
      "type": "experiences"
    },
    {
      "source": "Narrator",
      "target": "Xi Leng Yin She",
      "type": "is_in"
    },
    {
      "source": "Wang Meng",
      "target": "Narrator",
      "type": "informs"
    },
    {
      "source": "Qin Hai Ting",
      "target": "Hai Shu",
      "type": "is_niece_of"
    },
    {
      "source": "Qin Hai Ting",
      "target": "Narrator",
      "type": "delivers_message_to"
    },
    {
      "source": "Qin Hai Ting",
      "target": "Fish eye stone",
      "type": "delivers_payment_for"
    },
    {
      "source": "Qin Hai Ting",
      "target": "Antique appraisal meeting",
      "type": "invites_to"
    },
    {
      "source": "Hai Shu",
      "target": "Bronze fish",
      "type": "hints_connection_to"
    },
    {
      "source": "Hai Shu",
      "target": "Narrator",
      "type": "discusses_with"
    },
    {
      "source": "Hai Shu",
      "target": "Old newspaper clipping",
      "type": "provides"
    },
    {
      "source": "Old newspaper clipping",
      "target": "Bronze fish",
      "type": "details_discovery_of"
    },
    {
      "source": "Bronze fish",
      "target": "Guangxi",
      "type": "discovered_in"
    },
    {
      "source": "Bronze fish",
      "target": "Buddhist temple pagoda",
      "type": "found_in_foundation_of"
    },
    {
      "source": "Buddhist temple pagoda",
      "target": "Underground palace",
      "type": "contains"
    },
    {
      "source": "Underground palace",
      "target": "Chen Pi A Si",
      "type": "explores"
    },
    {
      "source": "Chen Pi A Si",
      "target": "Underground palace",
      "type": "explores"
    },
    {
      "source": "Chen Pi A Si",
      "target": "Underground palace",
      "type": "enters"
    },
    {
      "source": "Chen Pi A Si",
      "target": "Bronze fish",
      "type": "finds"
    },
    {
      "source": "Chen Pi A Si",
      "target": "Cultural Revolution",
      "type": "active_during"
    },
    {
      "source": "Chen Pi A Si",
      "target": "Miao villagers",
      "type": "interacts_with"
    },
    {
      "source": "Miao villagers",
      "target": "Buddhist temple pagoda",
      "type": "inform_about"
    },
    {
      "source": "Buddhist temple pagoda",
      "target": "Demon suppression",
      "type": "related_to"
    },
    {
      "source": "Chen Pi A Si",
      "target": "Basin",
      "type": "enters"
    },
    {
      "source": "Chen Pi A Si",
      "target": "Jungle",
      "type": "navigates"
    },
    {
      "source": "Chen Pi A Si",
      "target": "Corpse",
      "type": "discovers"
    },
    {
      "source": "Corpse",
      "target": "Ground hornets",
      "type": "contains_nest_of"
    },
    {
      "source": "Ground hornets",
      "target": "Chen Pi A Si",
      "type": "attacks"
    },
    {
      "source": "Chen Pi A Si",
      "target": "Mirror Palace",
      "type": "identifies"
    },
    {
      "source": "Mirror Palace",
      "target": "Yin Yang Shuttle",
      "type": "is_also_called"
    },
    {
      "source": "Chen Pi A Si",
      "target": "Tunnel",
      "type": "digs"
    },
    {
      "source": "Tunnel",
      "target": "Underground palace",
      "type": "leads_to"
    },
    {
      "source": "Underground palace",
      "target": "Sanskrit inscriptions",
      "type": "contains"
    },
    {
      "source": "Underground palace",
      "target": "Arhats",
      "type": "contains"
    },
    {
      "source": "Arhats",
      "target": "Underground palace",
      "type": "are_located_in"
    },
    {
      "source": "Arhats",
      "target": "Underground palace",
      "type": "face_downwards_in"
    },
    {
      "source": "Arhats",
      "target": "Chen Pi A Si",
      "type": "frightens"
    },
    {
      "source": "Chen Pi A Si",
      "target": "Arhats",
      "type": "shoots"
    },
    {
      "source": "Chen Pi A Si",
      "target": "Miniature white pagoda",
      "type": "sees"
    },
    {
      "source": "Miniature white pagoda",
      "target": "Treasure curtain",
      "type": "is_covered_by"
    },
    {
      "source": "Miniature white pagoda",
      "target": "Buddha's relics",
      "type": "likely_contains"
    },
    {
      "source": "Buddha's relics",
      "target": "Eight nested treasure boxes",
      "type": "stored_in"
    },
    {
      "source": "Underground palace",
      "target": "Hornet nest",
      "type": "contains"
    },
    {
      "source": "Hornet nest",
      "target": "Stone door",
      "type": "extends_from"
    },
    {
      "source": "Chen Pi A Si",
      "target": "Nine-claw hook",
      "type": "uses"
    },
    {
      "source": "Nine-claw hook",
      "target": "Miniature white pagoda",
      "type": "attempts_to_hook"
    },
    {
      "source": "Miniature white pagoda",
      "target": "Miniature pillars",
      "type": "is_supported_by"
    }
  ],
  "hierarchy": {
    "main_topics": [
      "Narrator's Recovery and Initial Investigations",
      "Lao Yang's Revelation",
      "Hai Shu's Discovery and the Bronze Fish",
      "Chen Pi A Si's Expedition into the Mirror Palace"
    ],
    "structure": "The document is structured chronologically, starting with the narrator's recovery, followed by a detailed flashback to Lao Yang's experience, and then a historical account of Chen Pi A Si's tomb raiding expedition, which forms the bulk of the narrative."
  }
}