{
  "propositions": [
    {
      "id": "1",
      "text": "盗墓是一门技术，一门进行破坏的技术。",
      "level": 1
    },
    {
      "id": "1.1",
      "text": "古代贵族们建造坟墓的时候，一定是想方设法地防止被盗，故此无所不用其极，在墓中设置种种机关暗器，消息①埋伏，有巨石、流沙、毒箭、毒虫、陷坑等等数不胜数。",
      "level": 2
    },
    {
      "id": "1.1.1",
      "text": "到了明代，受到西洋奇技淫巧的影响，一些大墓甚至用到了西洋的八宝转心机关，尤其是清代的帝陵，堪称集数千年防盗技术于一体的杰作。",
      "level": 3
    },
    {
      "id": "1.2",
      "text": "盗墓贼的课题就是千方百计地破解这些机关，进入墓中探宝。",
      "level": 2
    },
    {
      "id": "1.3",
      "text": "在现代，比起如何挖开古墓更困难的是寻找古墓。",
      "level": 2
    },
    {
      "id": "1.3.1",
      "text": "地面上有封土堆和石碑之类明显建筑的大墓早就被人发掘得差不多了，如果要找那些年深日久藏于地下，又没有任何地上标记的古墓，那就需要一定的技术和特殊工具了，铁钎、洛阳铲、竹钉、钻地龙、探阴爪、黑折子等工具应运而生。",
      "level": 3
    },
    {
      "id": "1.3.2",
      "text": "还有一些高手不依赖工具，有的通过寻找古代文献中的线索寻找古墓，还有极少数的一些人掌握秘术，可以通过解读山川河流的脉象，用看风水的本领找墓穴。",
      "level": 3
    },
    {
      "id": "1.4",
      "text": "我就是属于最后这一类的。",
      "level": 2
    },
    {
      "id": "1.5",
      "text": "我踏遍了各地，其间经历了很多诡异离奇的事件，若是一件件地表白出来，足以让观者惊心，闻者咋舌，毕竟那些龙形虎藏、揭天拔地、倒海翻江的举动，都非比寻常。",
      "level": 2
    },
    {
      "id": "2",
      "text": "这诸般事迹须从我祖父留下来的一本残书《十六字阴阳风水秘术》讲起。",
      "level": 1
    },
    {
      "id": "2.1",
      "text": "这本残书，下半本不知何故被人硬生生地扯了去，只留下这上卷风水秘术篇，书中所述，多半都是解读墓葬的风水格局之类的独门秘术……",
      "level": 2
    },
    {
      "id": "3",
      "text": "我的祖父叫胡国华。",
      "level": 1
    },
    {
      "id": "3.1",
      "text": "胡家祖上是十里八乡有名的大地主，最辉煌的时期在城里买了三条胡同相连的四十多间宅子，其间也曾出过一些当官的和经商的，捐过前清的粮台、槽运的帮办。",
      "level": 2
    },
    {
      "id": "3.2",
      "text": "到了民国年间，传到我祖父这一代就开始家道中落了。",
      "level": 2
    },
    {
      "id": "3.2.1",
      "text": "先是分了家，胡国华也分到了不少家产，足够衣食无忧地过一辈子，可是他偏偏不肯学好，当然这也和当时的社会环境有关，先是沉迷赌博，后来又抽上了福寿膏（大烟），把万贯家财败了个精光。",
      "level": 3
    },
    {
      "id": "3.2.2",
      "text": "胡国华年轻的时候吃喝嫖赌抽五毒俱全，到最后穷得身上连一个大子儿都没有了。",
      "level": 3
    },
    {
      "id": "3.2.3",
      "text": "人要是犯了烟瘾，就抓心挠肝的无法忍受，但是没钱谁让你抽啊？",
      "level": 3
    },
    {
      "id": "3.2.4",
      "text": "昔日里有钱的时候，烟馆里的老板伙计见了他都是胡爷长，胡爷短的，招呼得殷勤周到，可是一旦你身无分文了，他们就拿你当臭要饭的，连轰带赶，驱之不及。",
      "level": 3
    },
    {
      "id": "3.3",
      "text": "人要穷疯了，廉耻道德这些观念就不重要了，胡国华想了个办法，去找舅舅骗点钱。",
      "level": 2
    },
    {
      "id": "3.3.1",
      "text": "胡国华的舅舅知道他是败家子大烟鬼，平时一文钱都不肯给他，但是这次胡国华骗舅舅说要娶媳妇，让舅舅给凑点钱。",
      "level": 3
    },
    {
      "id": "3.3.2",
      "text": "舅舅一听感动得老泪纵横，这个不肖的外甥总算是办件正事，要是娶个贤慧的媳妇好好管管他，收收他的心，说不定日后就能学好了。",
      "level": 3
    },
    {
      "id": "3.3.3",
      "text": "于是 he gave him twenty silver dollars, and instructed him to marry a wife and live a good life, and never to smoke that opium again. He also said that he would visit his nephew’s wife at his home in a few days.",
      "level": 3
    },
    {
      "id": "3.4",
      "text": "胡国华鬼主意最多，为了应付舅舅，他回家之后到村里找了个扎纸人纸马（就是烧给死人的那种）的匠人。",
      "level": 2
    },
    {
      "id": "3.4.1",
      "text": "这个扎纸师傅手艺很高明，只要是你说得出来的东西，他都能做得惟妙惟肖。",
      "level": 3
    },
    {
      "id": "3.4.2",
      "text": "他按要求给胡国华扎了个白纸糊裱的纸女人，又用水彩给纸人画上了眉眼鼻子、衣服头发，在远处一看，嘿，真就跟个活人似的。",
      "level": 3
    },
    {
      "id": "3.4.3",
      "text": "胡国华把纸人扛到家里，放在里屋的炕上，用被子把纸人盖了，心里想得挺好，等过几天舅舅来了，就推说我媳妇病了，躺在床上不能见客，让他远远地看一眼就行了。",
      "level": 3
    },
    {
      "id": "3.5",
      "text": "没过几天，舅舅就上门了，买了一些花布点心之类的来看外甥媳妇。",
      "level": 2
    },
    {
      "id": "3.5.1",
      "text": "胡国华就按照预先想好的说辞推脱，说媳妇身体不适，不能见客，让舅舅在门口揭开门帘看了一眼就把门帘放下来了。",
      "level": 3
    },
    {
      "id": "3.5.2",
      "text": "舅舅不愿意了，噢，你小子就这么应付你亲娘舅啊？不行，今天必须得见见新媳妇，生病了我掏钱给新媳妇请郎中瞧病。",
      "level": 3
    },
    {
      "id": "3.5.3",
      "text": "胡国华就死活拦着不让见，他越拦舅舅越疑心，两下里争执起来，最后阻拦不住，舅舅冲进了里屋，往床上一看，好悬没把老爷子吓死，一张女人的大白脸，还擦着红脸蛋，两眼睁着，直勾勾地盯着天花板——是个纸扎的女人！",
      "level": 3
    },
    {
      "id": "3.6",
      "text": "这年的春节发生了很多事，胡国华扎个纸人骗他舅舅钱的事情败露了，舅舅生气上火，一病不起，没出三天就撒手归西了。",
      "level": 2
    },
    {
      "id": "3.7",
      "text": "胡家的亲戚朋友都像防贼似的防着他，别说借给他钱了，就连剩饭都不让他蹭一口。",
      "level": 2
    },
    {
      "id": "3.8",
      "text": "胡国华把家中最后的一对檀木箱子卖了两块银洋，这箱子是他母亲的嫁妆，一直想留个念想，没舍得典当，但是烟瘾发作，也管不了那许多了。",
      "level": 2
    },
    {
      "id": "3.9",
      "text": "用这两块钱买了一小块福寿膏，赶回家中就迫不及待地点上烟泡倒在床上，猛吸了两口，身体轻飘飘地如在云端。",
      "level": 2
    },
    {
      "id": "3.9.1",
      "text": "此刻他感觉自己快活似神仙，平日里那些被人瞧不起、辱骂、欺负的遭遇都不重要了。",
      "level": 3
    },
    {
      "id": "3.9.2",
      "text": "又吸了两口，忽然发现自己的破床上还趴着个黑乎乎的东西，定睛一看，原来床角上趴着一只大老鼠。",
      "level": 3
    },
    {
      "id": "3.9.3",
      "text": "这老鼠的岁数一定小不了，胡子都变白了，体型跟猫差不多大，它正在旁边吸着胡国华烟枪里冒出的烟雾，好像它也晓得这福寿膏的好处，嗅着鼻子贪婪地享受。",
      "level": 3
    },
    {
      "id": "3.10",
      "text": "胡国华觉得有趣，对大老鼠说：“你这家伙也有烟瘾？看来跟我是同道中人。”",
      "level": 2
    },
    {
      "id": "3.10.1",
      "text": "说完自己抽了一口，用嘴向那老鼠喷云吐雾，老鼠好像知道他没有恶意，也不惧怕他，抬起头来接纳喷向它的烟雾。",
      "level": 3
    },
    {
      "id": "3.10.2",
      "text": "过了半晌，似乎是过足了瘾，缓缓地爬着离开。",
      "level": 3
    },
    {
      "id": "3.11",
      "text": "如此数日，这只大老鼠每天都来同胡国华一起吸烟。",
      "level": 2
    },
    {
      "id": "3.11.1",
      "text": "胡国华到处被人轻贱，周围没有半个朋友，对这只老鼠惺惺相惜颇有好感，有时候老鼠来得晚一点，胡国华就忍着烟瘾等它。",
      "level": 3
    },
    {
      "id": "3.12",
      "text": "但是好景不常，胡国华家里就剩下一张床和四面墙了，再也没有钱去买烟土，他愁闷无策，叹息地对老鼠说：“老鼠啊老鼠，今天我囊罄粮绝，可再没钱买福寿膏了，恐不能与你常吸此味。”",
      "level": 2
    },
    {
      "id": "3.13",
      "text": "老鼠听了他说话，双目炯炯闪烁，若有所思，反身离去。",
      "level": 2
    },
    {
      "id": "3.14",
      "text": "天黑的时候，老鼠叼回来一枚银元放在胡国华枕边，胡国华惊喜交加，连夜就进城买了一块福寿膏，回来后就灯下点烧了，大肆吞吐，和老鼠一起痛快淋漓地吸了个饱。",
      "level": 2
    },
    {
      "id": "3.15",
      "text": "第二天老鼠又叼来三枚银元，胡国华乐得简直都不知道说什么好了。",
      "level": 2
    },
    {
      "id": "3.15.1",
      "text": "想起以前念私塾时学的一个典故，就对老鼠说：“知管仲者，鲍叔牙是也。君知我贫寒而厚施于我，真是我的知己啊，如不嫌弃，咱们就结为金兰兄弟。”",
      "level": 3
    },
    {
      "id": "3.15.2",
      "text": "从此与这只老鼠称兄道弟，呼其为“鼠兄”，饮食与共，一起抽大烟，还在床上给它用棉絮摆了个窝，让老鼠也睡在床上。",
      "level": 3
    },
    {
      "id": "3.16",
      "text": "人鼠相安，不亚于莫逆之交，老鼠每天都出去叼回来银元，少则一二枚，多则三五枚，从此胡国华衣食无忧。",
      "level": 2
    },
    {
      "id": "3.16.1",
      "text": "多年以后我的祖父回忆起来，总说这段日子是他一生中最快乐的时光。",
      "level": 3
    },
    {
      "id": "3.17",
      "text": "就这么过了多半年，胡国华渐渐富裕了起来，但不是有这么句话吗，发财遇好友，倒霉碰小人，也该着胡国华是穷命，他就被一个小人给盯上了。",
      "level": 2
    },
    {
      "id": "3.18",
      "text": "村里有个无赖叫王二杠子，他和胡国华不一样，胡国华至少曾经富裕过，怎么说也当过二十多年的“胡大少爷”，王二杠子就没那么好的命了，从他家祖上八辈算起，都没穿过一条不露腚的裤子。",
      "level": 2
    },
    {
      "id": "3.18.1",
      "text": "他看胡国华家业败了，幸灾乐祸，有事没事地就对胡国华打骂侮辱，欺负欺负当年的胡大少爷，给自己心里找点平衡。",
      "level": 3
    },
    {
      "id": "3.19",
      "text": "最近王二杠子觉得很奇怪，胡国华这穷小子也没做什么营生，家里能典当的都典当了，他家亲戚也死得差不多了，怎么天天在家抽大烟？",
      "level": 2
    },
    {
      "id": "3.19.1",
      "text": "他这买烟土的钱都是从哪来的？说不定这小子做了贼。",
      "level": 3
    },
    {
      "id": "3.19.2",
      "text": "我不如悄悄地盯着他，等他偷东西的时候抓了他扭送到官府，换几块大洋的赏钱也好。",
      "level": 3
    },
    {
      "id": "3.20",
      "text": "可是盯了一段时间，发现胡国华除了偶尔进城买些粮食和烟土之外，基本上是足不出户，也从不跟任何人来往。",
      "level": 2
    },
    {
      "id": "3.20.1",
      "text": "越是不知道他的钱是怎么来的，王二杠子就越是心痒。",
      "level": 3
    },
    {
      "id": "3.21",
      "text": "有天胡国华出去买吃的东西，王二杠子趁机翻墙头进了他家，翻箱倒柜地想找找胡国华究竟有什么秘密。",
      "level": 2
    },
    {
      "id": "3.21.1",
      "text": "突然发现床上有只大老鼠正在睡觉，王二杠子顺手把老鼠抓起来扔到炉子上正在烧的一壶水里，然后把壶盖压上，心想等胡国华回家喝水，我在旁边看个乐子。",
      "level": 3
    },
    {
      "id": "3.22",
      "text": "还没等王二杠子出去，胡国华就回来了，正好把他堵到屋里。",
      "level": 2
    },
    {
      "id": "3.22.1",
      "text": "胡国华一看壶里的大老鼠已经给活活烫死了，顿时红了眼睛，抄起菜刀就砍，王二杠子被砍了十几刀。",
      "level": 3
    },
    {
      "id": "3.22.2",
      "text": "好在胡国华是个大烟鬼，手上无力，王二杠子虽然中了不少刀，却没受致命伤，他全身是血地逃到保安队求救，保安队的队长是当地一个军阀的亲戚，当时正在请这个军阀喝酒，队长一看这还了得，光天化日之下就持刀行凶，没有 ক্রমবর্ধমান了吗？",
      "level": 3
    },
    {
      "id": "3.22.3",
      "text": "赶紧命几个手下把胡国华五花大绑地捆了来。",
      "level": 3
    },
    {
      "id": "3.23",
      "text": "胡国华被押到堂前，保安队长厉声喝问，为何持刀行凶要杀王二杠子？",
      "level": 2
    },
    {
      "id": "3.24",
      "text": "胡国华泪流满面，抽泣着述说了事情的始末，最后哀叹着说：“想我当初困苦欲死，没有这只老鼠我就活不到今日，不料我一时疏忽竟令鼠兄丧命，它虽非我所杀，却因我而死。九泉之下负此良友，情何以堪？我一人做事一人当，既然砍伤了王二杠子，该杀该罚都听凭发落，只求长官容我回家安葬了我的鼠兄，就是死也瞑目了。”",
      "level": 2
    },
    {
      "id": "3.25",
      "text": "还没等保安队长发话，旁边那个军阀就感叹不已地对胡国华说道：“他奶奶的，不忘恩是仁，不负心是义，对老鼠尚且如此，何况对人呢？我念你仁义，又看你无依无靠，日后就随我从军做个副官吧。”",
      "level": 2
    },
    {
      "id": "3.26",
      "text": "枪杆子就是政权，乱世之中，带兵的人说的话就是王法。",
      "level": 2
    },
    {
      "id": "3.26.1",
      "text": "军阀头子吩咐手下，把那个王二杠子用鞭子抽一顿给胡国华出气，又放了胡国华回家安葬老鼠。",
      "level": 3
    },
    {
      "id": "3.26.2",
      "text": "胡国华用木盒盛殓了老鼠的尸体，挖个坑埋了，哭了半日，就去投奔了那个军阀头子。",
      "level": 3
    },
    {
      "id": "3.27",
      "text": "常言说得好：饿时吃糠甜如蜜，饱时吃蜜都不甜。",
      "level": 2
    },
    {
      "id": "3.27.1",
      "text": "人到了穷苦潦倒之时，别人就是给他一碗粥、一块饼也会感恩戴德，何况老鼠送给胡国华那么多的钱财。",
      "level": 3
    },
    {
      "id": "3.27.2",
      "text": "当然老鼠的钱也都是偷来的，圣人说渴死不饮盗泉之水，不过那是至圣至贤之人的品德标准，古人尚且难以做到，何况胡国华这样的庸人呢？",
      "level": 3
    },
    {
      "id": "3.27.3",
      "text": "以前听说在房中吸烟，时间久了屋内的苍蝇老鼠也会上瘾，此言非虚。",
      "level": 3
    },
    {
      "id": "4",
      "text": "从那以后胡国华就当了兵，甚得重用，然而在那个时代，天下大乱，军阀混战，拉上百十人的队伍就能割据一方，今天你灭了我，明天他又收拾了你，没有几个势力是能长久生存下去的。",
      "level": 1
    },
    {
      "id": "4.1",
      "text": "胡国华所追随的这个军阀势力本来就不大，不出一年就在抢地盘的战斗中被另一路军阀打得七零八落，死的死、逃的逃，提拔胡国华的那位军阀头领也在混战中饮弹身亡。",
      "level": 2
    },
    {
      "id": "4.2",
      "text": "兵败之后，胡国华跑回了老家，这时他家里的破房子早就塌了，又逃得匆忙，身上没有钱粮，连续两天没吃过饭了，烟瘾又发作起来，无法可想，只好把手枪卖给了土匪，换了一些烟土粮食，以解燃眉之急。",
      "level": 2
    },
    {
      "id": "4.3",
      "text": "他一寻思，这么下去不是事啊，这点粮食和大烟顶多够支撑三五天的，吃光抽净了之后该怎么办？",
      "level": 2
    },
    {
      "id": "4.3.1",
      "text": "这时他想起了离家一百多里远的地方有处十三里铺，那里埋了不少达官显贵的墓葬，里面有很多值钱的陪葬品。",
      "level": 3
    },
    {
      "id": "4.4",
      "text": "此时的胡国华当过兵打过仗，胆子比以前大多了。",
      "level": 2
    },
    {
      "id": "4.4.1",
      "text": "胡国华在军队里曾经听个老兵油子说过很多盗墓的事，盗墓在民间又叫“倒斗”，能发横财，但是抓着了也是要掉脑袋的，所以他没敢在白天行动，把心一横，在一个毛月亮的晚上点了盏风灯，扛了把铁锹，就去了十三里铺的坟地。",
      "level": 3
    },
    {
      "id": "4.4.2",
      "text": "什么是毛月亮？就是天上没云，但是月光却不明亮，很朦胧。",
      "level": 4
    },
    {
      "id": "4.4.3",
      "text": "当然现代人都知道，这是一种气象现象，学名叫作月晕，表示要变天刮大风了，可是那个年代的农村里谁懂这些科学。",
      "level": 4
    },
    {
      "id": "4.4.4",
      "text": "有些地方的乡下人就管这种月亮叫长毛毛的月亮，还有人说这种月色昏暗的夜晚，是孤魂野鬼最爱出来转悠的时刻。",
      "level": 4
    },
    {
      "id": "4.5",
      "text": "等到了地方，他先喝了身上带的半斤烧酒，以壮胆色。",
      "level": 3
    },
    {
      "id": "4.5.1",
      "text": "这天夜里，月冷星寒，阴风嗖嗖地刮着，坟堆里飘荡着一片片磷火，不时有几声叽叽吱吱的怪鸟叫声响起，手中的风灯忽明忽暗，似乎随时都可能熄灭。",
      "level": 4
    },
    {
      "id": "4.5.2",
      "text": "胡国华这时候虽然刚喝了酒，还是被这鬼地方吓得出了一身冷汗，这回可好，那半斤烧刀子算是白喝了，全顺着汗毛孔出去了。",
      "level": 4
    },
    {
      "id": "4.5.3",
      "text": "好在这是一片野坟，附近完全没有人烟，大喊大叫也不怕被人听见。",
      "level": 4
    },
    {
      "id": "4.5.4",
      "text": "胡国华唱了几段山歌给自己壮胆，但是会的歌不多，没唱几句就没词了，干脆唱开了平日里最熟悉的“五更相思调”和“十八摸”。",
      "level": 4
    },
    {
      "id": "4.6",
      "text": "胡国华硬着头皮战战兢兢地到了这一大片坟地中央。",
      "level": 3
    },
    {
      "id": "4.6.1",
      "text": "那里竟然有一座无碑的孤坟，在这一片荒坟野地之中，这座坟显得那么与众不同。",
      "level": 4
    },
    {
      "id": "4.6.2",
      "text": "这座坟除了没有墓碑之外，更奇怪的是这坟的棺材没在封土堆下面，而是立着插在坟丘上，露出多半截子。",
      "level": 4
    },
    {
      "id": "4.6.3",
      "text": "棺材很新，锃明瓦亮地走了十八道朱漆，在残月的辉映下，泛着诡异的光芒。",
      "level": 4
    },
    {
      "id": "4.6.4",
      "text": "胡国华心中有些嘀咕，这棺材怎么这样摆着？真他娘的怪了，怕是有什么名堂。",
      "level": 4
    },
    {
      "id": "4.6.5",
      "text": "不过来都来了，不打开看看岂不是白走这一遭？没钱买吃的饿死是一死，没钱抽大烟犯了瘾憋死也是一死，那还不如让鬼掐死来得痛快，老子这辈子净受窝囊气了，他奶奶的，今天就豁出去了，一条道走到黑。",
      "level": 4
    },
    {
      "id": "4.7",
      "text": "打定了主意，抡起铁锨把埋着棺材下半截的封土挖开，整个棺材就呈现在了眼前。",
      "level": 3
    },
    {
      "id": "4.7.1",
      "text": "胡国华是个大烟鬼，体力差，挖了点土已经累得喘作一团。",
      "level": 4
    },
    {
      "id": "4.7.2",
      "text": "他没急着开棺，坐在地上掏出身上带的福寿膏往鼻子里吸了一点。",
      "level": 4
    },
    {
      "id": "4.7.3",
      "text": "大脑受到鸦片的刺激，神经也亢奋了，一咬牙站起身，用铁锨撬开了棺材盖子。",
      "level": 4
    },
    {
      "id": "4.7.4",
      "text": "里面的尸体赫然是个美女，面目栩栩如生，只是脸上的粉擦得很厚，两边脸蛋子上用红胭脂抹了两大块，在白粉底子的衬托下显得像是贴了两帖红膏药，她身上凤冠霞帔，大红丝绸的吉祥袍，竟然是一身新娘子的装扮。",
      "level": 4
    },
    {
      "id": "4.7.5",
      "text": "这具女尸是刚埋进去的，还是埋了一段时间了？这片坟地早就荒废了，最近这些年哪里还有人来？难不成她变成了僵尸？",
      "level": 4
    },
    {
      "id": "4.7.6",
      "text": "但此时，胡国华早就顾不上那么多了，他的眼睛里只剩下那棺中女尸身上的首饰，这些金银宝石在风灯的光线下诱人地闪烁着，还有放在她身旁陪葬的那些用红纸包成一筒一筒的银元，并有许多的金条，简直数都数不清。",
      "level": 4
    },
    {
      "id": "4.7.7",
      "text": "这回可发了**大财了，胡国华伸手就去撸女尸手上配戴的祖母绿宝石戒指，刚把手伸出去，忽然手腕被人抓住了，胡国华吓了一跳，定睛一看，抓住他手腕的人，原来是一位风度不凡的长者。",
      "level": 4
    },
    {
      "id": "4.8",
      "text": "原来胡国华匆匆赶往十三里铺，在途中曾遇到一位姓孙的风水先生，这位孙先生是省里有名的法师，不仅能看风水算命，而且还能掐会算，懂遁甲五行的奇术。",
      "level": 3
    },
    {
      "id": "4.8.1",
      "text": "孙先生一见胡国华，就发现他面上隐隐约约笼罩着一层黑气，掐指一算，勃然大怒，这小子是想去挖坟掘墓做那些有损阴德的勾当，如今叫我撞上，便不可不管上一管。",
      "level": 4
    },
    {
      "id": "4.8.2",
      "text": "于是**一路尾随而来。",
      "level": 4
    },
    {
      "id": "4.9",
      "text": "此时孙先生抓住胡国华的手臂，突然厉声喝道：“我只问你这贼人一句话，你这般作为，便不怕遭天谴吗？”",
      "level": 3
    },
    {
      "id": "4.10",
      "text": "此言一出，胡国华如遭当头棒喝，急忙跪倒在地，拜求孙先生饶命。",
      "level": 3
    },
    {
      "id": "4.11",
      "text": "孙先生把他搀扶起来：“你虽然德行败坏，但是并无大过，你须晓得回头是岸，让我救你不难，不过你要先拜我为师，并且戒了烟瘾。”",
      "level": 3
    },
    {
      "id": "4.12",
      "text": "胡国华听他说要让自己戒掉大烟，那还不如要了自己的小命呢，不过仔细衡量，还是遭报应来得重些，留得青山在，不怕没柴烧，我先求他暂且放我一马，日后趁他不备，我接着吸我的福寿膏去，还怕他发现不成？",
      "level": 3
    },
    {
      "id": "4.12.1",
      "text": "心中盘算已定，就当场给孙先生磕了八个头，行了拜师之礼。",
      "level": 4
    },
    {
      "id": "4.13",
      "text": "孙先生见胡国华知错能改，满意地点了点头，再一看被胡国华打开的棺木，里面的女尸栩栩如生，也是大吃一惊，看来这是片养尸地，这女尸日久定会酿成大祸，须尽早铲除才是。",
      "level": 3
    },
    {
      "id": "4.13.1",
      "text": "于是吩咐胡国华如此这般，这般如此……",
      "level": 4
    },
    {
      "id": "4.13.2",
      "text": "两人合力抬起棺材盖子，用力一推把那棺板合上，取出长钉钉得死死的，又用墨斗在棺材上纵横交错地弹满了墨线，墨线如同围棋棋盘的格子一样形成一张黑色大网，把棺材封得严严实实。",
      "level": 4
    },
    {
      "id": "4.13.3",
      "text": "接着让胡国华堆些枯柴，把那口朱漆大棺焚毁。",
      "level": 4
    },
    {
      "id": "4.13.4",
      "text": "胡国华遵命而行，点了把火将棺材付之一炬，火焰熊熊升腾，一股股的黑烟冒了出来，臭不可闻，最后终于都烧成了一堆灰烬。",
      "level": 4
    },
    {
      "id": "4.13.5",
      "text": "胡国华这才想起，那棺中还有许多金银珠宝，跺脚叹息，悔之晚矣，只好搀扶着师傅孙先生，一同到了孙先生家中居住。",
      "level": 4
    },
    {
      "id": "5",
      "text": "此后孙先生用秘方治好了胡国华的烟瘾，传授他一些看风水测字的本领。",
      "level": 1
    },
    {
      "id": "5.1",
      "text": "胡国华在县城中摆个小摊，替人测个字看看相，赚些小钱，娶了个乡下女子为妻。",
      "level": 2
    },
    {
      "id": "5.1.1",
      "text": "他感念师傅的救命之恩，从此安分守己，好好过起日子来。",
      "level": 3
    },
    {
      "id": "5.2",
      "text": "然而孙先生有一次偶感风寒，一病不起，没少请郎中，吃了很多药，但是就一直没能痊愈，过了几年就一命归西了。",
      "level": 2
    },
    {
      "id": "5.3",
      "text": "临终前，孙先生把胡国华招至身前，说道：“你我师徒一场，只是为师并未来得及传授你什么真实本领。",
      "level": 2
    },
    {
      "id": "5.3.1",
      "text": "我这里有本古书《十六字阴阳风水秘术》，此书是残本，只有半卷，是些看风水寻墓穴的小术，你就留在身边做个纪念吧。”",
      "level": 3
    },
    {
      "id": "5.3.2",
      "text": "说完之后一口气没喘上来，就此于世长辞。",
      "level": 3
    },
    {
      "id": "5.4",
      "text": "胡国华安葬了师傅，无事之时就研习孙先生留给他的这本残书，日积月累，也窥得些许奥妙，在县里到处给有钱人选墓地佳穴，逐渐有了些名气，家道也慢慢地富裕了起来。",
      "level": 2
    },
    {
      "id": "5.5",
      "text": "媳妇给胡国华生了个儿子，取名胡云宣。",
      "level": 2
    },
    {
      "id": "5.5.1",
      "text": "胡云宣在十七岁的时候，到省城的英国教会学校读书，年轻人性格活跃不受拘束，又接触了一些革命思潮的冲击，全身热血沸腾，天天晚上做梦都在参加革命暴动，于是离家出走，投奔了革命圣地延安。",
      "level": 3
    },
    {
      "id": "5.5.2",
      "text": "此后胡云宣参了军，一直到建国前，淮海战役之时，已经当上三野六纵的某团团长，渡江战役之后随部队南下，把家也安在了南方。",
      "level": 3
    },
    {
      "id": "5.5.3",
      "text": "再后来就有了我，我生的时间很巧，正赶上八一建军节，父亲就给我起名叫胡建军，结果上幼儿园的时候一看，一个班里有七八个叫建军的，重名的太多了，于是就给我改了个名“胡八一”。",
      "level": 3
    },
    {
      "id": "5.5.4",
      "text": "我祖父胡国华说：“这名改得好，单和（胡）八万一筒。”",
      "level": 3
    },
    {
      "id": "5.6",
      "text": "在我十八岁的时候，家里受到了冲击，我父母出身不太好，他们两口子都被隔离审查了，祖父也被拉出去当牛鬼蛇神批斗游街。",
      "level": 2
    },
    {
      "id": "5.6.1",
      "text": "他年岁大了，老胳膊老腿的经不住折腾，没斗两回就去世了。",
      "level": 3
    },
    {
      "id": "5.6.2",
      "text": "他给别人看了一辈子的风水，为人选墓地，自己临终还是给火葬的。",
      "level": 3
    },
    {
      "id": "5.6.3",
      "text": "世事就是这么的无常。",
      "level": 3
    },
    {
      "id": "5.7",
      "text": "我家一共被抄了三遍，所有值钱的东西都被抄走了，祖父生前喜欢收藏古董，这些古玩不是被砸就是被抄，一件也没保全。",
      "level": 2
    },
    {
      "id": "5.7.1",
      "text": "最后唯一剩下的就是一本我祖父留下的残书，他让我把书用油布包了藏在公共厕所的房顶上才得以幸免。",
      "level": 3
    },
    {
      "id": "6",
      "text": "文革时的年轻人有三个选择，一是参军，这是最好的去处，一是锻炼人，二是将来转业了能分配工作。",
      "level": 1
    },
    {
      "id": "6.1",
      "text": "其次是留在城里当工人，这也不错，可以赚工资。",
      "level": 2
    },
    {
      "id": "6.2",
      "text": "最倒霉的就是那些没门路，没关系，或者家里受到冲击的，这些年轻人只能上山下乡去插队。",
      "level": 2
    },
    {
      "id": "6.3",
      "text": "你要说我选第四条路，哪都不去，我就在家待着行不行啊？",
      "level": 2
    },
    {
      "id": "6.3.1",
      "text": "那也不行，当时没有闲人这么一说，人人都是社会主义的螺丝钉，都有用处。",
      "level": 3
    },
    {
      "id": "6.3.2",
      "text": "你要在家待着，居委会的、学校的、知青办的就天天走马灯似的来动员你。",
      "level": 3
    },
    {
      "id": "6.3.3",
      "text": "不过有些人坚持到了最后，就不去插队，你能把我怎么着？最后这样的人也都留在城里还给安排工作了。",
      "level": 3
    },
    {
      "id": "6.3.4",
      "text": "有的事就是这样，说不清楚，越活越糊涂，永远也不知道规则是什么，而潜规则又不是每个人都明白的。",
      "level": 3
    },
    {
      "id": "6.4",
      "text": "当时我太年轻，也不知道上山下乡具体是怎么回事，反正我这种家庭出身的想参军是肯定没指望了，留在城里也没人管安排工作，不插队也没别的地方可去。",
      "level": 2
    },
    {
      "id": "6.4.1",
      "text": "我一想插队就插队吧，我就当是广阔天地炼红心了，反正是离开家，要插就插得越远越好。",
      "level": 3
    },
    {
      "id": "6.5",
      "text": "我们这里的大部分人都选择去云南新疆插队，我选择了去内蒙，跟我一起的还有我一哥们儿王凯旋，他比平常人白一些，胖一些，所以外号叫胖子。",
      "level": 2
    },
    {
      "id": "6.6",
      "text": "我们插队去的地方叫岗岗营子，这地名我以前连听都没听过。",
      "level": 2
    },
    {
      "id": "6.6.1",
      "text": "坐火车离开家的时候，没人来送我们，比起那些去部队参军的热烈欢送场面，我们这些知青离家的情景有些凄惨悲壮。",
      "level": 3
    },
    {
      "id": "6.6.2",
      "text": "我随身只带了那本藏在公共厕所房顶的《十六字阴阳风水秘术》，我不知道这是本什么书，只不过这是我家里唯一一样保留下来的东西，我想带在身上，等到想家的时候拿出来看看也好。",
      "level": 3
    },
    {
      "id": "7",
      "text": "虽说是内蒙，其实离黑龙江不远，都快到外蒙边境了。",
      "level": 1
    },
    {
      "id": "7.1",
      "text": "居民也以汉族为主，只有少数的满蒙两族。",
      "level": 2
    },
    {
      "id": "7.2",
      "text": "我们这一拨知青总共有六个人，四男两女，一到地方就傻眼了，周围全是绵延起伏的山脉和一望无际的原始森林，出了屯子走上百十里地也看不见半个人影。",
      "level": 2
    },
    {
      "id": "7.3",
      "text": "这里根本不通公路，更别说通电了，在这地方点个油灯都属于干部待遇了，使手电筒相当于现在住总统套房，在城里完全想象不到。",
      "level": 2
    },
    {
      "id": "7.3.1",
      "text": "我们当时还以为祖国各地全是楼上楼下、电灯电话呢。",
      "level": 3
    },
    {
      "id": "7.4",
      "text": "不过那时候也觉得新鲜，从来没见过这么大的山，好多山里产的东西也是头一次吃到。",
      "level": 2
    },
    {
      "id": "7.4.1",
      "text": "这附近的山比较富，山货很多，河里还可以捞鱼，倒不愁吃不饱饭。",
      "level": 3
    },
    {
      "id": "7.4.2",
      "text": "后来回城后听他们去陕西插队的说他们那才真叫苦呢，几年里压根没见过一粒像样的粮食。",
      "level": 3
    },
    {
      "id": "7.5",
      "text": "知青的活不太重，因为这地方靠山吃山，农作物种得不多。",
      "level": 2
    },
    {
      "id": "7.5.1",
      "text": "夏天的晚上我们轮流去田里看庄稼，因为怕被野兽啃了，所以每天晚上得有一两个人在庄稼地里过夜。",
      "level": 3
    },
    {
      "id": "7.5.2",
      "text": "山里的庄稼地不像华北平原那样的千里青纱帐，而是东边一块，西边一块，哪地平就在哪开一块田，所以晚上要经常出去走动。",
      "level": 3
    },
    {
      "id": "7.5.3",
      "text": "这天夜里正赶上我和胖子搭伴，胖子在草棚里睡觉，我出去转了一圈，一看也没什么事，回去睡觉得了。",
      "level": 3
    },
    {
      "id": "7.5.4",
      "text": "快到草棚的时候，我看见不远的地方有一大团圆乎乎的白影，我揉了揉眼睛再仔细看，确实不是看花眼了，但是天太黑究竟是个什么东西也看不清楚。",
      "level": 4
    },
    {
      "id": "7.5.5",
      "text": "我那时候不信有鬼，以为是什么动物，于是就捡了条木棍想把它赶跑。",
      "level": 4
    },
    {
      "id": "7.5.6",
      "text": "一片漆黑之中一团白花花的事物，而且还在微微晃动，这究竟是什么东西？也不像是动物，可是如果不是动物它又为什么会动？",
      "level": 4
    },
    {
      "id": "7.5.7",
      "text": "我虽然不怕鬼怪，但是面对未知的事物时，始终还是存在一些畏惧的心理，不敢抡棍子直接去打。",
      "level": 4
    },
    {
      "id": "7.5.8",
      "text": "我手中的这根棍子，其实就是从地里随手捡来的粗树枝。",
      "level": 4
    },
    {
      "id": "7.5.9",
      "text": "我用树枝轻轻捅了捅那堆白生生的东西，很软……",
      "level": 4
    },
    {
      "id": "7.5.10",
      "text": "突然，在黑暗中听见胖子大叫：“啊……干什么？胡八一！你用树枝捅我屁股干什么？”",
      "level": 4
    },
    {
      "id": "7.5.11",
      "text": "一场虚惊，原来是胖子白天吃了不干净的果子，晚上闹肚子，蹲在那里放茅，黑夜里就他的大白屁股显眼。",
      "level": 4
    },
    {
      "id": "7.6",
      "text": "第二天早上，胖子不依不饶地要我对他进行补偿，自称昨晚被吓得死了一百多万脑细胞。",
      "level": 3
    },
    {
      "id": "7.6.1",
      "text": "我说：“就你那大脑，能有那么多脑细胞吗？我跟你都是穷光棍，接受了最高指示来农村接受很有必要的贫下中农再教育，你想让我拿什么补偿你？我可跟你提前说，作为你亲密的革命战友，我的全部家当就只剩下现在身上穿的这最后一条裤子了，你总不会要我拿这条裤子补偿你吧？”",
      "level": 4
    },
    {
      "id": "7.7",
      "text": "胖子满脸坏笑着说：“那倒不用，我昨天在团山子那片老林里见到一个非常大的蜂窝，你跟我去把蜂窝捅了，咱们弄点蜂蜜冲水喝，还可以用蜂蜜跟燕子她爹换兔子肉吃。”",
      "level": 3
    },
    {
      "id": "7.7.1",
      "text": "燕子是个姑娘的名字，她爹是村里有名的老猎人，我和胖子都住在她家里的知青点。",
      "level": 4
    },
    {
      "id": "7.7.2",
      "text": "他们父女两个经常进山打猎，时不时地请我们吃野味，我们一直觉得总吃人家的好东西有点过意不去，但是我们实在太穷，没什么东西可以用来还请燕子父女。",
      "level": 4
    },
    {
      "id": "7.8",
      "text": "于是我们就决定弄些蜂蜜回来送给燕子。",
      "level": 3
    },
    {
      "id": "7.8.1",
      "text": "俩人都是急脾气，说干就干。",
      "level": 4
    },
    {
      "id": "7.8.2",
      "text": "以前在城里我和胖子都是全军区出了名的淘气大王，捅个蜂窝不算什么，比这厉害十倍的勾当也是经常耍的。",
      "level": 4
    },
    {
      "id": "7.9",
      "text": "我怕迷路就找燕子借了她的猎犬，这是条半大的小狗，它是燕子自己养起来的。",
      "level": 3
    },
    {
      "id": "7.9.1",
      "text": "燕子给小狗起了个名字叫栗子黄，还一直没舍得带它出去打猎，见我们要去团山子玩，就把狗借给了我们。",
      "level": 4
    },
    {
      "id": "7.10",
      "text": "团山子离我们村的直线距离不算远，但是由于没有路，翻山越岭走了半日才到。",
      "level": 3
    },
    {
      "id": "7.10.1",
      "text": "这片林子极大，村里的人曾警告过我们不要进去，说里面有人熊出没。",
      "level": 4
    },
    {
      "id": "7.10.2",
      "text": "我们见过村中有个只有半边脸的男人，小时候就在这里遇到了人熊，好在燕子她爹及时赶到，开枪惊走了人熊，把他救了下来。",
      "level": 4
    },
    {
      "id": "7.10.3",
      "text": "但是脸还是被人熊舔了一口，人熊的舌头上全是倒生的肉刺，一舔就舔掉了一大片肉。",
      "level": 4
    },
    {
      "id": "7.10.4",
      "text": "他的左脸没有眼睛耳朵，鼻子和嘴也是歪的，都四十多岁了，还讨不到老婆，村里的老人们说起他的事，都要流眼泪的。",
      "level": 4
    },
    {
      "id": "7.11",
      "text": "我们虽然胆大，也不敢贸然进入原始森林，胖子所说的那个蜂巢是他跟村里人去采松籽油时，在森林边缘发现的，就在林子外边靠近一条小溪的大树上。",
      "level": 3
    },
    {
      "id": "7.12",
      "text": "不过出乎意料的是，这蜂窝太大了，比我们以前捅过的那些加起来还要大，从远处看，就像是树上挂了一头没有四肢的小牛犊子，里面黑压压的巨大蜇蜂飞来飞去，嗡嗡声震耳欲聋。",
      "level": 3
    },
    {
      "id": "7.12.1",
      "text": "我说小胖你他妈的就坑我吧，这是蜂窝吗？这简直就是一大颗马蜂原子弹啊，这要捅炸了还得了？",
      "level": 4
    },
    {
      "id": "7.12.2",
      "text": "胖子说没错，要是普通的蜂窝还用得着找你吗？我自己就顺手解决了，怎么样，你还敢不敢干？",
      "level": 4
    },
    {
      "id": "7.13",
      "text": "我说这算什么，我们的队伍是不可战胜的，连美帝国主义的飞机坦克咱都不怕，能怕几只小蜜蜂？全是他奶奶的纸老虎，干他娘的，今天咱们吃定蜂蜜了。",
      "level": 3
    },
    {
      "id": "7.14",
      "text": "话虽如此说，却不能蛮干，稍有失误就会被马蜂活活蜇死，这种蜂如此巨大，肯定是有毒的，不用多，挨这么一两下就完了。",
      "level": 3
    },
    {
      "id": "7.14.1",
      "text": "刚好旁边有条小河，这就叫天助我也。",
      "level": 4
    },
    {
      "id": "7.14.2",
      "text": "我先拿出一块饼子掰了两块，喂栗子黄吃了，让它远远地跑开。",
      "level": 4
    },
    {
      "id": "7.14.3",
      "text": "然后各自把带来的军大衣穿上，戴了狗皮帽子扎了围脖，戴上手套，帽子前面遮了一块找女知青借的透明纱巾，检查全身都没有半点露出皮肉的地方之后，让胖子找了两棵空心的苇子，一人一棵，准备等会儿跳到河里躲避蜂群攻击时用来呼吸。",
      "level": 4
    },
    {
      "id": "7.15",
      "text": "准备停当之后，我们像两只臃肿的狗熊一样，一步三晃地来到树下，我手拿一团冬籽草和火柴蓄势待发，胖子拿个长长的杆子数着：“一，二，三。”",
      "level": 3
    },
    {
      "id": "7.15.1",
      "text": "数到三就用长杆猛捅蜂巢和树干连接的部分，没捅到四五下，巨大的蜂窝叭嗒一下落到树下，里面的无数大马蜂立刻就炸了营一样飞出来，在天空中形成一大片黑雾，嗡嗡嗡地笼罩在我们头顶。",
      "level": 4
    },
    {
      "id": "7.16",
      "text": "我事先准备得比较充分，不管蜂群的攻击，用火柴点着了冬籽草，放在蜂窝的上风口，从里面飞出来的巨蜂被烟一熏就丧失了方向感，到处乱飞，我和胖子又用泥土在燃烧的枯草周围堆了一道防火墙，以防形成烧山大火。",
      "level": 3
    },
    {
      "id": "7.17",
      "text": "此时那些没被烟熏到的马蜂已经认清了目标，纷纷扑向我们。",
      "level": 3
    },
    {
      "id": "7.17.1",
      "text": "我感觉头上就像下冰雹一样啪啪啪地乱响，不敢再作停留，急忙和胖子奔向旁边的小溪。",
      "level": 4
    },
    {
      "id": "7.17.2",
      "text": "那溪水不深，不到一米的样子，我们一个猛子扎到了底，身上的马蜂都被溪水冲走，我一手按住头上的狗皮帽子防止被水流冲走，另一只手取出苇子呼吸。",
      "level": 4
    },
    {
      "id": "7.18",
      "text": "过了许久才露出头来，发现蜂群不是被水淹死，就是被烟熏晕了过去，已经没有危险了。",
      "level": 3
    },
    {
      "id": "7.18.1",
      "text": "此时虽是盛夏，山中的溪流却冷，我已经冻得全身发抖，好不容易才爬上岸，躺在石头上大口喘气，头上的阳光晒得身上发暖，说不出的舒服。",
      "level": 4
    },
    {
      "id": "7.19",
      "text": "不一会儿胖子也撑不住了，晃晃悠悠地爬上岸来，刚爬一半，他忽然哎哟一声，猛地抬起手臂，手上不知被什么扎了个大口子，鲜血直流。",
      "level": 3
    },
    {
      "id": "7.19.1",
      "text": "我赶忙又下到溪中去扶他，胖子一边紧握住伤口一边说：“你小心点，这河里好像有只破碗，他妈的扎死我了。”",
      "level": 4
    },
    {
      "id": "7.20",
      "text": "这附近根本没有人居住，怎么会有破碗，我好奇心起，脱个精光，赤着膀子潜进溪中摸索，在胖子被扎的地方，摸出半个破瓷碗，看那碗的款式和青蓝色的花纹，倒有几分像以前我祖父所收藏的北宋青花瓷。",
      "level": 3
    },
    {
      "id": "7.20.1",
      "text": "祖父的那些古玩字画在破四旧的时候都被红卫兵给砸了，想不到在这深山老林里也能见到这类古玩的残片，还真有点亲切感。",
      "level": 4
    },
    {
      "id": "7.20.2",
      "text": "不过这东西对我来讲根本没什么用，我一抬手把这半个破碗远远地扔进了树林里。",
      "level": 4
    },
    {
      "id": "7.21",
      "text": "胖子也把湿透了的衣服扒个精光，胡乱包了包手上的口子，又跳进溪中。",
      "level": 3
    },
    {
      "id": "7.21.1",
      "text": "我们俩洗了个澡，然后把衣服鞋袜一件件地晾在溪边的鹅卵石上，我打声呼哨，招呼栗子黄回来。",
      "level": 4
    },
    {
      "id": "7.22",
      "text": "只见栗子黄从远处跑了回来，嘴里还叼了只肥大的灰色野兔。",
      "level": 3
    },
    {
      "id": "7.22.1",
      "text": "不知这只倒霉的兔子是怎么搞的，竟然会撞到栗子黄这只还在实习期的猎犬口中。",
      "level": 4
    },
    {
      "id": "7.22.2",
      "text": "我一见有野兔，大喜之下抱着栗子黄在地上滚了几圈，真是条好狗，我从蜂巢上掰了一大块沾满蜂蜜的蜂房奖励它。",
      "level": 4
    },
    {
      "id": "7.23",
      "text": "胖子说：“回去咱们也找人要几只小狗养着，以后天天都有兔子肉吃了。”",
      "level": 3
    },
    {
      "id": "7.24",
      "text": "我说：“你想得倒美，山里有多少兔子也架不住你这大槽儿狠吃。先别说废话了，我还真有点饿了，你赶紧把兔子收拾收拾，我去捡柴生火。”",
      "level": 3
    },
    {
      "id": "7.25",
      "text": "胖子在溪边把兔子洗剥干净，我抱了捆干松枝点起了一堆篝火，把剥了皮的野兔抹上厚厚的一层蜂蜜，架在火堆上烧烤。",
      "level": 3
    },
    {
      "id": "7.25.1",
      "text": "不一会儿，蜜制烤兔肉的香味就在空气中飘散开了，我把兔头切下来喂狗，剩下的兔肉一劈两半和胖子吃了个痛快。",
      "level": 4
    },
    {
      "id": "7.25.2",
      "text": "我长这么大从来没吃过这么香的东西，差点连自己的手指也一起吞下去，虽然没有油盐调味，但是抹了野生蜂蜜再用松枝烤出来的野兔肉，别有一番天然风味，在城市里一辈子也想象不到世上会有这种好吃的东西。",
      "level": 4
    },
    {
      "id": "7.26",
      "text": "吃饱之后，眼见天色不早，衣服也干得差不多了，就用粗树枝穿起了巨大的蜂窝，两人一前一后地抬了，高唱着革命歌曲回村：“天大地大，不如我们大家决心大；爹亲娘亲，不如共产党的恩情亲。”",
      "level": 3
    },
    {
      "id": "7.26.1",
      "text": "这才真是鞭敲金镫响，齐唱凯歌还。",
      "level": 4
    },
    {
      "id": "7.26.2",
      "text": "唯一不太协调的就是在我们嘹亮的革命歌声中还夹杂着栗子黄兴奋的叫声，这使我觉得有点像电影里面鬼子进村的气氛。",
      "level": 4
    },
    {
      "id": "7.27",
      "text": "回到屯子里一看，人少了一大半，我就问燕子：“燕子，你爹他们都到哪去了？”",
      "level": 3
    },
    {
      "id": "7.27.1",
      "text": "燕子一边帮我们抬蜂巢一边回答：“查干哈河发大水，林场的木头都被泡了，中午村里的人都去那边帮忙搬木头了。",
      "level": 4
    },
    {
      "id": "7.27.2",
      "text": "支书让俺转告你们，好好看庄稼，别闯祸，他们要七八天才能回来。”",
      "level": 4
    },
    {
      "id": "7.28",
      "text": "我最不喜欢听别人不让我闯祸的话，就好像我天生是到处闯祸的人似的，于是对燕子说：“支书喝酒喝糊涂了吧？我们能闯什么祸？我们可都是毛主席的好孩子。”",
      "level": 3
    },
    {
      "id": "7.29",
      "text": "燕子笑着说你们还不惹祸呀，打你们城里这几个知青来了之后，村里的母鸡都让你们闹腾得不下蛋了。",
      "level": 3
    },
    {
      "id": "7.30",
      "text": "我们一起的另外两个男知青也去了林场，只剩下我和胖子还有另外两个女知青，我们因为出去玩没被派去林场干活，觉得很幸运。",
      "level": 3
    },
    {
      "id": "7.30.1",
      "text": "把蜂蜜控进罐子里，足足装了十多个大瓦罐，燕子说剩下的蜂房还可以整菜吃，晚上整狍子肉炒蜂房吃。",
      "level": 4
    },
    {
      "id": "7.31",
      "text": "一说到吃，胖子就乐了，说今天咱们这小生活跟过年差不多，下午刚吃了烤兔子肉，晚上又吃狍子肉炒蜂房，我这口水都流出来了。",
      "level": 3
    },
    {
      "id": "7.31.1",
      "text": "燕子问我们在哪烤的兔子。",
      "level": 4
    },
    {
      "id": "7.31.2",
      "text": "我把经过说了。",
      "level": 4
    },
    {
      "id": "7.31.3",
      "text": "燕子说哎呀，你们可别瞎整了，在老林子边上烤野兔，肉香把人熊引出来咋整呀。",
      "level": 4
    },
    {
      "id": "7.32",
      "text": "我们听她这么说才想起来，还真是太危险了，幸亏今天人熊可能是在睡觉才没闻见烤肉的香味。",
      "level": 3
    },
    {
      "id": "7.32.1",
      "text": "我一边帮燕子生火一边说了胖子在溪水中被破碗扎破手的事，荒山野岭的地方怎么会有那种宋代的青花瓷碗？",
      "level": 4
    },
    {
      "id": "7.33",
      "text": "燕子说那一点都不新鲜，咱村里姑娘出嫁，哪家都有几个瓶瓶罐罐的做陪嫁，都是从河里捞出来的。",
      "level": 3
    },
    {
      "id": "7.34",
      "text": "我越听越觉得奇怪，河里还能捞古董？",
      "level": 3
    },
    {
      "id": "7.34.1",
      "text": "燕子也从床底下翻出两个瓷瓶让我看：“不是河里长的，都是从上游冲下来的。",
      "level": 4
    },
    {
      "id": "7.34.2",
      "text": "咱村附近这几条河的源头都在喇嘛沟的牛心山，听老人们讲那山是埋了也不知辽国金国的哪个太后的墓穴，里面陪葬的好东西老鼻子去了。",
      "level": 4
    },
    {
      "id": "7.34.3",
      "text": "好多人都想去找那个墓，但是，不是没找着，就是进了喇嘛沟就出不来了。",
      "level": 4
    },
    {
      "id": "7.34.4",
      "text": "喇嘛沟那林子老密了，我爹就曾经看见过沟里有野人出没，还有些人说那牛心山里闹鬼，反正这些年是没人敢再去了。”",
      "level": 4
    },
    {
      "id": "7.35",
      "text": "说话间已经夜幕降临，燕子把饭菜做得了，胖子去叫另外两个女知青来吃饭。",
      "level": 3
    },
    {
      "id": "7.35.1",
      "text": "结果刚去就和其中一个叫王娟的一同气喘吁吁地跑了回来，我忙问他们出什么事了。",
      "level": 4
    },
    {
      "id": "7.35.2",
      "text": "王娟喘了半天才说清楚，原来和她一起的那个女知青田晓萌家里来信，说是她母亲得哮喘住院了，病得还挺严重。",
      "level": 4
    },
    {
      "id": "7.35.3",
      "text": "田晓萌听人说喇嘛沟里长的菩萨果对哮喘有奇效，就一个人去喇嘛沟采菩萨果。",
      "level": 4
    },
    {
      "id": "7.35.4",
      "text": "从早晨就去了，一直到现在天黑也没回来。",
      "level": 4
    },
    {
      "id": "7.36",
      "text": "我脑门子青筋一下跳起来多高，这田晓萌也太冒失了，那地方全是原始森林，连村里有经验的猎人也不敢随便去，她怎么就自己一个人去了？",
      "level": 3
    },
    {
      "id": "7.37",
      "text": "王娟哭着说我拦不住她呀，咱们赶紧去找她吧，要是万一出点什么事可怎么办呀。",
      "level": 3
    },
    {
      "id": "7.38",
      "text": "可是眼下村里的劳动力都去了林场，剩下的人老的老小的小，要去找人只能我和胖子去了，燕子也带上栗子黄和猎枪跟我们一道去，留下王娟在村里看庄稼。",
      "level": 3
    },
    {
      "id": "7.39",
      "text": "在山里有狗就不怕迷路，我们不敢耽搁，点着火把牵着栗子黄连夜进了山。",
      "level": 3
    },
    {
      "id": "7.39.1",
      "text": "深山老林里根本没有路可走，我真想不明白田晓萌自己一个女孩怎么敢单身一人闯进大山的最深处，胖子说她可能是急糊涂了，谁的亲娘病了不着急啊。",
      "level": 4
    },
    {
      "id": "7.40",
      "text": "因为天黑，就让狗追踪气味，栗子黄没受过专业的追踪训练，经常跟丢了，还要掉回头去重找。",
      "level": 3
    },
    {
      "id": "7.40.1",
      "text": "所以我们走得很慢，以前四五个小时的路，走了整整一夜。",
      "level": 4
    },
    {
      "id": "7.41",
      "text": "东方出现了曙光，大森林中的晨风吹得人身上起鸡皮疙瘩，清新的空气使人精神为之一振，燕子给我们指了指西面：“你们看，那座大山就是牛心山。”",
      "level": 3
    },
    {
      "id": "7.42",
      "text": "我和胖子向西边看去，被茫茫林海覆盖着的山峦中，耸立着一座怪模怪样的巨大山峰，整个山就如同牛心的形状，九条白练玉龙般的大瀑布从山上奔流而下，村民们捡到的那些瓷器就是从这些瀑布里冲出来的，看来那传说中辽国太后的陵墓可能就在山内，不过这么多年以来始终没人找得到入口。",
      "level": 3
    },
    {
      "id": "7.43",
      "text": "我见了这座壮观的山峰突然有一种感觉，向毛主席保证这样的山我好像在哪见过。",
      "level": 3
    },
    {
      "id": "7.43.1",
      "text": "心念一动，终于想起来平时闲着翻看我祖父留下的那本破书时看到的一段记载。",
      "level": 4
    },
    {
      "id": "7.43.2",
      "text": "这种山水格局是一块极佳的风水宝穴，前有望，后有靠，九道瀑布好似九龙取水，把山丘分割得如同一朵盛开的莲花，对了，好像是叫什么“九龙罩玉莲”。",
      "level": 4
    },
    {
      "id": "7.43.3",
      "text": "山上这九条瀑布，多一条少一条，又或者说没有这么大的水流量，都够不上九龙罩玉莲的格局。",
      "level": 4
    },
    {
      "id": "7.43.4",
      "text": "九在个位数中最大，有至尊之隐义；发音也同久，有永恒之意，一向被视为最吉祥的一个数字。",
      "level": 4
    },
    {
      "id": "7.43.5",
      "text": "另外瀑布的水流如果小了，那也就不叫龙了，那是蛇。",
      "level": 4
    },
    {
      "id": "7.44",
      "text": "这种风水宝穴，还有个别称作“洛神辇”，按书中所说，最适合的就是在这种地方安葬女性，如果安葬了男子，其家族就要倒大霉了。",
      "level": 3
    },
    {
      "id": "7.45",
      "text": "这时我心中隐隐约约有种感觉，我祖父的那本《十六字阴阳风水秘术》并不是什么乱七八糟的四旧，书中的内容确实是言之有物的，回去之后还要再好好读一读。",
      "level": 3
    },
    {
      "id": "7.46",
      "text": "不过我并不觉得这种风水术有什么实用价值，中国自古以来有那么多的帝王将相，哪一个死后是随便找地方埋的？",
      "level": 3
    },
    {
      "id": "7.46.1",
      "text": "朝代更替、兴盛衰亡的历史洪流，岂是祖坟埋得好不好能左右的？",
      "level": 4
    },
    {
      "id": "7.47",
      "text": "燕子指着牛心山前的山谷说：“这就是有名的喇嘛沟，传说里面有野人，到了晚上还闹鬼。”",
      "level": 3
    },
    {
      "id": "7.48",
      "text": "胖子望了望山谷中遮天蔽日的原始森林，皱着眉头说：“田晓萌要是进了喇嘛沟肯定会迷路，咱们只有三个人一条狗，想找她可真是有点不大容易。”",
      "level": 3
    },
    {
      "id": "7.49",
      "text": "我看他们俩有点泄气，就为他们打气说：“共产唯物主义者们就不应该相信世界上有什么鬼，不管是鬼还是野人，让我碰见了就算它倒霉，我要活捉它几只，带到北京去送给毛主席，毛主席见了一定很惊讶。”",
      "level": 3
    },
    {
      "id": "7.50",
      "text": "胖子和我一样都是军人家庭出身，血液里天生就有一种天不怕地不怕的遗传因子，他听了我这么说，也来精神了，摩拳擦掌地准备进沟。",
      "level": 3
    },
    {
      "id": "7.51",
      "text": "只有燕子忧心忡忡，她作为本地人，从小到大听了无数关于这条喇嘛沟的可怕传说，自然就有一种先天养成的畏惧心理。",
      "level": 3
    },
    {
      "id": "7.51.1",
      "text": "不过现在救人要紧，只能把那些抛在脑后了。",
      "level": 4
    },
    {
      "id": "7.52",
      "text": "三人先坐下来吃了些干粮，整点装备，我们一共有两杆猎枪，这两支枪是燕子和她爹打猎时用的，一把是三套筒，另一把是鄂伦春人常用的抬牙子，这两种枪都很落后，全是前膛装填的火药枪，近距离杀伤力很大，但是射击三十五米开外的目标，威力和精度便难以保证，也就打个野兔狍子之类的还算好使。",
      "level": 3
    },
    {
      "id": "7.53",
      "text": "我六岁起就被我爹带到靶场玩枪，解放军的制式长短枪械我用得都很熟，但是这种前膛燧发猎枪，我一点都没有把握能控制住。",
      "level": 3
    },
    {
      "id": "7.53.1",
      "text": "胖子和我的经验差不多，我们商量了一下，猎枪我和燕子各拿一支，胖子拿了一把砍柴的砍刀。",
      "level": 4
    },
    {
      "id": "7.53.2",
      "text": "准备停当之好，三人就一头扎进了喇嘛沟的密林之中。",
      "level": 4
    },
    {
      "id": "7.54",
      "text": "在喇嘛沟里，比起传说中的野人和山鬼，最真实而又直接的威胁来自人熊，人熊虽然和黑瞎子同样都是熊，但是人熊喜欢人立行走，故得此名。",
      "level": 3
    },
    {
      "id": "7.54.1",
      "text": "人熊体积庞大，皮糙肉厚，猎人们只有成群结队，并带有大批猎狗的时候才敢攻击人熊。",
      "level": 4
    },
    {
      "id": "7.54.2",
      "text": "如果一个人带着一把破枪在原始森林中和人熊遭遇，几乎就等于是被判死刑了。",
      "level": 4
    },
    {
      "id": "7.55",
      "text": "在林子里走了大半日，牛心山上九道大瀑布的流水声轰隆隆的越来越大，眼瞅着喇嘛沟已经走到了尽头，就快到牛心山脚下了。",
      "level": 3
    },
    {
      "id": "7.56",
      "text": "人熊野人都没碰到，更没见到田晓萌的踪影，胖子累得一屁股坐在地上：“不行了……实在……走不动了。”",
      "level": 3
    },
    {
      "id": "7.57",
      "text": "燕子说那咱们就先歇会儿吧，栗子黄好像也寻不到田晓萌的气味了，唉，这可咋整啊，要是找不到她，支书和我爹他们回来还不得把我骂死。",
      "level": 3
    },
    {
      "id": "7.58",
      "text": "我也累得够戗，拿起水壶咕咚咕咚灌了几口，对他们两个人说：“田晓萌许不会是让人熊给吃了？再不然也有可能是被野人抓去做了压寨夫人。”",
      "level": 3
    },
    {
      "id": "7.59",
      "text": "我们正在一边休息一边闲扯，忽听栗子黄冲着密林深处狂叫了起来，猎犬都是血统优良的好狗，它们不在极其危险的情况下，绝不会如此狂叫。",
      "level": 3
    },
    {
      "id": "7.60",
      "text": "我问燕子：“狗怎么了？是不是发现有什么野兽？”",
      "level": 3
    },
    {
      "id": "7.61",
      "text": "燕子脸色惨白：“快上树，是人熊。”",
      "level": 3
    },
    {
      "id": "7.62",
      "text": "我一听说是人熊，急忙三下两下爬上了一棵大树，低头一看，燕子正在用力托着胖子的屁股，胖子不会爬树，吃力地抱着树干一点点地往上蹭。",
      "level": 3
    },
    {
      "id": "7.62.1",
      "text": "我赶紧又从树上溜了下来，和燕子一起托胖子的屁股，胖子好不容易爬上了最低的一个大树杈，满头大汗地趴在上面说：“我……这树他妈的……太高了！”",
      "level": 4
    },
    {
      "id": "7.63",
      "text": "栗子黄的叫声越来越急，还没等我和燕子爬上树，就见树丛中钻出一只浑身黑毛的人熊，它见了活人，立即兴奋起来，人立着咆哮如雷。",
      "level": 3
    },
    {
      "id": "7.64",
      "text": "燕子长年跟她爹在山里打猎，经验极其丰富，来不及多想，抬起猎枪对着人熊就放了一枪，碰的一声火光飞溅，弹丸正中人熊的肚子。",
      "level": 3
    },
    {
      "id": "7.64.1",
      "text": "由于距离很近，而且人熊的腹部最是柔软，这一枪在它的肚子上开了个大洞，鲜血和肚肠同时流了出来。",
      "level": 4
    },
    {
      "id": "7.64.2",
      "text": "人熊受了伤，恼怒无比，用大熊掌把自己的肠子塞了回去，然后狂暴地扑向燕子，燕子的猎枪不能连发，身后都是树木荆棘无处可逃，只能闭眼等死。",
      "level": 4
    },
    {
      "id": "7.65",
      "text": "救人要紧，我顾不上多想，急忙举枪瞄准人熊的头部，这一枪如果打不中，燕子就完了，想到这里手有点发抖，一咬牙扣动扳机，轰的一声，抬牙子猎枪巨大的后坐力差点把我掀了个跟头，一屁股坐在地上，不知是火枪的杀伤力不够还是我射得偏了，虽然打中了人熊的头部，却只是打瞎了它的一只眼睛。",
      "level": 3
    },
    {
      "id": "7.66",
      "text": "这一枪虽不致命，却把燕子救了，人熊瞎了...",
      "level": 3
    }
  ],
  "concepts": [
    {
      "name": "盗墓",
      "frequency": 10,
      "context": "The practice of grave robbing, its techniques, and difficulties."
    },
    {
      "name": "坟墓",
      "frequency": 5,
      "context": "Ancient burial sites, their construction and security."
    },
    {
      "name": "机关",
      "frequency": 3,
      "context": "Traps and mechanisms within ancient tombs."
    },
    {
      "name": "工具",
      "frequency": 2,
      "context": "Tools used for tomb excavation and searching."
    },
    {
      "name": "风水",
      "frequency": 8,
      "context": "The art of geomancy, reading landscapes for burial sites."
    },
    {
      "name": "残书",
      "frequency": 4,
      "context": "A fragmented ancient book on funerary arts."
    },
    {
      "name": "胡国华",
      "frequency": 15,
      "context": "The narrator's grandfather, a central character with a history of gambling and opium addiction."
    },
    {
      "name": "大烟",
      "frequency": 7,
      "context": "Opium addiction and its effects on characters."
    },
    {
      "name": "舅舅",
      "frequency": 4,
      "context": "Hu Guohua's maternal uncle, involved in a deception."
    },
    {
      "name": "扎纸人",
      "frequency": 2,
      "context": "The art of making paper figures for the deceased."
    },
    {
      "name": "老鼠",
      "frequency": 8,
      "context": "A significant rat that forms an unusual bond with Hu Guohua."
    },
    {
      "name": "银元",
      "frequency": 4,
      "context": "Currency and its acquisition through unusual means."
    },
    {
      "name": "王二杠子",
      "frequency": 4,
      "context": "A village bully who targets Hu Guohua."
    },
    {
      "name": "军阀",
      "frequency": 3,
      "context": "Warlords and the chaotic political climate of the era."
    },
    {
      "name": "十三里铺",
      "frequency": 2,
      "context": "A location known for ancient tombs."
    },
    {
      "name": "毛月亮",
      "frequency": 1,
      "context": "A specific type of moonlight, associated with ill omens."
    },
    {
      "name": "棺材",
      "frequency": 5,
      "context": "Coffins, their placement and contents."
    },
    {
      "name": "女尸",
      "frequency": 2,
      "context": "A mysteriously preserved female corpse found in a tomb."
    },
    {
      "name": "孙先生",
      "frequency": 6,
      "context": "A Feng Shui master who becomes Hu Guohua's teacher."
    },
    {
      "name": "师徒",
      "frequency": 3,
      "context": "The master-disciple relationship and its significance."
    },
    {
      "name": "胡云宣",
      "frequency": 1,
      "context": "The narrator's father, a former military officer."
    },
    {
      "name": "胡八一",
      "frequency": 3,
      "context": "The narrator's name and its origin."
    },
    {
      "name": "文革",
      "frequency": 3,
      "context": "The Cultural Revolution and its impact on society and individuals."
    },
    {
      "name": "知青",
      "frequency": 6,
      "context": "Educated youth sent to the countryside during the Cultural Revolution."
    },
    {
      "name": "上山下乡",
      "frequency": 3,
      "context": "The policy of sending urban youth to rural areas."
    },
    {
      "name": "内蒙",
      "frequency": 2,
      "context": "Inner Mongolia, the location where the narrator is sent to."
    },
    {
      "name": "岗岗营子",
      "frequency": 1,
      "context": "The specific rural village where the narrator is stationed."
    },
    {
      "name": "胖子",
      "frequency": 10,
      "context": "The narrator's close friend, Wang Kaixuan, nicknamed Fatty."
    },
    {
      "name": "原始森林",
      "frequency": 5,
      "context": "The dense, untamed forests of the region."
    },
    {
      "name": "蜂窝",
      "frequency": 5,
      "context": "A large beehive and the dangerous endeavor to extract honey."
    },
    {
      "name": "栗子黄",
      "frequency": 4,
      "context": "Yanzi's hunting dog."
    },
    {
      "name": "人熊",
      "frequency": 6,
      "context": "A dangerous bear species, a significant threat in the wilderness."
    },
    {
      "name": "喇嘛沟",
      "frequency": 4,
      "context": "A mysterious and dangerous valley rumored to be inhabited by wildmen and ghosts."
    },
    {
      "name": "牛心山",
      "frequency": 3,
      "context": "A distinctive mountain peak with a rumored ancient tomb."
    },
    {
      "name": "野人",
      "frequency": 2,
      "context": "Legendary wild humanoids said to inhabit the region."
    },
    {
      "name": "鬼",
      "frequency": 1,
      "context": "Supernatural beings, their existence debated."
    },
    {
      "name": "猎枪",
      "frequency": 4,
      "context": "Hunting rifles used by the characters."
    },
    {
      "name": "瓷器",
      "frequency": 2,
      "context": "Ceramic fragments found in the river, hinting at ancient origins."
    },
    {
      "name": "菩萨果",
      "frequency": 1,
      "context": "A fruit from Lama Valley rumored to have medicinal properties."
    },
    {
      "name": "田晓萌",
      "frequency": 3,
      "context": "A fellow educated youth who goes missing in Lama Valley."
    },
    {
      "name": "燕子",
      "frequency": 7,
      "context": "A local girl who helps the narrator and Fatty."
    }
  ],
  "relations": [
    {
      "source": "盗墓",
      "target": "坟墓",
      "type": "part_of"
    },
    {
      "source": "盗墓",
      "target": "机关",
      "type": "involves"
    },
    {
      "source": "盗墓",
      "target": "工具",
      "type": "uses"
    },
    {
      "source": "风水",
      "target": "坟墓",
      "type": "related_to"
    },
    {
      "source": "残书",
      "target": "风水",
      "type": "contains"
    },
    {
      "source": "胡国华",
      "target": "大烟",
      "type": "addicted_to"
    },
    {
      "source": "胡国华",
      "target": "舅舅",
      "type": "deceived"
    },
    {
      "source": "胡国华",
      "target": "老鼠",
      "type": "befriended"
    },
    {
      "source": "老鼠",
      "target": "银元",
      "type": "provides"
    },
    {
      "source": "王二杠子",
      "target": "胡国华",
      "type": "antagonizes"
    },
    {
      "source": "胡国华",
      "target": "王二杠子",
      "type": "attacks"
    },
    {
      "source": "胡国华",
      "target": "军阀",
      "type": "joins"
    },
    {
      "source": "胡国华",
      "target": "十三里铺",
      "type": "visits"
    },
    {
      "source": "十三里铺",
      "target": "坟墓",
      "type": "contains"
    },
    {
      "source": "坟墓",
      "target": "女尸",
      "type": "contains"
    },
    {
      "source": "孙先生",
      "target": "胡国华",
      "type": "teaches"
    },
    {
      "source": "孙先生",
      "target": "风水",
      "type": "practices"
    },
    {
      "source": "胡国华",
      "target": "孙先生",
      "type": "discipleship"
    },
    {
      "source": "胡国华",
      "target": "残书",
      "type": "inherits"
    },
    {
      "source": "胡云宣",
      "target": "军人",
      "type": "is_a"
    },
    {
      "source": "胡八一",
      "target": "胡建军",
      "type": "renamed_from"
    },
    {
      "source": "文革",
      "target": "知青",
      "type": "affects"
    },
    {
      "source": "知青",
      "target": "上山下乡",
      "type": "participates_in"
    },
    {
      "source": "知青",
      "target": "内蒙",
      "type": "sent_to"
    },
    {
      "source": "胡八一",
      "target": "胖子",
      "type": "befriends"
    },
    {
      "source": "胡八一",
      "target": "岗岗营子",
      "type": "lives_in"
    },
    {
      "source": "原始森林",
      "target": "人熊",
      "type": "inhabited_by"
    },
    {
      "source": "喇嘛沟",
      "target": "野人",
      "type": "rumored_to_inhabit"
    },
    {
      "source": "喇嘛沟",
      "target": "鬼",
      "type": "rumored_to_haunt"
    },
    {
      "source": "牛心山",
      "target": "坟墓",
      "type": "rumored_to_contain"
    },
    {
      "source": "胡八一",
      "target": "蜂窝",
      "type": "explores"
    },
    {
      "source": "蜂窝",
      "target": "人熊",
      "type": "related_to_danger"
    },
    {
      "source": "栗子黄",
      "target": "燕子",
      "type": "owned_by"
    },
    {
      "source": "胡八一",
      "target": "燕子",
      "type": "befriends"
    },
    {
      "source": "胖子",
      "target": "燕子",
      "type": "befriends"
    },
    {
      "source": "人熊",
      "target": "猎枪",
      "type": "hunted_by"
    },
    {
      "source": "田晓萌",
      "target": "喇嘛沟",
      "type": "enters"
    },
    {
      "source": "田晓萌",
      "target": "菩萨果",
      "type": "searches_for"
    },
    {
      "source": "胡八一",
      "target": "瓷器",
      "type": "discovers"
    },
    {
      "source": "瓷器",
      "target": "牛心山",
      "type": "originates_from"
    },
    {
      "source": "胡八一",
      "target": "风水",
      "type": "studies"
    }
  ],
  "hierarchy": {
    "main_topics": [
      "The Art of Tomb Robbing",
      "Hu Guohua's History and Downfall",
      "The Mystical Bond with a Rat",
      "The Influence of Warlords and the Era",
      "The Pursuit of Wealth and Desperation",
      "The Encounter with the Master and the Book",
      "The Narrator's Family History and the Cultural Revolution",
      "Life as an Educated Youth in Inner Mongolia",
      "The Perilous Journey into the Wilderness",
      "Encountering Natural Dangers and Ancient Mysteries"
    ],
    "structure": "The document is structured chronologically, beginning with an introduction to tomb robbing, then delving into the past of the narrator's grandfather, Hu Guohua. It then shifts to the narrator's personal history and experiences during the Cultural Revolution, leading to his time as an educated youth in Inner Mongolia, and finally detailing his adventures in the wild, encountering both natural and supernatural threats."
  }
}