{
  "propositions": [
    {
      "id": "1",
      "text": "The narrative revolves around complex family and social dynamics in a historical or fictional setting.",
      "level": 1
    },
    {
      "id": "1.1",
      "text": "Characters experience emotional conflicts and personal struggles, often tied to familial expectations and societal norms.",
      "level": 2
    },
    {
      "id": "1.2",
      "text": "Themes of duty, love, and sacrifice are central to character motivations and plot development.",
      "level": 2
    },
    {
      "id": "2",
      "text": "Historical or cultural context shapes the characters' decisions and interactions.",
      "level": 1
    },
    {
      "id": "2.1",
      "text": "References to specific time periods or events (e.g., '同治十三年') indicate a Qing dynasty setting or influence.",
      "level": 2
    },
    {
      "id": "2.2",
      "text": "Social hierarchy and gender roles heavily influence character behavior and narrative tension.",
      "level": 2
    },
    {
      "id": "3",
      "text": "Interpersonal relationships drive the emotional core of the story.",
      "level": 1
    },
    {
      "id": "3.1",
      "text": "Parent-child relationships are depicted with themes of care, misunderstanding, and longing for connection.",
      "level": 2
    },
    {
      "id": "3.2",
      "text": "Romantic and platonic relationships are fraught with unspoken feelings and societal barriers.",
      "level": 2
    }
  ],
  "concepts": [
    {
      "name": "Family",
      "frequency": 30,
      "context": "Central theme involving duty, conflict, and emotional bonds between parents and children."
    },
    {
      "name": "Duty",
      "frequency": 20,
      "context": "Characters often act based on societal or familial obligations, leading to personal sacrifice."
    },
    {
      "name": "Love",
      "frequency": 25,
      "context": "Romantic and familial love as a source of both joy and pain in character interactions."
    },
    {
      "name": "Social Hierarchy",
      "frequency": 15,
      "context": "Influence of class and gender roles on character behavior and societal expectations."
    },
    {
      "name": "Historical Context",
      "frequency": 10,
      "context": "References to specific eras or events grounding the narrative in a historical framework."
    }
  ],
  "relations": [
    {
      "source": "Family",
      "target": "Duty",
      "type": "implies"
    },
    {
      "source": "Family",
      "target": "Love",
      "type": "part_of"
    },
    {
      "source": "Social Hierarchy",
      "target": "Duty",
      "type": "influences"
    },
    {
      "source": "Historical Context",
      "target": "Social Hierarchy",
      "type": "shapes"
    },
    {
      "source": "Love",
      "target": "Duty",
      "type": "conflicts_with"
    }
  ],
  "hierarchy": {
    "main_topics": [
      "Family Dynamics",
      "Societal Norms",
      "Historical Setting"
    ],
    "structure": "The document is a narrative text with a focus on emotional and social conflicts within a historical context, structured around character dialogues and internal monologues."
  }
}