{
  "propositions": [
    {
      "id": "1",
      "text": "武昌起义隆隆的枪炮声，使中国终于挣脱了封建帝制的沉重枷锁，进入了一个各种新锐思潮与遗风陋习激烈冲撞的大时代。",
      "level": 1
    },
    {
      "id": "1.1",
      "text": "民国初年的社会局势尤其混乱，不仅各路军阀之间的战事频繁，而且出现了百年不遇的“北旱南涝”灾情，使得许多省份颗粒无收，成千上万的人成了灾民，为了能有口饭吃，更有许多人铤而走险当起了土匪响马，或去做倒卖人口、走私烟土、贩运军火一类缺德到底的勾当。",
      "level": 2
    },
    {
      "id": "1.1.1",
      "text": "这正是“十年干戈天地老，四海苍生痛哭深”。",
      "level": 3
    },
    {
      "id": "2",
      "text": "常言道：“盛世古董，乱世黄金。”",
      "level": 1
    },
    {
      "id": "2.1",
      "text": "在兵荒马乱的年月里，只有黄澄澄的大黄鱼（金条）才是硬通货。",
      "level": 2
    },
    {
      "id": "3",
      "text": "但在盗墓者的眼中，如此时局之下，国家的法律已形同虚设，正是盗掘古冢、窃取秘器的大好时机。",
      "level": 1
    },
    {
      "id": "3.1",
      "text": "有经验的盗墓老手，当然不会放过这种机会。",
      "level": 2
    },
    {
      "id": "3.2",
      "text": "等到有朝一日政局稳定下来之后，古董价格必会看涨，届时再把所盗之物出手，便可轻轻松松地上一笔横财。",
      "level": 2
    },
    {
      "id": "4",
      "text": "盗墓贼“马王爷”和他的两个老伙计——老北风、费无忌，就是瞅准了眼下的机会，打算趁着淤泥河附近军阀交战，附近村县老百姓逃得十室九空之机，动手盗掘河畔的一处无名古冢。",
      "level": 1
    },
    {
      "id": "5",
      "text": "马王爷本名叫马连城，只因盗墓经验丰富，做过不少大手笔的勾当，而且眼功极高，甚至有人传说他生了三只眼，不管地下有什么古墓，不论藏得多深，他只瞧一眼，就能看出其中端倪，所以才得了这么一个绰号。",
      "level": 1
    },
    {
      "id": "5.1",
      "text": "然而对马王爷的本领比较熟悉之人，自然都知道他并非生有什么三只眼睛，只尊称其为“观山马爷”。",
      "level": 2
    },
    {
      "id": "6",
      "text": "马王爷盯上淤泥河边这座古冢不是一两天了，地点就在离河边不远的一片密林之中。",
      "level": 1
    },
    {
      "id": "6.1",
      "text": "时移物换，丘陇渐平，那古冢的地面封土堆和石碑等标记早已消失多年，不是行家根本就现不了。",
      "level": 2
    },
    {
      "id": "6.2",
      "text": "如果拨开那些枯黄的乱草，在半尺多厚的异色泥下，便可以瞧见一块块奇大无比的墓砖，墓砖的缝隙间铸有铁水加固，要想短时间挖开盗洞，就必须使用土炮炸出缺口。",
      "level": 2
    },
    {
      "id": "7",
      "text": "只是这附近离官道不远，地理位置虽然偏僻，但却是赶场的必经之路，昔日里人来车往难有机会下手，即使在夜里用土炮炸那墓墙，也有可能会惊动民团或保安队。",
      "level": 1
    },
    {
      "id": "7.1",
      "text": "所以马王爷虽然早就踩过几遍点儿了，却迟迟未敢轻举妄动。",
      "level": 2
    },
    {
      "id": "8",
      "text": "当前的战乱却使得这里突然变得人迹罕至，这对马王爷等人来讲那真是天赐的机缘，他立刻会合了另外两个盗墓老手——善使火药术的“老北风”，与身大力不亏的开棺好手“费无忌”，为了掩人耳目，三人都装作道人打扮，带上一干应用器械，牵了几头用来驮东西的骡马，昼伏夜行来至淤泥河畔。",
      "level": 1
    },
    {
      "id": "9",
      "text": "“淤泥河”之所以得名，是由于这河中是半水半泥，也不管是涝是旱，这条河始终都有这么多烂泥。",
      "level": 1
    },
    {
      "id": "9.1",
      "text": "近年来河水流量逐渐变少，原本一条数丈宽的河流，又被淤泥分割成若干段，只有在雨水最大的时候，才偶尔连成一片。",
      "level": 2
    },
    {
      "id": "9.2",
      "text": "河床则全是一丛丛几尺高的乱草，有那些不明究竟的外地人，路过的时候想在河边喝口水、洗把脸什么的，在毫无准备的情况下，如果一脚踩到草下的泥潭，往往就陷在淤泥中丢了性命，谁也说不清这淤泥河陷死过多少人。",
      "level": 2
    },
    {
      "id": "9.3",
      "text": "只是这条河由于死人太多，除了河道最中间极窄一段的水质还算说得过去，大部分河道中一年四季都流着黑水，散着一股股强烈的腐臭。",
      "level": 2
    },
    {
      "id": "10",
      "text": "马王爷他们到达淤泥河边之时，已经是夕阳西下，暮色黄昏。",
      "level": 1
    },
    {
      "id": "10.1",
      "text": "由于事先已经多次看过地形，马王爷和老北风等人几乎不费吹灰之力，就将古墓那铜浇铁灌的砖墙掘了出来。",
      "level": 2
    },
    {
      "id": "10.2",
      "text": "老北风一马当先，在硕大的墓砖上用手指敲敲打打，勘察下手的位置。",
      "level": 2
    },
    {
      "id": "10.3",
      "text": "马王爷同费无忌二人都蹲在一旁等候，马王爷神色悠闲地吸着旱烟袋，而费无忌则神情专注地盯着老北风脸上的表情变化，有几分担心携带的土炮药量不够。",
      "level": 2
    },
    {
      "id": "11",
      "text": "老北风不慌不忙地探明了砖层的薄厚，对马王爷和费无忌说道：“两位老哥，这寿穴造得好个石椁铁壁，恁般结实坚固，咱们虽然带的火药不多，但我估量着若用土炮落力打它最薄弱之处，就算擂不开也差不多了。”",
      "level": 1
    },
    {
      "id": "12",
      "text": "马王爷听罢，不动声色地点了点头，吩咐道：“这淤泥河附近的人早就跑光了，动静闹得再大也不打紧，只是需把药量掐算得恰到好处，别损伤了寿穴中值钱的器物便是。”",
      "level": 1
    },
    {
      "id": "13",
      "text": "马王爷是这伙人中的领，他了话之后，老北风才敢动手，三下五除二便安装了土炮的药引，土炮轰然炸响，别看是土**，但配比高明，爆炸的威力着实不小，直炸得土石横飞、浓烟升腾。",
      "level": 1
    },
    {
      "id": "13.1",
      "text": "老北风早年间在北洋火器局做过火药师，这些年来跟随着马王爷盗过不少古墓，土炮破墙正是他的拿手好戏，待烟雾散去之后，只见这座无名古墓被来了个大揭顶，已经给崩出好大一个缺口。",
      "level": 2
    },
    {
      "id": "14",
      "text": "土炮打出的缺口，位置刚好在墓道铜门的顶端，绕过了最为坚固的铜门铁壁，可墓墙露出的缺口后并不是墓道，里面竖着一块青条石墓碑，三人不免有些奇怪，盗了这么多年的墓，还没见过谁家的墓碑放在坟墓内部，这唱的又是哪出戏？",
      "level": 1
    },
    {
      "id": "14.1",
      "text": "于是并肩走到近前定睛观瞧，都忍不住想要看看这无名古墓里藏着的石碑上究竟写了些什么。",
      "level": 2
    },
    {
      "id": "15",
      "text": "那墓碑又扁又长，造得甚是奇特，石头便是普通的大青石，上边顶端雕了一个鬼头，当中歪歪斜斜地刻着一行大字，笔画怪异潦草，透着阵阵邪气。",
      "level": 1
    },
    {
      "id": "16",
      "text": "这三人中只有费无忌是不识字的粗人，老北风虽然识得一些常用字，但加上认错的白字，最多也就认得几百个字，稍微复杂些的文字便不认得，对于石碑篆刻更是一窍不通。",
      "level": 1
    },
    {
      "id": "16.1",
      "text": "他们俩看起这块墓里的石碑来，跟看天书差不多，连半个字也读不出来，只好请教马王爷这碑上究竟写得些什么文字。",
      "level": 2
    },
    {
      "id": "17",
      "text": "马王爷博古通今，自然是难不倒他，青石上的一行字迹虽然奇特，却并非古篆之类繁杂艰难的碑文，稍加辨认就已读出，当下便在心中默**了一遍。",
      "level": 1
    },
    {
      "id": "17.1",
      "text": "不看不要紧，一看之下，马王爷竟然觉得心底里突然生出一阵寒意，这青石上刻的一行字是：“诸敢吾丘者必遭恶咒坠万劫而不复之地。”",
      "level": 2
    },
    {
      "id": "17.2",
      "text": "原来这是一块古代墓主用于恐吓盗墓者的诅咒石，也就是墓主下毒咒，谁敢掘这座坟，墓主即使死后千年在冥冥之中，也必诅咒盗墓者坠入万劫不复的境地，见此石碑者——死。",
      "level": 2
    },
    {
      "id": "18",
      "text": "自古以来，从有厚葬之风开始，世间便无不之冢，但“事死如事生”的观**在古人心中根深蒂固，很少有贵族愿意纸衣瓦棺。",
      "level": 1
    },
    {
      "id": "18.1",
      "text": "既然不能薄葬，便只有想尽办法反盗墓，除了机关疑冢之外，诅咒震慑也是一个常用的办法。",
      "level": 2
    },
    {
      "id": "18.2",
      "text": "马王爷以前也曾见过类似的，但盗墓之人既然敢做这穿梭于阴阳界之间的行当，便早已将鬼神诅咒置之度外了，他对于这种毒咒早已习以为常，根本就不在乎。",
      "level": 2
    },
    {
      "id": "18.3",
      "text": "然而这次不知为什么，竟然感到一阵心慌意乱，说不定这无名古墓中真会有什么古怪。",
      "level": 2
    },
    {
      "id": "19",
      "text": "好在这种感觉很快就过去了，从以往的经验来看，这座墓至少是宋代以前的，虽然整体规模不大，但那些墓砖却大得罕见，墓主人的来头一定不小，里面陪葬的金玉珍宝少不了，别再疑神疑鬼耽误了正事。",
      "level": 1
    },
    {
      "id": "19.1",
      "text": "想到这儿，马王爷已经为自己打消了那些疑虑，他定了定神，故作镇定地指着青石碑告诉另外两个同伙：“试读碑上文，乃是昔时英啊！石上所刻乃是墓主先贤的高名。”",
      "level": 2
    },
    {
      "id": "19.2",
      "text": "马王爷没对老北风和费无忌说实话，心想反正他们二人也不认得碑上写了些什么，与其让他们担惊受怕，还不如就说这青石是块墓碑，免得干活的时候大伙心里虚。",
      "level": 2
    },
    {
      "id": "20",
      "text": "老北风和费无忌向来对马王爷佩服得五体投地，此时听马王爷这么一说，顿时恍然大悟，看那青条石形状虽然古怪，敢情也就是块刻着墓主人名字的石碑，这还得说是马爷，不但认得碑上的怪字，而且说出话来还出口成章，不得不让人在心里赞叹。",
      "level": 1
    },
    {
      "id": "20.1",
      "text": "马老爷还是百年才出一位的相地大师，跟着马爷观山盗墓，简直比抢银号都过瘾，不仅能财源广进，而且还长学问、长见识，不愧是我等的良师益友。",
      "level": 2
    },
    {
      "id": "21",
      "text": "马王爷隐隐约约有种不太好的预感，他历来不是疑神疑鬼之人，何况现在古墓砖墙已经炸塌了，到了嘴边的肥肉岂有不吃之理？",
      "level": 1
    },
    {
      "id": "21.1",
      "text": "但这种不祥的预感还是使他有几分不安，只想尽快收工回府，于是对老北风二人一摆手：“得了吧二位，咱们老三位加起来少说都有一百六七十岁了，你们也甭捧我了，赶紧收拾停当，到这寿穴中勾当一番，把活做得利利索索的可比什么都强。”",
      "level": 2
    },
    {
      "id": "22",
      "text": "老北风和费无忌齐声称是，方今天下正值乱世，趁着老胳膊老腿还能动，抓紧时机狠狠地干上几票，但盼着此墓中金玉满堂，让咱们今天来个开门红。",
      "level": 1
    },
    {
      "id": "22.1",
      "text": "当下三人就在那墓前，用老酒擦了擦手脸，取出朱砂来用水化开，当做颜料用毛笔沾染，各自在脸上画了一张血红狰狞的脸谱，并在头顶上扎了一块蓝色方巾。",
      "level": 2
    },
    {
      "id": "23",
      "text": "马王爷他们的装束打扮看似神秘诡异，其实这一举一动里面很有讲究，盗墓之人虽然不信邪，却不能不避邪。",
      "level": 1
    },
    {
      "id": "23.1",
      "text": "身穿道袍头顶蓝巾，左手戴个银指环，脸上画个红脸谱，这扮相叫做“魁星踢斗”。",
      "level": 2
    },
    {
      "id": "23.2",
      "text": "据说魁星乃是“九九星中一龙”，古星学中“魁”为北斗一星，堪称九宫之魁。",
      "level": 2
    },
    {
      "id": "23.3",
      "text": "此星在天为万灵之主宰；在地为百脉之权衡。",
      "level": 2
    },
    {
      "id": "23.4",
      "text": "魁星也就是贪狼星，传说贪狼星君相貌奇丑，突面而獠牙，民间视之为司管文运之星，而马王爷这些盗墓者认为贪狼星君能挡煞克邪，如果能请得魁星天官上身，别说墓中生尸变，古尸忽起扑人之类的险恶状况，即便是有具千年尸王，也尽可以一脚将其踏住。",
      "level": 2
    },
    {
      "id": "24",
      "text": "费无忌一脸茫然，用手摸了摸自己的光头，问马王爷道：“马老爷，这是有水没有鱼啊？”",
      "level": 1
    },
    {
      "id": "24.1",
      "text": "他说的这是一句“避口”，也就是道上的黑话，古墓是死者的领地，活人进去盗墓为了让自己安心，硬是给自己增加了许多忌讳，“避口”便是口头上的忌讳，最忌说诸如“死、尸、阴、冥、逃、坟、墓”之类的字眼，认为这些字太不吉利，在交谈的时候都要尽量绕开。",
      "level": 2
    },
    {
      "id": "24.2",
      "text": "“棺材”二字音同“官财”，所以并不需要避口，如果说棺材里有水没有鱼，那就是指棺中只有陪葬品而没有尸骨。",
      "level": 2
    },
    {
      "id": "25",
      "text": "其实就算费无忌不说，马王爷也已经看到了，纵然是他见多识广，却也不知道这棺中究竟是怎么回事。",
      "level": 1
    },
    {
      "id": "25.1",
      "text": "先这口大棺材虽然受墓中潮气所侵，但棺盖的钉子在刚刚被撬开之前，都是完好无损的。",
      "level": 2
    },
    {
      "id": "25.2",
      "text": "棺中摆着数十件陪葬的明器，这至少说明这里没被其他人盗过，既有陪葬品那可以断言绝不可能是疑冢，但棺中却为何没有墓主人的尸骸？",
      "level": 2
    },
    {
      "id": "25.3",
      "text": "难道是经过了千百年时光的消磨，腐烂得连骨头渣子都没剩下半点，可从种种迹象来看又不太像是尸解消散了。",
      "level": 2
    },
    {
      "id": "26",
      "text": "联想到墓道口那写着毒咒的石碑，还有从他们脚边突然间钻进墓中的那个东西，马王爷心里也开始打鼓了，但面对着一棺金玉之物，这个老盗墓贼一时间利欲熏心，他咬了咬后槽牙对费无忌说道：“见怪不怪，其怪自败。你管他这许多做甚？拿！拿完了放把火烧了这口棺材，然后立马走返。”",
      "level": 1
    },
    {
      "id": "27",
      "text": "费无忌答应一声，按以往的惯例，他立刻走到棺材另一端去想把棺材盖子整个扯落。",
      "level": 1
    },
    {
      "id": "27.1",
      "text": "这时候马王爷那两只眼死死盯着棺中亮闪闪的金锭玉璧，不等费无忌将棺盖彻底拉开，便纵身跃入棺中，把一件件陪葬的金玉珠宝都装进蛇皮口袋。",
      "level": 2
    },
    {
      "id": "27.2",
      "text": "按说马王爷江湖人称“观山马爷”，他祖传的盗墓手艺，几十年中掘了不少古冢，颇见过些世面，而且在绿林道上也很有交情，家中置办下良田千顷，开着十几家买卖商号，在当地算得上是屈指可数的豪族。",
      "level": 2
    },
    {
      "id": "27.3",
      "text": "可马王爷这人偏偏在钱财上不太开眼，不是说他眼神不好，就像中国乡间那些普通的土财主一样，见钱眼开，让钱给迷了眼，胃口越来越大，水涨船高，赚多少钱也觉得不够，这可真应了那句老话：“人心不足蛇吞象。”",
      "level": 2
    },
    {
      "id": "27.4",
      "text": "不过话说回来了，要是不贪图暴利，谁又愿意冒险去做盗墓贼这种暗无天日的危险职业？可见财迷人眼色乱心，心智一昏，纵有天大的本领也施展不出了，这种性格注定了他早晚要为此付出代价。",
      "level": 2
    },
    {
      "id": "28",
      "text": "棺中珠光宝气的奇珍异宝，正是得其所哉，马王爷心花怒放，一张老脸上的皱纹都舒展开了，蹲在棺材里出手如电随拿随装，可正在此时，他忽然觉得墓室中有点不太对劲……好像除了自己尚在动作之外，四周全都静止了一般，竟然听不到同伙费无忌的呼吸声了。",
      "level": 1
    },
    {
      "id": "29",
      "text": "马王爷大奇，费无忌那家伙干什么去了？他刚刚不是在搬棺材盖子吗？",
      "level": 1
    },
    {
      "id": "29.1",
      "text": "可棺材盖子被拉开一半便停住不动，现在还在那儿悬着，费无忌却已人影不见。",
      "level": 2
    },
    {
      "id": "29.2",
      "text": "马王爷低声召唤：“老铁……老铁你还在吗？”",
      "level": 2
    },
    {
      "id": "29.3",
      "text": "但墓室中静得连根针掉在地上都能听到，没有半点回应。",
      "level": 2
    },
    {
      "id": "29.4",
      "text": "马王爷心知不好，不过毕竟是老江湖了，临危不乱，身子一晃从棺中翻出，落地之时，一把顶上膛的驳壳枪已经抄在了手中。",
      "level": 2
    },
    {
      "id": "30",
      "text": "这一瞬间马王爷先想到的是费无忌和老北风合伙反水，盗墓贼内部起内讧，为了钱财自相残杀的事太多了，也许那两个家伙想把自己活埋在墓里……",
      "level": 1
    },
    {
      "id": "30.1",
      "text": "这个**头才刚刚浮现，马王爷便现棺材下的宫床上躺着两具血淋淋的尸体，虽然尸体全身血肉模糊，但借着马灯的光亮，马王爷还是看得一清二楚。",
      "level": 2
    },
    {
      "id": "30.2",
      "text": "两具尸体中光头的那个绝对是费无忌，而那个佝偻着身子的罗锅，自然是土炮手老北风，这二人的外貌特征都十分有特点，用眼睛一扫便已认出。",
      "level": 2
    },
    {
      "id": "30.3",
      "text": "马王爷只觉全身毛俱竖，他无法想象刚刚在棺中攫取宝物的一瞬间，这墓室里究竟生了什么可怕的事情，竟然包括在外边放风的老北风在内，两个大活人死得无声无息，而且死状如此之惨。",
      "level": 2
    },
    {
      "id": "31",
      "text": "马王爷知道今天遇上大麻烦了，抬脚想往外逃，而就在这时候，四周黑暗的角落中传来“窸窸窣窣”一片如同有大群老鼠触物之声，俄而，那声音愈剧烈，潮湿的空气中增加了腥臭的烂鱼气味。",
      "level": 1
    },
    {
      "id": "31.1",
      "text": "而且从方向上来判断，退路已经被封上了。",
      "level": 2
    },
    {
      "id": "32",
      "text": "马王爷急中生智，反身再次跃进那口悬掉着的棺材里，双手一拉棺盖，把自己装进了棺中。",
      "level": 1
    },
    {
      "id": "32.1",
      "text": "这么做并不是自寻死路，而是马王爷祖传的绝招，故老相传，如果墓中有怨魂僵尸，只有躲进棺材里，并将棺材盖子拉上，断了它回老窝的退路，子不见午、午不见子，用不了多半天，僵尸疠气尽散，他也就安全了。",
      "level": 2
    },
    {
      "id": "32.2",
      "text": "直接向外闯也不是不行，但天晓得那贪狼星君是否能随请随到，至少眼下这么做要比面对面同古尸斗上一场稳妥得多。",
      "level": 2
    },
    {
      "id": "33",
      "text": "马王爷像具尸体般躺在棺材里，无论从外边看起来体积多么大的棺椁，一旦置身其中，把棺材盖子扣上，也会觉得里面的空间实在是太狭窄压抑了。",
      "level": 1
    },
    {
      "id": "33.1",
      "text": "但马王爷这会儿工夫顾不上去考虑这里舒服不舒服了，放慢了呼吸，支棱着耳朵去听外边的动静。",
      "level": 2
    },
    {
      "id": "34",
      "text": "可这棺木厚实，听了半晌也听不到什么，马王爷在心中打定主意：“本老夫子今天跟你耗上了，歇够了再出去，且看你能在外边能撑到几时。”",
      "level": 1
    },
    {
      "id": "34.1",
      "text": "正寻思着脱身之策，却突然觉得腿上被一只手死死抓住了，腿骨都快被捏碎了。",
      "level": 2
    },
    {
      "id": "34.2",
      "text": "先前他和费无忌，扯开一截棺材盖子，却尚未来得及整个揭掉，难道下半截棺材里藏着什么东西？",
      "level": 2
    },
    {
      "id": "34.3",
      "text": "还是刚才见到老北风和费无忌尸身之时，有什么东西趁机先躲了进去？",
      "level": 2
    },
    {
      "id": "34.4",
      "text": "在迫切的求生**下，马王爷想要挣扎着摆脱，但却现全身肌肉僵硬，已是丝毫动弹不得，只能惊恐地睁着两只眼睛，任由黑暗将他慢慢吞噬。",
      "level": 2
    },
    {
      "id": "35",
      "text": "到最后马王爷神志开始模糊不清了，恍惚中好像有个嘶哑的 ক্ষমা嗓音问了他一些事情，他只觉得那声音根本不像是人在说话，迷迷糊糊地过了许久，突然全身一振，如同从梦魇中醒来，手足终于又能动了，马王爷如遇大赦，哪里还敢在看棺中有什么东西，推掉棺材盖子，他连滚带爬地从棺里爬出来，跌跌撞撞地冲出墓道。",
      "level": 1
    },
    {
      "id": "36",
      "text": "回到家的时候，马王爷好像整个变了个人，家里人觉得老太爷口音很怪，八成是赶路的时候伤风了，也就没有多想。",
      "level": 1
    },
    {
      "id": "36.1",
      "text": "儿孙弟子们赶紧过来请安，问起这次去淤泥河盗墓的经过，马王爷便简略地说出了一遍，随后一句话也不再多说，一连数日闭门不出，任何亲戚朋友一概不见，只在厅中自斟自饮，一喝多了就胡言乱语：“大头鬼、小头鬼，吊死鬼、淹死鬼，屈死鬼、怨死鬼……来来，喝！喝！”好像在招呼许多孤魂野鬼跟他一同饮酒。",
      "level": 2
    },
    {
      "id": "36.2",
      "text": "这诡异无比的举动，把家中的女眷们骇得个个面无人色，老爷这是怎么了？莫不是鬼迷了心窍?",
      "level": 2
    },
    {
      "id": "36.3",
      "text": "但马王爷平日里在家作威作福，说一不二，大伙心里嘀咕，积威之下却是谁也不敢言明。",
      "level": 2
    },
    {
      "id": "37",
      "text": "马家是个大家族，家财万贯，除了做盗墓的勾当，也和绿林道有许多勾结，到现在为止还没有分家，家中重要事务都是马王爷一个人说了算。",
      "level": 1
    },
    {
      "id": "37.1",
      "text": "家里人见老爷如此，担心他年岁大了有什么闪失，请了几位郎中来给他诊病，但都被马王爷骂了出去。",
      "level": 2
    },
    {
      "id": "38",
      "text": "正当家人不知所措的时候，适逢天阴如晦，马王爷突然一反常态，把家族中的男女老少统统召集到厅堂之中，看架势是要开个家族会议。",
      "level": 1
    },
    {
      "id": "38.1",
      "text": "高墙深院的马宅正厅陈设典雅、富丽堂皇，古朴的檀木门框窗棂上都嵌以黑色大理石作为装饰，堂内附庸风雅地挂着“诗书传家，孝悌为本”之类的题字，处处都显示出马家财大气粗的显赫门。",
      "level": 2
    },
    {
      "id": "38.2",
      "text": "但由于家中有不少装饰品都是从古墓中掘出来的，使得马宅在气派中又平添了几分阴森之气，家中一些胆小的丫鬟仆妇，到了掌灯的时辰，就轻易不敢再在院中随便走动，她们都觉得这院子里瘆。",
      "level": 2
    },
    {
      "id": "39",
      "text": "马家众人听的老太爷话，都不敢怠慢，按辈分顺序肃立两厢，恭候马王爷训示。",
      "level": 1
    },
    {
      "id": "39.1",
      "text": "当地的乡俗重男轻女，包括几位姨奶奶，不管什么时候都只有“依倒明柱，站破方砖”的份儿，这次能让她们参与实属罕见，所以家中的女眷不论辈分都站在最后。",
      "level": 2
    },
    {
      "id": "39.2",
      "text": "外边虽然阴天，但堂内没有掌灯，马王爷坐在太师椅上，大伙甚至看不清他的脸，既然他不开口说话，别人自然也都不敢吭声，可心里边又都有点犯嘀咕，不知道老爷今天又抽哪门子风？召集了这么多人还不让点灯。",
      "level": 2
    },
    {
      "id": "40",
      "text": "人都到齐之后又过了好一阵子，马王爷这才开言，先是一声长叹：“唉……我夜里梦到一只黑猫挠门，看来我这把老骨头剩下的日子不多了。",
      "level": 1
    },
    {
      "id": "40.1",
      "text": "按说都这把年纪了，该享的福也都享了，该遭的罪也都遭了，天年已尽，虽死无妨。",
      "level": 2
    },
    {
      "id": "40.2",
      "text": "怎奈我死之后，咱们马家气数便尽，偌大的个家业旦夕之间就要败掉了，一想到留下你们这班子孙在世上受苦受难，我在九泉之下也难以瞑目。”",
      "level": 2
    },
    {
      "id": "41",
      "text": "马家几个儿子知道这不是闹着玩儿的事，忙赌咒誓，绝对唯命是从。",
      "level": 1
    },
    {
      "id": "41.1",
      "text": "于是马王爷详加指点，必须在他死后当天立即下葬，正确的地点就是太师椅下，穴地八尺而葬，而且务必要“裸尸倒植”，也就是尸体不能穿衣服，也不用棺椁，大头朝下直接埋到地下八尺深的所在，下足上，面朝东南，然后再填土掩埋。",
      "level": 2
    },
    {
      "id": "41.2",
      "text": "这之后的四十九天里，马宅既不准出又不准进，任何客人来吊丧都不能应门，七七四十九日之后，把宅子拆了改为祠堂，这些细节一丝一毫的差错都不能有。",
      "level": 2
    },
    {
      "id": "41.3",
      "text": "“你们要是能听遗命行事就用此穴眼，否则万万不可使用，吉凶只在一线之间，其中有天渊之别。”",
      "level": 2
    },
    {
      "id": "42",
      "text": "把一切后事安排好之后，不出三天，马王爷果然猝死在太师椅上，马家众人悲痛之余不敢怠慢，赶忙按老爷临终前的吩咐，在正堂太师椅下穴地八尺，但在下葬的时候，大伙都觉得把老爷光着腚埋进去有些不妥，这成何体统啊？",
      "level": 1
    },
    {
      "id": "42.1",
      "text": "《葬经》上可从来没有这种礼制。",
      "level": 2
    },
    {
      "id": "42.2",
      "text": "虽然老爷生前说得严重，但他自打从淤泥河回来之后，行为十分反常，说出来的话也未必当得真。",
      "level": 2
    },
    {
      "id": "42.3",
      "text": "但大多数人觉得，宁可信其有，也不可信其无，为了家门兴旺，还是按老爷子说的照做妥当。",
      "level": 2
    },
    {
      "id": "42.4",
      "text": "结果商量来商量去，采取了一个折中的办法，在尸体上裹了一层白帛，这才倒竖进 the穴中掩埋。",
      "level": 2
    },
    {
      "id": "43",
      "text": "然后马家闭门谢客，回绝了一切前来吊丧的人，紧锁前后宅门，在一段时期内断绝了与外界的来往，然而就在七七四十九天将满未满之际，还是出了件要命的祸事。",
      "level": 1
    },
    {
      "id": "44",
      "text": "马家全家都谨遵马王爷遗嘱，在他死后秘不丧，于堂中穴地八尺倒葬，然后连日闭门不出。",
      "level": 1
    },
    {
      "id": "44.1",
      "text": "眼瞅着七七四十九天就到日子了，却在前一天的晚上来了伙人。",
      "level": 2
    },
    {
      "id": "44.2",
      "text": "其实这些人也不是外人，都是马王爷的外戚和故交，只因马王爷寿辰将至，他们都是来给老太爷拜寿的。",
      "level": 2
    },
    {
      "id": "44.3",
      "text": "由于马王爷去世的消息被瞒得很紧，所以这些人毫不知情，没想到来至马宅，只见大门紧闭，宅中也不是没人，可任凭怎么叫门，里面硬是没半点动静。",
      "level": 2
    },
    {
      "id": "44.4",
      "text": "再接着砸门，里面这才有人回应，说现在不方便接待外客，而且说出来的原因也很难让人信服。",
      "level": 2
    },
    {
      "id": "45",
      "text": "来拜寿的这帮人也都是绿林中人，说白了就是土匪，或者被称为山贼响马子的那一路人，警惕性很高，一看这情形就立刻起了疑心，感觉这事不大对，搞不好是山匪血洗了马宅，或者出了什么别的异样变故。",
      "level": 1
    },
    {
      "id": "45.1",
      "text": "当时世道太乱，黑道上的仇杀报复都如家常便饭。",
      "level": 2
    },
    {
      "id": "45.2",
      "text": "这伙人都得过马王爷的好处，还指着他生财呢，当然不肯袖手旁观。",
      "level": 2
    },
    {
      "id": "45.3",
      "text": "这伙江洋大盗一贯是枪不离身，纷纷从衣服中拽出藏着的密雷艮、左轮、快制驳壳等短家伙，想进去一探究竟。",
      "level": 2
    },
    {
      "id": "45.4",
      "text": "马家深宅大院，大伙只好搭起人梯往院子里跳。",
      "level": 2
    },
    {
      "id": "46",
      "text": "马家院墙虽高且厚，但毕竟不是炮楼，哪里挡得住这些响马？",
      "level": 1
    },
    {
      "id": "46.1",
      "text": "然而进去一看，现马宅中一切如常，没有横尸满堂的景象，但全家大小批麻戴孝，而且唯独不知马王爷在哪儿，再追问究竟，马家众人如实托出，听得这些响马目瞪口呆，不知道该说什么好了，头回听说还有这种葬俗。",
      "level": 2
    },
    {
      "id": "46.2",
      "text": "来的这些人其中有个老土匪头子罗歪嘴“罗司令”，他跟马王爷是年轻时一个头磕在地下的结拜兄弟，几十年过命的交情，听明白来龙去脉之后，罗司令立刻就火了，抬手“啪”地给了马家大儿子一个耳光，教训道：“他娘的你知道为什么抽你吗？你爹走了竟然敢不告诉我，这是你一个罪过：二，葬不以礼，这一条可以算是大不孝的罪过，要不是**在我那大哥刚走不久，单凭这两桩罪过，现在就可以他娘的一枪把你给崩了。",
      "level": 2
    },
    {
      "id": "46.3",
      "text": "让大伙说说，天底下哪有这般裸身倒葬自己亲爹的？还敢披麻戴孝充孝子？这其中许是有何图谋不成？”",
      "level": 2
    },
    {
      "id": "47",
      "text": "罗歪嘴硬说马家几个儿子为了分家产，图害了马王爷，嚷嚷着要把马王爷的尸身从土中掘出，看看究竟是怎么死的，然后再重新隆重下葬。",
      "level": 1
    },
    {
      "id": "47.1",
      "text": "那罗歪嘴是叔伯辈的长辈，马家长子挨了打也白挨，根本不敢顶撞他，心里就甭提多委屈了。",
      "level": 2
    },
    {
      "id": "47.2",
      "text": "旧社会最重孝道，谁也担不起谋害自己亲爹的罪过呀，而且罗司令手里拎着枪，一边教训这些人，一边举着手枪对众人比比画画、指指点点，谁不知道这位罗爷是“伸手五支令，卷手就要命”的老土匪头子，脾气一上来看谁不顺眼立刻就能给谁钉几个血窟窿，这种情况下谁又敢说个“不”字。",
      "level": 2
    },
    {
      "id": "48",
      "text": "马家众人本就对马王爷临终的吩咐存有几分疑虑，再加上罗司令的再三催逼，万般无奈之下，只好将众人请到堂屋，找来铁锨锄头，由马家大儿子先向灵位磕头，向先父在天之灵禀明缘由，然后才动手掘地。",
      "level": 1
    },
    {
      "id": "49",
      "text": "马宅中有不少都是盗掘古冢的高手，八尺深的填土，在这帮人的手底下根本不算回事，没多大工夫，就挖到了底，最后还剩下这么数寸的距离便可以看到马王爷尸体的双脚了，因为是头下脚上，所以最靠近地面的应该是马王爷的双脚，罗司令连忙吩咐众人手底下轻点，别戳坏了马王爷的尸。",
      "level": 1
    },
    {
      "id": "49.1",
      "text": "听了罗司令的吩咐，动手掘土的几个人赶紧答应，手中不敢再随便使劲，度就缓了下来，突然间也不知是谁惊叫一声：“哎哟！马老爷的脚还在动！”",
      "level": 2
    },
    {
      "id": "49.2",
      "text": "这么一惊一乍的，把其余几个人都吓得扔掉手中的家伙，像被火燎了屁股一般从土坑中蹿了出来。",
      "level": 2
    },
    {
      "id": "50",
      "text": "突如其来的变故使众人慌了神，在场的这些人，除了盗墓的就是土匪山贼，即便是给活人扒皮抽筋，也都视作等闲，可在那个年代，对于迷信事物这种先天形成的恐惧心理根深蒂固，他们最怕的就是僵尸。",
      "level": 1
    },
    {
      "id": "50.1",
      "text": "众人均想，那马王爷的尸体埋进土中四十多天，未烂也就罢了，现在竟然动了起来，一准是变了僵尸。",
      "level": 2
    },
    {
      "id": "50.2",
      "text": "当地关于僵尸的民间传说实在太多了，虽然大多数人都没见过，但人人都可以讲出一大串相关的传闻，比如一男一女两僵尸是怎么野合的，那僵尸又是怎么突然坐起来扑人的，怎么掏人心肝饮人血髓，又是怎么刀枪不入的，尸体突然的抖动自然是不由得他们不怕。",
      "level": 2
    },
    {
      "id": "51",
      "text": "罗司令往坑中一看，也觉骇异万分，坑中的土里，露出一截被白色丝网裹缠着的东西。",
      "level": 1
    },
    {
      "id": "51.1",
      "text": "那物正自一蹿一蹿地向上蠕动，似乎是在土中埋得难受，努力挣扎着想要破土而出，由于被那些白布包得甚紧，看不清那是什么东西，但看形状绝不像是尸的双足。",
      "level": 2
    },
    {
      "id": "52",
      "text": "罗司令虽然也是害怕，但他毕竟是湘阴地区出了名的悍匪，一辈子杀人如麻，见过无数残酷恐怖的怪异事端，这伙人里就属他贼胆包天。",
      "level": 1
    },
    {
      "id": "52.1",
      "text": "此刻他见众人慌了神，争先恐后的都想从房中逃出去，连忙对着房顶连开数枪，枪声一响，其余的人才纷纷停了下来，罗司令对他们说道：“诸位，都听我说，咱们这有几十条快枪，没什么好怕的。",
      "level": 2
    },
    {
      "id": "52.2",
      "text": "我的拜把兄弟马老爷死得不明不白，今天不管下面有什么东西，老子都要挖出来看个清楚，谁要是再大惊小怪的妖言惑众，可别怪我罗歪嘴的枪子儿翻脸不认人！”",
      "level": 2
    },
    {
      "id": "53",
      "text": "罗司令身为湘阴匪，向来杀人不眨眼，一贯以心狠手辣服众，他几句话一出口，自然而然就带着一种号施令的气势，很快就把局势稳定了下来。",
      "level": 1
    },
    {
      "id": "53.1",
      "text": "罗司令先吩咐大伙准备制僵尸的墨斗和朱砂，然后把四周的门户全部洞开，让外边的日光照射进来，等一切都准备妥当了，这才用枪顶着两个手下的小喽啰，硬逼着他们下到坑中，尽破马王爷所葬之穴，将那用白帛裹缠，尚在不停挣扎蠕动的尸体完完整整地给挖了出来。",
      "level": 2
    },
    {
      "id": "54",
      "text": "众人提心吊胆地凑到近前一看，不免更是惊奇，按马家之人所说，马王爷是脱光了身子，只裹一层白帛下葬，但挖出来的这个东西，虽然外边裹着数匝白帛，可不论怎么看，那形状也不是㸸人形。",
      "level": 1
    },
    {
      "id": "54.1",
      "text": "足足胀大了两倍有余，那些裹尸用的帛锦，已经被撑成了丝线状，乍一看去，就像是裹了密密层层的白色蜘蛛网。",
      "level": 2
    },
    {
      "id": "54.2",
      "text": "一股股的腥臭从中散出来，众人心下疑惑不解，莫非是白帛裹得太多，尸体下葬后腐烂膨胀，尸气化散不掉，才产生这种异状，这白花花的尸裹微微颤动，可能就是尸气在其中流转造成的，刚才确是少见多怪了。",
      "level": 2
    },
    {
      "id": "55",
      "text": "罗司令捏着鼻子，走到更近的距离观看，便立刻现不对，绝对不是尸解的胀气，那些蛛网般的帛丝缝隙间，露出许多鳞片，尸体再怎么变化，也不可能生出鳞片，看这样子，竟像是被帛丝缚住了一尾怪鱼，但是地下怎么会有鱼，而马王爷的尸体却又到哪里去了？",
      "level": 1
    },
    {
      "id": "56",
      "text": "这下子众人更是六神无主，就连见多识广的罗司令也是丈二和尚——摸不着头脑了，不知道该如何理会，这件事实在是出乎他的预料。",
      "level": 1
    },
    {
      "id": "56.1",
      "text": "过了没一会儿，那被白帛裹住的尸体便逐渐不再动了，罗司令甚至有点后悔了，不应该随随便便就把马王爷的尸体挖出来，说不定就要惹出什么大祸了，但事到如今，只好强打精神，他让手下人壮着胆子把白帛剪掉，看看里面裹的到底是何物。",
      "level": 2
    },
    {
      "id": "57",
      "text": "《谜踪之国3神农天匦》里有个吃死人肉的“老蛇”，其原形来自解放以前，河南开封附近的一个怪人。",
      "level": 1
    },
    {
      "id": "57.1",
      "text": "此人是个四十来岁的壮汉，形貌伟岸，筋骨虬结，身材恰似半截铁塔，面相极为凶恶，颧骨凸出，眼窝深陷，两眼已盲。",
      "level": 2
    },
    {
      "id": "57.2",
      "text": "他每天都在街上摆摊为生，往往顶着布伞，竖起一根旗幡，那旗幡上画有一只巨鼠，他自己抱着个大木箱坐到下边，那些过往的贩夫走卒老幼妇孺，见此人举止奇异，忍不住都会停步观看，瞧瞧此人是变戏法还是卖野药。",
      "level": 2
    },
    {
      "id": "57.3",
      "text": "这壮汉摆摊却不卖东西，也不会耍戏法，他是善食生鼠，也就是吃活的大老鼠，观者赏他一枚老钱，他就吃上一口生鼠肉，若给得钱多，就捉来巨鼠，直接放到嘴里，当众咬食，只听鼠类在他嘴中吱吱惨叫，鲜血顺着他嘴角往下流淌，那情形很是残忍，胆小的都捂上眼不敢去看。",
      "level": 2
    },
    {
      "id": "57.4",
      "text": "他所携带的木箱里，装得满满的，全是巴掌大小的活鼠。",
      "level": 2
    },
    {
      "id": "57.5",
      "text": "谁要抓来蜥蜴、蜈蚣，只要肯给钱，他也愿意当面吃下肚去。",
      "level": 2
    },
    {
      "id": "58",
      "text": "大伙都以为这汉子是吃毒虫老鼠吃多了，致使两眼失明，然而只有少数本地人才知道，这汉子眼盲与食鼠无关，而是吃人吃的。",
      "level": 1
    },
    {
      "id": "58.1",
      "text": "据说此人平生最嗜之物，就是小孩。",
      "level": 2
    },
    {
      "id": "58.2",
      "text": "那时候他血气方刚，住在哥哥嫂子家里，哥哥有个儿子，年方三岁，白皙肥嫩，非常招人喜爱，这人佯装呵护幼侄，夜里带着小孩同睡，转天早上起来，床上却只剩他自己了，哥哥一看被褥中沾染血迹，还有许多残存的头，立刻就明白过来了。",
      "level": 2
    },
    {
      "id": "58.3",
      "text": "自己这兄弟自小就喜欢吃活物，家人除了呵斥几句，谁也没太当回事儿，没想到这厮丧心病狂，现在竟吃起活人了。",
      "level": 2
    },
    {
      "id": "58.4",
      "text": "当哥哥的也知自己这兄弟体魄出众，难以力敌，因此没有声张，趁其不备，拿生石灰投到他眼中，然后抡起菜刀就剁。",
      "level": 2
    },
    {
      "id": "58.5",
      "text": "谁知这厮两眼都被石灰烧瞎了，但还悍勇绝伦，居然抢过刀来，劈死了兄嫂全家，然后逃至外省避难。",
      "level": 2
    },
    {
      "id": "58.6",
      "text": "等大清国倒了，天下改换了朝代，他才重新回到开封，由于废了一对眼睛，只能依靠在街头食活鼠度日。",
      "level": 2
    },
    {
      "id": "59",
      "text": "街上围观的人们听说了真相，无不切齿痛骂，那汉子却没半分悔意，声称两三岁小孩之肉鲜嫩无比，世间任何山珍海味都不能与之相提并论，因为小孩的肉有种天然香气，世人所谓“**”是也。",
      "level": 1
    },
    {
      "id": "59.1",
      "text": "他每次接近小孩，一闻到这股**，都会忍不住馋涎欲滴，吃过这世间至味，搭上两个眼珠子又算得了什么？",
      "level": 2
    },
    {
      "id": "59.2",
      "text": "说罢咧嘴大笑，露出白森森的牙齿，吓得观者相顾失色，再也不敢多言，或许这个人就属于天生厉种，其行为不能用常理解释。",
      "level": 2
    },
    {
      "id": "60",
      "text": "《谜踪之国3神农天匦》中，主人公探险的地点在神农架，那是个充满神秘色彩的地方，处在鄂西腹地，又恰好位于北纬3o度地带，围绕着这一纬度，存在着许多难以解释的谜团，失落的亚特兰蒂斯，以及壮观的金字塔、百慕大魔鬼黑洞，全都出现在北纬3o度。",
      "level": 1
    },
    {
      "id": "61",
      "text": "自古有神农四宝之说，被称为“江边一碗水、头顶一颗珠、文王一根笔、七叶一枝花”。",
      "level": 1
    },
    {
      "id": "61.1",
      "text": "那是指神农架林海茫茫，古木参天蔽日，生长着许多珍异药草，甚至溪水都有药性。",
      "level": 2
    },
    {
      "id": "61.2",
      "text": "每当春雷过后，下到山溪里舀起一碗水，便能治疗跌打、风湿，头顶一颗珠能治头疼，文王一根笔能表热解毒，七叶一枝花更是具有奇效，堪称“疑难杂症一把抓”。",
      "level": 2
    },
    {
      "id": "61.3",
      "text": "所谓“七叶一枝花”，顾名思义是一种草本植物，其特征是有七片叶子，在山里随处可见，诸如阴寒热毒之类的症状药到病除，相传乃是神农老祖所留，山区那些抓不起药的穷苦人，便以此物救命。",
      "level": 2
    },
    {
      "id": "62",
      "text": "神农架的原始森林里，更有无数珍禽异兽出没，除了恐怖的野人传说，还有一种非常特殊的生物。",
      "level": 1
    },
    {
      "id": "62.1",
      "text": "相传这种怪物驴头狼身，当地山民将其称为“驴头狼”，体形和驴子差不多大小，头部很像驴，却长着四条狼一般的利爪，尾巴又粗又长，行走如飞，生性凶猛残忍。",
      "level": 2
    },
    {
      "id": "62.2",
      "text": "在找不到食物时就伤害牲畜，甚至吃人，单想想“驴狼身”的模样也足够可怕，那些相关传说，更像笼罩在深山里的迷雾，面目模糊诡异，令人望而生畏。",
      "level": 2
    },
    {
      "id": "63",
      "text": "据说在六十年代初期，还曾有猎人在山里打到过驴头狼，可惜尸体没有保存下来，甚至连张照片都没留下，所有关于驴头狼的传说，仅存在于目击者的口头叙述上，截止到目前为止，还没有任何直接证据证实它的存在。",
      "level": 1
    },
    {
      "id": "64",
      "text": "这些传说听似荒诞，可往深处想想，却又合乎情理，有考察古生物的科学家认为：驴头狼的外形特征，与上新世的史前生物“沙犷”非常接近，但由于神农架的特殊地理和生态环境，动、植物群类非常丰富，与“沙犷”一起生活在上新世的动物如金丝猴、苏门羚等，在别的众多地区都已绝迹了，但在神农架却依然生存着。",
      "level": 1
    },
    {
      "id": "64.1",
      "text": "因此我们也就同样有理由认为，可能有少数残存的“沙犷”也在这块土地上继续生存了下来，仍然栖息在人迹罕见的深山密林之中。",
      "level": 2
    },
    {
      "id": "65",
      "text": "我在长篇探险小说《谜踪之国》中，设定了一个核心秘密，其背景源自前苏联的“地球望远镜计划”。",
      "level": 1
    },
    {
      "id": "65.1",
      "text": "顾名思义，人类设制造了天文望远镜，可以通过它用肉眼来窥探宇宙星空，但人的眼睛却不能穿透地面，因为向脚底下探索要远难于向头顶上探索。",
      "level": 2
    },
    {
      "id": "65.2",
      "text": "人类已经可以到达太阳系的边沿，但很难打出过三千米深的深井，所以才将穿透地层的深渊称为“地球望远镜”，意指直通地心的洞穴。",
      "level": 2
    },
    {
      "id": "66",
      "text": "该计划的原型是早在六十年代冷战时期，苏联和美国这两大阵营，受到冷战思维支配，将大量财力、物力投入到无休无止的战备竞争当中，军事科研也以近乎畸形的度突飞猛进，双方竭尽所能开各种战略资源。",
      "level": 1
    },
    {
      "id": "66.1",
      "text": "当时苏联国土的南部和东部幅员辽阔，环绕着山岳地带，天然洞窟和矿井极多。",
      "level": 2
    },
    {
      "id": "66.2",
      "text": "为了比美国更早掌握地底蕴藏的丰富资源，以及人类从未接触过的未知世界，苏联人选择了贝加尔湖中一个无人荒岛为基地，动用重型钻探机械设备，秘密进行了前所未有的深度挖掘。",
      "level": 2
    },
    {
      "id": "66.3",
      "text": "这一工程耗时将近二十年，他们挖出的洞穴，垂直深度达到一万两千米，是世界上最深的已知洞窟。",
      "level": 2
    },
    {
      "id": "66.4",
      "text": "因为涉及高度军事机密，所以“地球望远镜”计划始终都在绝对封闭的状态下进行，外界很少有人知道其中的内幕。",
      "level": 2
    },
    {
      "id": "67",
      "text": "关于苏联科学家通过地球望远镜现了什么，一直以来都有很多传说，内容非常离奇恐怖，有种说法是深度钻探挖掘到一万两千米左右，就再也挖不下去了。",
      "level": 1
    },
    {
      "id": "67.1",
      "text": "虽然钻头的熔点几乎等于太阳表面的温度，可有时候把钻头放下去，拉出来的却只剩下钢丝绳，而且钻井中传出来了奇怪的声音。",
      "level": 2
    },
    {
      "id": "67.2",
      "text": "电台里会收到大量从地底出的诡异噪音，那简直像是恶魔的怪叫，没人能理解这些来自深渊的信息，也无法用科学来解释，现场人员都以为他们挖通了地狱。",
      "level": 2
    },
    {
      "id": "67.3",
      "text": "随着深度的增加，难以置信的奇怪现象越来越多，最后因为各种可知和不可知的因素，这项工程被迫冻结。",
      "level": 2
    },
    {
      "id": "68",
      "text": "据说美国宇航员，也在外太空接收过与之类似的“幽灵电波”，近年来被科学家证实是宇宙微波辐射，如同电视机里出现的雪花，或是电台中的噪音干扰。",
      "level": 1
    },
    {
      "id": "68.1",
      "text": "从遥远的过去到无尽的未来，自然界中始终存在着这种看不见摸不到的电磁波，或许地底深渊里的可怕现象同样是电磁作用，不过这些情况还有待于科学家继续探索。",
      "level": 2
    },
    {
      "id": "68.2",
      "text": "至于小说《谜踪之国》中，那个深埋在地心的秘密又是什么，也留到小说里再作分解。",
      "level": 2
    },
    {
      "id": "69",
      "text": "《鬼吹灯之怒晴湘西》的冒险地点在湖南，实际上这个故事里出现的怒晴鸡，其原型来自河南的民间传说。",
      "level": 1
    },
    {
      "id": "70",
      "text": "据说很多年以前，在嵩山一带，每逢春天惊蛰时分，住在山里的居民夜里常常会看见两道红光围绕在少室山巅，一条大约六七尺长，另一条大约四五尺长，蜿蜒起伏，就好似两条火龙一样。",
      "level": 1
    },
    {
      "id": "70.1",
      "text": "到了天明，报晓鸡打鸣之后，就会逐渐消失了。",
      "level": 2
    },
    {
      "id": "70.2",
      "text": "只要春天一过，到了初秋季节，这两条红光便不会再出现，很多看到的人都搞不懂这到底是怎么回事。",
      "level": 2
    },
    {
      "id": "71",
      "text": "话说在这少室山下居住着一户山民，其家中养有一只雄鸡，这只鸡体形高大，身材魁梧，其相貌颇有气势，足有十多斤重，所产之卵全都光滑圆润，而且假以时日孵化，无有不活，主人一直视其为宝贝，并且称呼它为“老雄”，养了十余年，一直不肯宰杀。",
      "level": 1
    },
    {
      "id": "71.1",
      "text": "有一年初春季节，又到了这老雄产卵之时，但谁知此次这老雄产了数十只蛋，到最后仅存活了一只雄性鸡崽，其余的尽数夭亡，主人看后，每日垂头丧气，以为此事乃不祥之兆。",
      "level": 2
    },
    {
      "id": "71.2",
      "text": "这天，忽然有一位番邦模样之人来到了这户山民家中，看到了老雄与那只雏鸡，转头便问主人这两只鸡是否肯卖。",
      "level": 2
    },
    {
      "id": "71.3",
      "text": "主人正在因之前的事情而犯愁，认为是这老雄已经年老无用了，所以就随口说了句：“客人如果出得重金买之，我岂能不卖？”",
      "level": 2
    },
    {
      "id": "71.4",
      "text": "那客人问道：“这两只鸡你想卖多少价钱？”主人回应：“五百就够了。”",
      "level": 2
    },
    {
      "id": "71.5",
      "text": "客人听后面露喜悦之色，立即应允了下来。",
      "level": 2
    },
    {
      "id": "71.6",
      "text": "主人起初想找那客人索要五百个铜钱，但见其面露喜悦之色，便立即明白自己索要的价钱低了，于是急忙改口说道：“我所说的五百，乃是五百两纹银，并非五百铜钱。”",
      "level": 2
    },
    {
      "id": "71.7",
      "text": "客人听其这样说后，沉思了许久，说道：“既已如此，我答应你便是。五百两纹银的价钱我不会吝惜，但是你不可再反悔！”",
      "level": 2
    },
    {
      "id": "71.8",
      "text": "主人听后大喜过望，答：“你若拿得五百两纹银前来，我誓不反悔。”",
      "level": 2
    },
    {
      "id": "71.9",
      "text": "客人甚是高兴，次日便带了五百两纹银前来，付给了这户山民。",
      "level": 2
    },
    {
      "id": "72",
      "text": "主人见其果真带了银两前来，喜形于色，收好银两后便立即打开笼子，将两只鸡交付在了客人手中。",
      "level": 1
    },
    {
      "id": "72.1",
      "text": "客人接过鸡时，主人拉住其衣袖，笑着问道：“我起初只是想戏弄一下贵客，没想到你果真携重金前来，敢问一句，你买这两只鸡所谓何用？”",
      "level": 2
    },
    {
      "id": "72.2",
      "text": "客人笑着回答：“尊翁执意要问，我只好如实相告。”",
      "level": 2
    },
    {
      "id": "73",
      "text": "那客人说道：“你在这少室山下居住，可曾见过这山巅之上有两道红光？”主人疑惑地看着他点了点头。",
      "level": 1
    },
    {
      "id": "73.1",
      "text": "客人继续道：“那两道红光乃是两只蜈蚣精，一父一子，若再过百年，其子长成，必为一方禽兽，到那时必定残害生灵，为祸一方，你不但一家难保，就算我们这些外乡人，也要受其牵连，所以实为大患，不得不除。",
      "level": 2
    },
    {
      "id": "73.2",
      "text": "如今那只小蜈蚣精，尚为年少，不成气候，其父老矣，而且势单力孤，还不敢公然横行肆虐，唯有这两只鸡可以制伏它们。",
      "level": 2
    },
    {
      "id": "73.3",
      "text": "老雄体壮，不足为虑，但其幼雏年纪尚轻，若是每日将稀世珍物作为饲料喂之，便可迅丰满其毛羽，壮其体力。",
      "level": 2
    },
    {
      "id": "73.4",
      "text": "听说这幼雏乃是数十只卵中仅存一枚，可想而知其精气独钟，难怪其余之卵尽数夭亡啊。”",
      "level": 2
    },
    {
      "id": "73.5",
      "text": "主人听罢这一番话，整个人傻愣在了那里，随即问道：“你说这两只鸡可制伏那蜈蚣精，但这两只鸡乃普通家禽，没有特异之处啊！”",
      "level": 2
    },
    {
      "id": "73.6",
      "text": "客人微微一笑：“这你就有所不知了，普通家养之鸡，皆为眼皮上掩，这两只鸡则恰恰相反，此目名为怒晴，此鸡实为凤种。”",
      "level": 2
    },
    {
      "id": "73.7",
      "text": "说罢，客人便带着这两只鸡由山路走了。",
      "level": 2
    },
    {
      "id": "74",
      "text": "过了一段时日，一天客人带着这两只鸡来看望主人，主人见那只幼雏已然长大，无论体形还是姿态，居然都和老雄十分相似。",
      "level": 1
    },
    {
      "id": "74.1",
      "text": "客人住下后每日给雄鸡饲以精食，直到某天暮色微降，少室山上又浮现出那两道红光，客人看到后满脸喜悦地招呼主人从屋中走出，“那妖怪又出来了！我带凤种去制伏它。”",
      "level": 2
    },
    {
      "id": "74.2",
      "text": "说完携鸡便往门外走。",
      "level": 2
    },
    {
      "id": "74.3",
      "text": "主人随后跟上，想去看个究竟，被客人拦住了脚步。“山顶之处妖气凝重，你乃一介山民，不知其中厉害，倘若中了剧毒，性命万难保全。”",
      "level": 2
    },
    {
      "id": "74.4",
      "text": "客人说完，转身上了山去。",
      "level": 2
    },
    {
      "id": "74.5",
      "text": "主人听了客人之语，留在家中抬头看着山巅，仔细观察所生的事情。",
      "level": 2
    },
    {
      "id": "75",
      "text": "过了不久，主人看到少室山上那两道红光好似燃烧起来一般，其红愈鲜艳，瞬间变得像两股擎天闪电一样时闪时烁，一会儿蹿向东南，一会蹿到西北，有时上下起伏，有时宛然缠绕，分分合合，若即若离。",
      "level": 1
    },
    {
      "id": "75.1",
      "text": "一会儿变成一个圆环的形状围于山顶，一会儿变成一根木棒模样笔直伸缩，或像雄鹰盘旋一样围转，或像鱼跃龙门一样激奋，时而旋转着慢慢停了下来，时而穿行着骤然停止，其形亦迷亦幻，虚实不定。",
      "level": 2
    },
    {
      "id": "76",
      "text": "主人为眼前所看到的景象惊得目瞪口呆，这时忽然见其中那段较短的红光一阵剧烈的上下翻腾，好似要挣脱束缚一样，然后变为笔直的一条光柱，倾斜着疾驰而下，半明半灭，落入山中，顿时山上冒出一道五色光芒，瞬间消逝无踪。",
      "level": 1
    },
    {
      "id": "76.1",
      "text": "主人心中窃喜，心想必定是那妖怪已被歼灭。",
      "level": 2
    },
    {
      "id": "76.2",
      "text": "再抬头观望，见还有一道红光飘于山顶，忽左忽右，忽高忽低，知此乃老妖之气，看起来已经气渐低迷，估计是要落荒而逃了。",
      "level": 2
    },
    {
      "id": "76.3",
      "text": "果不其然，一会儿的工夫，另一道红光就好似一片惨落的树叶，在空中任由狂风摧残，萧瑟飘荡，慢慢地堕入山中荒地处。",
      "level": 2
    },
    {
      "id": "76.4",
      "text": "到此，两道红光都以悉数灭绝。",
      "level": 2
    },
    {
      "id": "77",
      "text": "清晨时分，东方渐渐亮了起来，主人知两妖已除，早就备好了饭食准备接待客人。",
      "level": 1
    },
    {
      "id": "77.1",
      "text": "这时见客人左臂抱着两只鸡，右手提着一段树条缓缓地走入屋内，树条上穿着两只蜈蚣，一大一小。",
      "level": 2
    },
    {
      "id": "77.2",
      "text": "主人迎上前去说道：“知道你大功告成，所以特...",
      "level": 2
    }
  ],
  "concepts": [
    {
      "name": "鬼吹灯",
      "frequency": 1,
      "context": "Title of the document"
    },
    {
      "name": "盗墓",
      "frequency": 13,
      "context": "Central theme of the narrative, involving the act of digging up ancient tombs for treasures."
    },
    {
      "name": "马王爷",
      "frequency": 11,
      "context": "The main character, an experienced tomb raider known for his keen eyesight."
    },
    {
      "name": "淤泥河",
      "frequency": 4,
      "context": "The location where the tomb raiding takes place, described as a treacherous river."
    },
    {
      "name": "古墓",
      "frequency": 11,
      "context": "Refers to ancient tombs, the primary targets of the characters."
    },
    {
      "name": "军阀",
      "frequency": 1,
      "context": "Contextualizes the chaotic political situation in the early Republic of China."
    },
    {
      "name": "乱世",
      "frequency": 3,
      "context": "Describes the period of chaos and warfare during the early Republic of China."
    },
    {
      "name": "老北风",
      "frequency": 7,
      "context": "One of Ma Wangye's companions, skilled in explosives."
    },
    {
      "name": "费无忌",
      "frequency": 7,
      "context": "One of Ma Wangye's companions, strong and adept at opening coffins."
    },
    {
      "name": "土炮",
      "frequency": 4,
      "context": "Explosive devices used to breach tomb walls."
    },
    {
      "name": "诅咒",
      "frequency": 2,
      "context": "A mystical threat encountered by the tomb raiders on a tombstone."
    },
    {
      "name": "石碑",
      "frequency": 4,
      "context": "An inscribed stone found inside the tomb, bearing a curse."
    },
    {
      "name": "魁星",
      "frequency": 2,
      "context": "A deity associated with luck and warding off evil, invoked by the tomb raiders through their attire."
    },
    {
      "name": "避口",
      "frequency": 2,
      "context": "A superstitious practice among tomb raiders to avoid uttering inauspicious words."
    },
    {
      "name": "棺材",
      "frequency": 8,
      "context": "The main container within the tomb, holding treasures and later, the mystery of the missing body."
    },
    {
      "name": "尸骸",
      "frequency": 1,
      "context": "Refers to the skeletal remains of the deceased."
    },
    {
      "name": "宝物",
      "frequency": 2,
      "context": "The valuable items found within the tomb."
    },
    {
      "name": "马家",
      "frequency": 10,
      "context": "The family of Ma Wangye, involved in his posthumous arrangements."
    },
    {
      "name": "罗司令",
      "frequency": 7,
      "context": "A sworn brother of Ma Wangye, a powerful bandit leader who intervenes after Ma's death."
    },
    {
      "name": "僵尸",
      "frequency": 5,
      "context": "A supernatural entity feared by the characters, associated with reanimated corpses."
    },
    {
      "name": "神农架",
      "frequency": 4,
      "context": "A mysterious and legendary mountainous region in China."
    },
    {
      "name": "驴头狼",
      "frequency": 4,
      "context": "A mythical creature described as a hybrid of a donkey and a wolf."
    },
    {
      "name": "怒晴鸡",
      "frequency": 6,
      "context": "A mythical bird described as a phoenix species, capable of combating supernatural creatures."
    },
    {
      "name": "蜈蚣精",
      "frequency": 4,
      "context": "Supernatural centipedes that are enemies of the 'nuqing ji'."
    }
  ],
  "relations": [
    {
      "source": "马王爷",
      "target": "老北风",
      "type": "part_of_group"
    },
    {
      "source": "马王爷",
      "target": "费无忌",
      "type": "part_of_group"
    },
    {
      "source": "老北风",
      "target": "土炮",
      "type": "uses"
    },
    {
      "source": "马王爷",
      "target": "淤泥河",
      "type": "locates_in"
    },
    {
      "source": "淤泥河",
      "target": "古墓",
      "type": "contains"
    },
    {
      "source": "古墓",
      "target": "石碑",
      "type": "contains"
    },
    {
      "source": "石碑",
      "target": "诅咒",
      "type": "states"
    },
    {
      "source": "马王爷",
      "target": "宝物",
      "type": "seeks"
    },
    {
      "source": "马王爷",
      "target": "马家",
      "type": "is_head_of"
    },
    {
      "source": "马王爷",
      "target": "罗司令",
      "type": "sworn_brother_of"
    },
    {
      "source": "马家",
      "target": "僵尸",
      "type": "fears"
    },
    {
      "source": "罗司令",
      "target": "马王爷",
      "type": "searches_for_corpse_of"
    },
    {
      "source": "怒晴鸡",
      "target": "蜈蚣精",
      "type": "fights"
    },
    {
      "source": "神农架",
      "target": "驴头狼",
      "type": "inhabited_by"
    },
    {
      "source": "神农架",
      "target": "神农四宝",
      "type": "contains"
    },
    {
      "source": "驴头狼",
      "target": "沙犷",
      "type": "similar_to"
    },
    {
      "source": "苏联",
      "target": "地球望远镜计划",
      "type": "developed"
    },
    {
      "source": "地球望远镜计划",
      "target": "地底世界",
      "type": "explores"
    }
  ],
  "hierarchy": {
    "main_topics": [
      "Chapter 1: The Rise of the Republic and the Opportunity for Tomb Raiding",
      "Chapter 2: The Unveiling of the Tomb and the Curse",
      "Chapter 3: The Rituals and the Ill Omen",
      "Chapter 4: The Strange Discovery in the Coffin",
      "Chapter 5: The Disappearance and the Bloody Scene",
      "Chapter 6: The Desperate Measures and the Mysterious Grasp",
      "Chapter 7: The Escape and the Lingering Madness",
      "Chapter 8: The Will and the Peculiar Burial",
      "Chapter 9: The Friends' Arrival and the Unearthing",
      "Chapter 10: The Movement and the Growing Fear",
      "Chapter 11: The Confrontation and the Unveiling of a Strange Form",
      "Chapter 13: The 'Li Zhong' - A Tale of Cannibalism and Cruelty",
      "Chapter 14: The 'Lü Tou Lang' - Mythical Beasts of Shennongjia",
      "Chapter 15: The 'Earth Telescope' Project - Soviet Exploration of the Depths",
      "Chapter 17: The 'Nu Qing Ji' - Legend of the Fiery Birds",
      "Chapter 18: The Battle Against the Centipede Spirits",
      "Chapter 19: The Victory and the Aftermath"
    ],
    "structure": "The document is structured as a series of chapters, detailing the narrative of tomb raiding, supernatural encounters, mysterious deaths, and posthumous events. It also includes sections that delve into folklore and scientific speculation related to mythical creatures and deep earth exploration. The narrative progresses chronologically from the initial tomb raid to the aftermath and subsequent legends."
  }
}