{
  "propositions": [
    {
      "id": "1",
      "text": "The protagonist discovers she is not the biological child of her parents.",
      "level": 1
    },
    {
      "id": "1.1",
      "text": "On her 18th birthday, her parents reveal they found her as a baby and raised her.",
      "level": 2
    },
    {
      "id": "2",
      "text": "The protagonist is identified as the heir of the Phoenix clan.",
      "level": 1
    },
    {
      "id": "2.1",
      "text": "Her true heritage is linked to the Phoenix clan, a lineage with strict rules against female succession.",
      "level": 2
    },
    {
      "id": "2.2",
      "text": "Despite being female, she is chosen to bear the responsibility of the Phoenix legacy.",
      "level": 2
    },
    {
      "id": "3",
      "text": "The protagonist faces life-threatening challenges and supernatural experiences.",
      "level": 1
    },
    {
      "id": "3.1",
      "text": "She encounters a near-death experience in a bathroom with mysterious water currents.",
      "level": 2
    },
    {
      "id": "3.2",
      "text": "She is saved by a mysterious figure during a water crisis, symbolizing her awakening as the Phoenix female.",
      "level": 2
    },
    {
      "id": "4",
      "text": "The protagonist begins training under a mentor to learn the Phoenix clan's traditions.",
      "level": 1
    },
    {
      "id": "4.1",
      "text": "Her mentor, a senior member of the clan, introduces her to ancient magic and secret arts.",
      "level": 2
    },
    {
      "id": "5",
      "text": "The protagonist is introduced to the Night Kingdom and its political intricacies.",
      "level": 1
    },
    {
      "id": "5.1",
      "text": "She enters the royal palace and learns of her mission as the Phoenix female.",
      "level": 2
    },
    {
      "id": "5.2",
      "text": "She uncovers conspiracies within the court that threaten her life.",
      "level": 2
    },
    {
      "id": "6",
      "text": "The protagonist faces personal and political trials.",
      "level": 1
    },
    {
      "id": "6.1",
      "text": "She undergoes a trial to find an antidote for a poison affecting her.",
      "level": 2
    },
    {
      "id": "6.2",
      "text": "She is confronted with a marriage proposal tied to political alliances in the Night Kingdom.",
      "level": 2
    }
  ],
  "concepts": [
    {
      "name": "Phoenix Clan",
      "frequency": 10,
      "context": "A mystical lineage with strict inheritance rules, central to the protagonist's identity."
    },
    {
      "name": "Night Kingdom",
      "frequency": 8,
      "context": "The political and cultural setting where the protagonist's mission unfolds."
    },
    {
      "name": "Phoenix Female",
      "frequency": 12,
      "context": "The title given to the protagonist, symbolizing her role as the chosen heir."
    },
    {
      "name": "Awakening",
      "frequency": 5,
      "context": "The process of the protagonist realizing and accepting her powers and destiny."
    },
    {
      "name": "Mentor",
      "frequency": 6,
      "context": "A guiding figure who teaches the protagonist the traditions and magic of the Phoenix clan."
    }
  ],
  "relations": [
    {
      "source": "Phoenix Female",
      "target": "Phoenix Clan",
      "type": "is_a"
    },
    {
      "source": "Phoenix Female",
      "target": "Night Kingdom",
      "type": "part_of"
    },
    {
      "source": "Phoenix Female",
      "target": "Awakening",
      "type": "implies"
    },
    {
      "source": "Mentor",
      "target": "Phoenix Clan",
      "type": "part_of"
    },
    {
      "source": "Phoenix Female",
      "target": "Mentor",
      "type": "guided_by"
    }
  ],
  "hierarchy": {
    "main_topics": [
      "Identity Revelation",
      "Phoenix Heritage",
      "Challenges and Awakening",
      "Training and Mentorship",
      "Political Intrigues",
      "Personal Trials"
    ],
    "structure": "The document is structured as a narrative with a clear progression from personal revelation to supernatural awakening, mentorship, and political involvement, divided into chapters within a volume."
  }
}