{
  "propositions": [
    {
      "id": "1",
      "text": "Gnosis 语境下的“复活夜”",
      "level": 1
    },
    {
      "id": "1.1",
      "text": "2009年，《人间》（中）卷，复活夜。",
      "level": 2
    },
    {
      "id": "1.2",
      "text": "“你到底有没有在听我说话？我要报警了！”",
      "level": 3
    },
    {
      "id": "1.3",
      "text": "“你别以为我就不知道你是谁……我告诉你，我……”",
      "level": 3
    },
    {
      "id": "1.4",
      "text": "2009年9月，我写了《人间》（中）卷，复活夜。",
      "level": 2
    },
    {
      "id": "1.5",
      "text": "“你在听我说话吗？”",
      "level": 3
    },
    {
      "id": "1.6",
      "text": "“你真以为我就不知道你是谁？我告诉你，我是……但是……我是……”",
      "level": 3
    },
    {
      "id": "1.7",
      "text": "“好吧，好吧，我知道了。但是，你怎么……你……但是，我……你也知道……你……但是我……但是，你也知道……你……虽然……可是，我也知道……但是，你……但是，你也知道……你……你……所以……所以，你……虽然，你也知道……你也知道……你就知道……我就知道……你就知道……你……所以，你也知道……所以，你也知道……你就知道……你……但是，我也知道……但是，你也知道……你就知道……你也知道……我就知道……你也知道……你……所以……所以，你也知道……我也知道……你也知道……你也知道……我就知道……你也知道……你……所以……所以，你也知道……我也知道……你也知道……你也知道……我就知道……你也知道……你……所以……所以，你也知道……我也知道……你也知道……你也知道……我就知道……你也知道……你……所以……所以，你也知道……我也知道……你也知道……你也知道……我就知道……你也知道……你……所以……所以，你也知道……我也知道……你也知道……你也知道……我就知道……你也知道……你……所以……所以，你也知道……我也知道……你也知道……你也知道……我就知道……你也知道……你……所以……所以，你也知道……我也知道……你也知道……你也知道……我就知道……你也知道……你……所以……所以，你也知道……我也知道……你也知道……你也知道……我就知道……你也知道……你……所以……所以，你也知道……我也知道……你也知道……你也知道……我就知道……你也知道……你……所以……所以，你也知道……我也知道……你也知道……你也知道……我就知道……你也知道……你……所以……所以，你也知道……我也知道……你也知道……你也知道……我就知道……你也知道……你……所以……所以，你也知道……我也知道……你也知道……你也知道……我就知道……你也知道……你……所以……所以，你也知道……我也知道……你也知道……你也知道……我就知道……你也知道……你……所以……所以，你也知道……我也知道……你也知道……你也知道……我就知道……你也知道……你……所以……所以，你也知道……我也知道……你也知道……你也知道……我就知道……你也知道……你……所以……所以，你也知道……我也知道……你也知道……你也知道……我就知道……你也知道……你……所以……所以，你也知道……我也知道……你也知道……你也知道……我就知道……你也知道……你……所以……所以，你也知道……我也知道……你也知道……你也知道……我就知道……你也知道……你……所以……所以，你也知道……我也知道……你也知道……你也知道……我就知道……你也知道……你……所以……所以，你也知道……我也知道……你也知道……你也知道……我就知道……你也知道……你……所以……所以，你也知道……我也知道……你也知道……你也知道……我就知道……你也知道……你……所以……所以，你也知道……我也知道……你也知道……你也知道……我就知道……你也知道……你……所以……所以，你也知道……我也知道……你也知道……你也知道……我就知道……你也知道……你……所以……所以，你也知道……我也知道……你也知道……你也知道……我就知道……你也知道……你……所以……所以，你也知道……我也知道……你也知道……你也知道……我就知道……你也知道……你……所以……所以，你也知道……我也知道……你也知道……你也知道……我就知道……你也知道……你……所以……所以，你也知道……我也知道……你也知道……你也知道……我就知道……你也知道……你……所以……所以，你也知道……我也知道……你也知道……你也知道……我就知道……你也知道……你……所以……所以，你也知道……我也知道……你也知道……你也知道……我就知道……你也知道……你……所以……所以，你也知道……我也知道……你也知道……你也知道……我就知道……你也知道……你……所以……所以，你也知道……我也知道……你也知道……你也知道……我就知道……你也知道……你……所以……所以，你也知道……我也知道……你也知道……你也知道……我就知道……你也知道……你……所以……所以，你也知道……我也知道……你也知道……你也知道……我就知道……你也知道……你……所以……所以，你也知道……我也知道……你也知道……你也知道……我就知道……你也知道……你……所以……所以，你也知道……我也知道……你也知道……你也知道……我就知道……你也知道……你……所以……所以，你也知道……我也知道……你也知道……你也知道……我就知道……你也知道……你……所以……所以，你也知道……我也知道……你也知道……你也知道……我就知道……你也知道……你……所以……所以，你也知道……我也知道……你也知道……你也知道……我就知道……你也知道……你……所以……所以，你也知道……我也知道……你也知道……你也知道……我就知道……你也知道……你……所以……所以，你也知道……我也知道……你也知道……你也知道……我就知道……你也知道……你……所以……所以，你也知道……我也知道……你也知道……你也知道……我就知道……你也知道……你……所以……",
      "level": 4
    }
  ],
  "concepts": [
    {
      "name": "Gnosis",
      "frequency": 1,
      "context": "Gnosis 语境下的“复活夜”"
    },
    {
      "name": "复活夜",
      "frequency": 2,
      "context": "Gnosis 语境下的“复活夜”\n2009年，《人间》（中）卷，复活夜。"
    },
    {
      "name": "人间",
      "frequency": 2,
      "context": "《人间》（中）卷\n《人间》（中）卷"
    },
    {
      "name": "2009年",
      "frequency": 2,
      "context": "2009年，《人间》（中）卷，复活夜。\n2009年9月，我写了《人间》（中）卷，复活夜。"
    },
    {
      "name": "报警",
      "frequency": 1,
      "context": "“你到底有没有在听我说话？我要报警了！”"
    },
    {
      "name": "我",
      "frequency": 12,
      "context": "“你到底有没有在听我说话？我要报警了！”\n“你别以为我就不知道你是谁……我告诉你，我……”\n“你真以为我就不知道你是谁？我告诉你，我是……但是……我是……”\n“好吧，好吧，我知道了。但是，你怎么……你……但是，我……你也知道……你……但是我……但是，你也知道……你……虽然……可是，我也知道……但是，你……但是，你也知道……你……你……所以……所以，你……虽然，你也知道……你也知道……你就知道……我就知道……你就知道……你……所以，你也知道……所以，你也知道……你就知道……你……但是，我也知道……但是，你也知道……你就知道……你也知道……我就知道……你也知道……你……所以……所以，你也知道……我也知道……你也知道……你也知道……我就知道……你也知道……你……所以……"
    },
    {
      "name": "你",
      "frequency": 20,
      "context": "“你到底有没有在听我说话？我要报警了！”\n“你别以为我就不知道你是谁……我告诉你，我……”\n“你真以为我就不知道你是谁？我告诉你，我是……但是……我是……”\n“好吧，好吧，我知道了。但是，你怎么……你……但是，我……你也知道……你……但是我……但是，你也知道……你……虽然……可是，我也知道……但是，你……但是，你也知道……你……你……所以……所以，你……虽然，你也知道……你也知道……你就知道……我就知道……你就知道……你……所以，你也知道……所以，你也知道……你就知道……你……但是，我也知道……但是，你也知道……你就知道……你也知道……我就知道……你也知道……你……所以……所以，你也知道……我也知道……你也知道……你也知道……我就知道……你也知道……你……所以……"
    },
    {
      "name": "知道",
      "frequency": 10,
      "context": "“好吧，好吧，我知道了。但是，你怎么……你……但是，我……你也知道……你……但是我……但是，你也知道……你……虽然……可是，我也知道……但是，你……但是，你也知道……你……你……所以……所以，你……虽然，你也知道……你也知道……你就知道……我就知道……你就知道……你……所以，你也知道……所以，你也知道……你就知道……你……但是，我也知道……但是，你也知道……你就知道……你也知道……我就知道……你也知道……你……所以……所以，你也知道……我也知道……你也知道……你也知道……我就知道……你也知道……你……所以……"
    },
    {
      "name": "但是",
      "frequency": 10,
      "context": "“好吧，好吧，我知道了。但是，你怎么……你……但是，我……你也知道……你……但是我……但是，你也知道……你……虽然……可是，我也知道……但是，你……但是，你也知道……你……你……所以……所以，你……虽然，你也知道……你也知道……你就知道……我就知道……你就知道……你……所以，你也知道……所以，你也知道……你就知道……你……但是，我也知道……但是，你也知道……你就知道……你也知道……我就知道……你也知道……你……所以……所以，你也知道……我也知道……你也知道……你也知道……我就知道……你也知道……你……所以……"
    },
    {
      "name": "所以",
      "frequency": 10,
      "context": "“好吧，好吧，我知道了。但是，你怎么……你……但是，我……你也知道……你……但是我……但是，你也知道……你……虽然……可是，我也知道……但是，你……但是，你也知道……你……你……所以……所以，你……虽然，你也知道……你也知道……你就知道……我就知道……你就知道……你……所以，你也知道……所以，你也知道……你就知道……你……但是，我也知道……但是，你也知道……你就知道……你也知道……我就知道……你也知道……你……所以……所以，你也知道……我也知道……你也知道……你也知道……我就知道……你也知道……你……所以……"
    }
  ],
  "relations": [
    {
      "source": "2009年",
      "target": "人间",
      "type": "part_of"
    },
    {
      "source": "2009年",
      "target": "复活夜",
      "type": "part_of"
    },
    {
      "source": "Gnosis",
      "target": "复活夜",
      "type": "context_of"
    },
    {
      "source": "我",
      "target": "写",
      "type": "agent_of"
    },
    {
      "source": "我",
      "target": "知道",
      "type": "agent_of"
    },
    {
      "source": "你",
      "target": "知道",
      "type": "agent_of"
    },
    {
      "source": "但是",
      "target": "知道",
      "type": "contrast_with"
    },
    {
      "source": "所以",
      "target": "知道",
      "type": "consequence_of"
    }
  ],
  "hierarchy": {
    "main_topics": [
      "Gnosis 语境下的“复活夜”"
    ],
    "structure": "The document begins with a title and a subtitle indicating a specific context ('Gnosis') for the topic ('Resurrection Night'). It then presents quoted dialogue, followed by a direct statement about the author and the writing of 'Resurrection Night' in 2009. The dialogue that follows becomes repetitive and seems to explore the nuances of knowing and being known, with a recurring pattern of 'you know' and 'I know', and connectives like 'but' and 'so'. The extensive repetition of similar phrases suggests a focus on the act of communication, understanding, and potential miscommunication."
  }
}