{
  "propositions": [
    {
      "id": "1",
      "text": "This document contains the story \"人皮信封\" by 狼七.",
      "level": 1
    },
    {
      "id": "1.1",
      "text": "The story is available online at http://www.xiaoshuotxt.com/xuanyi/7100/",
      "level": 2
    },
    {
      "id": "1.2",
      "text": "The website http://www.xiaoshuotxt.com is described as a literary website.",
      "level": 2
    },
    {
      "id": "1.3",
      "text": "The website offers classic literary masterpieces, martial arts novels, romance novels, and humanities and social science books for online reading.",
      "level": 2
    },
    {
      "id": "1.4",
      "text": "TXT e-books are available for free download and reading on mobile phones.",
      "level": 2
    },
    {
      "id": "2",
      "text": "Chapter 1 is titled \"楔子\" (Prologue).",
      "level": 1
    },
    {
      "id": "2.1",
      "text": "The narrator hesitates to write about their experiences and observations.",
      "level": 2
    },
    {
      "id": "2.2",
      "text": "The narrator finally gathers the courage to record everything after a person involved in the matter passes away.",
      "level": 2
    },
    {
      "id": "2.3",
      "text": "The narrator claims the events are true, even if they seem unbelievable.",
      "level": 2
    },
    {
      "id": "2.4",
      "text": "The narrator's life was ordinary and peaceful about a year ago.",
      "level": 2
    },
    {
      "id": "2.5",
      "text": "A specific event changed the narrator's life.",
      "level": 2
    },
    {
      "id": "2.6",
      "text": "Friends told the narrator that the story would either mean they are crazy or it only happens in stories.",
      "level": 2
    },
    {
      "id": "3",
      "text": "Chapter 2 is titled \"初涉邮差(1)\" (First Steps as a Postman (1)).",
      "level": 1
    },
    {
      "id": "3.1",
      "text": "The narrator's name is Luo Ze.",
      "level": 2
    },
    {
      "id": "3.2",
      "text": "Luo Ze was a postman until about six months prior to the current narration.",
      "level": 2
    },
    {
      "id": "3.3",
      "text": "After graduating from high school, Luo Ze took a job as a postman in a poor county in Chengde.",
      "level": 2
    },
    {
      "id": "3.4",
      "text": "Luo Ze's delivery route was in the mountainous areas of the county.",
      "level": 2
    },
    {
      "id": "3.5",
      "text": "Luo Ze's first bicycle was old and in poor condition.",
      "level": 2
    },
    {
      "id": "3.6",
      "text": "The conditions of the job were described as difficult.",
      "level": 2
    },
    {
      "id": "3.7",
      "text": "Five people were hired as postmen at the same time.",
      "level": 2
    },
    {
      "id": "3.8",
      "text": "The postmen were described as 'three-no' personnel: no insurance, no subsidies, and no wives.",
      "level": 2
    },
    {
      "id": "3.9",
      "text": "The county had poor transportation due to the mountains, making postmen a vital link to the outside world.",
      "level": 2
    },
    {
      "id": "3.10",
      "text": "On the first day, the director gave Luo Ze a tattered map.",
      "level": 2
    },
    {
      "id": "3.11",
      "text": "The director, Mr. Wang, was a middle-aged man with a stern expression, known as 'Fatty Wang' by others.",
      "level": 2
    },
    {
      "id": "3.12",
      "text": "Mr. Wang asked Luo Ze if he could understand the map.",
      "level": 2
    },
    {
      "id": "3.13",
      "text": "Luo Ze, needing the job, nodded and said he understood.",
      "level": 2
    },
    {
      "id": "3.14",
      "text": "Luo Ze's postman life began.",
      "level": 2
    },
    {
      "id": "3.15",
      "text": "Luo Ze worked for about a month, sometimes staying overnight in abandoned villages due to long delivery distances.",
      "level": 2
    },
    {
      "id": "3.16",
      "text": "When Luo Ze went to get his contract for full-time employment, the other four new postmen were dejected.",
      "level": 2
    },
    {
      "id": "3.17",
      "text": "Cao Laonian, a colleague of Luo Ze, stopped him and warned him not to deliver a red envelope.",
      "level": 2
    },
    {
      "id": "3.18",
      "text": "Luo Ze knocked on the director's door.",
      "level": 2
    },
    {
      "id": "3.19",
      "text": "Mr. Wang appeared to smile, but it made Luo Ze uneasy.",
      "level": 2
    },
    {
      "id": "3.20",
      "text": "Luo Ze presented his contract for signature.",
      "level": 2
    },
    {
      "id": "3.21",
      "text": "Mr. Wang explained that there was a shortage of staff and presented Luo Ze with a red envelope to deliver.",
      "level": 2
    },
    {
      "id": "3.22",
      "text": "Mr. Wang promised Luo Ze would be made permanent if he delivered the letter.",
      "level": 2
    },
    {
      "id": "3.23",
      "text": "Cao Laonian's prediction came true.",
      "level": 2
    },
    {
      "id": "3.24",
      "text": "Luo Ze felt he had no choice but to accept the job, given its importance.",
      "level": 2
    },
    {
      "id": "3.25",
      "text": "The red envelope had a peculiar, smooth texture, a one-yuan stamp, and no sender's address.",
      "level": 2
    },
    {
      "id": "3.26",
      "text": "The recipient's address was written in calligraphy: Bei Gua Village, Group 3, Zeng Hao.",
      "level": 2
    },
    {
      "id": "3.27",
      "text": "Luo Ze asked about the unfamiliar location.",
      "level": 2
    },
    {
      "id": "3.28",
      "text": "Mr. Wang told him to ask Cao Laonian and the others.",
      "level": 2
    },
    {
      "id": "3.29",
      "text": "Luo Ze left the office, and Cao Laonian rushed up to him.",
      "level": 2
    },
    {
      "id": "3.30",
      "text": "Cao Laonian saw the red envelope and realized Luo Ze had accepted.",
      "level": 2
    },
    {
      "id": "3.31",
      "text": "The other four postmen looked at Luo Ze with strange expressions, shifting from surprise to satisfaction.",
      "level": 2
    },
    {
      "id": "3.32",
      "text": "Cao Laonian declared Luo Ze was \"finished\" and walked away.",
      "level": 2
    },
    {
      "id": "3.33",
      "text": "Luo Ze felt an eerie chill and suspected something was amiss.",
      "level": 2
    },
    {
      "id": "3.34",
      "text": "Cao Laonian found Luo Ze later to invite him to a farewell dinner.",
      "level": 2
    },
    {
      "id": "3.35",
      "text": "The dinner atmosphere was tense and somber.",
      "level": 2
    },
    {
      "id": "3.36",
      "text": "Cao Laonian warned Luo Ze to be careful going to Bei Gua Village.",
      "level": 2
    },
    {
      "id": "3.37",
      "text": "Cao Laonian explained that Bei Gua Village was considered \"evil\" and \"unclean,\" which is why no one wanted to go there.",
      "level": 2
    },
    {
      "id": "3.38",
      "text": "Luo Ze initially dismissed their warnings.",
      "level": 2
    },
    {
      "id": "3.39",
      "text": "Du Wei, another colleague, shared a story passed down from his father, a former postman.",
      "level": 2
    },
    {
      "id": "3.40",
      "text": "Du Wei's father had a traumatic experience after delivering a letter to an unknown place.",
      "level": 2
    },
    {
      "id": "3.41",
      "text": "After the delivery, Du Wei's father became reclusive, preferring to go out at night, and would often wake up screaming, \"Don't kill me.\"",
      "level": 2
    },
    {
      "id": "3.42",
      "text": "Du Wei's father eventually quit his job and became a taxi driver.",
      "level": 2
    },
    {
      "id": "3.43",
      "text": "He died in a taxi accident soon after starting.",
      "level": 2
    },
    {
      "id": "3.44",
      "text": "Du Wei's father's dying wish was for his son never to become a postman.",
      "level": 2
    },
    {
      "id": "3.45",
      "text": "Du Wei revealed that the destination of his father's last delivery was Bei Gua Village.",
      "level": 2
    },
    {
      "id": "3.46",
      "text": "Cao Laonian offered Luo Ze expensive cigarettes, implying it was a final gesture.",
      "level": 2
    },
    {
      "id": "3.47",
      "text": "After dinner, Luo Ze accompanied Cao Laonian home.",
      "level": 2
    },
    {
      "id": "3.48",
      "text": "Cao Laonian revealed he had faked his drunkenness to trick the others.",
      "level": 2
    },
    {
      "id": "3.49",
      "text": "Cao Laonian took Luo Ze to his home and gave him a mysterious item wrapped in newspaper.",
      "level": 2
    },
    {
      "id": "3.50",
      "text": "The item was a small, black box with strange carvings, left by Cao Laonian's deceased father.",
      "level": 2
    },
    {
      "id": "3.51",
      "text": "Inside the box was a black stone that resembled solidified pitch.",
      "level": 2
    },
    {
      "id": "3.52",
      "text": "Cao Laonian recounted his father's story of how he found the stone.",
      "level": 2
    },
    {
      "id": "3.53",
      "text": "His father, while scavenging for valuables in a tomb, was trapped when the entrance was blocked.",
      "level": 2
    },
    {
      "id": "3.54",
      "text": "He found a small passage and crawled through, hearing the sound of water.",
      "level": 2
    },
    {
      "id": "3.55",
      "text": "The water turned into a powerful underground river.",
      "level": 2
    },
    {
      "id": "3.56",
      "text": "His father eventually escaped through a cave opening, only to find himself at a cliff edge.",
      "level": 2
    },
    {
      "id": "3.57",
      "text": "He jumped and landed on a platform in a large cave filled with animal skins and bones.",
      "level": 2
    },
    {
      "id": "3.58",
      "text": "He heard rustling sounds and discovered a stone coffin with strange carvings and several jars nearby.",
      "level": 2
    },
    {
      "id": "3.59",
      "text": "The jars contained \"Yuan Datou\" silver coins, and the last one held the black box.",
      "level": 2
    },
    {
      "id": "3.60",
      "text": "Cao Laonian's father kept the box as a treasure.",
      "level": 2
    },
    {
      "id": "3.61",
      "text": "Cao Laonian's father later worked at a power plant near an artificial lake.",
      "level": 2
    },
    {
      "id": "3.62",
      "text": "Villagers avoided the lake, and people had gone missing from it.",
      "level": 2
    },
    {
      "id": "3.63",
      "text": "Cao Laonian's father was warned by a friend, Sun Erhu, not to swim in the lake.",
      "level": 2
    },
    {
      "id": "3.64",
      "text": "While swimming, Cao Laonian's father felt the water become extremely cold, and his legs went numb.",
      "level": 2
    },
    {
      "id": "3.65",
      "text": "He found himself alone in the water, with thick black fog rising and a spectral white boat appearing.",
      "level": 2
    },
    {
      "id": "3.66",
      "text": "He was unable to move, but a light from beneath him grew brighter.",
      "level": 2
    },
    {
      "id": "3.67",
      "text": "The white boat disappeared, and he was pulled towards the surface.",
      "level": 2
    },
    {
      "id": "3.68",
      "text": "Upon reaching the shore, he realized the light that saved him came from the black stone he carried.",
      "level": 2
    },
    {
      "id": "3.69",
      "text": "Cao Laonian's father cherished the stone afterward until his death.",
      "level": 2
    },
    {
      "id": "3.70",
      "text": "Cao Laonian gives the stone to Luo Ze, advising him to be careful and that he would explain more if Luo Ze returned.",
      "level": 2
    },
    {
      "id": "3.71",
      "text": "Luo Ze, feeling uneasy, examines the red envelope and the stone.",
      "level": 2
    },
    {
      "id": "3.72",
      "text": "The next morning, Luo Ze sets out for Bei Gua Village, feeling somewhat prepared.",
      "level": 2
    },
    {
      "id": "3.73",
      "text": "The journey becomes difficult as rain starts and the roads turn to mountain paths.",
      "level": 2
    },
    {
      "id": "3.74",
      "text": "Luo Ze leaves his bicycle at a substation in Daqi and continues on foot.",
      "level": 2
    },
    {
      "id": "3.75",
      "text": "Bei Gua Village is surrounded by barren mountains, with a narrow valley overgrown with weeds.",
      "level": 2
    },
    {
      "id": "3.76",
      "text": "Luo Ze is suddenly attacked by a small, dark, snake-like creature that bites his leg.",
      "level": 2
    },
    {
      "id": "3.77",
      "text": "The creature is sticky and difficult to remove.",
      "level": 2
    },
    {
      "id": "3.78",
      "text": "The bite causes a sharp, piercing pain.",
      "level": 2
    },
    {
      "id": "3.79",
      "text": "Luo Ze tries to fight back with a sharp stone.",
      "level": 2
    },
    {
      "id": "3.80",
      "text": "The creature exhibits exceptional jumping ability.",
      "level": 2
    },
    {
      "id": "3.81",
      "text": "Luo Ze realizes the creature is legless and moves by coiling and jumping.",
      "level": 2
    },
    {
      "id": "3.82",
      "text": "The creature taps its tail rhythmically on the ground, seemingly to summon others.",
      "level": 2
    },
    {
      "id": "3.83",
      "text": "Several more of these creatures appear.",
      "level": 2
    },
    {
      "id": "3.84",
      "text": "Luo Ze's leg becomes numb and swollen.",
      "level": 2
    },
    {
      "id": "3.85",
      "text": "A \"pheasant-like\" creature suddenly appears and attacks the creatures biting Luo Ze.",
      "level": 2
    },
    {
      "id": "3.86",
      "text": "An old man appears, wearing a straw hat and a white t-shirt, carrying a short, curved knife with a dragon carving.",
      "level": 2
    },
    {
      "id": "3.87",
      "text": "The old man uses his knife to extract two black fangs from Luo Ze's wound.",
      "level": 2
    },
    {
      "id": "3.88",
      "text": "He then retrieves the flesh of one of the creatures and tells Luo Ze to eat it.",
      "level": 2
    },
    {
      "id": "3.89",
      "text": "Luo Ze finds the creature's flesh delicious and fragrant.",
      "level": 2
    },
    {
      "id": "3.90",
      "text": "The old man identifies the creatures as \"Di Kui\" and explains they live in special conditions.",
      "level": 2
    },
    {
      "id": "3.91",
      "text": "The \"pheasant\" is revealed not to be a wild pheasant.",
      "level": 2
    },
    {
      "id": "3.92",
      "text": "The old man and the \"pheasant\" collect Di Kui.",
      "level": 2
    },
    {
      "id": "3.93",
      "text": "Luo Ze learns that the Di Kui are buried in this area, along with 352 villagers from Bei Gua Village.",
      "level": 2
    },
    {
      "id": "3.94",
      "text": "The old man invites Luo Ze to stay at his home in Nan Gua Village.",
      "level": 2
    },
    {
      "id": "4",
      "text": "Chapter 4 is titled \"诡异的村庄(1)\" (The Strange Village (1)).",
      "level": 1
    },
    {
      "id": "4.1",
      "text": "Nan Gua Village has unusually high courtyard walls and imposing doorways.",
      "level": 2
    },
    {
      "id": "4.2",
      "text": "The house Luo Ze enters feels strangely familiar.",
      "level": 2
    },
    {
      "id": "4.3",
      "text": "A boy named Jin Douzi, the old man's grandson, runs out to greet him.",
      "level": 2
    },
    {
      "id": "4.4",
      "text": "Jin Douzi has large black eyes and appears energetic.",
      "level": 2
    },
    {
      "id": "4.5",
      "text": "Inside the house, they find an altar with incense and strange objects.",
      "level": 2
    },
    {
      "id": "4.6",
      "text": "Luo Ze is given dry clothes that fit him perfectly.",
      "level": 2
    },
    {
      "id": "4.7",
      "text": "The old man, identified as Jin, becomes angry when he sees bones with strange carvings that Jin Douzi drew on.",
      "level": 2
    },
    {
      "id": "4.8",
      "text": "Jin throws the carved bones into the stove.",
      "level": 2
    },
    {
      "id": "4.9",
      "text": "Jin reveals that Jin Douzi is his grandson and that Jin Douzi is actually around Luo Ze's age, despite his appearance.",
      "level": 2
    },
    {
      "id": "4.10",
      "text": "Jin recounts his daughter Hong Ying's story.",
      "level": 2
    },
    {
      "id": "4.11",
      "text": "Hong Ying married Tang Jun from Daqi Town, and Jin Douzi was born shortly after.",
      "level": 2
    },
    {
      "id": "4.12",
      "text": "Jin's family were hunters and later horse breeders.",
      "level": 2
    },
    {
      "id": "4.13",
      "text": "One day, while hunting with Hong Ying, they chased a rabbit into a graveyard.",
      "level": 2
    },
    {
      "id": "4.14",
      "text": "They entered the overgrown area and were suddenly plunged into darkness, experiencing what felt like a \"ghost wall\" (鬼打墙).",
      "level": 2
    },
    {
      "id": "4.15",
      "text": "Jin used a traditional method of biting his middle finger and waving his blood to dispel the illusion.",
      "level": 2
    },
    {
      "id": "4.16",
      "text": "He saw Hong Ying near a grave, with a dark shadow behind her.",
      "level": 2
    },
    {
      "id": "4.17",
      "text": "He rushed to her, and the shadow disappeared.",
      "level": 2
    },
    {
      "id": "4.18",
      "text": "Hong Ying was unwell and thirsty, and after waking up, she became weak.",
      "level": 2
    },
    {
      "id": "4.19",
      "text": "Strange events began to occur in Jin's home after that night.",
      "level": 2
    },
    {
      "id": "4.20",
      "text": "Jin and Tang Jun heard a strange procession with唢呐 (suona) music, gongs, and drums approaching their house at night.",
      "level": 2
    },
    {
      "id": "4.21",
      "text": "Jin realized that their village was mostly deserted, making the procession unusual.",
      "level": 2
    },
    {
      "id": "4.22",
      "text": "They extinguished the lamp and prepared to defend themselves.",
      "level": 2
    },
    {
      "id": "4.23",
      "text": "Tang Jun investigated and found nothing outside.",
      "level": 2
    },
    {
      "id": "4.24",
      "text": "The next morning, Jin discovered that one of their three water缸 (water vats) was missing, with no trace of water on the floor.",
      "level": 2
    }
  ],
  "concepts": [
    {
      "name": "人皮信封 (Human Skin Envelope)",
      "frequency": 1,
      "context": "Title of the document."
    },
    {
      "name": "狼七",
      "frequency": 1,
      "context": "Author of the document."
    },
    {
      "name": "邮差 (Postman)",
      "frequency": 14,
      "context": "The narrator's former profession and the central role in the story's beginning."
    },
    {
      "name": "信封 (Envelope)",
      "frequency": 6,
      "context": "Specifically a red envelope that plays a crucial role in the plot."
    },
    {
      "name": "北卦村 (Bei Gua Village)",
      "frequency": 7,
      "context": "A mysterious and dangerous destination for a delivery."
    },
    {
      "name": "罗泽 (Luo Ze)",
      "frequency": 15,
      "context": "The narrator and protagonist of the story."
    },
    {
      "name": "汪主任 (Director Wang)",
      "frequency": 5,
      "context": "The narrator's superior at the post office, referred to as 'Fatty Wang'."
    },
    {
      "name": "曹老蔫 (Cao Laonian)",
      "frequency": 12,
      "context": "A colleague of Luo Ze who warns him about the red envelope and provides crucial information."
    },
    {
      "name": "杜伟 (Du Wei)",
      "frequency": 6,
      "context": "A colleague of Luo Ze who shares a cautionary tale from his father."
    },
    {
      "name": "石头 (Stone)",
      "frequency": 4,
      "context": "A black stone given by Cao Laonian to Luo Ze, believed to have protective properties."
    },
    {
      "name": "地奎 (Di Kui)",
      "frequency": 7,
      "context": "Mysterious, snake-like creatures that attack Luo Ze."
    },
    {
      "name": "老头 (Old Man)",
      "frequency": 13,
      "context": "The mysterious old man in Nan Gua Village who helps Luo Ze and tells his story."
    },
    {
      "name": "金豆子 (Jin Douzi)",
      "frequency": 7,
      "context": "The grandson of the old man, who appears as a child but is revealed to be older."
    },
    {
      "name": "金 (Jin)",
      "frequency": 6,
      "context": "The surname of the old man and his family."
    },
    {
      "name": "南卦村 (Nan Gua Village)",
      "frequency": 2,
      "context": "The village where the old man lives, whose name is related to Bei Gua Village."
    },
    {
      "name": "诡异 (Strange/Eerie)",
      "frequency": 2,
      "context": "Describes the atmosphere of the village and events."
    },
    {
      "name": "故事 (Story)",
      "frequency": 6,
      "context": "Refers to the narrative being told and recounted."
    },
    {
      "name": "危险 (Danger)",
      "frequency": 3,
      "context": "Implied through warnings and encounters with creatures."
    },
    {
      "name": "神秘 (Mysterious)",
      "frequency": 5,
      "context": "Describes characters, objects, and events in the story."
    }
  ],
  "relations": [
    {
      "source": "人皮信封",
      "target": "狼七",
      "type": "written_by"
    },
    {
      "source": "罗泽",
      "target": "邮差",
      "type": "is_a"
    },
    {
      "source": "罗泽",
      "target": "信封",
      "type": "receives"
    },
    {
      "source": "汪主任",
      "target": "罗泽",
      "type": "assigns_task_to"
    },
    {
      "source": "曹老蔫",
      "target": "罗泽",
      "type": "warns"
    },
    {
      "source": "曹老蔫",
      "target": "石头",
      "type": "gives"
    },
    {
      "source": "杜伟",
      "target": "故事",
      "type": "recounts"
    },
    {
      "source": "杜伟",
      "target": "北卦村",
      "type": "links_to_danger"
    },
    {
      "source": "石头",
      "target": "辟邪",
      "type": "has_property"
    },
    {
      "source": "地奎",
      "target": "罗泽",
      "type": "attacks"
    },
    {
      "source": "老头",
      "target": "罗泽",
      "type": "helps"
    },
    {
      "source": "老头",
      "target": "故事",
      "type": "tells"
    },
    {
      "source": "金豆子",
      "target": "老头",
      "type": "is_grandson_of"
    },
    {
      "source": "金豆子",
      "target": "诡异",
      "type": "exhibits"
    },
    {
      "source": "南卦村",
      "target": "诡异",
      "type": "is"
    },
    {
      "source": "北卦村",
      "target": "危险",
      "type": "is"
    },
    {
      "source": "信封",
      "target": "北卦村",
      "type": "addressed_to"
    },
    {
      "source": "老头",
      "target": "地奎",
      "type": "collects"
    },
    {
      "source": "老头",
      "target": "女儿",
      "type": "has"
    },
    {
      "source": "女儿",
      "target": "金豆子",
      "type": "is_mother_of"
    }
  ],
  "hierarchy": {
    "main_topics": [
      "Introduction and Premise",
      "The Postman's Life and the Mysterious Task",
      "Warnings and Past Horrors",
      "Encounter with the Supernatural and Mysterious Aid",
      "The Strange Village and its Inhabitants"
    ],
    "structure": "The document is structured chronologically through chapters, starting with a prologue and then detailing the protagonist's experiences as a postman leading to a dangerous assignment. Subsequent chapters focus on supernatural encounters, mysterious artifacts, and the unfolding of a village's strange history."
  }
}