{
  "propositions": [
    {
      "id": "1",
      "text": "Chapter 1: Observing Expressions and Manners",
      "level": 1
    },
    {
      "id": "1.1",
      "text": "During dinner, Han Feng asked Qin Yi about the company and the sudden death of Manager Sun.",
      "level": 2
    },
    {
      "id": "1.1.1",
      "text": "Qin Yi listed the current top ten shareholders, including herself, Xiao Jun, the Chairman, Honorary Director Zhuo Chengtao, Guangdong Regional General Manager Chen Tianshou, Shanghai Regional General Manager Shan Yanfei, Beijing Regional General Manager Mai Di, Chongqing Branch Manager Feng Qiushi, Lin Zheng of the H City branch, and Personnel Manager Sun Xiangxian.",
      "level": 3
    },
    {
      "id": "1.1.2",
      "text": "Sun Xiangxian was the nephew of the former chairman and rumored to be his illegitimate son.",
      "level": 3
    },
    {
      "id": "1.1.3",
      "text": "The former chairman died of cancer, and Mr. Jiang became the chairman afterward.",
      "level": 3
    },
    {
      "id": "1.1.4",
      "text": "The company had a rule where if a director died without a will, their shares would be reallocated proportionally among shareholders, a rule originally intended for eleven directors to prevent hostile takeovers.",
      "level": 3
    },
    {
      "id": "1.1.5",
      "text": "Qin Yi explained the 'Ten Gentlemen Agreement' was to prevent illegal takeover by controlling heirs of deceased directors.",
      "level": 3
    },
    {
      "id": "1.1.6",
      "text": "Han Feng admitted to not understanding the stock market.",
      "level": 3
    },
    {
      "id": "1.1.7",
      "text": "Han Feng inquired about the company's stock reform, which Qin Yi deemed a top commercial secret.",
      "level": 3
    },
    {
      "id": "1.1.8",
      "text": "Han Feng asked about the company holding weekly meetings with all regional managers, which Qin Yi denied, stating they might have one annually at most.",
      "level": 3
    },
    {
      "id": "1.1.9",
      "text": "Qin Yi revealed that Shan Yanfei, the daughter-in-law of the former director Qi Kaihua, became a major shareholder after Qi Kaihua's son, Qi Jinyun, was deemed incompetent.",
      "level": 3
    },
    {
      "id": "1.1.10",
      "text": "Qin Yi flirted with Han Feng, but he quickly left, suspecting her intentions were not genuine.",
      "level": 3
    },
    {
      "id": "1.1.11",
      "text": "Han Feng suspected Qin Yi might be a trained agent due to her behavior towards two men.",
      "level": 3
    },
    {
      "id": "1.1.12",
      "text": "Li Xiang reported to Leng Jinghan about the day's events, sounding hesitant.",
      "level": 3
    },
    {
      "id": "1.1.13",
      "text": "In H City, Ding Yixiao and another person discussed restarting 'Plan C' and applying pressure to the H City police, while keeping Han Feng and his team occupied in T City.",
      "level": 3
    },
    {
      "id": "1.1.14",
      "text": "The other person expressed confidence in their plan, believing Han Feng was outsmarted and that delaying them in T City was beneficial.",
      "level": 3
    },
    {
      "id": "1.1.15",
      "text": "Ding Yixiao cautioned against taking unnecessary risks in the final stage.",
      "level": 3
    },
    {
      "id": "1.1.16",
      "text": "The other person dismissed Ding Yixiao's caution and inquired about the new factory's production.",
      "level": 3
    },
    {
      "id": "1.1.17",
      "text": "Ding Yixiao confirmed the factory was operational and expressed disinterest in the other person's larger plans, focusing only on his share.",
      "level": 3
    },
    {
      "id": "2",
      "text": "Chapter 2: The Seven Deadly Sins",
      "level": 1
    },
    {
      "id": "2.1",
      "text": "Leng Jinghan and Han Feng went to investigate Qiao Minggang, following a lead from the Hurricane Car Dealership.",
      "level": 2
    },
    {
      "id": "2.1.1",
      "text": "The lead indicated that a car involved in an attack was sold by Hurricane Car Dealership three years ago to Qiao Minggang of Shangcaijia Village.",
      "level": 3
    },
    {
      "id": "2.1.2",
      "text": "Han Feng believed Qiao Minggang was not suspicious, based on his demeanor.",
      "level": 3
    },
    {
      "id": "2.1.3",
      "text": "Qiao Minggang explained he had lent his ID card to others to register car plates, a common practice at the time, and did not remember the individuals.",
      "level": 3
    },
    {
      "id": "2.1.4",
      "text": "Leng Jinghan warned Qiao Minggang about the legal implications of his actions, which had caused them to go in circles.",
      "level": 3
    },
    {
      "id": "2.1.5",
      "text": "Han Feng suggested they visit Cheng'an Steel Factory next to see Hu Yinxin.",
      "level": 3
    },
    {
      "id": "2.1.6",
      "text": "They returned to the car dealership and phone store, but no one remembered the individuals involved.",
      "level": 3
    },
    {
      "id": "2.1.7",
      "text": "Leng Jinghan was discouraged and considered returning to H City.",
      "level": 3
    },
    {
      "id": "2.1.8",
      "text": "Leng Jinghan received a call reporting the death of Hong Agen, who had died by suicide by banging his head against a wall.",
      "level": 3
    },
    {
      "id": "2.1.9",
      "text": "Han Feng downplayed Hong Agen's death, citing his past crimes.",
      "level": 3
    },
    {
      "id": "2.1.10",
      "text": "Han Feng encountered Yan Fei at the hotel restaurant and flirted with her, but she rebuffed him, warning him not to impersonate a police officer.",
      "level": 3
    },
    {
      "id": "2.1.11",
      "text": "Han Feng then met Qi Jinyun, the son of the late Qi Kaihua, and engaged him in conversation.",
      "level": 3
    },
    {
      "id": "2.1.12",
      "text": "Qi Jinyun revealed that his father had transferred company shares to Shan Yanfei, and that both his parents died of cancer.",
      "level": 3
    },
    {
      "id": "2.1.13",
      "text": "Qi Jinyun mentioned that his father's death certificate had a note of 'rage' on it.",
      "level": 3
    },
    {
      "id": "2.1.14",
      "text": "Qi Jinyun's mother died of adrenal neuroendocrine carcinoma, and his father of a novel, rapidly progressing cancer.",
      "level": 3
    },
    {
      "id": "2.1.15",
      "text": "Han Feng took Qi Jinyun's phone, instructing him to contact him if he returned to T City and warning him about his safety.",
      "level": 3
    },
    {
      "id": "2.1.16",
      "text": "Han Feng instructed Leng Jinghan to obtain photos of Lin Zheng and Lu Fang.",
      "level": 3
    },
    {
      "id": "2.1.17",
      "text": "Han Feng used Lin Zheng's photo to question a hotel staff member, who revealed Lin Zheng and Lu Fang were frequent visitors and had a dispute with Yu Chenglong.",
      "level": 3
    },
    {
      "id": "2.1.18",
      "text": "Li Xiang reported a deteriorating situation in H City, with increased crime and difficulty tracking Ding Yixiao.",
      "level": 3
    },
    {
      "id": "2.1.19",
      "text": "The crime spree in H City included multiple homicides, robberies, assaults, and a kidnapping (the daughter of Professor Lin).",
      "level": 3
    },
    {
      "id": "2.1.20",
      "text": "Han Feng purchased several books on stocks.",
      "level": 3
    },
    {
      "id": "2.1.21",
      "text": "Han Feng and Leng Jinghan visited Cheng'an Steel Factory, where they were initially misled by the manager, Huang Guiyang.",
      "level": 3
    },
    {
      "id": "2.1.22",
      "text": "Han Feng discovered evidence that Hu Yinxin had been the general manager of Cheng'an Steel Factory, but had recently been replaced by someone appointed by 'Mr. Ding'.",
      "level": 3
    },
    {
      "id": "2.1.23",
      "text": "Han Feng collected iron ore samples from the factory's trucks for analysis.",
      "level": 3
    },
    {
      "id": "2.1.24",
      "text": "Han Feng instructed Leng Jinghan to have Long Jia check if a production line sent for repair in France was still there.",
      "level": 3
    },
    {
      "id": "2.1.25",
      "text": "Han Feng believed that Lin Zheng's file would be available that afternoon.",
      "level": 3
    },
    {
      "id": "3",
      "text": "Chapter 3: Strategic Moves",
      "level": 1
    },
    {
      "id": "3.1",
      "text": "Han Feng and Leng Jinghan met Zhuang Xiaojun at Hengfu Bank.",
      "level": 2
    },
    {
      "id": "3.1.1",
      "text": "Zhuang Xiaojun explained the company was busy due to audits and media scrutiny, leading to a stock price drop.",
      "level": 3
    },
    {
      "id": "3.1.2",
      "text": "Han Feng inquired about Chen Tianshou, the Guangdong Regional General Manager, who was also at Hengfu Bank.",
      "level": 3
    },
    {
      "id": "3.1.3",
      "text": "Zhuang Xiaojun expressed hatred for Chen Tianshou, especially after seeing him with Qin Yi.",
      "level": 3
    },
    {
      "id": "3.1.4",
      "text": "Han Feng stated he already knew how Sun Xiangxian died and that he wanted to speak with Zhuang Xiaojun privately.",
      "level": 3
    },
    {
      "id": "3.1.5",
      "text": "Han Feng asked Zhuang Xiaojun about his father's death.",
      "level": 3
    },
    {
      "id": "3.1.6",
      "text": "Zhuang Xiaojun's father died three years ago, on his 50th birthday, from a heart attack.",
      "level": 3
    },
    {
      "id": "3.1.7",
      "text": "Zhuang Xiaojun's father forgot to bring his heart medication, and the medicine was later found in his car.",
      "level": 3
    },
    {
      "id": "3.1.8",
      "text": "Zhuang Xiaojun's father was a gourmet who loved food.",
      "level": 3
    },
    {
      "id": "3.1.9",
      "text": "The police investigation at the time found no issues, and the case was closed.",
      "level": 3
    },
    {
      "id": "3.1.10",
      "text": "Han Feng connected Zhuang Xiaojun's father's death to 'gluttony,' one of the Seven Deadly Sins.",
      "level": 3
    },
    {
      "id": "3.1.11",
      "text": "Han Feng theorized that the perpetrator might be targeting major shareholders, with the motive of accumulating wealth beyond tens of billions.",
      "level": 3
    },
    {
      "id": "3.1.12",
      "text": "Han Feng suggested the deaths of Sun Xiangxian ('arrogance'), Qi Kaihua ('rage'), Zhuang Qinglong ('gluttony'), and potentially Lin Zheng ('lust') are linked to the Seven Deadly Sins.",
      "level": 3
    },
    {
      "id": "3.1.13",
      "text": "Han Feng wanted to confirm Zhuang Qinglong's cause of death and hoped for information from Chen Ju.",
      "level": 3
    }
  ],
  "concepts": [
    {
      "name": "Han Feng",
      "frequency": 38,
      "context": "The main detective investigating the case."
    },
    {
      "name": "Leng Jinghan",
      "frequency": 23,
      "context": "Han Feng's colleague and partner in the investigation."
    },
    {
      "name": "Qin Yi",
      "frequency": 9,
      "context": "An employee at the company, providing information to Han Feng."
    },
    {
      "name": "Sun Xiangxian",
      "frequency": 8,
      "context": "A deceased manager and shareholder, his death is an initial focus of the investigation."
    },
    {
      "name": "Zhuang Xiaojun",
      "frequency": 9,
      "context": "A shareholder and employee at Hengfu Bank, provides crucial information about his father's death."
    },
    {
      "name": "Ten Shareholders",
      "frequency": 7,
      "context": "The group of individuals who hold significant shares in the company."
    },
    {
      "name": "Stock Market",
      "frequency": 6,
      "context": "The economic system within which the company operates and shares are traded."
    },
    {
      "name": "Seven Deadly Sins",
      "frequency": 5,
      "context": "A concept that Han Feng believes is connected to the motives behind the deaths."
    },
    {
      "name": "Lin Zheng",
      "frequency": 5,
      "context": "A shareholder and employee at the H City branch, his death is suspected to be related to 'lust'."
    },
    {
      "name": "Qi Kaihua",
      "frequency": 4,
      "context": "Former director of Hengfu Bank, his death was attributed to 'rage'."
    },
    {
      "name": "Shan Yanfei",
      "frequency": 4,
      "context": "Regional General Manager and former associate of Qi Kaihua."
    },
    {
      "name": "Ding Yixiao",
      "frequency": 4,
      "context": "An antagonist in H City, orchestrating events and applying pressure to the police."
    },
    {
      "name": "Hengfu Bank",
      "frequency": 4,
      "context": "The bank where Zhuang Xiaojun and others work, and a central location for company operations."
    },
    {
      "name": "Hu Yinxin",
      "frequency": 3,
      "context": "A person of interest investigated at Cheng'an Steel Factory."
    },
    {
      "name": "Cheng'an Steel Factory",
      "frequency": 3,
      "context": "A location investigated by Han Feng and Leng Jinghan, revealing a connection to 'Mr. Ding'."
    },
    {
      "name": "Zhuang Qinglong",
      "frequency": 3,
      "context": "Zhuang Xiaojun's father, whose death is being re-examined in relation to 'gluttony'."
    },
    {
      "name": "Chen Tianshou",
      "frequency": 2,
      "context": "Guangdong Regional General Manager, observed with Qin Yi."
    },
    {
      "name": "Qi Jinyun",
      "frequency": 2,
      "context": "Son of Qi Kaihua, shares information about his parents' deaths."
    },
    {
      "name": "Company Shares",
      "frequency": 2,
      "context": "The financial assets that appear to be a motive for the crimes."
    },
    {
      "name": "Police Investigation",
      "frequency": 2,
      "context": "The process of uncovering facts and evidence."
    },
    {
      "name": "Heart Attack",
      "frequency": 2,
      "context": "The initial cause of death for Zhuang Qinglong."
    },
    {
      "name": "Cancer",
      "frequency": 2,
      "context": "The cause of death for Qi Kaihua and his wife."
    },
    {
      "name": "Kidnapping",
      "frequency": 1,
      "context": "A crime occurring in H City, linked to the wider conspiracy."
    },
    {
      "name": "Hostile Takeover",
      "frequency": 1,
      "context": "A business practice that the 'Ten Gentlemen Agreement' was designed to prevent."
    },
    {
      "name": "Commercial Secret",
      "frequency": 1,
      "context": "Information that is kept confidential within the company."
    },
    {
      "name": "Trained Agent",
      "frequency": 1,
      "context": "A suspicion Han Feng has about Qin Yi's true nature."
    },
    {
      "name": "Plan C",
      "frequency": 1,
      "context": "A clandestine operation discussed by Ding Yixiao and his associate."
    },
    {
      "name": "Hurricane Car Dealership",
      "frequency": 1,
      "context": "A location that provides a lead in the investigation."
    },
    {
      "name": "Suicide",
      "frequency": 1,
      "context": "The reported cause of death for Hong Agen."
    },
    {
      "name": "Gourmet",
      "frequency": 1,
      "context": "A description of Zhuang Qinglong's passion for food."
    },
    {
      "name": "Adrenal Neuroendocrine Carcinoma",
      "frequency": 1,
      "context": "The specific type of cancer that killed Zhuang Qinglong's mother."
    },
    {
      "name": "Rage",
      "frequency": 1,
      "context": "A characteristic associated with Qi Kaihua's death."
    },
    {
      "name": "Gluttony",
      "frequency": 1,
      "context": "A 'sin' linked to Zhuang Qinglong's death."
    },
    {
      "name": "Lust",
      "frequency": 1,
      "context": "A 'sin' suspected in Lin Zheng's death."
    },
    {
      "name": "Arrogance",
      "frequency": 1,
      "context": "A potential cause of death for Sun Xiangxian."
    },
    {
      "name": "Stock Data",
      "frequency": 1,
      "context": "Information Han Feng reviews to understand market dynamics."
    },
    {
      "name": "Iron Ore",
      "frequency": 1,
      "context": "Raw material at Cheng'an Steel Factory, with potentially suspicious purity."
    },
    {
      "name": "Production Line",
      "frequency": 1,
      "context": "A component that Long Jia is asked to investigate in France."
    },
    {
      "name": "Audit",
      "frequency": 1,
      "context": "A process that is causing disruption at Hengfu Bank."
    },
    {
      "name": "Media Scrutiny",
      "frequency": 1,
      "context": "Negative attention the company is receiving."
    },
    {
      "name": "Hacking",
      "frequency": 1,
      "context": "An act that caused negative public opinion against the company."
    },
    {
      "name": "Public Figure",
      "frequency": 1,
      "context": "The status of Zhuang Qinglong, implying his actions would be carefully managed."
    },
    {
      "name": "New Cancer",
      "frequency": 1,
      "context": "A description of Zhuang Qinglong's father's rare cancer."
    },
    {
      "name": "Heart Disease Medication",
      "frequency": 1,
      "context": "A crucial item that was missing during Zhuang Qinglong's death."
    },
    {
      "name": "Food",
      "frequency": 1,
      "context": "Zhuang Qinglong's primary hobby."
    },
    {
      "name": "T City Public Security Bureau",
      "frequency": 1,
      "context": "The authority that initially investigated Zhuang Qinglong's death."
    },
    {
      "name": "Small Paper Slips",
      "frequency": 1,
      "context": "A potential clue Han Feng inquired about regarding Zhuang Qinglong's death."
    }
  ],
  "relations": [
    {
      "source": "Han Feng",
      "target": "Leng Jinghan",
      "type": "partner"
    },
    {
      "source": "Han Feng",
      "target": "Qin Yi",
      "type": "interrogates"
    },
    {
      "source": "Han Feng",
      "target": "Sun Xiangxian",
      "type": "investigates death of"
    },
    {
      "source": "Han Feng",
      "target": "Zhuang Xiaojun",
      "type": "interrogates"
    },
    {
      "source": "Han Feng",
      "target": "Seven Deadly Sins",
      "type": "theorizes connection to"
    },
    {
      "source": "Han Feng",
      "target": "Lin Zheng",
      "type": "suspects cause of death"
    },
    {
      "source": "Han Feng",
      "target": "Qi Kaihua",
      "type": "investigates death of"
    },
    {
      "source": "Han Feng",
      "target": "Shan Yanfei",
      "type": "observes"
    },
    {
      "source": "Han Feng",
      "target": "Ding Yixiao",
      "type": "opposes"
    },
    {
      "source": "Han Feng",
      "target": "Hengfu Bank",
      "type": "investigates"
    },
    {
      "source": "Han Feng",
      "target": "Hu Yinxin",
      "type": "investigates"
    },
    {
      "source": "Han Feng",
      "target": "Cheng'an Steel Factory",
      "type": "investigates"
    },
    {
      "source": "Han Feng",
      "target": "Zhuang Qinglong",
      "type": "re-examines death of"
    },
    {
      "source": "Han Feng",
      "target": "Chen Tianshou",
      "type": "observes"
    },
    {
      "source": "Han Feng",
      "target": "Qi Jinyun",
      "type": "interacts with"
    },
    {
      "source": "Han Feng",
      "target": "Company Shares",
      "type": "sees as motive"
    },
    {
      "source": "Han Feng",
      "target": "Police Investigation",
      "type": "conducts"
    },
    {
      "source": "Han Feng",
      "target": "Heart Attack",
      "type": "links to investigation"
    },
    {
      "source": "Han Feng",
      "target": "Cancer",
      "type": "links to investigation"
    },
    {
      "source": "Han Feng",
      "target": "Kidnapping",
      "type": "links to conspiracy"
    },
    {
      "source": "Han Feng",
      "target": "Hostile Takeover",
      "type": "understands concept"
    },
    {
      "source": "Han Feng",
      "target": "Commercial Secret",
      "type": "discovers"
    },
    {
      "source": "Han Feng",
      "target": "Trained Agent",
      "type": "suspects"
    },
    {
      "source": "Han Feng",
      "target": "Plan C",
      "type": "aware of"
    },
    {
      "source": "Han Feng",
      "target": "Hurricane Car Dealership",
      "type": "investigates"
    },
    {
      "source": "Han Feng",
      "target": "Suicide",
      "type": "links to investigation"
    },
    {
      "source": "Han Feng",
      "target": "Gourmet",
      "type": "identifies trait"
    },
    {
      "source": "Han Feng",
      "target": "Adrenal Neuroendocrine Carcinoma",
      "type": "identifies type of"
    },
    {
      "source": "Han Feng",
      "target": "Rage",
      "type": "links to Qi Kaihua"
    },
    {
      "source": "Han Feng",
      "target": "Gluttony",
      "type": "links to Zhuang Qinglong"
    },
    {
      "source": "Han Feng",
      "target": "Lust",
      "type": "links to Lin Zheng"
    },
    {
      "source": "Han Feng",
      "target": "Arrogance",
      "type": "links to Sun Xiangxian"
    },
    {
      "source": "Han Feng",
      "target": "Stock Data",
      "type": "analyzes"
    },
    {
      "source": "Han Feng",
      "target": "Iron Ore",
      "type": "collects sample of"
    },
    {
      "source": "Han Feng",
      "target": "Production Line",
      "type": "requests investigation of"
    },
    {
      "source": "Han Feng",
      "target": "Audit",
      "type": "aware of"
    },
    {
      "source": "Han Feng",
      "target": "Media Scrutiny",
      "type": "understands impact of"
    },
    {
      "source": "Han Feng",
      "target": "Hacking",
      "type": "understands cause of"
    },
    {
      "source": "Han Feng",
      "target": "Public Figure",
      "type": "understands implications for"
    },
    {
      "source": "Han Feng",
      "target": "New Cancer",
      "type": "identifies as unusual"
    },
    {
      "source": "Han Feng",
      "target": "Heart Disease Medication",
      "type": "investigates absence of"
    },
    {
      "source": "Han Feng",
      "target": "Food",
      "type": "connects to Zhuang Qinglong's death"
    },
    {
      "source": "Han Feng",
      "target": "T City Public Security Bureau",
      "type": "inquires with"
    },
    {
      "source": "Han Feng",
      "target": "Small Paper Slips",
      "type": "inquires about"
    },
    {
      "source": "Leng Jinghan",
      "target": "Han Feng",
      "type": "partner"
    },
    {
      "source": "Leng Jinghan",
      "target": "Qiao Minggang",
      "type": "investigates"
    },
    {
      "source": "Leng Jinghan",
      "target": "Hong Agen",
      "type": "reports death of"
    },
    {
      "source": "Leng Jinghan",
      "target": "Zhuang Xiaojun",
      "type": "observes interaction with Han Feng"
    },
    {
      "source": "Leng Jinghan",
      "target": "Cheng'an Steel Factory",
      "type": "accompanies Han Feng to"
    },
    {
      "source": "Leng Jinghan",
      "target": "Iron Ore",
      "type": "observes Han Feng collecting"
    },
    {
      "source": "Leng Jinghan",
      "target": "Production Line",
      "type": "is informed about"
    },
    {
      "source": "Leng Jinghan",
      "target": "Audit",
      "type": "is aware of"
    },
    {
      "source": "Leng Jinghan",
      "target": "Media Scrutiny",
      "type": "is aware of"
    },
    {
      "source": "Leng Jinghan",
      "target": "Hacking",
      "type": "is aware of"
    },
    {
      "source": "Leng Jinghan",
      "target": "T City Public Security Bureau",
      "type": "accompanied by Han Feng to"
    },
    {
      "source": "Qin Yi",
      "target": "Han Feng",
      "type": "provides information to"
    },
    {
      "source": "Qin Yi",
      "target": "Sun Xiangxian",
      "type": "provides context about"
    },
    {
      "source": "Qin Yi",
      "target": "Company Shares",
      "type": "explains rules regarding"
    },
    {
      "source": "Qin Yi",
      "target": "Stock Market",
      "type": "explains lack of understanding of"
    },
    {
      "source": "Sun Xiangxian",
      "target": "Former Chairman",
      "type": "is nephew of"
    },
    {
      "source": "Sun Xiangxian",
      "target": "Ten Shareholders",
      "type": "is a member of"
    },
    {
      "source": "Zhuang Xiaojun",
      "target": "Hengfu Bank",
      "type": "is employee of"
    },
    {
      "source": "Zhuang Xiaojun",
      "target": "Company Shares",
      "type": "is shareholder of"
    },
    {
      "source": "Zhuang Xiaojun",
      "target": "Zhuang Qinglong",
      "type": "is son of"
    },
    {
      "source": "Zhuang Xiaojun",
      "target": "Qin Yi",
      "type": "observes interaction with Chen Tianshou"
    },
    {
      "source": "Ten Shareholders",
      "target": "Company",
      "type": "own shares in"
    },
    {
      "source": "Ten Shareholders",
      "target": "Company Shares",
      "type": "hold"
    },
    {
      "source": "Stock Market",
      "target": "Company",
      "type": "affects"
    },
    {
      "source": "Seven Deadly Sins",
      "target": "Motive",
      "type": "is theorized as"
    },
    {
      "source": "Lin Zheng",
      "target": "H City Branch",
      "type": "works at"
    },
    {
      "source": "Lin Zheng",
      "target": "Ten Shareholders",
      "type": "is a member of"
    },
    {
      "source": "Lin Zheng",
      "target": "Lu Fang",
      "type": "has relationship with"
    },
    {
      "source": "Lin Zheng",
      "target": "Yu Chenglong",
      "type": "had dispute with"
    },
    {
      "source": "Qi Kaihua",
      "target": "Former Director",
      "type": "was"
    },
    {
      "source": "Qi Kaihua",
      "target": "Shan Yanfei",
      "type": "was associated with"
    },
    {
      "source": "Qi Kaihua",
      "target": "Qi Jinyun",
      "type": "is father of"
    },
    {
      "source": "Qi Kaihua",
      "target": "Cancer",
      "type": "died of"
    },
    {
      "source": "Shan Yanfei",
      "target": "Qi Kaihua",
      "type": "was associated with"
    },
    {
      "source": "Shan Yanfei",
      "target": "Qi Jinyun",
      "type": "had relationship with"
    },
    {
      "source": "Shan Yanfei",
      "target": "Chen Tianshou",
      "type": "is seen with"
    },
    {
      "source": "Ding Yixiao",
      "target": "Plan C",
      "type": "restarts"
    },
    {
      "source": "Ding Yixiao",
      "target": "H City Police",
      "type": "applies pressure to"
    },
    {
      "source": "Ding Yixiao",
      "target": "Han Feng",
      "type": "wants to delay"
    },
    {
      "source": "Ding Yixiao",
      "target": "New Factory",
      "type": "operates"
    },
    {
      "source": "Hengfu Bank",
      "target": "Company",
      "type": "is related to"
    },
    {
      "source": "Hengfu Bank",
      "target": "Zhuang Qinglong",
      "type": "was director of"
    },
    {
      "source": "Hengfu Bank",
      "target": "Audit",
      "type": "is undergoing"
    },
    {
      "source": "Hu Yinxin",
      "target": "Cheng'an Steel Factory",
      "type": "was manager of"
    },
    {
      "source": "Cheng'an Steel Factory",
      "target": "Iron Ore",
      "type": "processes"
    },
    {
      "source": "Cheng'an Steel Factory",
      "target": "Ding",
      "type": "is owned by"
    },
    {
      "source": "Zhuang Qinglong",
      "target": "Heart Attack",
      "type": "died of"
    },
    {
      "source": "Zhuang Qinglong",
      "target": "Food",
      "type": "had hobby of"
    },
    {
      "source": "Zhuang Qinglong",
      "target": "Gluttony",
      "type": "linked to death"
    },
    {
      "source": "Zhuang Qinglong",
      "target": "Heart Disease Medication",
      "type": "forgot to bring"
    },
    {
      "source": "Chen Tianshou",
      "target": "Hengfu Bank",
      "type": "is branch manager of"
    },
    {
      "source": "Chen Tianshou",
      "target": "Qin Yi",
      "type": "is seen with"
    },
    {
      "source": "Qi Jinyun",
      "target": "Qi Kaihua",
      "type": "is son of"
    },
    {
      "source": "Qi Jinyun",
      "target": "Shan Yanfei",
      "type": "had relationship with"
    },
    {
      "source": "Qi Jinyun",
      "target": "Cancer",
      "type": "parents died of"
    },
    {
      "source": "Company Shares",
      "target": "Motive",
      "type": "is"
    },
    {
      "source": "Police Investigation",
      "target": "Zhuang Qinglong's Death",
      "type": "initially conducted on"
    },
    {
      "source": "Heart Attack",
      "target": "Zhuang Qinglong",
      "type": "was initial cause of death for"
    },
    {
      "source": "Cancer",
      "target": "Qi Kaihua",
      "type": "died of"
    },
    {
      "source": "Cancer",
      "target": "Qi Jinyun's Mother",
      "type": "killed"
    },
    {
      "source": "Kidnapping",
      "target": "Professor Lin's Daughter",
      "type": "occurred to"
    },
    {
      "source": "Hostile Takeover",
      "target": "Ten Gentlemen Agreement",
      "type": "was prevented by"
    },
    {
      "source": "Commercial Secret",
      "target": "Stock Reform",
      "type": "is"
    },
    {
      "source": "Trained Agent",
      "target": "Qin Yi",
      "type": "suspected of being"
    },
    {
      "source": "Plan C",
      "target": "Ding Yixiao",
      "type": "is associated with"
    },
    {
      "source": "Hurricane Car Dealership",
      "target": "Lead",
      "type": "provided"
    },
    {
      "source": "Suicide",
      "target": "Hong Agen",
      "type": "was cause of death for"
    },
    {
      "source": "Gourmet",
      "target": "Zhuang Qinglong",
      "type": "was a"
    },
    {
      "source": "Adrenal Neuroendocrine Carcinoma",
      "target": "Zhuang Qinglong's Mother",
      "type": "was cause of death for"
    },
    {
      "source": "Rage",
      "target": "Qi Kaihua",
      "type": "associated with death"
    },
    {
      "source": "Gluttony",
      "target": "Zhuang Qinglong",
      "type": "associated with death"
    },
    {
      "source": "Lust",
      "target": "Lin Zheng",
      "type": "associated with death"
    },
    {
      "source": "Arrogance",
      "target": "Sun Xiangxian",
      "type": "associated with death"
    },
    {
      "source": "Stock Data",
      "target": "Han Feng",
      "type": "analyzed by"
    },
    {
      "source": "Iron Ore",
      "target": "Cheng'an Steel Factory",
      "type": "sourced from"
    },
    {
      "source": "Production Line",
      "target": "France",
      "type": "sent to"
    },
    {
      "source": "Audit",
      "target": "Hengfu Bank",
      "type": "is subject to"
    },
    {
      "source": "Media Scrutiny",
      "target": "Company",
      "type": "received by"
    },
    {
      "source": "Hacking",
      "target": "Company",
      "type": "negatively impacted"
    },
    {
      "source": "Public Figure",
      "target": "Zhuang Qinglong",
      "type": "was a"
    },
    {
      "source": "New Cancer",
      "target": "Zhuang Qinglong's Father",
      "type": "suffered from"
    },
    {
      "source": "Heart Disease Medication",
      "target": "Zhuang Qinglong",
      "type": "failed to have"
    },
    {
      "source": "Food",
      "target": "Zhuang Qinglong",
      "type": "was hobby of"
    },
    {
      "source": "T City Public Security Bureau",
      "target": "Zhuang Qinglong's Death",
      "type": "investigated"
    },
    {
      "source": "Small Paper Slips",
      "target": "Potential Clue",
      "type": "is a"
    }
  ],
  "hierarchy": {
    "main_topics": [
      "Investigation of Deaths",
      "Corporate Affairs and Shareholders",
      "Underlying Conspiracy and Motives",
      "Character Interactions and Suspicions"
    ],
    "structure": "The document is structured into chapters, each detailing specific events, investigations, and dialogues. Chapter 1 focuses on initial interviews and the establishment of key characters and company structures. Chapter 2 delves deeper into specific leads, introduces the 'Seven Deadly Sins' concept, and reveals a broader conspiracy. Chapter 3 follows up on leads, re-examines past events, and further develops the interconnectedness of the crimes."
  }
}