{
  "propositions": [
    {
      "id": "1",
      "text": "The plan to reach the ancient Gegu caves involves using helicopters for a quick approach, as the terrain is open and allows for better visibility, unlike the mountainous and forested regions of Motuo.",
      "level": 1
    },
    {
      "id": "1.1",
      "text": "This open terrain in Gegu reduces the risk of ambushes, a concern in more mountainous areas.",
      "level": 2
    },
    {
      "id": "1.2",
      "text": "The urgency to reach the destination is driven by the need to beat their target's timeline.",
      "level": 2
    },
    {
      "id": "1.3",
      "text": "The estimated timeline for reaching the caves, opening the mechanism, and obtaining the 'silver eyes' is approximately three days.",
      "level": 2
    },
    {
      "id": "1.4",
      "text": "The target's progress will be further slowed by the mechanisms within the 'Hanging Temple'.",
      "level": 2
    },
    {
      "id": "2",
      "text": "There is a discussion about adjusting weapons based on the known number and types of weapons possessed by the opposing group.",
      "level": 1
    },
    {
      "id": "2.1",
      "text": "The preference is to avoid direct confrontation to preserve the ancient ruins.",
      "level": 2
    },
    {
      "id": "3",
      "text": "Dong Ji mentions the tradition of the best hunter serving as a guide for the 'Sacred Envoy'.",
      "level": 1
    },
    {
      "id": "3.1",
      "text": "Past Sacred Envoys have either abandoned their quest or never returned after entering the 'Gate of Life'.",
      "level": 2
    },
    {
      "id": "3.2",
      "text": "Zhuo Muqiang Ba is uncertain about his own selection as a Sacred Envoy, as his family has no prior history of this role.",
      "level": 2
    },
    {
      "id": "4",
      "text": "Dong Ji's description of Ben's group's equipment, including 'iron blowpipes' and 'hollow iron rods with banana-like iron boxes', is noted.",
      "level": 1
    },
    {
      "id": "5",
      "text": "A specific epic poem is cited as the reason for Ben's group heading west towards Gegu.",
      "level": 1
    },
    {
      "id": "5.1",
      "text": "A passage from the poem warns of widespread disaster if the holy temple steps are desecrated by blood.",
      "level": 2
    },
    {
      "id": "5.2",
      "text": "Other lines from the poem allude to methods of opening mechanisms and trials, such as 'the sacred swastika to the north', 'the High Mountain Snow Wolf's mouth', 'Nanan Ta's heart emitting silver light', 'ancestors' resting place bathed in golden sunlight', 'hidden moon, silver eyes', 'kneel and open the warrior's hall', 'heaven and earth without light, gods built a hanging myth', and 'through eighteen trials, receive the warrior's light'.",
      "level": 2
    },
    {
      "id": "5.3",
      "text": "The interpretation of these poetic lines is challenging, even for scholars like Master Ya La and Lu Jingnan.",
      "level": 2
    },
    {
      "id": "6",
      "text": "Dong Ji's fervent admiration for Zhuo Muqiang Ba is observed by Zhang Li and Yue Yang.",
      "level": 1
    },
    {
      "id": "7",
      "text": "The epic poem was originally part of a larger, complete version recorded in a book.",
      "level": 1
    },
    {
      "id": "7.1",
      "text": "This book was lent to a 'blue-eyed person' and never returned.",
      "level": 2
    },
    {
      "id": "7.2",
      "text": "The elders' recollection of the poem resulted in significant omissions due to their age and memory.",
      "level": 2
    },
    {
      "id": "8",
      "text": "A young girl, identified as Ga Ga, appears with a flock of sheep and shows joy upon seeing Dong Ji.",
      "level": 1
    },
    {
      "id": "8.1",
      "text": "Dong Ji scolds Ga Ga upon meeting her, stating it's necessary for future discipline.",
      "level": 2
    },
    {
      "id": "8.2",
      "text": "Dong Ji expresses traditional views on women's roles, believing their primary purpose is to bear children and serve men.",
      "level": 2
    },
    {
      "id": "9",
      "text": "The elders agree to meet with Zhuo Muqiang Ba, but only individually.",
      "level": 1
    },
    {
      "id": "10",
      "text": "The meeting room is adorned with religious imagery and artifacts.",
      "level": 1
    },
    {
      "id": "10.1",
      "text": "The three elders are identified by name: Nie Zha Xi Danba (broad forehead), Kun Jiang Yang Dajie (large lion nose), and Niang Dong Ji Gelie (long eyebrows).",
      "level": 2
    },
    {
      "id": "11",
      "text": "The elders perform a ritualistic examination of Zhuo Muqiang Ba.",
      "level": 1
    },
    {
      "id": "12",
      "text": "Zhuo Muqiang Ba inquires about the basis of his identification as a Sacred Envoy.",
      "level": 1
    },
    {
      "id": "12.1",
      "text": "The elders state that the 'heavenly beads' on him are sacred but not directly related to his Sacred Envoy status.",
      "level": 2
    },
    {
      "id": "13",
      "text": "The elders refuse to disclose the method of confirming a Sacred Envoy's identity to prevent misuse by greedy individuals seeking Shangri-La.",
      "level": 1
    },
    {
      "id": "13.1",
      "text": "Previous instances of misplaced trust have caused significant harm to their village.",
      "level": 2
    },
    {
      "id": "14",
      "text": "Elder Dajie questions whether Zhuo Muqiang Ba believes his journey from America and connection to the Paba La Temple are coincidences.",
      "level": 1
    },
    {
      "id": "15",
      "text": "Elder Dajie suggests that Zhuo Muqiang Ba's destiny is predetermined by the Buddha to be connected to the Paba La Temple, implying a spiritual calling rather than mere coincidence.",
      "level": 1
    },
    {
      "id": "16",
      "text": "Zhuo Muqiang Ba expresses his belief in science and atheism, rejecting the notion of gods or Buddhas.",
      "level": 1
    },
    {
      "id": "17",
      "text": "Elder Dajie believes Zhuo Muqiang Ba's disbelief is due to a lack of spiritual awakening, and that he will eventually believe when that time comes.",
      "level": 1
    },
    {
      "id": "17.1",
      "text": "He suggests that the truth is concealed and that proximity to Paba La brings one closer to it.",
      "level": 2
    },
    {
      "id": "18",
      "text": "The elders state that Zhuo Muqiang Ba is unique among Sacred Envoys, possessing the most 'dharma appearance and wisdom root', and is destined to open the temple gates.",
      "level": 1
    },
    {
      "id": "19",
      "text": "Zhuo Muqiang Ba inquires about the Hanging Temple and Shangri-La.",
      "level": 1
    },
    {
      "id": "19.1",
      "text": "The Hanging Temple was a place of ancient saints'修行 (cultivation), where diseases and demons originated, and where they built statues to suppress evil, bringing peace to Tibet.",
      "level": 2
    },
    {
      "id": "19.2",
      "text": "Paba La is identified as Shangri-La, humanity's last pure land, hidden in the core of hell, accessible only to brave warriors.",
      "level": 2
    },
    {
      "id": "20",
      "text": "Zhuo Muqiang Ba asks about the legend of the 'Purple Qilin'.",
      "level": 1
    },
    {
      "id": "20.1",
      "text": "He clarifies that he means a fierce Tibetan Mastiff, a large dog with a mane.",
      "level": 2
    },
    {
      "id": "21",
      "text": "The elders interpret 'Purple Qilin' as 'High Mountain Snow Wolf'.",
      "level": 1
    },
    {
      "id": "22",
      "text": "A Tangka painting is presented, depicting a wrathful, multi-faced, multi-armed Buddha figure on a white snow mastiff, surrounded by smaller Buddhist figures.",
      "level": 1
    },
    {
      "id": "22.1",
      "text": "The snow mastiff is described as powerful, with golden armor, embodying a general preparing for battle.",
      "level": 2
    },
    {
      "id": "23",
      "text": "Zhuo Muqiang Ba identifies the mastiff in the painting as a 'War Mastiff'.",
      "level": 1
    },
    {
      "id": "24",
      "text": "Elder Gelie confirms it is the 'High Mountain Snow Wolf'.",
      "level": 1
    },
    {
      "id": "25",
      "text": "Elder Danba explains that the figure is 'Ghost King Xi Li Emperor', who guards the southwest, and his mount is the High Mountain Snow Wolf.",
      "level": 1
    },
    {
      "id": "26",
      "text": "The connection between the High Mountain Snow Wolf and Shangri-La is emphasized.",
      "level": 1
    },
    {
      "id": "27",
      "text": "The High Mountain Snow Wolves are described as integral to the creation of Shangri-La and its final guardians.",
      "level": 1
    },
    {
      "id": "28",
      "text": "Zhuo Muqiang Ba inquires about the 'Four Directional Auspicious Beasts'.",
      "level": 1
    },
    {
      "id": "28.1",
      "text": "These beasts, though now mythical, are depicted on totems and prayer flags with different meanings.",
      "level": 2
    },
    {
      "id": "29",
      "text": "The elders share legends about the High Mountain Snow Wolf co-creating the glorious snow country with saints, battling demons, and achieving good results.",
      "level": 1
    },
    {
      "id": "30",
      "text": "Zhuo Muqiang Ba reveals that his search for Paba La is motivated by a Tibetan Mastiff.",
      "level": 1
    },
    {
      "id": "31",
      "text": "The elders agree that the High Mountain Snow Wolf and Shangri-La are inseparable, and following the wolf's tracks will lead to Shangri-La.",
      "level": 1
    },
    {
      "id": "32",
      "text": "Elder Dajie reiterates that Zhuo Muqiang Ba's destiny is guided by the Buddha, leading him to Paba La.",
      "level": 1
    },
    {
      "id": "33",
      "text": "Zhuo Muqiang Ba questions what would happen if he stopped pursuing Paba La.",
      "level": 1
    },
    {
      "id": "34",
      "text": "Elder Dajie insists Zhuo Muqiang Ba will not stop because he is a Sacred Envoy and can feel Paba La's call.",
      "level": 1
    },
    {
      "id": "35",
      "text": "Master Ya La asks about the conversation with the elders, who seem indecisive, mentioning 'Great Blue Lotus'.",
      "level": 1
    },
    {
      "id": "36",
      "text": "Dong Ji reveals that the elders' agreement to meet Zhuo Muqiang Ba was due to a conversation between Master Ya La and the elders.",
      "level": 1
    },
    {
      "id": "37",
      "text": "Zhuo Muqiang Ba questions Master Ya La about his conversation with the elders.",
      "level": 1
    },
    {
      "id": "38",
      "text": "Master Ya La clarifies that his discussion with the elders was on religious matters and that Zhuo Muqiang Ba's Sacred Envoy status likely led to their agreement.",
      "level": 1
    },
    {
      "id": "39",
      "text": "Master Ya La confirms that the High Mountain Snow Wolf refers to Tibetan Mastiffs, specifically 'War Mastiffs'.",
      "level": 1
    },
    {
      "id": "39.1",
      "text": "He explains that this connection is not widely known in folklore or biological research, but stems from a religious perspective.",
      "level": 2
    },
    {
      "id": "39.2",
      "text": "Master Ya La states that Tibetan Mastiffs were once royal pets and only became known to the public after the fall of the Tubo Dynasty, a history related to 'Guang Jun'.",
      "level": 2
    },
    {
      "id": "40",
      "text": "Zhuo Muqiang Ba realizes his understanding of War Mastiffs has been limited to non-religious aspects.",
      "level": 1
    },
    {
      "id": "41",
      "text": "The term 'Wolf Leader' is mentioned and explained as meaning they can lead wolves.",
      "level": 1
    },
    {
      "id": "42",
      "text": "Master Ya La suggests that the current lack of sightings of wild Tibetan Mastiffs and their interaction with wolves is due to their scarcity.",
      "level": 1
    },
    {
      "id": "43",
      "text": "An elder expert's research indicated that wolves exhibit not just fear but awe towards Tibetan Mastiffs, akin to commoners facing a king.",
      "level": 1
    },
    {
      "id": "43.1",
      "text": "This expert observed a wolf cowering from a Tibetan Mastiff, suggesting a natural 'kingly aura' that commands spiritual submission.",
      "level": 2
    },
    {
      "id": "43.2",
      "text": "This expert also tracked a Tibetan Mastiff living within a wolf pack, observing it as a symbol of freedom and回归 (return) to its natural state.",
      "level": 2
    },
    {
      "id": "44",
      "text": "Genetic studies show a significant difference between Tibetan Mastiffs and wolves, leading some to suggest they did not evolve from wolves.",
      "level": 1
    },
    {
      "id": "44.1",
      "text": "The elder expert proposed that Tibetan Mastiffs are highly evolved individuals from wolf ancestors, possessing superior physical and intellectual traits, and that all canids carry a gene of submission to them due to their 'noble blood'.",
      "level": 2
    },
    {
      "id": "45",
      "text": "The elder expert's conclusions were partially corrected to state that this specific submissive relationship exists between Tibetan wolves and Tibetan Mastiffs, not other canids.",
      "level": 1
    },
    {
      "id": "46",
      "text": "Master Ya La learned this information from an elder Tibetan researcher named 'Sai', who is now deceased.",
      "level": 1
    },
    {
      "id": "46.1",
      "text": "Sai was a passionate Tibetan Mastiff enthusiast before and during the liberation period and influenced Professor Fang Xin's research direction.",
      "level": 2
    },
    {
      "id": "46.2",
      "text": "Sai's profession was unusual and related to animals, and he was highly knowledgeable and multi-lingual.",
      "level": 2
    },
    {
      "id": "47",
      "text": "Professor Fang Xin believes that while the direct evolutionary link might be flawed, the special connection between Tibetan wolves and Tibetan Mastiffs is a significant area of study.",
      "level": 1
    },
    {
      "id": "48",
      "text": "Master Ya La reveals that Gongbu Village's elders are descendants of the Southern Outer Vajra Division, and the 'Gate of Life' is their holy altar.",
      "level": 1
    },
    {
      "id": "49",
      "text": "The elders' adherence to their mission after a thousand years of separation is noteworthy.",
      "level": 1
    },
    {
      "id": "50",
      "text": "Master Ya La expresses doubt about the elders' method of confirming Sacred Envoy status, especially regarding Mo Jin being a foreigner.",
      "level": 1
    },
    {
      "id": "50.1",
      "text": "He believes Mo Jin might not be the Sacred Envoy, but rather someone within his mercenary group.",
      "level": 2
    },
    {
      "id": "50.2",
      "text": "It is confirmed that Mo Jin is the one identified as the Sacred Envoy, and there are other Sacred Envoys besides Mo Jin and Zhuo Muqiang Ba.",
      "level": 2
    },
    {
      "id": "51",
      "text": "The function of a Sacred Envoy seems to be directly related to or capable of reaching the Paba La Temple.",
      "level": 1
    },
    {
      "id": "51.1",
      "text": "Zhuo Muqiang Ba possesses 'noble and sacred blood', which is likely a factor in his connection to Paba La.",
      "level": 2
    },
    {
      "id": "52",
      "text": "Master Ya La expresses concern about Zhuo Muqiang Ba's physical condition, particularly a relapse of 'Great Blue Lotus' curse, confirmed by the elders.",
      "level": 1
    },
    {
      "id": "52.1",
      "text": "The current treatment only alleviates surface pain, not eradicating the curse fundamentally.",
      "level": 2
    },
    {
      "id": "52.2",
      "text": "The elders can only guarantee a few years of relief, and the long-term prognosis is uncertain, requiring consultation with the Elder Council.",
      "level": 2
    },
    {
      "id": "53",
      "text": "Zhuo Muqiang Ba must not be informed about the severity of his condition.",
      "level": 1
    },
    {
      "id": "54",
      "text": "The sung poem recited by Dong Ji is confirmed to be a '頌歌' (chant or hymn).",
      "level": 1
    },
    {
      "id": "54.1",
      "text": "Gongbu Village possesses eleven independent chants, but likely had more, and a significant portion of them hold key information.",
      "level": 2
    },
    {
      "id": "54.2",
      "text": "The origin and source of these chants are being investigated by the Elder Council.",
      "level": 2
    },
    {
      "id": "55",
      "text": "The dispersion of clues was intentional, yet Gongbu Village was tasked with guarding important information.",
      "level": 1
    },
    {
      "id": "56",
      "text": "The thirteen individuals who attempted to rob the Ahe underground palace are preliminarily identified as the 'Thirteen Round Table Knights'.",
      "level": 1
    },
    {
      "id": "56.1",
      "text": "The Thirteen Round Table Knights are a powerful, secretive, and rapidly rising organization that opposes those seeking the temple, including their own holy sect.",
      "level": 2
    },
    {
      "id": "56.2",
      "text": "Their disappearance in recent years is attributed to significant losses in the Maya underground palace.",
      "level": 2
    },
    {
      "id": "56.3",
      "text": "The number thirteen in Western culture symbolizes hell, thus 'Thirteen Round Table Knights' implies 'fallen knights of hell'.",
      "level": 2
    },
    {
      "id": "57",
      "text": "The group arrives at the 'Hell's Gate' location, a scenic spot with waterfalls and rainbows, described as a place of immense natural beauty.",
      "level": 1
    },
    {
      "id": "57.1",
      "text": "The name 'Hell's Gate' is considered ironic given its beautiful appearance.",
      "level": 2
    },
    {
      "id": "57.2",
      "text": "The location has no artificial markers and is identified solely through memory of geographical features.",
      "level": 2
    },
    {
      "id": "57.3",
      "text": "The exact entrance or mechanism for opening 'Hell's Gate' is unknown to Dong Ji.",
      "level": 2
    },
    {
      "id": "58",
      "text": "Dong Ji volunteers to accompany the group to Xiangxiong.",
      "level": 1
    },
    {
      "id": "58.1",
      "text": "Lu Jingnan dismisses his offer, citing the dangerous nature of the journey and his inability to ensure his safety, fearing he would slow the team down.",
      "level": 2
    }
  ],
  "concepts": [
    {
      "name": "Gegu",
      "frequency": 1,
      "context": "Region mentioned for its open terrain, suitable for helicopter operations."
    },
    {
      "name": "Motuo",
      "frequency": 1,
      "context": "Region contrasted with Gegu for its mountainous and forested terrain, posing ambush risks."
    },
    {
      "name": "Helicopter",
      "frequency": 2,
      "context": "Mode of transport used for rapid approach and later to depart from Gongbu village."
    },
    {
      "name": "Ambush",
      "frequency": 1,
      "context": "Risk associated with mountainous terrain."
    },
    {
      "name": "Ancient ruins",
      "frequency": 1,
      "context": "Reason for avoiding direct conflict."
    },
    {
      "name": "Sacred Envoy",
      "frequency": 6,
      "context": "Role fulfilled by Zhuo Muqiang Ba, with past precedents and a specific tradition of guides."
    },
    {
      "name": "Gate of Life",
      "frequency": 2,
      "context": "Location entered by past Sacred Envoys who did not return."
    },
    {
      "name": "Heavenly beads",
      "frequency": 1,
      "context": "Sacred items on Zhuo Muqiang Ba, unrelated to his Sacred Envoy status."
    },
    {
      "name": "Shangri-La",
      "frequency": 6,
      "context": "The ultimate destination, also referred to as Paba La, a sacred pure land."
    },
    {
      "name": "Paba La",
      "frequency": 5,
      "context": "Another name for Shangri-La, the ultimate goal of the search."
    },
    {
      "name": "Buddha",
      "frequency": 3,
      "context": "Believed by some to have preordained Zhuo Muqiang Ba's destiny and guiding his path."
    },
    {
      "name": "Science",
      "frequency": 1,
      "context": "Zhuo Muqiang Ba's basis of belief, contrasting with religious or spiritual notions."
    },
    {
      "name": "Hanging Temple",
      "frequency": 2,
      "context": "Location with mechanisms that will impede the target's progress."
    },
    {
      "name": "Purple Qilin",
      "frequency": 1,
      "context": "A legendary creature Zhuo Muqiang Ba inquires about."
    },
    {
      "name": "Tibetan Mastiff",
      "frequency": 9,
      "context": "The animal Zhuo Muqiang Ba associates with the Purple Qilin, and later identified with High Mountain Snow Wolves and War Mastiffs."
    },
    {
      "name": "War Mastiff",
      "frequency": 3,
      "context": "A powerful type of Tibetan Mastiff, depicted in Tangka paintings and central to discussions."
    },
    {
      "name": "High Mountain Snow Wolf",
      "frequency": 7,
      "context": "Identified as a synonym for War Mastiffs and intrinsically linked to Shangri-La."
    },
    {
      "name": "Tangka",
      "frequency": 1,
      "context": "A type of Tibetan scroll painting."
    },
    {
      "name": "Ghost King Xi Li Emperor",
      "frequency": 1,
      "context": "Figure associated with the High Mountain Snow Wolf as its rider."
    },
    {
      "name": "Four Directional Auspicious Beasts",
      "frequency": 1,
      "context": "A concept Zhuo Muqiang Ba inquires about, related to Tibetan mythology."
    },
    {
      "name": "Gongbu Village",
      "frequency": 5,
      "context": "Location where elders discuss important matters and where Zhuo Muqiang Ba meets them."
    },
    {
      "name": "Elders",
      "frequency": 8,
      "context": "The three senior figures in Gongbu Village who hold significant knowledge and authority."
    },
    {
      "name": "Master Ya La",
      "frequency": 11,
      "context": "A prominent figure guiding Zhuo Muqiang Ba, with knowledge of religious and historical matters."
    },
    {
      "name": "Lu Jingnan",
      "frequency": 4,
      "context": "A member of the group, involved in strategic discussions and assessing risks."
    },
    {
      "name": "Dong Ji",
      "frequency": 8,
      "context": "A local guide from Gongbu Village, with knowledge of traditions and the landscape."
    },
    {
      "name": "Southern Outer Vajra Division",
      "frequency": 1,
      "context": "Descendants who reside in Gongbu Village and have a connection to their holy altar."
    },
    {
      "name": "Great Blue Lotus",
      "frequency": 1,
      "context": "A curse afflicting Zhuo Muqiang Ba, confirmed by the elders."
    },
    {
      "name": "Curse",
      "frequency": 2,
      "context": "A harmful affliction, specifically the 'Great Blue Lotus' curse affecting Zhuo Muqiang Ba."
    },
    {
      "name": "Elder Council",
      "frequency": 2,
      "context": "Higher authority to consult regarding complex issues, such as Zhuo Muqiang Ba's condition."
    },
    {
      "name": "Poem",
      "frequency": 3,
      "context": "Recited by Dong Ji, it contains prophecies and clues about the quest."
    },
    {
      "name": "Chant/Hymn (頌歌)",
      "frequency": 2,
      "context": "The genre of the poem recited by Dong Ji, with potential key information."
    },
    {
      "name": "Thirteen Round Table Knights",
      "frequency": 3,
      "context": "A formidable and secretive organization involved in tomb raiding, identified as antagonists."
    },
    {
      "name": "Hell's Gate",
      "frequency": 3,
      "context": "A location described as a natural wonder, believed to be an entrance or point of passage."
    },
    {
      "name": "Professor Fang Xin",
      "frequency": 3,
      "context": "An academic mentor who has research interests in Tibetan Mastiffs and their legends."
    },
    {
      "name": "Sai",
      "frequency": 3,
      "context": "An elder Tibetan Tibetan Mastiff enthusiast and researcher, whose knowledge is relayed through Professor Fang Xin."
    },
    {
      "name": "Tubo Dynasty",
      "frequency": 2,
      "context": "Historical period related to the history of Tibetan Mastiffs and their public availability."
    },
    {
      "name": "Guang Jun",
      "frequency": 2,
      "context": "Historical entity or figure connected to the spread of Tibetan Mastiffs and the fall of the Tubo Dynasty."
    },
    {
      "name": "Wolf Leader",
      "frequency": 3,
      "context": "A title or concept referring to the leadership role of certain wolves or wolf-like creatures."
    },
    {
      "name": "Xiongshi",
      "frequency": 1,
      "context": "A location the group intends to travel to after leaving Gongbu village."
    }
  ],
  "relations": [
    {
      "source": "Gegu",
      "target": "Helicopter",
      "type": "suitable_for"
    },
    {
      "source": "Motuo",
      "target": "Ambush",
      "type": "prone_to"
    },
    {
      "source": "Sacred Envoy",
      "target": "Gate of Life",
      "type": "enters"
    },
    {
      "source": "Sacred Envoy",
      "target": "Shangri-La",
      "type": "seeks"
    },
    {
      "source": "Sacred Envoy",
      "target": "Paba La",
      "type": "seeks"
    },
    {
      "source": "Zhuo Muqiang Ba",
      "target": "Sacred Envoy",
      "type": "is_a"
    },
    {
      "source": "Heavenly beads",
      "target": "Sacred Envoy",
      "type": "unrelated_to"
    },
    {
      "source": "Elders",
      "target": "Gongbu Village",
      "type": "resides_in"
    },
    {
      "source": "Elders",
      "target": "Sacred Envoy",
      "type": "confirms_identity_of"
    },
    {
      "source": "Master Ya La",
      "target": "Zhuo Muqiang Ba",
      "type": "guides"
    },
    {
      "source": "Master Ya La",
      "target": "Tibetan Mastiff",
      "type": "explains_connection_to"
    },
    {
      "source": "Tibetan Mastiff",
      "target": "High Mountain Snow Wolf",
      "type": "synonym_for"
    },
    {
      "source": "Tibetan Mastiff",
      "target": "War Mastiff",
      "type": "type_of"
    },
    {
      "source": "High Mountain Snow Wolf",
      "target": "Shangri-La",
      "type": "linked_to"
    },
    {
      "source": "High Mountain Snow Wolf",
      "target": "Ghost King Xi Li Emperor",
      "type": "mount_of"
    },
    {
      "source": "Great Blue Lotus",
      "target": "Curse",
      "type": "is_a"
    },
    {
      "source": "Zhuo Muqiang Ba",
      "target": "Great Blue Lotus",
      "type": "afflicted_by"
    },
    {
      "source": "Poem",
      "target": "Dong Ji",
      "type": "recited_by"
    },
    {
      "source": "Chant/Hymn (頌歌)",
      "target": "Poem",
      "type": "is_a"
    },
    {
      "source": "Thirteen Round Table Knights",
      "target": "Antagonist",
      "type": "is_a"
    },
    {
      "source": "Hell's Gate",
      "target": "Natural wonder",
      "type": "is_a"
    },
    {
      "source": "Professor Fang Xin",
      "target": "Tibetan Mastiff",
      "type": "researches"
    },
    {
      "source": "Sai",
      "target": "Tibetan Mastiff",
      "type": "enthusiast_of"
    },
    {
      "source": "Sai",
      "target": "Professor Fang Xin",
      "type": "influenced"
    },
    {
      "source": "Tubo Dynasty",
      "target": "Tibetan Mastiff",
      "type": "historical_context_for"
    },
    {
      "source": "Guang Jun",
      "target": "Tubo Dynasty",
      "type": "related_to_fall_of"
    },
    {
      "source": "Wolf Leader",
      "target": "Leadership role",
      "type": "denotes"
    },
    {
      "source": "Southern Outer Vajra Division",
      "target": "Gongbu Village",
      "type": "descendants_in"
    },
    {
      "source": "Southern Outer Vajra Division",
      "target": "Holy altar",
      "type": "possesses"
    },
    {
      "source": "Zhuo Muqiang Ba",
      "target": "Paba La",
      "type": "motivated_by"
    },
    {
      "source": "Zhuo Muqiang Ba",
      "target": "Noble and sacred blood",
      "type": "possesses"
    },
    {
      "source": "Elders",
      "target": "Great Blue Lotus",
      "type": "confirmed_curse_of"
    },
    {
      "source": "Elders",
      "target": "Sacred Envoy",
      "type": "question_method_of_confirming"
    },
    {
      "source": "Lu Jingnan",
      "target": "Dong Ji",
      "type": "denies_request_of"
    },
    {
      "source": "Master Ya La",
      "target": "Elder Council",
      "type": "consults"
    }
  ],
  "hierarchy": {
    "main_topics": [
      "Mission Strategy and Opposition",
      "Mythology and Legends",
      "Spiritual and Predetermined Destiny",
      "Tibetan Mastiff Lore and Connections",
      "Villainous Organizations and Curses"
    ],
    "structure": "The document follows a narrative structure, detailing the progress of a mission, character interactions, and the unfolding of ancient mysteries. It begins with strategic planning, moves into discussions with local elders about mythology and destiny, delves into the complex lore of Tibetan Mastiffs and mythical beasts, and concludes with concerns about curses and the introduction of new antagonist groups. The structure is episodic, with distinct scenes and conversations driving the plot forward."
  }
}