{
  "propositions": [
    {
      "id": "1",
      "text": "A hundred-year-old discovery of human remains in a cave in Shennongjia.",
      "level": 1
    },
    {
      "id": "1.1",
      "text": "The cave, known as \"Ren Dong\" (Human Cave), is located on a cliff face in Shennongjia's Xinhua Township.",
      "level": 2
    },
    {
      "id": "1.2",
      "text": "An expedition team, led by local villagers, found over a hundred sets of human bones in the cave.",
      "level": 2
    },
    {
      "id": "1.3",
      "text": "The bones belong to men, women, and children, totaling over 300 individuals.",
      "level": 2
    },
    {
      "id": "1.4",
      "text": "Evidence of past human habitation, such as pottery shards and burnt wood, was found in the cave.",
      "level": 2
    },
    {
      "id": "1.5",
      "text": "The reason for hundreds of people living and dying in the cave remains unknown.",
      "level": 2
    },
    {
      "id": "2",
      "text": "The narrator, Na Duo, a journalist, encounters the news of the \"Ren Dong\" discovery and it triggers a traumatic memory.",
      "level": 1
    },
    {
      "id": "2.1",
      "text": "Na Duo sees the news online while working at the \"Morning Star Daily\".",
      "level": 2
    },
    {
      "id": "2.2",
      "text": "He believes the expedition team and reporter are unaware of the deeper, terrifying significance of \"Ren Dong\".",
      "level": 2
    },
    {
      "id": "2.3",
      "text": "Na Duo has a personal traumatic experience connected to \"Ren Dong\" less than a year prior.",
      "level": 2
    },
    {
      "id": "2.4",
      "text": "He reflects on journalistic practices, emphasizing the importance of secondary interviews based on online information.",
      "level": 2
    },
    {
      "id": "2.5",
      "text": "The discovery reawakens a deeply buried, terrifying memory that he had tried to forget.",
      "level": 2
    },
    {
      "id": "2.6",
      "text": "Some online commenters dismiss the discovery as fake news.",
      "level": 2
    },
    {
      "id": "2.7",
      "text": "Na Duo feels compelled to write his story to overcome the shadow of his past experience.",
      "level": 2
    },
    {
      "id": "3",
      "text": "The story flashes back to the summer of 2001, when Na Duo joined a university expedition to Shennongjia.",
      "level": 1
    },
    {
      "id": "3.1",
      "text": "The expedition was organized by F University's biology department, promoting \"quality education\" and \"hardship education\".",
      "level": 2
    },
    {
      "id": "3.2",
      "text": "The expedition was led by Liang Yingwu, Na Duo's friend and former classmate, a lecturer at F University.",
      "level": 2
    },
    {
      "id": "3.3",
      "text": "Liang Yingwu is secretly a researcher for a mysterious, high-level organization known as \"X Institute\".",
      "level": 2
    },
    {
      "id": "3.4",
      "text": "The X Institute deals with anomalous events that defy conventional scientific understanding.",
      "level": 2
    },
    {
      "id": "3.5",
      "text": "Na Duo's own curiosity and experiences have led him to interact with the X Institute.",
      "level": 2
    },
    {
      "id": "3.6",
      "text": "Shennongjia is known for its mysterious atmosphere, including legends of wild men.",
      "level": 2
    },
    {
      "id": "3.7",
      "text": "The group travels from Shanghai to Wuhan and then by bus to Badong.",
      "level": 2
    },
    {
      "id": "3.8",
      "text": "The 12 students in the expedition exhibit diverse personalities and backgrounds.",
      "level": 2
    },
    {
      "id": "3.9",
      "text": "Notable students include He Yunkai (physically imposing), Liu Wenying (outgoing beauty), Fei Qing and Ka Xiao'ou (a couple), Yuan Qiuhong (from a wealthy family), Zhu Zili (arrogant rich boy), Zhao Gang, Wang Fangyuan, Lin Zhipu, Jiang Wei (seemingly ordinary), and Lu Yun and Guo Yonghua (introverted).",
      "level": 2
    },
    {
      "id": "3.10",
      "text": "The journey to Badong highlights the economic disparity between urban Shanghai and rural areas.",
      "level": 2
    },
    {
      "id": "3.11",
      "text": "The bus journey into Shennongjia is perilous due to steep, winding mountain roads.",
      "level": 2
    },
    {
      "id": "4",
      "text": "The expedition arrives at Sanlitun Village, the starting point for their trek.",
      "level": 1
    },
    {
      "id": "4.1",
      "text": "The plan is to traverse 300 kilometers of primitive forest over 15 days, with no local guides.",
      "level": 2
    },
    {
      "id": "4.2",
      "text": "Na Duo and Liang Yingwu are not worried due to detailed maps and Liang's potential resources from the X Institute.",
      "level": 2
    },
    {
      "id": "4.3",
      "text": "They are welcomed by village elders and residents, and partake in a feast of wild game and mushrooms.",
      "level": 2
    },
    {
      "id": "4.4",
      "text": "A young boy named A Bao mentions \"Ren Dong\" as a place to play.",
      "level": 2
    },
    {
      "id": "4.5",
      "text": "A Bao's father, Tian Jin, reacts with extreme anger and physically punishes A Bao for mentioning \"Ren Dong\".",
      "level": 2
    },
    {
      "id": "4.6",
      "text": "The villagers and elders consider \"Ren Dong\" a dangerous and forbidden place, a \"fierce land\" (xiong di) that brings disaster.",
      "level": 2
    },
    {
      "id": "4.7",
      "text": "The students' curiosity is piqued by the villagers' fear and secrecy surrounding \"Ren Dong\".",
      "level": 2
    },
    {
      "id": "4.8",
      "text": "Liang Yingwu agrees to let the students investigate \"Ren Dong\" the next day, despite the villagers' warnings.",
      "level": 2
    },
    {
      "id": "4.9",
      "text": "The village conditions are basic, with limited electricity and reliance on kerosene lamps for many households.",
      "level": 2
    },
    {
      "id": "4.10",
      "text": "Na Duo probes Liang Yingwu about the X Institute, learning about cases involving mythical creatures like \"Nian\" and its connection to time.",
      "level": 2
    },
    {
      "id": "5",
      "text": "The expedition begins their trek into Shennongjia.",
      "level": 1
    },
    {
      "id": "5.1",
      "text": "They follow a stream and navigate uneven terrain, facing challenges like exposed tree roots and fallen logs.",
      "level": 2
    },
    {
      "id": "5.2",
      "text": "The students, initially excited, begin to feel the physical strain of the journey.",
      "level": 2
    },
    {
      "id": "5.3",
      "text": "The students' conversations revolve around \"Ren Dong\", with some, like Zhu Zili, making superstitious comparisons.",
      "level": 2
    },
    {
      "id": "5.4",
      "text": "They reach Baoshan Mountain and prepare to climb to \"Ren Dong\", which is located on a steep slope.",
      "level": 2
    },
    {
      "id": "5.5",
      "text": "The climb is arduous, resembling rock climbing, and the students' appearance deteriorates.",
      "level": 2
    },
    {
      "id": "5.6",
      "text": "Na Duo notes that the path they are taking seems unusually well-worn for a forbidden place.",
      "level": 2
    },
    {
      "id": "5.7",
      "text": "Liang Yingwu expresses concern about the delay but proceeds with the plan.",
      "level": 2
    },
    {
      "id": "5.8",
      "text": "They reach the entrance of \"Ren Dong\" and prepare to enter, with Liang Yingwu securing ropes for descent.",
      "level": 2
    },
    {
      "id": "6",
      "text": "Inside \"Ren Dong\", the explorers find a surprisingly spacious and dry cave.",
      "level": 1
    },
    {
      "id": "6.1",
      "text": "The cave lacks expected features like bats or vegetation, which strikes Liang Yingwu and Na Duo as unusual.",
      "level": 2
    },
    {
      "id": "6.2",
      "text": "They proceed into a dark, seemingly natural passageway, described as a \"corridor leading to a tomb\" (yi tiao tong xiang fen mu de yong dao).",
      "level": 2
    },
    {
      "id": "6.3",
      "text": "The passageway is uneven and requires careful navigation.",
      "level": 2
    },
    {
      "id": "6.4",
      "text": "After several turns, they discover it is not a dead end but leads to another large space.",
      "level": 2
    }
  ],
  "concepts": [
    {
      "name": "Ren Dong",
      "frequency": 14,
      "context": "The 'Human Cave' in Shennongjia where human remains were discovered, and the site of a traumatic event for the narrator."
    },
    {
      "name": "Shennongjia",
      "frequency": 10,
      "context": "The mountainous region in China where the story is set, known for its mystery and legends."
    },
    {
      "name": "Na Duo",
      "frequency": 10,
      "context": "The narrator, a journalist for the 'Morning Star Daily', who experiences a traumatic event related to 'Ren Dong'."
    },
    {
      "name": "Liang Yingwu",
      "frequency": 10,
      "context": "Na Duo's friend, a lecturer, and a secretly affiliated researcher with the X Institute, leading the university expedition."
    },
    {
      "name": "X Institute",
      "frequency": 4,
      "context": "A mysterious, high-level organization that investigates anomalous and supernatural events."
    },
    {
      "name": "Expedition",
      "frequency": 7,
      "context": "The group of university students and the narrator embarking on a journey into Shennongjia."
    },
    {
      "name": "Students",
      "frequency": 7,
      "context": "The twelve university students participating in the expedition, exhibiting various personalities."
    },
    {
      "name": "Journalism",
      "frequency": 3,
      "context": "Na Duo's profession and his reflections on journalistic practices."
    },
    {
      "name": "Memory",
      "frequency": 3,
      "context": "Na Duo's recurring traumatic memory associated with 'Ren Dong'."
    },
    {
      "name": "Discovery",
      "frequency": 3,
      "context": "The initial finding of human remains and the subsequent exploration of 'Ren Dong'."
    },
    {
      "name": "Curiosity",
      "frequency": 3,
      "context": "A driving force for Na Duo and the students, leading them to investigate the mysteries of Shennongjia and 'Ren Dong'."
    },
    {
      "name": "Fear",
      "frequency": 3,
      "context": "The villagers' fear of 'Ren Dong' and the growing apprehension among the expedition members."
    },
    {
      "name": "Passageway",
      "frequency": 4,
      "context": "The dark, winding tunnel inside 'Ren Dong' that the explorers navigate."
    },
    {
      "name": "Supernatural",
      "frequency": 2,
      "context": "The concept of events beyond scientific explanation, which the X Institute investigates."
    },
    {
      "name": "Warning",
      "frequency": 3,
      "context": "The villagers' repeated warnings against entering 'Ren Dong'."
    }
  ],
  "relations": [
    {
      "source": "Ren Dong",
      "target": "Human remains",
      "type": "contains"
    },
    {
      "source": "Ren Dong",
      "target": "Traumatic memory",
      "type": "associated_with"
    },
    {
      "source": "Na Duo",
      "target": "Journalist",
      "type": "is_a"
    },
    {
      "source": "Na Duo",
      "target": "Ren Dong",
      "type": "has_traumatic_experience"
    },
    {
      "source": "Liang Yingwu",
      "target": "X Institute",
      "type": "affiliated_with"
    },
    {
      "source": "Liang Yingwu",
      "target": "Expedition",
      "type": "leads"
    },
    {
      "source": "X Institute",
      "target": "Anomalous events",
      "type": "investigates"
    },
    {
      "source": "Expedition",
      "target": "Students",
      "type": "includes"
    },
    {
      "source": "Expedition",
      "target": "Shennongjia",
      "type": "travels_to"
    },
    {
      "source": "Villagers",
      "target": "Ren Dong",
      "type": "fear"
    },
    {
      "source": "Villagers",
      "target": "Warning",
      "type": "give"
    },
    {
      "source": "Passageway",
      "target": "Ren Dong",
      "type": "part_of"
    },
    {
      "source": "Supernatural",
      "target": "X Institute",
      "type": "studied_by"
    }
  ],
  "hierarchy": {
    "main_topics": [
      "Discovery of \"Ren Dong\"",
      "Narrator's Trauma and Investigation",
      "University Expedition to Shennongjia",
      "Exploration of \"Ren Dong\""
    ],
    "structure": "The document is structured as a narrative with a framing device. It begins with the present-day discovery of 'Ren Dong', then flashes back to the events leading up to it during a university expedition, and finally details the exploration of the 'Ren Dong' cave itself, interspersed with the narrator's personal reflections and insights."
  }
}