{
  "propositions": [
    {
      "id": "1",
      "text": "A woman receives an email from an unknown sender titled \"Past Events\".",
      "level": 1
    },
    {
      "id": "1.1",
      "text": "The email describes a frightening experience from her 17th year, involving getting lost at night, a kiss, an injury, and stumbling into a graveyard.",
      "level": 2
    },
    {
      "id": "1.2",
      "text": "She fears she might be pregnant and that a spirit might have possessed her.",
      "level": 2
    },
    {
      "id": "1.3",
      "text": "The memory of that night still haunts her.",
      "level": 2
    },
    {
      "id": "2",
      "text": "Zheng Chuan, the recipient of the email, is puzzled by its content and origin.",
      "level": 1
    },
    {
      "id": "2.1",
      "text": "He initially intended to receive a contract draft but found this peculiar email instead.",
      "level": 2
    },
    {
      "id": "2.2",
      "text": "He smokes and contemplates the email's sender and relevance to him.",
      "level": 2
    },
    {
      "id": "2.3",
      "text": "He recalls three young women he met and dated but is certain none had the described graveyard experience.",
      "level": 2
    },
    {
      "id": "2.4",
      "text": "The sender's email address is unfamiliar.",
      "level": 2
    },
    {
      "id": "3",
      "text": "Zheng Chuan's secretary, Gao Wei, enters and informs him about a canceled dinner.",
      "level": 1
    },
    {
      "id": "3.1",
      "text": "Gao Wei seems pleased about the cancellation.",
      "level": 2
    },
    {
      "id": "3.2",
      "text": "Zheng Chuan, who is losing interest in Gao Wei, anticipates her desire to spend time with him.",
      "level": 2
    },
    {
      "id": "3.3",
      "text": "Gao Wei expresses concern about him driving after drinking.",
      "level": 2
    },
    {
      "id": "3.4",
      "text": "She recounts a frightening dream she had where Zheng Chuan was driving at night on a country road and encountered a ghostly woman near a graveyard.",
      "level": 2
    },
    {
      "id": "4",
      "text": "Zheng Chuan suspects a connection between the email and Gao Wei's dream, both involving a encounter in a graveyard.",
      "level": 1
    },
    {
      "id": "4.1",
      "text": "He reflects on his past as a 'sent-down youth' and searches for clues.",
      "level": 2
    },
    {
      "id": "4.2",
      "text": "He recalls a former classmate named Lin Xiaoyue and remembers walking with her at night.",
      "level": 2
    },
    {
      "id": "4.3",
      "text": "He speculates if Lin Xiaoyue is the sender and why she would bring up a distant past experience.",
      "level": 2
    },
    {
      "id": "4.4",
      "text": "He learns from a contact list that Lin Xiaoyue works at 'Yun' magazine.",
      "level": 2
    },
    {
      "id": "5",
      "text": "Zheng Chuan receives a second email titled \"Past Events (2)\".",
      "level": 1
    },
    {
      "id": "5.1",
      "text": "He decides to contact 'Yun' magazine to inquire about Lin Xiaoyue.",
      "level": 2
    },
    {
      "id": "5.2",
      "text": "He is informed that Lin Xiaoyue passed away over a year ago.",
      "level": 2
    },
    {
      "id": "5.3",
      "text": "Zheng Chuan experiences dizziness and ringing in his ears after this revelation.",
      "level": 2
    },
    {
      "id": "6",
      "text": "A murder occurred in the underground parking lot of Fangcheng Building a month prior, involving a young woman in a white dress.",
      "level": 1
    },
    {
      "id": "6.1",
      "text": "Zheng Chuan revisits the parking lot around the same time the murder happened.",
      "level": 2
    },
    {
      "id": "6.2",
      "text": "He recalls the event: finding the woman's body and calling the police.",
      "level": 2
    },
    {
      "id": "7",
      "text": "Zheng Chuan goes to his office to retrieve a contract and reflects on the mysterious emails from the deceased Lin Xiaoyue.",
      "level": 1
    },
    {
      "id": "7.1",
      "text": "He believes time, like a lost child, can return unexpectedly.",
      "level": 2
    },
    {
      "id": "8",
      "text": "In the elevator, Zheng Chuan encounters a young woman in a white dress, resembling the murder victim.",
      "level": 1
    },
    {
      "id": "8.1",
      "text": "The woman is silent and presses the button for the 24th floor.",
      "level": 2
    },
    {
      "id": "8.2",
      "text": "He is terrified and concludes she is the ghost of the murdered woman, Cui Juan, who worked on the 24th floor.",
      "level": 2
    },
    {
      "id": "9",
      "text": "Zheng Chuan ventures to the 24th floor, which is undergoing renovation and is dark and deserted.",
      "level": 1
    },
    {
      "id": "9.1",
      "text": "He hears a woman crying and encounters a white-clad figure.",
      "level": 2
    },
    {
      "id": "9.2",
      "text": "He panics and flees back into the elevator.",
      "level": 2
    },
    {
      "id": "9.3",
      "text": "He calls the building's security to investigate the 24th floor.",
      "level": 2
    },
    {
      "id": "10",
      "text": "Zheng Chuan feels controlled by an external will after his encounter on the 24th floor.",
      "level": 1
    },
    {
      "id": "11",
      "text": "Gao Wei arrives at the office early and prepares it for Zheng Chuan.",
      "level": 1
    },
    {
      "id": "11.1",
      "text": "She recalls meeting Zheng Chuan when she was a student and he recruited her to work at his company.",
      "level": 2
    },
    {
      "id": "11.2",
      "text": "Their relationship evolved into an intimate one, but his interest has waned.",
      "level": 2
    },
    {
      "id": "12",
      "text": "Zheng Chuan notices a Qing Dynasty vase in his office and recalls a friend's belief that antique objects can be sentient.",
      "level": 1
    },
    {
      "id": "12.1",
      "text": "He begins to suspect the vase might be influencing events.",
      "level": 2
    },
    {
      "id": "13",
      "text": "He rereads the second email from Lin Xiaoyue, which details a visit when she was ill and he felt responsible for her distress.",
      "level": 1
    },
    {
      "id": "14",
      "text": "Gao Wei informs Zheng Chuan about security concerns in the building, including a guard who claimed to see a ghost on the 24th floor.",
      "level": 1
    },
    {
      "id": "14.1",
      "text": "Zheng Chuan shares his own strange experiences from the previous night.",
      "level": 2
    },
    {
      "id": "14.2",
      "text": "Gao Wei expresses her fear due to her dreams consistently coming true.",
      "level": 2
    },
    {
      "id": "15",
      "text": "Zheng Chuan visits an antique shop and sees a young woman whose appearance reminds him of Lin Xiaoyue.",
      "level": 1
    },
    {
      "id": "15.1",
      "text": "He questions the possibility of Lin Xiaoyue being alive given her supposed death and his mother's voice after her passing.",
      "level": 2
    },
    {
      "id": "16",
      "text": "Gao Wei calls Zheng Chuan, asking him to pick her up from the office because she is scared to be alone.",
      "level": 1
    },
    {
      "id": "16.1",
      "text": "Zheng Chuan drives to the building and enters the elevator, hoping not to encounter the ghostly woman.",
      "level": 2
    },
    {
      "id": "16.2",
      "text": "The elevator stops at the 3rd floor, where the woman previously entered.",
      "level": 2
    },
    {
      "id": "17",
      "text": "Zheng Chuan enters his office, where Gao Wei is waiting, wearing a negligee and claiming to be hot due to the lack of air conditioning.",
      "level": 1
    },
    {
      "id": "17.1",
      "text": "He is attracted to her, and they engage in an intimate act.",
      "level": 2
    },
    {
      "id": "17.2",
      "text": "Gao Wei jokingly suggests the portrait on the vase is watching them.",
      "level": 2
    },
    {
      "id": "18",
      "text": "Gao Wei confronts Zheng Chuan about his suspected interest in another woman, his old flame.",
      "level": 1
    },
    {
      "id": "18.1",
      "text": "Zheng Chuan admits he's receiving emails from Lin Xiaoyue, who has been dead for over a year.",
      "level": 2
    },
    {
      "id": "18.2",
      "text": "He asks Gao Wei to investigate the emails.",
      "level": 2
    },
    {
      "id": "19",
      "text": "Gao Wei goes to the restroom and hears breathing from the next stall.",
      "level": 1
    },
    {
      "id": "19.1",
      "text": "She sees a white high-heeled shoe through a gap and calls out, but receives no answer.",
      "level": 2
    },
    {
      "id": "19.2",
      "text": "She flees the restroom and tells Zheng Chuan someone is in the women's restroom.",
      "level": 2
    },
    {
      "id": "19.3",
      "text": "They investigate, but find no one in the stall, though Gao Wei insists she saw a shoe.",
      "level": 2
    },
    {
      "id": "20",
      "text": "As they walk towards the elevator, Gao Wei asks if there are ghosts.",
      "level": 1
    },
    {
      "id": "21",
      "text": "The elevator stops at the 3rd floor, and Zheng Chuan exits, leaving Gao Wei behind.",
      "level": 1
    },
    {
      "id": "21.1",
      "text": "He realizes the woman he saw previously entered here.",
      "level": 2
    },
    {
      "id": "21.2",
      "text": "The elevator descends without him.",
      "level": 2
    },
    {
      "id": "22",
      "text": "Zheng Chuan decides to take the stairs and encounters a motionless woman in a white dress at the stairwell entrance.",
      "level": 1
    },
    {
      "id": "22.1",
      "text": "He retreats to the elevator lobby, terrified.",
      "level": 2
    },
    {
      "id": "23",
      "text": "In a dream, Zheng Chuan sees the woman at the stairwell and people carrying a coffin, stating she is a dead person who will only lie down when she sees it.",
      "level": 1
    },
    {
      "id": "23.1",
      "text": "He is awakened by a phone call, but the line is dead.",
      "level": 2
    },
    {
      "id": "24",
      "text": "At the hospital, nurse Tan Xiaoying attends to a dying patient, Zheng Chuan.",
      "level": 1
    },
    {
      "id": "24.1",
      "text": "She reflects on the shock of witnessing death and the concerns about moving bodies too soon.",
      "level": 2
    },
    {
      "id": "25",
      "text": "Tan Xiaoying finds a bouquet of roses with a card for patient 13, Zheng Chuan.",
      "level": 1
    },
    {
      "id": "25.1",
      "text": "The card reads 'Wishing you health! Lin Xiaoyue.'",
      "level": 2
    },
    {
      "id": "26",
      "text": "Zheng Chuan is stunned to receive flowers from the deceased Lin Xiaoyue.",
      "level": 1
    },
    {
      "id": "26.1",
      "text": "Tan Xiaoying recognizes the name and recalls Lin Xiaoyue as a former patient and editor from 'Yun' magazine.",
      "level": 2
    },
    {
      "id": "26.2",
      "text": "She confirms Lin Xiaoyue was hospitalized there and died of heart disease.",
      "level": 2
    },
    {
      "id": "27",
      "text": "Zheng Chuan's dizziness worsens, and he suspects it is related to the supernatural events he has experienced.",
      "level": 1
    },
    {
      "id": "27.1",
      "text": "He questions if female ghosts are haunting him.",
      "level": 2
    },
    {
      "id": "28",
      "text": "A man in a white coat pushes a gurney into Zheng Chuan's room, appearing to be transporting a body.",
      "level": 1
    },
    {
      "id": "28.1",
      "text": "He quickly retreats when Tan Xiaoying identifies the patient as 31 bed, not 13 bed.",
      "level": 2
    },
    {
      "id": "28.2",
      "text": "Zheng Chuan feels a chill, realizing the man was pushing a stretcher for a dead person.",
      "level": 2
    }
  ],
  "concepts": [
    {
      "name": "Email",
      "frequency": 9,
      "context": "The primary mode of communication for the mysterious messages."
    },
    {
      "name": "Ghost/Spirit",
      "frequency": 10,
      "context": "A recurring element, manifesting as a woman in white, causing fear and mystery."
    },
    {
      "name": "Graveyard",
      "frequency": 5,
      "context": "A location of significant events and fear in the narrative, linked to past trauma and supernatural encounters."
    },
    {
      "name": "Past",
      "frequency": 10,
      "context": "The central theme, with memories resurfacing and impacting the present."
    },
    {
      "name": "Fear",
      "frequency": 12,
      "context": "A dominant emotion experienced by the characters due to the supernatural occurrences."
    },
    {
      "name": "Memory",
      "frequency": 7,
      "context": "The act of recalling past events, often triggered by external stimuli."
    },
    {
      "name": "Woman in white",
      "frequency": 11,
      "context": "The recurring spectral figure that haunts Zheng Chuan and other characters."
    },
    {
      "name": "Lin Xiaoyue",
      "frequency": 8,
      "context": "A deceased former girlfriend whose presence is felt through emails and flowers."
    },
    {
      "name": "Zheng Chuan",
      "frequency": 21,
      "context": "The protagonist, who is increasingly entangled in supernatural events."
    },
    {
      "name": "Gao Wei",
      "frequency": 12,
      "context": "Zheng Chuan's secretary, who experiences unsettling dreams and fears."
    },
    {
      "name": "Antique",
      "frequency": 5,
      "context": "Objects from the past, like the vase and mirror, believed to possess spiritual or influential properties."
    },
    {
      "name": "Death",
      "frequency": 8,
      "context": "The ultimate end of life, but in this narrative, its boundaries are blurred by the supernatural."
    },
    {
      "id": "Hospital",
      "frequency": 6,
      "context": "A setting where illness and death are juxtaposed with the protagonist's supernatural experiences."
    },
    {
      "name": "Encounter",
      "frequency": 10,
      "context": "The meetings between characters and the spectral figures, often leading to distress."
    },
    {
      "name": "Dream",
      "frequency": 5,
      "context": "A psychic channel for premonition and heightened fear, particularly for Gao Wei."
    }
  ],
  "relations": [
    {
      "source": "Email",
      "target": "Past",
      "type": "delivers"
    },
    {
      "source": "Ghost/Spirit",
      "target": "Woman in white",
      "type": "is_a"
    },
    {
      "source": "Woman in white",
      "target": "Fear",
      "type": "causes"
    },
    {
      "source": "Graveyard",
      "target": "Fear",
      "type": "associated_with"
    },
    {
      "source": "Past",
      "target": "Memory",
      "type": "is_accessed_through"
    },
    {
      "source": "Memory",
      "target": "Past",
      "type": "relates_to"
    },
    {
      "source": "Lin Xiaoyue",
      "target": "Death",
      "type": "underwent"
    },
    {
      "source": "Lin Xiaoyue",
      "target": "Email",
      "type": "sends"
    },
    {
      "source": "Zheng Chuan",
      "target": "Fear",
      "type": "experiences"
    },
    {
      "source": "Zheng Chuan",
      "target": "Encounter",
      "type": "has"
    },
    {
      "source": "Gao Wei",
      "target": "Dream",
      "type": "has"
    },
    {
      "source": "Dream",
      "target": "Fear",
      "type": "causes"
    },
    {
      "source": "Dream",
      "target": "Premonition",
      "type": "indicates"
    },
    {
      "source": "Antique",
      "target": "Ghost/Spirit",
      "type": "can_be_associated_with"
    },
    {
      "source": "Antique",
      "target": "Influence",
      "type": "exerts"
    },
    {
      "source": "Hospital",
      "target": "Death",
      "type": "is_a_site_of"
    },
    {
      "source": "Woman in white",
      "target": "Graveyard",
      "type": "appears_near"
    },
    {
      "source": "Zheng Chuan",
      "target": "Lin Xiaoyue",
      "type": "is_haunted_by"
    },
    {
      "source": "Zheng Chuan",
      "target": "Woman in white",
      "type": "is_haunted_by"
    },
    {
      "source": "Encounter",
      "target": "Fear",
      "type": "results_in"
    },
    {
      "source": "Gao Wei",
      "target": "Encounter",
      "type": "has"
    },
    {
      "source": "Zheng Chuan",
      "target": "Antique",
      "type": "possesses"
    },
    {
      "source": "Zheng Chuan",
      "target": "Hospital",
      "type": "is_admitted_to"
    },
    {
      "source": "Lin Xiaoyue",
      "target": "Hospital",
      "type": "died_in"
    }
  ],
  "hierarchy": {
    "main_topics": [
      "Mysterious Emails and Past Memories",
      "Supernatural Encounters and Fear",
      "The Haunting Presence of the Dead",
      "Unexplained Events and Psychological Impact"
    ],
    "structure": "The document follows a narrative structure, starting with the receipt of a mysterious email, progressing through a series of increasingly unsettling supernatural events and character interactions, and culminating in the protagonist's hospitalization amidst lingering mysteries. It is divided into chapters, with each chapter exploring different facets of the central mystery and its impact on the characters."
  }
}