{
  "propositions": [
    {
      "id": "1",
      "text": "A news report details a mysterious car accident involving a taxi driver, Xie Baogang, and a woman identified as Xu Meng.",
      "level": 1
    },
    {
      "id": "1.1",
      "text": "The report describes Xie Baogang picking up a woman from the Municipal Bureau of Investment Promotion.",
      "level": 2
    },
    {
      "id": "1.2",
      "text": "On the way, Xie Baogang encounters a woman lying on the road, seemingly injured.",
      "level": 2
    },
    {
      "id": "1.3",
      "text": "The injured woman claims to have been dead for two years.",
      "level": 3
    },
    {
      "id": "1.4",
      "text": "Subsequently, the woman in the taxi transforms into a terrifying, bloody figure.",
      "level": 3
    },
    {
      "id": "1.5",
      "text": "This leads to Xie Baogang losing control of the taxi, which falls off a cliff and catches fire.",
      "level": 2
    },
    {
      "id": "1.6",
      "text": "Xie Baogang survives by jumping out of the vehicle.",
      "level": 2
    },
    {
      "id": "1.7",
      "text": "The official investigation concludes the accident was due to the driver's shock and misoperation of controls.",
      "level": 2
    },
    {
      "id": "1.8",
      "text": "Near the accident site, a two-year-old skeletal remains are found, speculated to be the ghost Xie Baogang encountered.",
      "level": 2
    },
    {
      "id": "1.9",
      "text": "The news sparks widespread public discussion and speculation about the existence of ghosts.",
      "level": 1
    },
    {
      "id": "2",
      "text": "The narrative shifts to focus on the reporter, Ling Zijiang, who wrote the initial report.",
      "level": 1
    },
    {
      "id": "2.1",
      "text": "Ling Zijiang receives a call from a migrant worker questioning the timeline of the ghost incident.",
      "level": 2
    },
    {
      "id": "2.2",
      "text": "Ling Zijiang is mentoring a new reporter, Gu Peng.",
      "level": 2
    },
    {
      "id": "2.3",
      "text": "Ling Zijiang's career path is detailed, highlighting his preference for investigative journalism over bureaucratic reporting.",
      "level": 2
    },
    {
      "id": "2.4",
      "text": "His past marriage and subsequent divorce are attributed to his demanding work schedule and his wife's infidelity.",
      "level": 3
    },
    {
      "id": "2.5",
      "text": "Despite his talent and dedication, Ling Zijiang remains a regular reporter, while his former colleague, Hou Xiaodan, becomes the editor-in-chief.",
      "level": 2
    },
    {
      "id": "2.6",
      "text": "Hou Xiaodan, now in a leadership position, shows support for Ling Zijiang, believing in his journalistic integrity.",
      "level": 2
    },
    {
      "id": "3",
      "text": "Hou Xiaodan, as the editor-in-chief, aims to revitalize the newspaper and expand its reach.",
      "level": 1
    },
    {
      "id": "3.1",
      "text": "She plans to consolidate various local newspapers and publications into a newspaper group, with herself as the likely leader.",
      "level": 2
    },
    {
      "id": "3.2",
      "text": "Hou Xiaodan recognizes Ling Zijiang's significant contributions to the newspaper's success.",
      "level": 2
    },
    {
      "id": "3.3",
      "text": "Ling Zijiang thrives in the Social and Livelihood department, focusing on issues that resonate with the public.",
      "level": 3
    },
    {
      "id": "3.4",
      "text": "Hou Xiaodan encourages Ling Zijiang to pursue personal happiness and attempts to set him up with a friend.",
      "level": 2
    },
    {
      "id": "3.5",
      "text": "They discuss the ongoing public fascination with the ghost incident and decide to create a special feature on it.",
      "level": 2
    },
    {
      "id": "4",
      "text": "Ling Zijiang and Gu Peng meet with a man named Qi Nu, a performance artist, who claims to be Xu Meng's boyfriend.",
      "level": 1
    },
    {
      "id": "4.1",
      "text": "Qi Nu recounts his history as a performance artist and his claim to have introduced body painting to Jiangdu.",
      "level": 2
    },
    {
      "id": "4.2",
      "text": "He expresses bitterness over being misunderstood and mistreated for his artistic endeavors.",
      "level": 3
    },
    {
      "id": "4.3",
      "text": "Qi Nu reveals that Xu Meng was his girlfriend and that they were planning to marry.",
      "level": 2
    },
    {
      "id": "4.4",
      "text": "He believes Xu Meng's departure and subsequent death were due to her involvement with another man.",
      "level": 3
    },
    {
      "id": "4.5",
      "text": "Qi Nu shares the story of their relationship, their shared dream of opening a painting studio, and its eventual closure.",
      "level": 3
    },
    {
      "id": "4.6",
      "text": "Meanwhile, Gu Peng receives calls from his university friend, Wang Yu, whose uncle has just passed away.",
      "level": 2
    },
    {
      "id": "4.7",
      "text": "Gu Peng and Wang Yu develop romantic feelings for each other, hinted at through their interactions and Wang Yu's request for Gu Peng to accompany her to the hospital.",
      "level": 3
    },
    {
      "id": "5",
      "text": "The narrative repeats the initial scene of Ling Zijiang's encounter with the woman at the tea garden, foreshadowing the connection to the ghost incident and Xu Meng.",
      "level": 1
    }
  ],
  "concepts": [
    {
      "name": "News Report",
      "frequency": 8,
      "context": "The central theme of extracting information and presenting it to the public."
    },
    {
      "name": "Ghost",
      "frequency": 6,
      "context": "The supernatural element driving public fascination and the mystery of the accident."
    },
    {
      "name": "Car Accident",
      "frequency": 5,
      "context": "The catalyst for the story and the investigation."
    },
    {
      "name": "Reporter",
      "frequency": 9,
      "context": "The protagonist's profession and the means of uncovering the truth."
    },
    {
      "name": "Investigative Journalism",
      "frequency": 3,
      "context": "Ling Zijiang's preferred method of reporting, focusing on in-depth investigation."
    },
    {
      "name": "Supernatural",
      "frequency": 2,
      "context": "The unexplained elements of the story, like the ghost."
    },
    {
      "name": "Art",
      "frequency": 5,
      "context": "Represented by Qi Nu's profession as a performance artist and body painter."
    },
    {
      "name": "Relationship",
      "frequency": 4,
      "context": "The romantic entanglements of the characters, particularly Xu Meng and Qi Nu, and Gu Peng and Wang Yu."
    },
    {
      "name": "Journalism Ethics",
      "frequency": 2,
      "context": "The principles guiding reporters like Ling Zijiang, such as reporting the truth."
    },
    {
      "name": "Public Opinion",
      "frequency": 3,
      "context": "The societal reaction to the ghost incident and its influence on the narrative."
    },
    {
      "name": "Personal Happiness",
      "frequency": 3,
      "context": "The pursuit of well-being, particularly for Ling Zijiang and Gu Peng."
    },
    {
      "name": "Myth",
      "frequency": 1,
      "context": "The folklore and legends surrounding supernatural events."
    },
    {
      "name": "Trauma",
      "frequency": 2,
      "context": "The psychological impact of the events on Xie Baogang and Qi Nu."
    },
    {
      "name": "Grief",
      "frequency": 1,
      "context": "The emotional response to loss, as experienced by Wang Yu."
    },
    {
      "name": "Romance",
      "frequency": 3,
      "context": "The developing relationships between characters."
    }
  ],
  "relations": [
    {
      "source": "News Report",
      "target": "Car Accident",
      "type": "reports_on"
    },
    {
      "source": "Car Accident",
      "target": "Ghost",
      "type": "involves"
    },
    {
      "source": "Reporter",
      "target": "News Report",
      "type": "creates"
    },
    {
      "source": "Reporter",
      "target": "Investigative Journalism",
      "type": "practices"
    },
    {
      "source": "Reporter",
      "target": "Supernatural",
      "type": "investigates"
    },
    {
      "source": "Ghost",
      "target": "Car Accident",
      "type": "potentially_causes"
    },
    {
      "source": "Art",
      "target": "Performance Artist",
      "type": "is_field_of"
    },
    {
      "source": "Relationship",
      "target": "Romance",
      "type": "includes"
    },
    {
      "source": "Journalism Ethics",
      "target": "Reporter",
      "type": "guides"
    },
    {
      "source": "Public Opinion",
      "target": "Ghost",
      "type": "focuses_on"
    },
    {
      "source": "Personal Happiness",
      "target": "Reporter",
      "type": "is_goal_of"
    },
    {
      "source": "Trauma",
      "target": "Car Accident",
      "type": "results_from"
    },
    {
      "source": "Grief",
      "target": "Death",
      "type": "is_response_to"
    },
    {
      "source": "Xu Meng",
      "target": "Car Accident",
      "type": "victim_of"
    },
    {
      "source": "Xu Meng",
      "target": "Ghost",
      "type": "perceived_as"
    },
    {
      "source": "Qi Nu",
      "target": "Xu Meng",
      "type": "was_boyfriend_of"
    },
    {
      "source": "Qi Nu",
      "target": "Art",
      "type": "practices"
    },
    {
      "source": "Gu Peng",
      "target": "Reporter",
      "type": "is_apprentice_of"
    },
    {
      "source": "Gu Peng",
      "target": "Romance",
      "type": "develops"
    },
    {
      "source": "Wang Yu",
      "target": "Gu Peng",
      "type": "develops_romance_with"
    },
    {
      "source": "Hou Xiaodan",
      "target": "Reporter",
      "type": "is_superior_to"
    },
    {
      "source": "Hou Xiaodan",
      "target": "News Report",
      "type": "oversees"
    }
  ],
  "hierarchy": {
    "main_topics": [
      "The 'Ghost' Car Accident and its Aftermath",
      "The Life and Career of Reporter Ling Zijiang",
      "The Editorial Vision of Hou Xiaodan",
      "The Personal Life and Artistic Pursuit of Qi Nu",
      "Developing Relationships and Personal Journeys"
    ],
    "structure": "The document is structured episodically, beginning with the sensational news of a ghost-related car accident, then delving into the personal and professional lives of the characters involved, particularly the reporter and his editor, before introducing new characters and their intertwined narratives. The initial incident serves as a recurring motif."
  }
}