{
  "propositions": [
    {
      "id": "1",
      "text": "The document is titled \"短信：你身边的恐怖经历\".",
      "level": 1
    },
    {
      "id": "1.1",
      "text": "The title suggests a collection of terrifying experiences shared via text message.",
      "level": 2
    },
    {
      "id": "2",
      "text": "The document includes a link to a website for more information about the book.",
      "level": 1
    },
    {
      "id": "3",
      "text": "The website is described as a literary site offering classic literature and free e-book downloads.",
      "level": 1
    },
    {
      "id": "4",
      "text": "Chapter 1 is titled \"死人会不会发短信？\".",
      "level": 1
    },
    {
      "id": "4.1",
      "text": "This chapter introduces a premise where the protagonist receives a text message from a deceased person.",
      "level": 2
    },
    {
      "id": "5",
      "text": "The protagonist is drawn into the situation because of his colleague, Lao Liu.",
      "level": 1
    },
    {
      "id": "5.1",
      "text": "Lao Liu's real name is Xi Six, nicknamed 'Lao Liu' (meaning six) due to his name and its pronunciation.",
      "level": 2
    },
    {
      "id": "5.2",
      "text": "The protagonist and Lao Liu were close colleagues with similar interests and drinking capacity.",
      "level": 2
    },
    {
      "id": "5.3",
      "text": "Key differences between the protagonist and Lao Liu are mentioned: Lao Liu is engaged, Lao Liu is thrifty, and Lao Liu is heavier.",
      "level": 2
    },
    {
      "id": "6",
      "text": "The story begins with Lao Liu taking an uncharacteristic leave of absence.",
      "level": 1
    },
    {
      "id": "6.1",
      "text": "Lao Liu was known for his perfect attendance and dedication to earning the monthly full attendance bonus.",
      "level": 2
    },
    {
      "id": "7",
      "text": "The protagonist tries to contact Lao Liu, first by phone, which goes to voicemail, and then by text message.",
      "level": 1
    },
    {
      "id": "7.1",
      "text": "The protagonist's text message asks, \"你小子死了？\" (Are you dead, kid?).",
      "level": 2
    },
    {
      "id": "8",
      "text": "Lao Liu remains absent for several days, during which the protagonist is busy with work.",
      "level": 1
    },
    {
      "id": "9",
      "text": "After finishing the work late on Friday night, the protagonist receives a call from Lao Liu.",
      "level": 1
    },
    {
      "id": "9.1",
      "text": "Lao Liu's voice is hoarse and weak.",
      "level": 2
    },
    {
      "id": "9.2",
      "text": "Lao Liu asks the protagonist to meet him at a Starbucks in the city center at 3 PM the next day.",
      "level": 2
    },
    {
      "id": "10",
      "text": "The protagonist goes to the meeting, but Lao Liu is late.",
      "level": 1
    },
    {
      "id": "10.1",
      "text": "While waiting, the protagonist realizes Lao Liu might have meant Sunday instead of Saturday.",
      "level": 2
    },
    {
      "id": "11",
      "text": "The protagonist sees a shadow behind him in the glass reflection and turns to find Lao Liu.",
      "level": 1
    },
    {
      "id": "11.1",
      "text": "Lao Liu appears significantly thinner and disheveled.",
      "level": 2
    },
    {
      "id": "12",
      "text": "Lao Liu asks the protagonist, \"你说，死人会不会发短信？\" (You say, can dead people send text messages?).",
      "level": 1
    },
    {
      "id": "13",
      "text": "Lao Liu shows the protagonist a text message on his phone from \"黄淑芬\" with the content \"今晚吃什么？\" (What's for dinner tonight?).",
      "level": 1
    },
    {
      "id": "13.1",
      "text": "Lao Liu claims he saw Huang Shufen die in a car accident a year and a half ago.",
      "level": 2
    },
    {
      "id": "14",
      "text": "The protagonist suggests logical explanations like mistaken identity, remembrance by friends, or a prank.",
      "level": 1
    },
    {
      "id": "14.1",
      "text": "The protagonist also mentions the possibility of phone number recycling.",
      "level": 2
    },
    {
      "id": "15",
      "text": "Lao Liu insists the message is from Huang Shufen, citing a secret only she would know.",
      "level": 1
    },
    {
      "id": "16",
      "text": "The protagonist, frustrated, asks why Lao Liu doesn't just turn off his phone.",
      "level": 1
    },
    {
      "id": "17",
      "text": "Lao Liu's reaction is described as unsettling, with a smile that is neither a laugh nor a cry, and a guttural sound.",
      "level": 1
    },
    {
      "id": "18",
      "text": "Lao Liu says, \"我关了\" (I turned it off).",
      "level": 1
    },
    {
      "id": "19",
      "text": "The protagonist, unnerved, decides to get coffee to compose himself.",
      "level": 1
    },
    {
      "id": "20",
      "text": "When the protagonist returns to the table, Lao Liu has vanished.",
      "level": 1
    },
    {
      "id": "21",
      "text": "The protagonist tries calling Lao Liu and then his girlfriend, Karen, but both attempts are unsuccessful.",
      "level": 1
    },
    {
      "id": "22",
      "text": "The protagonist drives home, experiencing issues with his car's computer.",
      "level": 1
    },
    {
      "id": "23",
      "text": "That night, the protagonist has trouble sleeping and experiences a recurring \"嘀嘀\" sound.",
      "level": 1
    },
    {
      "id": "24",
      "text": "The next day at work, Lao Liu is still absent.",
      "level": 1
    },
    {
      "id": "25",
      "text": "While in the elevator, the protagonist receives a text message from \"黄淑芬\" saying \"今晚吃什么？\".",
      "level": 1
    },
    {
      "id": "26",
      "text": "The elevator's destination indicator shows \"-2\", an impossible floor for the building.",
      "level": 1
    },
    {
      "id": "27",
      "text": "The elevator descends to the \"-2\" level, where the doors open to a solid concrete wall.",
      "level": 1
    },
    {
      "id": "28",
      "text": "The protagonist panics, tries to escape, and injures his thumb trying to break through the wall.",
      "level": 1
    },
    {
      "id": "29",
      "text": "Chapter 3 is titled \"灵异户名\".",
      "level": 1
    },
    {
      "id": "30",
      "text": "The protagonist wakes up from a nightmare, realizing he dreamt about the elevator incident.",
      "level": 1
    },
    {
      "id": "31",
      "text": "He hears the \"嘀嘀\" sound again and discovers it's Lao Liu's phone, which Lao Liu must have put in his backpack.",
      "level": 1
    },
    {
      "id": "32",
      "text": "The protagonist finds numerous unread text messages from \"黄淑芬\" on Lao Liu's phone.",
      "level": 1
    },
    {
      "id": "33",
      "text": "He reads a recent message from Huang Shufen: \"今晚吃什么？鱼肉鸡肉猪肉牛肉牛奶猪肝虾肉老鼠。\" (What's for dinner tonight? Fish, chicken, pork, beef, milk, pig liver, shrimp, rat.)",
      "level": 2
    },
    {
      "id": "34",
      "text": "The protagonist deduces that the list of items are things a cat likes, suggesting Huang Shufen might be a cat demon.",
      "level": 1
    },
    {
      "id": "35",
      "text": "He then analyzes the phone's activity and realizes that even when turned off, it received messages and made sounds.",
      "level": 1
    },
    {
      "id": "36",
      "text": "He forcefully removes the battery from Lao Liu's phone.",
      "level": 1
    },
    {
      "id": "37",
      "text": "The next morning, feeling more grounded, the protagonist decides to confront Lao Liu.",
      "level": 1
    },
    {
      "id": "38",
      "text": "He drives to Lao Liu's apartment with the phone as evidence.",
      "level": 1
    },
    {
      "id": "39",
      "text": "Lao Liu is missing from his apartment, which appears to have been prepared for an escape.",
      "level": 1
    },
    {
      "id": "40",
      "text": "The protagonist finds a mooncake tin containing a savings passbook and a red notebook in Lao Liu's apartment.",
      "level": 1
    },
    {
      "id": "41",
      "text": "The savings passbook is in the name of \"黄淑芬\".",
      "level": 1
    },
    {
      "id": "41.1",
      "text": "The passbook shows a deposit of 300,000 CNY in 2007 and a withdrawal of 318,000 CNY in 2009.",
      "level": 2
    },
    {
      "id": "42",
      "text": "Chapter 4 is titled \"美女跟踪(1)\".",
      "level": 1
    },
    {
      "id": "43",
      "text": "The protagonist ponders the connection between the passbook, Lao Liu, and the deceased Huang Shufen.",
      "level": 1
    },
    {
      "id": "44",
      "text": "The red notebook is identified as Lao Liu's diary.",
      "level": 1
    },
    {
      "id": "45",
      "text": "Entries in the diary reveal Lao Liu's struggles with his weight and his decision to change his number and avoid places with electronics.",
      "level": 1
    },
    {
      "id": "46",
      "text": "Diary entries from April 2009 indicate increasing distress and a feeling of being pursued.",
      "level": 1
    },
    {
      "id": "46.1",
      "text": "One entry repeats the phrase \"她来了\" (She is here) multiple times.",
      "level": 2
    },
    {
      "id": "47",
      "text": "While reading the diary, the protagonist hears a doorbell ring.",
      "level": 1
    },
    {
      "id": "48",
      "text": "After a period of silence, there is a forceful knocking on the door, accompanied by a woman's voice demanding Lao Liu open the door.",
      "level": 1
    },
    {
      "id": "49",
      "text": "The protagonist looks through the peephole but sees no one.",
      "level": 1
    },
    {
      "id": "50",
      "text": "He considers the possibility that Lao Liu killed Huang Shufen and her spirit is seeking revenge.",
      "level": 1
    },
    {
      "id": "51",
      "text": "The protagonist grabs the mooncake tin and flees Lao Liu's apartment.",
      "level": 1
    },
    {
      "id": "52",
      "text": "He is attacked from behind, and the mooncake tin falls to the ground.",
      "level": 1
    },
    {
      "id": "53",
      "text": "The attacker is described as a beautiful woman.",
      "level": 2
    }
  ],
  "concepts": [
    {
      "name": "短信",
      "frequency": 27,
      "context": "The central theme and mode of communication in the story."
    },
    {
      "name": "恐怖",
      "frequency": 7,
      "context": "Describes the nature of the experiences shared."
    },
    {
      "name": "老六",
      "frequency": 27,
      "context": "The protagonist's colleague and a key character central to the mystery."
    },
    {
      "name": "黄淑芬",
      "frequency": 19,
      "context": "The deceased woman who allegedly sends text messages."
    },
    {
      "name": "手机",
      "frequency": 19,
      "context": "The device used for communication and a source of supernatural events."
    },
    {
      "name": "死人",
      "frequency": 3,
      "context": "The alleged sender of the mysterious text messages."
    },
    {
      "name": "短信列表",
      "frequency": 3,
      "context": "The display of received text messages."
    },
    {
      "name": "电梯",
      "frequency": 6,
      "context": "A setting for a terrifying experience."
    },
    {
      "name": "水泥墙",
      "frequency": 2,
      "context": "The obstacle encountered in the elevator."
    },
    {
      "name": "睡觉",
      "frequency": 4,
      "context": "The protagonist's attempts to rest and recurring nightmares."
    },
    {
      "name": "日记",
      "frequency": 5,
      "context": "Lao Liu's personal records providing clues."
    },
    {
      "name": "存折",
      "frequency": 3,
      "context": "Financial document belonging to Huang Shufen found in Lao Liu's apartment."
    },
    {
      "name": "失踪",
      "frequency": 2,
      "context": "The disappearance of Lao Liu."
    },
    {
      "name": "猫",
      "frequency": 3,
      "context": "The subject of a peculiar text message and a potential supernatural entity."
    },
    {
      "name": "关机",
      "frequency": 4,
      "context": "The attempt to disable the phone and the supernatural ability to still receive messages."
    }
  ],
  "relations": [
    {
      "source": "短信",
      "target": "恐怖",
      "type": "is_a"
    },
    {
      "source": "短信",
      "target": "黄淑芬",
      "type": "sent_by"
    },
    {
      "source": "老六",
      "target": "短信",
      "type": "receives"
    },
    {
      "source": "老六",
      "target": "黄淑芬",
      "type": "knows"
    },
    {
      "source": "老六",
      "target": "失踪",
      "type": "undergoes"
    },
    {
      "source": "手机",
      "target": "短信",
      "type": "sends_and_receives"
    },
    {
      "source": "手机",
      "target": "黄淑芬",
      "type": "sends_from"
    },
    {
      "source": "死人",
      "target": "短信",
      "type": "can_send"
    },
    {
      "source": "电梯",
      "target": "水泥墙",
      "type": "leads_to"
    },
    {
      "source": "日记",
      "target": "老六",
      "type": "written_by"
    },
    {
      "source": "存折",
      "target": "黄淑芬",
      "type": "owned_by"
    },
    {
      "source": "存折",
      "target": "老六",
      "type": "found_in_possession_of"
    },
    {
      "source": "猫",
      "target": "短信",
      "type": "related_to"
    },
    {
      "source": "关机",
      "target": "手机",
      "type": "action_on"
    },
    {
      "source": "关机",
      "target": "短信",
      "type": "fails_to_prevent_reception_of"
    },
    {
      "source": "美女",
      "target": "跟踪",
      "type": "performs"
    }
  ],
  "hierarchy": {
    "main_topics": [
      "Mysterious Text Messages",
      "Supernatural Encounters",
      "Disappearance and Investigation"
    ],
    "structure": "The document is structured as a narrative with distinct chapters, introducing characters, building suspense through unexplained events, and following the protagonist's investigation into a supernatural phenomenon involving text messages from a deceased person."
  }
}