{
  "propositions": [
    {
      "id": "1",
      "text": "卓木强巴的目光落下来，凝视远处，不由又问了一遍自己：“真的，不是在做梦吗？”",
      "level": 1
    },
    {
      "id": "1.1",
      "text": "长不过膝、短不覆履的翠草编制成毯，点缀着米粒般大小的白色小花，远远的缀去，连成天地间广袤的草原，一阵风吹过，草原上一圈圈涟漪荡漾开来，一直传送到极远极远的地方，仿佛每一朵小花每一株绿草都在向自己招手，发出轻快的欢呼：“你回来啦……你回来啦……你回来啦……”",
      "level": 2
    },
    {
      "id": "2",
      "text": "这里的风，轻柔的像情人呼出的气，令人实在分辨不出，这是扑面而来的风，还是自己身体带动了空气的流淌。",
      "level": 1
    },
    {
      "id": "3",
      "text": "几根巨大的石柱斜斜的伏在草丛中，为这宁谧的空间平添了几分庄严。",
      "level": 1
    },
    {
      "id": "4",
      "text": "有鸟衔花来，落在石柱上，顾盼流连，追逐翩飞，空中如有鸣琴奏响了幽泉月光之曲。",
      "level": 1
    },
    {
      "id": "5",
      "text": "风兮兮，鸟做曲，大地舒缓起伏，勾勒出如同少女般优美的曲线，想来传说中的伊甸园，就是这般模样吧，这是卓的第一印象。",
      "level": 1
    },
    {
      "id": "6",
      "text": "随后他发现，自己是在一个好似竖井的出口，正面朝大草原，自己背后的视线，则被石井挡着，他走了出去，再转身，发现这个环境建筑更像一个大一号的邮箱，自己则是从取信孔的位置钻了出来，再往后退，他看到了高高的院墙，再退，再退……一直退到大草原上，踏上软软的草甸，他才看清出口的全貌，那是一座皇家园林般的建筑，有高大的宫墙，像长城一般绵延开去，竟是望不到头，那斑驳而巨大的灰黑色砖，一块块砌成无数马赛克式的雕塑，藤蔓攀绕着高架引水渠，巨大的石柱在长城外撑起栈道一样的廊道。",
      "level": 1
    },
    {
      "id": "7",
      "text": "厚重而高大的宫墙，有这无数拱桥般的窗口，长而斜的阶梯缓缓向上，在阶梯的尽头，婉若天界之门巍然高耸，城墙外散落着一些小的建筑，有的像塔林，有的像棺盖，有的像小庙，有的像古希腊的神殿，卓从未见过如此怪异的建筑群，但城墙上那些高大的壁画他倒是能认出一些，有很多都是源自印度古神，梵天起舞，湿婆执剑，无数天女天妃围绕，还有许多古苯教神灵，这种绘画风格与他们在倒悬空寺里所见的极为相似。",
      "level": 1
    },
    {
      "id": "7.1",
      "text": "卓不由深吸一口气，暗忖，难道自己已经到了？",
      "level": 2
    },
    {
      "id": "7.2",
      "text": "可是这座城，总给他很怪异的感觉，这完全不像各种典籍中描述的圣地，倒有些像一处废弃的施工工厂，像一千多年前古人修的一座城或一座巨大的建筑，尚未完工就被遗弃了一般，虽然气势宏伟，震人心魄，但总有一种残缺和沧桑之美，用被遗弃的伊甸园来形容这里，才是最贴切的。",
      "level": 2
    },
    {
      "id": "8",
      "text": "卓木强巴跟着灰狼兄弟向台阶走过去。",
      "level": 1
    },
    {
      "id": "8.1",
      "text": "走到一半路程，他朝着他们来的方向看了一眼，只见绿毯铺就的远山尽头，一派云蒸雾绕，天的尽头则是一堵由白云组成的墙，越靠近地面云层越厚，如沉铅压顶，那云的里面就是他们来的地方？",
      "level": 2
    },
    {
      "id": "9",
      "text": "卓木强巴马上想起了吕竞男说的大气环流系统，将香巴al下层充沛的氧气交换上来。",
      "level": 1
    },
    {
      "id": "9.1",
      "text": "难道说，大气环流使得空气中的雾气就向台风一样形成了一个包围圈，将整个香巴拉保护起来，只是风眼附近，反而没有了云雾，只见青天？",
      "level": 2
    },
    {
      "id": "9.2",
      "text": "或许，还有别的什么原因？",
      "level": 2
    },
    {
      "id": "10",
      "text": "还有一点让卓木强巴不解，这里真的很热，就像他们在热带丛林一般闷热，这不是应该在海拔六七千米的地方吗？",
      "level": 1
    },
    {
      "id": "11",
      "text": "当卓木强巴带着疑问登临那巨大的天界之门时，他觉得自己找到了答案。",
      "level": 1
    },
    {
      "id": "11.1",
      "text": "整个围墙围住的竟然是一泓大湖，湖水倒映着蓝天，微微泛起金鳞，整个湖由外向内，分别呈现出蓝色、金色、绿色以及青色四种颜色；",
      "level": 2
    },
    {
      "id": "11.2",
      "text": "而且这座湖，一眼就能看出是人工开凿的，它呈圆形，从湖心朝四面八方伸出引水渠，与工布村的结构十分相似，在扇形区域里坐落着民居样建筑。",
      "level": 2
    },
    {
      "id": "12",
      "text": "卓木强巴之所以认为自己找到了答案，就是因为他远远看见那湖水表面有丝丝热气升腾，二狼和小狼已经在一道引水渠旁痛饮起来。",
      "level": 1
    },
    {
      "id": "13",
      "text": "卓木强巴试了试水的温度，略微有些烫手，但还不至于无法下水，水温应该在四五十度左右，有一丝丝硫黄的气息。",
      "level": 1
    },
    {
      "id": "13.1",
      "text": "地热，正如他和岳阳他们在亚马逊丛林里讨论过的那样，这里的热量来源于地热！",
      "level": 2
    },
    {
      "id": "14",
      "text": "那些戈巴族人将雪山融水引入人工湖中，然后不知道他们用了什么办法，用地热来替湖水加温，并保持在四五十度。",
      "level": 1
    },
    {
      "id": "14.1",
      "text": "由于这个地方夹在两座山的中间，基本是一个封闭的空间，所以就像蒸桑拿一样，将整个香巴拉蒸热了。",
      "level": 2
    },
    {
      "id": "14.2",
      "text": "而这地的热气渐成气候，在第三层平台形成了大气环流，将严寒抵挡在外面，并让有的气体散发出去，将大量的氧气吸进来，保持空气的清新。",
      "level": 2
    },
    {
      "id": "14.3",
      "text": "卓木强巴知道，在自己未能到达的地方，一定还有别的宏伟建筑，改变整个大气循环，不会那么容易就能实现的。",
      "level": 2
    },
    {
      "id": "15",
      "text": "二狼和小狼没卓木强巴那么多的想法，它们小心地试探着水温，将整个身体慢慢地泡进了水里，然后渐渐畅游开来，在经过了严寒和漫长的奔袭之后，洗个桑拿浴，那是相当地惬意。",
      "level": 1
    },
    {
      "id": "16",
      "text": "小狼扑打着水花，要卓木强巴下水一起嬉戏。",
      "level": 1
    },
    {
      "id": "17",
      "text": "初入水时有些烫，可不多久便能适应。",
      "level": 1
    },
    {
      "id": "18",
      "text": "更令人惊叹的是，在这温暖的雪山地热湖中，竟然有细细的鳞鱼游荡，还有着某种说不出名的绿色植物，不可思议的生命奇迹，令这四五十度的湖水中充满生机。",
      "level": 1
    },
    {
      "id": "19",
      "text": "泡着暖暖的温泉，数着蓝天上的云丝，和在那积雪的迷雾中顶风前行相比，简直是天堂和地狱的差别。",
      "level": 1
    },
    {
      "id": "20",
      "text": "卓木强巴摊开四肢，仰躺在水里，实在是不愿意动弹了。",
      "level": 1
    },
    {
      "id": "21",
      "text": "不知在水里泡了多久，已经清除了一身的疲倦，卓木强巴才从水里站起来。",
      "level": 1
    },
    {
      "id": "22",
      "text": "只见那环形的水渠似乎被设计为螺旋向下状，水花欢快地奔流着，而站在水中，仰望一栋栋造型各异又有统一规格的民居，便宛若处在江南水乡，画一般的风景，只是……那一阵暖风吹过，响起的却是古老的悠悠叹息。",
      "level": 1
    },
    {
      "id": "23",
      "text": "卓木强巴沿着环道前行，从一栋民宅走到另一栋。",
      "level": 1
    },
    {
      "id": "24",
      "text": "那些建筑的式样依然保持得如此完好，纵使有少许被风雨侵蚀或树木破坏，大多数都是完整的房屋。",
      "level": 1
    },
    {
      "id": "25",
      "text": "只是，这里的人呢？",
      "level": 1
    },
    {
      "id": "26",
      "text": "卓木强巴正要信步迈入一所宅屋，却被小狼拦在身前，嘴里低声呜呜警告：“不要进去。”",
      "level": 1
    },
    {
      "id": "27",
      "text": "卓木强巴与小狼最为熟稔，听到小狼警告，蹲下身来挑起小狼下颌道：“不能进去吗？里面是不是，有什么对我不好的东西？”",
      "level": 1
    },
    {
      "id": "27.1",
      "text": "小狼似懂非懂地点头，卓木强巴也点点头：“知道了。”",
      "level": 2
    },
    {
      "id": "27.2",
      "text": "他便不再进屋，只是站在门外观察。",
      "level": 2
    },
    {
      "id": "28",
      "text": "屋内家居摆设皆完好，这更令他疑窦丛生，究竟发生了什么，令这座恢弘之城人去楼空，一派死寂！",
      "level": 1
    },
    {
      "id": "29",
      "text": "走在空荡荡的街头，听着潺潺的水声，看着那廊桥小弄、高墙青砖，卓木强巴的心中，竟然生起了一丝惧意。",
      "level": 1
    },
    {
      "id": "30",
      "text": "蜘蛛在墙角织网，鼠、兔或蜥蜴一般的生物飞快地穿梭躲避，只是，没有人……一个人也没有……",
      "level": 1
    },
    {
      "id": "31",
      "text": "这座空城死一般地寂静，他甚至连一具骨骼都没有发现，偏偏那些保存完整的建筑，仿佛在向这个外来的陌生人诉说着不久之前的繁荣。",
      "level": 1
    },
    {
      "id": "32",
      "text": "高屋之上，全是各式造像，有天女衣袂翩翩，有金刚怒目四方，有瑞兽踏云而来，有小鬼爬满壁墙。",
      "level": 1
    },
    {
      "id": "32.1",
      "text": "那些造像或大或小，栩栩如生，门前、四壁，就是屋檐廊下也如葡萄般悬挂着一串串的小鬼。",
      "level": 2
    },
    {
      "id": "33",
      "text": "这些，是什么时候的建筑？",
      "level": 1
    },
    {
      "id": "34",
      "text": "这种圆形的建筑群设计是什么时候的理念？",
      "level": 1
    },
    {
      "id": "35",
      "text": "谁建造了它们？",
      "level": 1
    },
    {
      "id": "36",
      "text": "这里的主人又去了哪里？",
      "level": 1
    },
    {
      "id": "37",
      "text": "卓木强巴带着满腹的疑问，发出一声叹息，十余分钟后，他竟然听到一声叹息。",
      "level": 1
    },
    {
      "id": "38",
      "text": "卓木强巴有些疑惑地站在原地，难道有人吗？",
      "level": 1
    },
    {
      "id": "39",
      "text": "谁知，小狼在他身边一声长吟，几分钟后，远处，又好像就在身后的某处，响起了小狼的啸声。",
      "level": 1
    },
    {
      "id": "40",
      "text": "小狼露出牙齿，有些得意地对卓木强巴笑着，好似在说：“神奇吧。”",
      "level": 1
    },
    {
      "id": "41",
      "text": "原来，这种弧形的建筑群落形成了类似回音壁一样的东西，声音传开后，不知通过怎样的转折，又会从身后传回来，这是那些古人对声学的运用。",
      "level": 1
    },
    {
      "id": "42",
      "text": "卓木强巴还来不及去细细探究，二狼发出了警语：“该走了，天黑前必须离开这里。”",
      "level": 1
    },
    {
      "id": "43",
      "text": "不知道到了晚上这里会有什么出现，或许是那种硕大的小强。",
      "level": 1
    },
    {
      "id": "44",
      "text": "卓木强巴也无暇去探究，他只是觉得奇怪，这么一座空城，看似已如此繁华，难道这里不是香巴拉？",
      "level": 1
    },
    {
      "id": "45",
      "text": "他想了很久，才发出一阵啸声，询问小狼：“离家还有多远？”",
      "level": 1
    },
    {
      "id": "46",
      "text": "小狼眯眼望着远方，夕阳已经不见，但天空湛蓝依旧，云染霞似火烧：“还远着呢。”",
      "level": 1
    },
    {
      "id": "47",
      "text": "卓木强巴回头再看那围住这方空间的密云，被浓雾笼罩着的香巴拉，此刻已经全黑了吧？",
      "level": 1
    },
    {
      "id": "48",
      "text": "在草原上走着，生物种类开始繁多起来。",
      "level": 1
    },
    {
      "id": "49",
      "text": "没多久二狼和小狼就逮到一些好似兔子一样的有角生物，吃饱之后，以大地为席，天做被，仰视流云苍狗，渐有银河密布。",
      "level": 1
    },
    {
      "id": "50",
      "text": "天似穹庐，笼罩四野，空旷的感觉向四面八方延伸，思绪也仿佛传到了千里之外。",
      "level": 1
    },
    {
      "id": "51",
      "text": "又走了两天，草渐渐茂密，树渐渐林立，他从草原踏入了丛林，那些遮天障目的巨树，枝叶根茎纠结在一起，像扭打不休的怪兽们。",
      "level": 1
    },
    {
      "id": "52",
      "text": "二狼和小狼一猫腰，就能从洞隙间钻过，可苦了卓木强巴，要从这片密林中挤过去，要侧身钻洞，还要爬树翻墙。",
      "level": 1
    },
    {
      "id": "53",
      "text": "走着走着，卓木强巴便见到了第二座城……或是一座庙宇？",
      "level": 1
    },
    {
      "id": "54",
      "text": "好大一座庙宇！",
      "level": 1
    },
    {
      "id": "55",
      "text": "卓木强巴在一些巨树的顶端，远远地就看见天地间横环着纵横交错的线条，布局似棋盘。",
      "level": 1
    },
    {
      "id": "56",
      "text": "走近些，则发现那些线条方方正正，围成一个又一个像“回”字一般的同心长方形；",
      "level": 1
    },
    {
      "id": "57",
      "text": "再走近些，就发现那些线条是因树与树之间出现了空隙而造成的，等到他从最后一排密林中钻出来，才看到那些线条的全貌。",
      "level": 1
    },
    {
      "id": "58",
      "text": "森林的中央，出现了一道四四方方的天井。",
      "level": 1
    },
    {
      "id": "58.1",
      "text": "这座天井的周长，恐怕有好几公里，井底是水，水的中央就是那座庙宇！",
      "level": 2
    },
    {
      "id": "58.2",
      "text": "那些线条都是由庙宇的边墙，或一排排似松树一般的塔林组成的。",
      "level": 2
    },
    {
      "id": "59",
      "text": "卓木强巴站在天井的边缘，看着那座庙宇，显得那么不真实，好似不该是人间拥有的东西。",
      "level": 1
    },
    {
      "id": "60",
      "text": "其奥秘就在于，这方人造的天井，打磨得太过平整。",
      "level": 1
    },
    {
      "id": "61",
      "text": "水面上没有一丝波澜，像一面镜子，透过水面可以很清晰地看见天上的白云在水中缓缓飘过，于是，远方那座庙宇就好似浮在半空中。",
      "level": 1
    },
    {
      "id": "62",
      "text": "通往庙宇的小路，全被人为打磨成一叶一叶的浮萍或荷叶样式，踩在上面，颇有蜻蜓点水的感觉。",
      "level": 1
    },
    {
      "id": "63",
      "text": "不知道那方方正正的湖水究竟平整到何种程度，卓木强巴踏着那些浮萍时，竟然产生了高空眩晕，唯恐自己一脚踏错，就会跌落凡尘。",
      "level": 1
    },
    {
      "id": "64",
      "text": "而二狼和小狼似乎没有这种错觉，还能在浮萍上扭打嬉闹，一路衔尾奔走。",
      "level": 1
    },
    {
      "id": "65",
      "text": "等卓木强巴终于走到庙宇面前，他终于还是被眼前所见彻底震撼。",
      "level": 1
    },
    {
      "id": "65.1",
      "text": "这座庙宇的构成，竟然是成千上万的佛鬼塑像，可以这样说，是把一个一个立体生动、形态各异的佛像小鬼，用作一砖一瓦而搭建成了一座庙宇；",
      "level": 2
    },
    {
      "id": "65.2",
      "text": "或者，古人先将一座熔岩山削成一个巨大的立方体，再从立方体中抠出一座庙宇的大致形态，最后，再将这座庙宇的，不管是顶、廊、梁、柱、墙，还是门、槛、窗、台阶、栏杆，通通镂空雕刻成一个个的小鬼佛像。",
      "level": 2
    },
    {
      "id": "65.3",
      "text": "远看墙面是平整的，近看则是凹凸不平的，因为它们全是一个个不足巴掌大的小人儿，挽臂起舞，踏背相叠，整座庙宇的小人儿雕塑，何止亿万，这是何其浩大的工程！",
      "level": 2
    },
    {
      "id": "66",
      "text": "卓木强巴静静地摩挲着这些小人儿，它们中有人有神，有鬼有佛，有飞鸟走兽、虫蚁蜉蝣，有藤木花卉，竟是将世上有的、没有的所有生命，皆雕凿于一庙之中。",
      "level": 1
    },
    {
      "id": "66.1",
      "text": "其后又以这些小人做基础，构筑出更大的建筑物，几十万小人儿勾肩搭背，就组成了一座巨大的佛像；",
      "level": 2
    },
    {
      "id": "66.2",
      "text": "几十万小人儿相互踩踏，就筑成了凸出于墙面的巨大文字符号；",
      "level": 2
    },
    {
      "id": "66.3",
      "text": "那些塔林，也是由几百万几百万的小人儿堆叠在一起形成的；",
      "level": 2
    },
    {
      "id": "66.4",
      "text": "就连脚下所踏的青石板，也是一座欲海的形象，亿万小人儿在欲海中张臂疾呼，挣扎翻涌，蹲下身去仔细看，就能看到那些小人儿，每一张脸上不同的表情，或愤怒，或绝望，或悲哀，或癫狂。",
      "level": 2
    },
    {
      "id": "66.5",
      "text": "卓木强巴的双脚就踏在这欲海之上，每一只脚下，都有几十个小人儿高举着手臂，痛苦地呼喊。",
      "level": 2
    },
    {
      "id": "66.6",
      "text": "当卓木强巴举目望上时，就会看到穹顶，无数的飞天，正伤悲地坠落人间，她们彩绸飞袖，似乎想捞住天空中的流云，却徒劳无功，诀别迷恋。",
      "level": 2
    },
    {
      "id": "66.7",
      "text": "而四壁墙上，则是一个个头上有光环的佛像，他们的面部表情异常地相似，那眼神，似乎带着一丝怜悯，又有一丝冷峻，或是略感悲哀，或是怒其不争。",
      "level": 2
    },
    {
      "id": "66.8",
      "text": "看过之后，只感到一种沉闷的压抑，那些眼神都透着一种深深的忧郁啊！",
      "level": 2
    },
    {
      "id": "67",
      "text": "踏着痛苦挣扎的人群，穿过俯视众生的神明，卓木强巴来到了这座庙宇的墙内，他立刻又有了不一样的感觉。",
      "level": 1
    },
    {
      "id": "67.1",
      "text": "静！",
      "level": 2
    },
    {
      "id": "67.2",
      "text": "佛教禅中最奥妙的释意。",
      "level": 2
    },
    {
      "id": "67.3",
      "text": "这座四四方方，由小人儿筑成的庙宇，竟然如此安静，没有一丝声音。",
      "level": 2
    },
    {
      "id": "67.4",
      "text": "卓木强巴屏住呼吸，仔细听，仍然没有一丝声音；",
      "level": 2
    },
    {
      "id": "67.5",
      "text": "唯一的声音都是他们带进来的，他的脚步声，狼的脚步声，他的呼吸声，狼的呼吸声……",
      "level": 2
    },
    {
      "id": "67.6",
      "text": "不只是安静，卓木强巴感觉自己好像来到了另一个世界，被封闭在一方水晶之中，由纯氧构成的立方体，笼罩在这座建筑的上方，是自己的呼吸才扰乱了这里空气的流动，否则，这里的一切都该是静止的。",
      "level": 2
    },
    {
      "id": "68",
      "text": "水是静止的，像平滑光洁的琉璃之镜；",
      "level": 1
    },
    {
      "id": "69",
      "text": "空气是静止的，氧气浓稠得好像拥有实质，可以清晰地感觉到自己将它们拽入胸腔，吸进肺里，化作千丝万缕，散布于四肢百骸。",
      "level": 1
    },
    {
      "id": "70",
      "text": "一片树叶飘零，绝不像被风吹落那样打着旋儿，而是笔直地、缓缓地沉降下来，若注视水中，会看见一片树叶，从水底慢慢地浮上来。",
      "level": 1
    },
    {
      "id": "71",
      "text": "当卓木强巴发现，这一切都好似静止不动的时候，再看那些附着于四壁地板的小人儿，顿时有一种芒刺在背、电击全身的感觉。",
      "level": 1
    },
    {
      "id": "72",
      "text": "那些原本已被固定了形态，真正应该静止的小人儿却仿佛在动！",
      "level": 1
    },
    {
      "id": "73",
      "text": "欲海中的人们，仿佛真的涌荡起来，相互践踏着随着血海翻腾，一潮一潮地涌了过来，要攀附上自己的脚背；",
      "level": 1
    },
    {
      "id": "74",
      "text": "四壁神佛则带着事不关己的目光，如行云流水般，绕着廊坊徐徐前行，他们像是要去朝圣，抑或远离着凡世纷争；",
      "level": 1
    },
    {
      "id": "75",
      "text": "天上飞仙，似青云坠地，不疾不缓，却是在以一种令人揪心的慢速接近着欲海。",
      "level": 1
    },
    {
      "id": "76",
      "text": "那是一种什么样的感觉，就好像自己是跳出三界外的一方存在，以绝高的姿态打量着芸芸众生，神佛尽归我手，宇宙自在我胸。",
      "level": 1
    },
    {
      "id": "77",
      "text": "只是这种感觉，让卓木强巴很不自在，他知道，这无疑是古人对声、空气、视觉等多种现象的掌握和运用，才营造出这种让人觉得自己已超越了神佛，掌控了整个宇宙的错觉。",
      "level": 1
    },
    {
      "id": "78",
      "text": "卓木强巴这一生，从未见过任何与之相似的建筑，而且这种超脱物外的感觉，并没有令他飘然若仙，而是感到了无穷的恐惧。",
      "level": 1
    },
    {
      "id": "79",
      "text": "对卓木强巴而言，这就是一座在磅礴的气势背后隐藏着无尽诡异的魔庙，他再也待不下去了，甚至连第一重广场和正殿都没有浏览完，就叫上二狼和小狼，匆匆离开。",
      "level": 1
    },
    {
      "id": "80",
      "text": "当莫金他们抵达边缘时，和卓木强巴在小狼和二狼带领下走地下通道不同，他们是沿着三层平台边缘前行。",
      "level": 1
    },
    {
      "id": "81",
      "text": "这一日，他们依旧列队行进于冰雪天地中，忽然发现前方迷雾大作。",
      "level": 1
    },
    {
      "id": "82",
      "text": "起初五十米开外还能见到人影，走着走着，能见距离不过十米；",
      "level": 1
    },
    {
      "id": "83",
      "text": "再往前走，那雾气竟然越堆越浓，白茫茫的一片，仿佛挤入了棉絮堆中，伸直手臂，竟然不见十指。",
      "level": 1
    },
    {
      "id": "84",
      "text": "莫金下令完全切换成红外模式，忽然听得士兵大呼，仿佛发现了什么，莫金与索瑞斯也各自取过头盔戴上，切换模式。",
      "level": 1
    },
    {
      "id": "85",
      "text": "“那是什么，老板，我们到火焰山了吗？”马索在一旁大呼小叫。",
      "level": 1
    },
    {
      "id": "86",
      "text": "通过头盔的红外模式，莫金清晰地看到，距离他们不足两百米，仿佛有几十头怪兽，那灼热变成一条火舌，吞吐翻卷，在红外模式里便是一团赤红。",
      "level": 1
    },
    {
      "id": "87",
      "text": "“好，我们到了，终于到了。”莫金惊喜大嚷，也顾不得什么威仪。",
      "level": 1
    },
    {
      "id": "88",
      "text": "佣兵们听到消息，顿时欢呼成一片。",
      "level": 1
    },
    {
      "id": "89",
      "text": "几个心急的已不顾一切要向前冲，被莫金叫了回来。",
      "level": 1
    },
    {
      "id": "90",
      "text": "“是这里吗？”索瑞斯问道：“前面那是什么东西？”",
      "level": 1
    },
    {
      "id": "91",
      "text": "莫金道：“《古格金书》后半卷记载，要抵达神庙，先要抵达叹息的墙壁。",
      "level": 1
    },
    {
      "id": "91.1",
      "text": "按记载，那堵墙壁厚千仞，中空有孔，吞云吐雾，如有人叹息，故名叹息之墙。",
      "level": 2
    },
    {
      "id": "91.2",
      "text": "这道墙不仅把神庙与外界隔绝开来，更是让第三怪平台笼罩在迷雾之中。”",
      "level": 2
    },
    {
      "id": "92",
      "text": "“吞云吐雾？你是说，整个第三层平台的雾气，都是从这里来的？”索瑞斯不解。",
      "level": 1
    },
    {
      "id": "93",
      "text": "莫金取下头盔，带着索瑞斯后退百米，指着前方道：“你看这云雾，可有不同？”",
      "level": 1
    },
    {
      "id": "94",
      "text": "索瑞斯极目望去，果然，虽说身在一片白茫茫的雾气之中，但前方雾浓，就好似大型工厂里冒出的白烟，前赴后继，叠嶂起伏，有如实质。",
      "level": 1
    },
    {
      "id": "95",
      "text": "那些雾气亦如洪水泄闸，喷薄而出，腾起数百米高度，再沿着第三层平台，朝他们来的方向滚滚而去，这第三层平台遮天蔽日的雾气，竟然是人造的！",
      "level": 1
    },
    {
      "id": "96",
      "text": "索瑞斯放眼望去，那雾海如潮，连绵不断，看来这道叹息的墙壁，竟然将第三层平台拦腰斩断，生生造出了雾锁平台的神奇效果。",
      "level": 1
    },
    {
      "id": "97",
      "text": "在此之前，索瑞斯一直以为，霜云雾雨，那是大自然才有的神功造化，岂料今日竟然见到了人造大雾！",
      "level": 1
    },
    {
      "id": "98",
      "text": "这不是工厂的小小烟柱，这可是笼罩方圆数百公里的大雾啊！",
      "level": 1
    },
    {
      "id": "99",
      "text": "“这是……怎么做到的？”",
      "level": 1
    },
    {
      "id": "99.1",
      "text": "若说在倒悬空寺，索瑞斯还能认定那是人造奇观，而这弥天的大雾，他实在不明白，古人怎么能做出如此惊人的效果，更何况还要持续千年。",
      "level": 2
    },
    {
      "id": "100",
      "text": "莫金肃然起敬道：“在此之前，我也百思不得其解，后来听巴桑说起他们抵达过有如热带丛林般的地方，我才敢有所联想，加上此地的原始火山地貌，更加印证了我的想法。”",
      "level": 1
    },
    {
      "id": "101",
      "text": "“不要卖关子，快说出你的想法。”索瑞斯有些急不可耐。",
      "level": 1
    },
    {
      "id": "102",
      "text": "莫金悠然道：“帕巴拉神庙和它周围散落的城邦，是建立在一座活火山之上，一座或许是亿万年前地球形成之初就有了的火山，千年之前，它还在不定期地喷涌岩浆。",
      "level": 1
    },
    {
      "id": "102.1",
      "text": "那些戈巴族人，将神庙选在此处，正是利用了火山的天然能量，引地热岩浆为已用。",
      "level": 2
    },
    {
      "id": "102.2",
      "text": "那道叹息的墙壁，将神庙与周围分隔开来，形成独立的空间，就和我们修建了房屋并在屋内安上暖气空调一个道理，屋外零下几十度，屋内却能达到三十几度的高温。",
      "level": 2
    },
    {
      "id": "102.3",
      "text": "只是这间屋子很大，其面积要以百平方公里为计算单位，这就是戈巴族人创造的奇迹，利用独特的地理环境和难以想象的能量来源，建造出我们现代科技不敢想象的奇迹！",
      "level": 2
    },
    {
      "id": "102.4",
      "text": "以人工的力量，改变方圆几百公里的自然环境啊！”",
      "level": 2
    },
    {
      "id": "103",
      "text": "莫金挥手一指，铿锵有力道：“那道叹息的墙壁，应该就是地下几千米处那大型机械运转的排气孔，它们喷出的极高的温度与外界极低的温度相碰，就形成了这漫天的浓雾。",
      "level": 1
    },
    {
      "id": "103.1",
      "text": "戈巴族人从不放弃利用任何有效资源，这也一定是早就计算好了的。",
      "level": 2
    },
    {
      "id": "103.2",
      "text": "这浓雾正好将整座神庙和它的卫星城一起保护起来。”",
      "level": 2
    },
    {
      "id": "104",
      "text": "“可是，它已经运转了一千年了啊？”索瑞斯还是无法相信，造一个能改变几百公里环境温度的大空调，这是一千年前的中国古人所具有的智慧？",
      "level": 1
    },
    {
      "id": "105",
      "text": "“你知道永动机为什么不能制造出来吗？”莫金忽然换了个问题，又自己解答道：“因为能量总是在被消耗，而且不能无中生有，但随着自动化机械的不断发展，其磨损的零部件都可以由机械自行更换，那么，永动机所需要的就只是一个能永久提供能量的来源了。”",
      "level": 1
    },
    {
      "id": "106",
      "text": "而事实上，大自然提供了无数近乎永久的能量来源，太阳光、潮汐、水、风，只要对这些能量善加利用，造出一台永动机是可行的。",
      "level": 1
    },
    {
      "id": "107",
      "text": "戈巴族人就是利用了火山的能量。",
      "level": 1
    },
    {
      "id": "107.1",
      "text": "一千年来，火山不熄，那这台机械就运转不停，就算没有人去操作更换，它也会一直这样运转下去，直到将所有的零部件都磨损至无法使用。",
      "level": 2
    },
    {
      "id": "107.2",
      "text": "一千年前的古人智慧啊，真是庆幸这种智慧被淹没在战争的长河中了，否则，这们不敢想象今天的中国会是什么样子！”",
      "level": 2
    },
    {
      "id": "108",
      "text": "“如果喷涌的是极高温气体，我们如何通过？”陪着莫金感慨了一阵，索瑞斯又想到另一个问题。",
      "level": 1
    },
    {
      "id": "109",
      "text": "“放心，它会停下来休息。",
      "level": 1
    },
    {
      "id": "109.1",
      "text": "一张一弛，这是中国古代传统的哲学思维，也唯有如此，那些机械才能千年不朽。",
      "level": 2
    },
    {
      "id": "109.2",
      "text": "莫金自信道。",
      "level": 2
    },
    {
      "id": "110",
      "text": "莫金说得没错，过了一阵，那吞吐的热气渐渐平息下来，他们的佣兵队伍迅速前插，利用现代工具登上那叹息之墙。",
      "level": 1
    },
    {
      "id": "111",
      "text": "这厚达百米的城墙可以算是一个大型广场，站在上面眺望城墙内外，竟是截然不同的两个世界。",
      "level": 1
    },
    {
      "id": "112",
      "text": "墙外白雾茫茫，而墙内竟是碧草茵茵，作毯连天，看着那满眼的绿色，莫金微笑道：“我们……终于到了！”",
      "level": 1
    },
    {
      "id": "113",
      "text": "城墙上顿时响起一片欢呼，那些佣兵们也暂时忘记了心中的不快，任谁在冰天雪地里走了数月之后，陡然见到一片散发着暖气的绿洲，心情都是舒畅而愉悦的。",
      "level": 1
    },
    {
      "id": "114",
      "text": "他们纷纷摘掉头盔，大口大口地呼吸清新空气，仿佛再往前走几步就能看见帕巴拉神庙了，却浑然不知，前面的路途遥远而艰辛，死亡等着他们。",
      "level": 1
    },
    {
      "id": "115",
      "text": "当莫金他们踏上城墙，看到一片生机勃勃的绿洲景象时，卓木强巴已在另一座城中漫步。",
      "level": 1
    },
    {
      "id": "116",
      "text": "这些天，他见到了各种各样的建筑，每种都让他惊叹称奇。",
      "level": 1
    },
    {
      "id": "117",
      "text": "每一次都有新的震撼，终于，在经历了太多震撼之后，产生了震撼的麻木。",
      "level": 1
    },
    {
      "id": "118",
      "text": "他知道，前面的每一座城市都是独一无二的，每一种建筑都会超出自己的想象。",
      "level": 1
    },
    {
      "id": "119",
      "text": "在密林之中，存在着各种古怪的生物，有的二狼和小狼会去捕食，有的二狼和小狼则带着他绕道而行，但是……整个平台上，所有的城市内，没有人！",
      "level": 1
    },
    {
      "id": "120",
      "text": "一个人都没有！",
      "level": 1
    },
    {
      "id": "121",
      "text": "所有存在的痕迹都随着时间的流逝而消失了！",
      "level": 1
    },
    {
      "id": "122",
      "text": "那一座座精美绝伦的城市，完美的几何学建筑，仿佛是从天上掉下来的，就像……就像那些玛雅的城邦一样，静静的躺在密林深处，不知过了几千几万年，只等着文明中起来的后人们去发现。",
      "level": 1
    },
    {
      "id": "123",
      "text": "去惊叹。",
      "level": 1
    },
    {
      "id": "124",
      "text": "从一座城市走向另一座城市，看着藤蔓林木缠绕着美轮美奂的建筑，看着那些说不出名字的中小型动物在城市间安营扎寨，嬉戏蹦跃，明明是温暖的风吹过，却感到无比冷清。",
      "level": 1
    },
    {
      "id": "125",
      "text": "卓木强巴踏着二狼和小狼的足迹，以陌生人的身分打量着它的繁华，他的内心深处却感到一种入骨的孤独。",
      "level": 1
    },
    {
      "id": "126",
      "text": "他不止一次地自问，为什么，为什么没有人？",
      "level": 1
    },
    {
      "id": "127",
      "text": "那些戈巴族人，去哪里了？",
      "level": 1
    },
    {
      "id": "128",
      "text": "渐渐地，卓木强巴看出更多端倪，二狼和小狼并没有带着自己走直线，而是沿着平台在森林中划出一道弧线，也就是说，他们一直在神秘中心的",
      "level": 1
    },
    {
      "id": "128.1",
      "text": "外围。",
      "level": 2
    },
    {
      "id": "129",
      "text": "如果说香巴拉是一座繁华的都市，那么自己所看到的就应该是它的卫星城，那些古人先开凿渠道将雪山积水引下来，汇成一个个的饮水潭，再沿着潭的四周修建居住区，再以居住区为基础，一层一层往上摞，最后形成一个个结构复杂、造型各异的立体城市，一座又一座风格迥异的城市。",
      "level": 1
    },
    {
      "id": "130",
      "text": "古戈巴族人似乎在进行一种实验，他们……好像是打算建造一座高度机械自动化，又能完美地和自然融为一体的城市，不同的卫星城就是他们建造的不同的蓝图，所以都会出现如此多带宗教色彩的、机械化的、自然的建造模式。",
      "level": 1
    },
    {
      "id": "131",
      "text": "当二狼和小狼带着卓木强巴参观完最后一座卫星城后，又按原路返回了，卓木强巴留意到二狼和小狼的举动，它们停歇很小，似乎在躲避着什么。",
      "level": 1
    },
    {
      "id": "132",
      "text": "卓木强巴捉住小狼，指着他们前进弧线对应的中心点，问道：“那里，就是我们要去的地方吗？”",
      "level": 1
    },
    {
      "id": "133",
      "text": "小狼似乎被吓了一跳，扒拉着脑袋，警惕地向四周看了一眼，突然蹑手蹑脚地前行，变得像只老鼠，然后带着卓木强巴来到一株大树下，扒开一堆石头，顿时一股熏人的气息扑鼻而来。",
      "level": 1
    },
    {
      "id": "134",
      "text": "卓木强巴一愣，他当然知道那是狼做的标记，标示前面是另一群狼的领地，只是这么大股味道，这个家族，究竟有多少狼啊？",
      "level": 1
    },
    {
      "id": "135",
      "text": "卓木强巴明白了,踏过这道看不见的标记线,将进入另一个家族的领地,而这些日子,二狼和小狼则带着自己,在不同的领地缓冲带里游走穿插.",
      "level": 1
    },
    {
      "id": "136",
      "text": "他们是一个孤独的团体,他们不知道会不会被别的狼接纳,而一次次失败的教训,以留给他们留下难以磨灭的痕迹,被赶了出去,赶到极寒之地.",
      "level": 1
    },
    {
      "id": "137",
      "text": "卓木强巴同时也明白,自己是头狼,如果自己踏过这条线,二狼和小狼都会踏过去,只是二狼和小狼似乎不能被狼群接纳,自己又能做到吗?",
      "level": 1
    },
    {
      "id": "138",
      "text": "正在犹豫不决时,二狼从后面跟了上来,发出短促的警告,似乎被什么东西发现了.",
      "level": 1
    },
    {
      "id": "139",
      "text": "卓木强巴刚站起身，丛林中便是一阵响声，一个由九匹狼组成的群体，出现在界线的另一方。",
      "level": 1
    },
    {
      "id": "140",
      "text": "小狼喉咙里嘟囔着，耷拉着半截尾巴上前交涉，对方似乎并不领领情，发出了准备攻击的信号。",
      "level": 1
    },
    {
      "id": "141",
      "text": "交涉未果，小狼赶紧跑了回来，躲在卓木强巴身后，露出半个脑袋，一只前爪搭在卓木强巴腿上，好像在说：“这是我们的老大，有什么事情找他。”",
      "level": 1
    },
    {
      "id": "142",
      "text": "卓木强巴紧了紧手中的武器，他根本就没有一下就会九匹狼的信心，只是在这密林中，跑是跑不过狼的，该怎么办？",
      "level": 1
    },
    {
      "id": "143",
      "text": "他又想起了手中唯一的退敌利器，骨笛！",
      "level": 1
    },
    {
      "id": "144",
      "text": "卓木强巴取出骨笛，放在唇下，轻轻一撮……",
      "level": 1
    },
    {
      "id": "145",
      "text": "出乎意料地，这次那些狼并没有退去，而是一阵交头接耳，眼中流露出疑惑的神色。",
      "level": 1
    },
    {
      "id": "146",
      "text": "卓木强巴有些急了，又吹了一阵，直到感觉有人拉自己的皮裙。",
      "level": 1
    },
    {
      "id": "147",
      "text": "卓木强巴扭头看去，二狼盯着他，摇了摇头，似乎在提醒他，不要老是吹。",
      "level": 1
    },
    {
      "id": "148",
      "text": "九匹狼里的首领站了出来，对卓木强巴他们轻轻一啸，这句卓木强巴能听懂，那是一种邀请或者命令：“跟我们走。”",
      "level": 1
    },
    {
      "id": "149",
      "text": "卓木强巴还在犹豫，二狼和小狼早已雀跃不已，推着卓木强巴不断向前。",
      "level": 1
    },
    {
      "id": "150",
      "text": "卓木强巴抚着小狼的头，感受到它们渴望回家的决心，这才跟上了这支队伍。",
      "level": 1
    },
    {
      "id": "151",
      "text": "一路上，二狼不住向那个狼首领重复着一个词，照卓木强巴的理解，应该是“首领”或“领导”的意思，那是一种带有敬畏的音调，是地位低的狼和地位高的狼对话时才有的声音。",
      "level": 1
    },
    {
      "id": "152",
      "text": "但看它们的神色，谈论的显然不是眼前这位狼首领，而且，它们究竟要带自己去哪里呢？",
      "level": 1
    },
    {
      "id": "153",
      "text": "原本以为短暂的行程竟然走了两天，卓木强巴已经深入密林中心地带，四周的一切趋于完美，头顶叠翠千丈的巨栉比鳞次；",
      "level": 1
    },
    {
      "id": "153.1",
      "text": "身旁有藤蔓缭绕，草比人高；",
      "level": 2
    },
    {
      "id": "153.2",
      "text": "脚下巨树们盘根错节，交织成网。",
      "level": 2
    },
    {
      "id": "153.3",
      "text": "有翅昆虫嘤嘤飞行，追花逐蔓地在狭小的缝隙间穿插；",
      "level": 2
    },
    {
      "id": "153.4",
      "text": "繁茂的枝叶间有走兽灵巧跳跃；",
      "level": 2
    },
    {
      "id": "153.5",
      "text": "蚂蚁结队成阵，在厚积成堆雪的落叶和苔藓间忙碌奔走。",
      "level": 2
    },
    {
      "id": "154",
      "text": "曼妙的花香袭人，林间不可见处有清泉幽幽吟诵。",
      "level": 1
    },
    {
      "id": "155",
      "text": "暖风吹过，林海枝舞叶涌，俯仰起伏，洒落了晨曦的凝露。",
      "level": 1
    },
    {
      "id": "156",
      "text": "阳光层层折射，斑驳剪影，自水晶般的露珠上透出七彩的光晕。",
      "level": 1
    },
    {
      "id": "157",
      "text": "卓木强巴踏过松软的树枝，发现身边一切都那么和谐。",
      "level": 1
    },
    {
      "id": "158",
      "text": "动物、植物，在这里构成一个独立的世界，生生不息，轮替更迭，他甚至可以触摸到空中跳跃的快乐音符。",
      "level": 1
    },
    {
      "id": "159",
      "text": "这里给人的感觉，要比那些鬼斧神工的巍峨建筑，更加令人必生敬畏，平静下又感情激荡，这自然，本身就是一个最大的奇迹。",
      "level": 1
    },
    {
      "id": "160",
      "text": "就在这样的奇迹之林中，另一个奇迹在卓木m强巴眼前悄然展开。",
      "level": 1
    },
    {
      "id": "161",
      "text": "虽说是在同一片密林中，但这里的环境与周遭大是不同。",
      "level": 1
    },
    {
      "id": "161.1",
      "text": "首尾相接的遮天密林突然出现了大幅的空地，萋萋芳草做毯，参天的巨茎树环抱，如镜的湖泊倒映着蓝天白云，无数宏伟的人造建筑似天界的神殿散落在草丛森林之间。",
      "level": 2
    },
    {
      "id": "161.2",
      "text": "神殿间穿梭着无数忙碌的身影，它们穿插不休，又各自接踵成列，远看像极了蚂蚁王国那些一刻不停的工蚁，又像是人类某个时代修建巨型建筑时那成千上万的奴隶劳作的画面。",
      "level": 2
    },
    {
      "id": "161.3",
      "text": "及至近处，才惊愕地发现，那些密密麻麻的身影是狼，还有獒，它们间夹混杂，却又井然有序，就像繁华闹市中的各种车辆，沿着街道前进。",
      "level": 2
    },
    {
      "id": "162",
      "text": "卓木强巴一生，从未见过如此多的狼和獒混杂在一处，虽然他看惯了秀美风光，也能无视那些神迹建筑，依然为那陡然出现的无数狼群心悸不已。",
      "level": 1
    },
    {
      "id": "163",
      "text": "导师是对的，这里有一个狼的王国，这里的狼已进入高度的社会化形态，它们有着严格的分工和社会地位。",
      "level": 1
    },
    {
      "id": "164",
      "text": "这种结构，已经超越了人类的氏族社会时期，看样子，已经达到了人类的奴隶社会，或更高等级的社会模式。",
      "level": 1
    },
    {
      "id": "165",
      "text": "它们有自己的巡边队，守护着领土的安全；",
      "level": 1
    },
    {
      "id": "166",
      "text": "远处拖来了巨大的猎物，它们有自己的狩猎队伍；",
      "level": 1
    },
    {
      "id": "167",
      "text": "南首的大片草地上，一群群的羊列成方阵行进，它们有自己的牧区，这 ন্যায্য难怪斯必杰莫大雪山上，那些被灰狼三兄弟组织起来的狼也能牧羊，这对它们来说只是家常便饭。",
      "level": 1
    },
    {
      "id": "168",
      "text": "导师的话仿佛回到了耳边，当迁徙狼达到一定数量，突破了集体的瓶颈，能收集到足够多的食物时，它们就足以产生媲美于人类社会的狼族社会结构，它们会出现更为合理的分工，按照氏族或一个国家的模式来生存发展，它们——会选出自己的王！",
      "level": 1
    },
    {
      "id": "169",
      "text": "真正的王！",
      "level": 1
    },
    {
      "id": "170",
      "text": "那支巡边队的队长可不容卓木强巴站在那里激动或感慨，催促他快些前进。",
      "level": 1
    },
    {
      "id": "171",
      "text": "二狼和小狼也收起平日跳脱不羁的性子，安静地跟在那位队长的身后，还轻轻地推着卓木强巴，让他不要违拗队长的意思。",
      "level": 1
    },
    {
      "id": "172",
      "text": "卓木强巴这才明白自己的真实身份，他们不是狼之国度邀请的客人，而是被当作俘虏，或者某种嫌犯，要被带到某处进行审问，如此而已。",
      "level": 1
    },
    {
      "id": "173",
      "text": "卓木强巴心中苦笑，不过他依然跟着那头狼队长，能够见到这样一个气壮山河的庞大建筑群，能够亲眼目睹几万，乃至几十万的狼和獒集结成的国度，就算下一刻遭遇不幸，也没有什么遗憾了。",
      "level": 1
    },
    {
      "id": "174",
      "text": "原本看着那些建筑物是极近的，可是却走了很久，只能说明一个问题——那些建筑太大了！",
      "level": 1
    },
    {
      "id": "175",
      "text": "当他们真正走到建筑群落之中的时候，卓木强巴又不由得产生的疑惑，这里不是一座城市吗？",
      "level": 1
    },
    {
      "id": "176",
      "text": "在远处明明看到都是些巨大的建筑，可走近之后才发现，那些建筑，竟然披上了一层树衣，树的根系像衣裙一样包裹着石砌的建筑群，要不是那些建筑的大厅或中堂里，长满了各种植物和花草，虫鸟筑巢，蛇鼠建窝，看上去，那些石砌的建筑和整个自然，已经完全融为一体了。",
      "level": 1
    },
    {
      "id": "177",
      "text": "卓木强巴暗藏隐忧，这些被打磨过的石头，这种适宜人类居住的嬉笑工，不会就是狼族搭建起来的吧？",
      "level": 1
    },
    {
      "id": "178",
      "text": "它们应该还有真正的主人，只是那些主人，究竟去了哪里呢？",
      "level": 1
    },
    {
      "id": "179",
      "text": "为什么这里变成了狼族王国的首都和各种野生动物的天堂？",
      "level": 1
    },
    {
      "id": "180",
      "text": "那位巡边的队长将卓木强巴他们带到某一个小图书馆似的建筑附近后，就不再前进。",
      "level": 1
    },
    {
      "id": "181",
      "text": "它和一头幼狼对话后，那头幼狼一溜烟去了，没多久就带回一头年迈的狼，旁边跟着四五头中年狼，看上去威严无比。",
      "level": 1
    },
    {
      "id": "182",
      "text": "老狼严肃地询问着巡边队长，似乎在问它为什么把不相干的带回了王国。",
      "level": 1
    },
    {
      "id": "183",
      "text": "巡边队长态度恭敬的回答着，还不住地往卓木强巴这边瞟，小狼在一旁为卓木强巴正名：“阿呜肮，阿呜肮。”",
      "level": 1
    },
    {
      "id": "184",
      "text": "老狼扭头看着小狼，将它招至身旁，询问起来，小狼快语连珠，不停地说着，阿呜肮怎么怎么样，阿呜肮怎么怎么样，它们又怎么样，如何如何，这般这般……",
      "level": 1
    },
    {
      "id": "185",
      "text": "听完小狼说了一大堆经历，老狼似乎陷入了沉思，旁边一头中年狼对小狼说了句什么，小狼奔回卓木强巴身边，听意思，是向他索要什么东西。",
      "level": 1
    },
    {
      "id": "186",
      "text": "卓木强巴拍了拍自己赤裸的上身，摊开手问小狼要什么。",
      "level": 1
    },
    {
      "id": "187",
      "text": "小狼撮走嘴，试了试发间，然后道：“嗷，嗷，嗷……”那并非正宗的狼语，卓木强巴听出来了，小狼是在模仿什么发音，他赶紧取出了骨笛，拿在手中，小狼不住颔首。",
      "level": 1
    },
    {
      "id": "188",
      "text": "老狼这时走了过来，对卓木强巴说了句什么。",
      "level": 1
    },
    {
      "id": "189",
      "text": "卓木强巴略懂，知道对方是让他吹一声试试，于是他将骨笛放在嘴里，吹响了那声音，嘹亮的笛音响彻在狼国的上空。",
      "level": 1
    },
    {
      "id": "190",
      "text": "远方行进中的狼群竟然都停了下来，纷纷注视着这边，巡边队长向着远处咆哮了一声，似乎在说：“看什么看！干活儿去！”",
      "level": 1
    },
    {
      "id": "191",
      "text": "那些地位较低的狼才又开始缓缓移动。",
      "level": 1
    },
    {
      "id": "192",
      "text": "老狼又对着巡边队长说了些什么，似乎是赞许的话，巡边队长很是受用，然后掉头疾奔，显然是归队去了。",
      "level": 1
    },
    {
      "id": "193",
      "text": "老狼又和周围的中年狼商量了一番，似乎决定了某项重大的事，有一头中年狼匆匆而去，又匆匆而返，似乎得到了上面的答复，随后老狼以命令的口气对着卓木强巴说话，卓木强巴的狼语理解能力实在有限，只能愣着。",
      "level": 1
    },
    {
      "id": "194",
      "text": "小狼用前爪扣着卓木强巴背上巨大的飞来骨，连声说道：“扔掉，扔掉。”",
      "level": 1
    },
    {
      "id": "195",
      "text": "卓木强巴这才明白，原来是让自己解除武装，看来，是要去见重要的人物了，不对，应该是重要的狼。",
      "level": 1
    },
    {
      "id": "196",
      "text": "越往前走，狼群就越是密集，所有的狼都带着新奇的目光打量着这头用两条腿走路的奇特的狼。",
      "level": 1
    },
    {
      "id": "197",
      "text": "卓木强巴感觉自己好像进了动物园，不过，在笼子里面 的动物，却是自己，周遭都是兴奋而又惊奇的目光，就差没有拿食物和树枝来逗喂自己了。",
      "level": 1
    },
    {
      "id": "198",
      "text": "再往前，狼群又渐渐稀疏起来，身边窃窃狼语也渐渐消失，威严肃穆的气氛越来越浓，四周巡游着的都是一些体格异常健壮的成年公狼，二狼和小狼更是大气也不敢出，走路都是踮着脚。",
      "level": 1
    },
    {
      "id": "199",
      "text": "卓木强巴知道，他们正在深入狼之王国的核心，只是不知道要见自己的是谁，狼国的智囊，还是……那神秘的狼王？",
      "level": 1
    },
    {
      "id": "200",
      "text": "那座好似玛雅金字塔的建筑渐渐出现在眼前，它突兀的拔地而起，比周围的建筑要雄壮几分，占据着丛林中的制高点。",
      "level": 1
    },
    {
      "id": "201",
      "text": "在这如同群星散步的建筑群中，它就好似一轮明月，巍峨高耸，与天相接。",
      "level": 1
    },
    {
      "id": "202",
      "text": "在那金字塔塔身的平台上，都各有一匹狼或獒，它们或站或卧，纷纷注视着塔下的来客。",
      "level": 1
    },
    {
      "id": "203",
      "text": "纵使卓木强巴这种第一次到这里来的人，也能明白，这就是狼之王国的决策中心，能站在这上面的狼，都是王国中地位极高者，而金字塔的顶端……",
      "level": 1
    },
    {
      "id": "204",
      "text": "从卓木强巴的角度和高度望去，看不到金字塔顶端的平台。",
      "level": 1
    },
    {
      "id": "205",
      "text": "塔的中央有一道天梯直通顶点，老狼沿着天梯攀登而上，卓木强巴他们则留在底部。",
      "level": 1
    },
    {
      "id": "206",
      "text": "不一会儿，那头老狼又逐极而下，在金字塔的中部有一个属于它的位置，它从天梯跃向了一旁。",
      "level": 1
    },
    {
      "id": "207",
      "text": "随后四围沉寂下来，安静得有些诡异，然后天梯的顶端出现了两头狼或獒的身影，对着下方一阵咆哮，吼声响彻四野。",
      "level": 1
    },
    {
      "id": "208",
      "text": "二狼和小狼低着头，一步一匍匐地向天梯攀登，卓木强巴走在两匹狼的中间，顶着四围一道道盛气如炬的狼的目光。",
      "level": 1
    },
    {
      "id": "209",
      "text": "气氛愈发严肃了，他能感到那股无形的威压。",
      "level": 1
    },
    {
      "id": "210",
      "text": "在距顶点还有十几级台阶的地方，二狼和小狼停下来了，趴在那里一动不动，目光不敢仰视。",
      "level": 1
    },
    {
      "id": "211",
      "text": "卓木强巴却是站直了身子，以他的身高刚好可以看见金字塔顶端还有一方小小的平台。",
      "level": 1
    },
    {
      "id": "212",
      "text": "那平台就像一个王座，上面躺着一个有些慵懒的庞大身躯。",
      "level": 1
    },
    {
      "id": "213",
      "text": "它半眯着眼，微张着嘴，舌头伸在外面晒着太阳，从尾梢至颅顶，就像雕塑家手中最完美的线条，腹部随着它的一呼一吸而有节律地颤动着，仿佛这就是整个狼之王国的心脏，整个王国因这个心跳而有着汩汩的生力。",
      "level": 1
    },
    {
      "id": "214",
      "text": "事实上，第一眼映入卓木强巴视野中，让他屏住呼吸并且心脏短暂停跳的，便是王座上那位；",
      "level": 1
    },
    {
      "id": "215",
      "text": "那一身黝黑的皮毛，在阳光下闪烁着紫金的色泽。",
      "level": 1
    },
    {
      "id": "216",
      "text": "那眉眼，那嘴唇，那四肢，那身段，卓木强巴无不熟悉，曾在睡梦中出现过千百回，那威风凛凛的纵驰草原，也曾在臆想中构筑了无数次，如今陡然君不见，它真的存在，就活生生地出现在自己的眼前，所以卓木强巴愣了，痴了，甚至忘记了周围的一切，眼里只有它，那传说中的——紫麒麟。",
      "level": 1
    },
    {
      "id": "217",
      "text": "卓木强巴确实忘记了一切，也忘记了自己的身份和这里是什么地方，只听四周一片怒吼，二狼和小狼不敢抬头，却小心地用脚触碰着卓木强巴的脚背，四周的一切都提醒着他：“这是王！这是至高无上的存在！你是什么身份？你还不跪下，你还不臣服！”",
      "level": 1
    },
    {
      "id": "218",
      "text": "王座上那位，睁开了半眯的眼睛，有如利刃的目光穿透了时空，这是什么？",
      "level": 1
    },
    {
      "id": "218.1",
      "text": "这是王道，是霸气！",
      "level": 2
    },
    {
      "id": "218.2",
      "text": "当它四肢伸直站起来时，金字塔上的一切生物，都选择了匍匐。",
      "level": 2
    },
    {
      "id": "219",
      "text": "卓木强巴没有想到，自己竟然在这样的情况下，以这样的身份，与紫麒麟见了面。",
      "level": 1
    },
    {
      "id": "220",
      "text": "在那短暂而又似恒久的错愕之后，卓木强巴省悟过来。",
      "level": 1
    },
    {
      "id": "221",
      "text": "他想起了自己的身份，自己是以一头狼的身份出现在这里，那怪异的长相在族群里的地位恐怕还不及二狼和小狼，而自己所面对的，是整个狼之国度的王，唯一的王！",
      "level": 1
    },
    {
      "id": "222",
      "text": "看那周围的目光，要是自己再没有表示，恐怕马上就会被撕作一堆碎肉。",
      "level": 1
    },
    {
      "id": "223",
      "text": "他选择了认同自己的身份和地位，缓缓地匍匐下去，四肢着地，但他却有勇气昂起自己的头颅，以平视的目光深情地看着紫麒麟。",
      "level": 1
    },
    {
      "id": "224",
      "text": "卓木强巴心中有些苦涩地想着，怎么整件事情，与自己最初的设想，完全反转了过来？",
      "level": 1
    },
    {
      "id": "225",
      "text": "就在不久前，他还想着能像领着一头猎犬一样，带着紫麒麟漫步于人类繁华的闹市街头，或在灯光璀璨的舞台上，向全世界介绍这种最尊贵的物种。",
      "level": 1
    },
    {
      "id": "226",
      "text": "可当事实出现在眼前时，他才惊愕地发现，那是王，是一国之君，是高高在上的至尊存在，而自己，只不过是地位低得不能再低的一头小狼，唯一的特点就是可以用两条腿站立起来行走。",
      "level": 1
    },
    {
      "id": "227",
      "text": "自己只能远远地，用景仰的目光去看着它，就连靠近也不可能，这是多么巨大的反差啊！",
      "level": 1
    },
    {
      "id": "228",
      "text": "他似乎有些理解，父亲那带有一丝讥讽的笑容。",
      "level": 1
    },
    {
      "id": "229",
      "text": "自己根本就不了解狼，不了解狼的世界，自己从来都是站在人类的角度去认识和观察狼，自己并不真的清楚狼想要什么，狼因何而存在；",
      "level": 1
    },
    {
      "id": "230",
      "text": "就像自己并不真的清楚自己想要什么，人类因何而存在。",
      "level": 1
    },
    {
      "id": "231",
      "text": "王座上，那位至高无上的王，并不清楚此刻卓木强巴的想法，但它似乎对这个可以两腿直立行走的生物有着别样的亲切。",
      "level": 1
    },
    {
      "id": "232",
      "text": "它舒展着身姿，轻盈地纵跃下了王座，来到天梯的边缘，俯视着卓木强巴。",
      "level": 1
    },
    {
      "id": "233",
      "text": "卓木强巴赶紧迎上了它的目光，他甚至在想，不知自己这副模样，是否有些诚惶诚恐，就像从未进过城的乡下老农，突然见到了真正的国王一样！",
      "level": 1
    },
    {
      "id": "234",
      "text": "四周一片躁动，那些狼王国的大臣们都惊诧万分，王是怎么了？",
      "level": 1
    },
    {
      "id": "235",
      "text": "怎么会为了这么一个两条腿走路的怪狼，亲自跃下王座，还亲自来到天梯的边缘，注视着它，这种极端的殊荣，竟然会出现在一个异族身上！",
      "level": 1
    },
    {
      "id": "236",
      "text": "一人一獒，两个不同的物种，各自以倾斜四十五度的视角，用目光进行着无声的交流。",
      "level": 1
    },
    {
      "id": "237",
      "text": "紫麒麟深吸一口气，鼻孔缩窄，慢慢地品味着、分析着台下那个两足生物带来的讯息，那深邃的目光透出复杂的疑惑：“你从哪里来？异族的人类啊！”",
      "level": 1
    },
    {
      "id": "238",
      "text": "“从极远的外界，一个人类的国度。”卓木强巴的目光渐渐平静下来，眼眸里倒映着蓝天白云。",
      "level": 1
    },
    {
      "id": "239",
      "text": "“你的目的是什么？”王的目光亲切而平和，似乎找到了一丝曾经的感觉。",
      "level": 1
    },
    {
      "id": "240",
      "text": "“赴一个千年的约定，来看看你，为了寻找你，我已放下一切。”卓木强巴的目光无比恳切，期待中不安地等待着答复。",
      "level": 1
    },
    {
      "id": "241",
      "text": "王闭上了眼睛，旋即睁开，似乎完成了气息的分析，双眸透着微微的失望：“你走吧，你不是我要等的那个人，回去吧，从哪里来，就回哪里去。”",
      "level": 1
    },
    {
      "id": "242",
      "text": "“不——”卓木强巴的眼神中，那一丝不安迅速扩大，焦虑和担忧无声地传达着，“请允许我留下，我想更多地了解这个国度。”",
      "level": 1
    },
    {
      "id": "243",
      "text": "王的目光变得凌厉起来，以一种威严的姿态将信息再度传达出去：“我赐予你，在我的国度，合法的身份！你……叩退吧！”",
      "level": 1
    },
    {
      "id": "244",
      "text": "之后紫麒麟再也没和卓木强巴进行目光的交流，它转过身去，冷冷地下达了命令，很快有狼将命令大声地宣读出来。",
      "level": 1
    },
    {
      "id": "245",
      "text": "卓木强巴不知道它们说了什么，只看二狼和小狼的表情，那眼眸中闪动的泪花，显然是允许它们留下来了。",
      "level": 1
    },
    {
      "id": "246",
      "text": "此间又有一狼疾驰而上，竟是直接上了平台，对紫麒麟说了些什么，紫麒麟回复了几句，卓木强巴听得有“围猎”这样的词语。",
      "level": 1
    },
    {
      "id": "247",
      "text": "那狼得令而去，金字塔下竟然有一大群狼如部队集结般列阵出行，不知去了何方。",
      "level": 1
    },
    {
      "id": "248",
      "text": "看着满眼的绿色，马索不失时机地问道：“卡恩大人，这里的生物种类，应该很繁多吧？”",
      "level": 1
    },
    {
      "id": "249",
      "text": "索瑞斯认同道：“不错，这种环境适合小型生物繁衍，大型生物就不行，估计应该是狼的天下了。”",
      "level": 1
    },
    {
      "id": "250",
      "text": "柯夫道：“继续沿着边缘前进，想来不久就能看到帕巴拉了。”",
      "level": 1
    },
    {
      "id": "251",
      "text": "“不，”莫金道，“穿越了这堵城墙，我们就得顺着城墙往里走，沿着雪山脚下过去，才能找到帕巴拉。",
      "level": 1
    },
    {
      "id": "251.1",
      "text": "他回忆起那半部《古格金书》的内容：“穿过叹息的墙壁，沿着雪山的根系，走过十五个光明和黑暗……沿途的城市，都死了……”",
      "level": 2
    },
    {
      "id": "251.2",
      "text": "城市，怎么会死呢？",
      "level": 2
    },
    {
      "id": "251.3",
      "text": "莫金不解地摇摇头。",
      "level": 2
    },
    {
      "id": "252",
      "text": "漫长的队伍变成高大城墙下的一行小黑点，在天地之间迤逦前行，当他们头顶的薄雾渐渐散去，露出清纯的蓝天白云时，所有的人都忍不住欢呼起来！",
      "level": 1
    },
    {
      "id": "253",
      "text": "他们再也不用受那迷雾的束缚。",
      "level": 1
    },
    {
      "id": "254",
      "text": "那天下午，索瑞斯不知用了什么方法，只见他拿出许多瓶瓶罐罐，没多久就引来一大群像豚鼠一样的生物，再也不用吃那枯燥乏味的太空食品了。",
      "level": 1
    },
    {
      "id": "255",
      "text": "第二天追云逐日，傍晚时分，莫金的队伍见到了散落在这天之净土的第一座遗迹。",
      "level": 1
    },
    {
      "id": "256",
      "text": "与其说它是一座城，倒不如说是一个巨大的喷泉，有点像北京的天坛，由一个个巨大的圆盘摞在一起，不同层级的圆盘上有着不同的建筑。",
      "level": 1
    },
    {
      "id": "257",
      "text": "经索瑞斯和莫金勘察后得出结论，这些圆盘之间的衔接处，都有缝隙和轨道结构，据他..."
    }
  ],
  "concepts": [
    {
      "name": "卓木强巴",
      "frequency": 32,
      "context": "The protagonist of the story."
    },
    {
      "name": "狼",
      "frequency": 38,
      "context": "The animal companions of the protagonist and a major theme in the story, leading to the discovery of a wolf kingdom."
    },
    {
      "name": "建筑",
      "frequency": 22,
      "context": "Various descriptions of cities, temples, and royal gardens, highlighting ancient construction and design."
    },
    {
      "name": "香巴拉",
      "frequency": 6,
      "context": "The mythical destination that the characters are seeking."
    },
    {
      "name": "戈巴族人",
      "frequency": 4,
      "context": "The ancient inhabitants who built the structures."
    },
    {
      "name": "地热",
      "frequency": 3,
      "context": "The source of heat in the artificial lake."
    },
    {
      "name": "寺庙",
      "frequency": 7,
      "context": "A significant structure encountered in the story, particularly the one made of sculptures."
    },
    {
      "name": "城墙",
      "frequency": 4,
      "context": "The defensive structures and barriers described in the text."
    },
    {
      "name": "雾",
      "frequency": 7,
      "context": "A significant atmospheric phenomenon that conceals and protects certain areas."
    },
    {
      "name": "湖",
      "frequency": 6,
      "context": "An artificial lake with unique properties."
    },
    {
      "name": "紫麒麟",
      "frequency": 5,
      "context": "A legendary creature and the ruler of the wolf kingdom."
    },
    {
      "name": "莫金",
      "frequency": 6,
      "context": "A character leading a separate expedition, encountering similar phenomena."
    },
    {
      "name": "索瑞斯",
      "frequency": 5,
      "context": "A companion of莫金, discussing the ancient constructions."
    },
    {
      "name": "马索",
      "frequency": 2,
      "context": "A soldier in莫金's group."
    },
    {
      "name": "《古格金书》",
      "frequency": 2,
      "context": "A text providing clues and descriptions related to the mythical location."
    },
    {
      "name": "叹息的墙壁",
      "frequency": 4,
      "context": "A specific wall described as a source of mist and protection."
    },
    {
      "name": "火山",
      "frequency": 2,
      "context": "The geological feature utilized for heat."
    },
    {
      "name": "模型",
      "frequency": 1,
      "context": "The concept of ancient models for cities and buildings."
    }
  ],
  "relations": [
    {
      "source": "卓木强巴",
      "target": "狼",
      "type": "is_accompanied_by"
    },
    {
      "source": "狼",
      "target": "香巴拉",
      "type": "leads_to"
    },
    {
      "source": "建筑",
      "target": "戈巴族人",
      "type": "is_built_by"
    },
    {
      "source": "地热",
      "target": "湖",
      "type": "heats"
    },
    {
      "source": "湖",
      "target": "香巴拉",
      "type": "located_in"
    },
    {
      "source": "寺庙",
      "target": "建筑",
      "type": "is_a_type_of"
    },
    {
      "source": "城墙",
      "target": "建筑",
      "type": "is_part_of"
    },
    {
      "source": "雾",
      "target": "叹息的墙壁",
      "type": "originates_from"
    },
    {
      "source": "雾",
      "target": "香巴拉",
      "type": "conceals"
    },
    {
      "source": "紫麒麟",
      "target": "狼",
      "type": "is_king_of"
    },
    {
      "source": "莫金",
      "target": "索瑞斯",
      "type": "is_accompanied_by"
    },
    {
      "source": "莫金",
      "target": "《古格金书》",
      "type": "references"
    },
    {
      "source": "叹息的墙壁",
      "target": "雾",
      "type": "generates"
    },
    {
      "source": "火山",
      "target": "地热",
      "type": "provides"
    },
    {
      "source": "卓木强巴",
      "target": "紫麒麟",
      "type": "meets"
    }
  ],
  "hierarchy": {
    "main_topics": [
      "The Discovery of a Lost Civilization",
      "The Wolf Kingdom",
      "The Encounter with the Purple Qilin"
    ],
    "structure": "The document describes the protagonist's journey through an ancient, abandoned civilization, detailing its unique architecture, environmental controls, and the discovery of a highly organized wolf society that culminates in an audience with their legendary king, the Purple Qilin. It also includes a parallel narrative of another group discovering similar phenomena."
  }
}