{
  "propositions": [
    {
      "id": "1",
      "text": "The story begins on April 16th, Tuesday, at 3:30 PM, when the narrator, Nonoguchi Shū, departs for Kunihiko Hidaka's residence.",
      "level": 1
    },
    {
      "id": "1.1",
      "text": "Hidaka's house is located in a beautiful, well-maintained residential area characterized by high-end homes and occasional mansions.",
      "level": 2
    },
    {
      "id": "1.1.1",
      "text": "The area was previously a dense thicket, and many homes retain original forest trees in their courtyards.",
      "level": 3
    },
    {
      "id": "1.1.1.1",
      "text": "Beech and gravel trees grow profusely within the walls, casting dense shade over the alleys.",
      "level": 4
    },
    {
      "id": "1.1.2",
      "text": "The streets are deliberately designed as one-way, possibly as a status symbol related to safety.",
      "level": 3
    },
    {
      "id": "1.1.3",
      "text": "For Nonoguchi, a local youth, buying a house in this area was a dream to be realized.",
      "level": 3
    },
    {
      "id": "1.2",
      "text": "Hidaka's house, while not a mansion, is spacious enough for a couple.",
      "level": 2
    },
    {
      "id": "1.2.1",
      "text": "The main house features a traditional Japanese roof but incorporates Western elements like bay windows, an arched entrance, and window box flower beds on the second floor.",
      "level": 3
    },
    {
      "id": "1.2.1.1",
      "text": "These Western elements are likely a compromise, with the wife having a stronger preference for a European castle-like home, indicated by the brick perimeter wall.",
      "level": 4
    },
    {
      "id": "1.3",
      "text": "Nonoguchi notes that Hidaka is now his 'ex-wife'.",
      "level": 2
    },
    {
      "id": "1.4",
      "text": "Upon arriving at the gate, Nonoguchi rings the doorbell but receives no answer.",
      "level": 2
    },
    {
      "id": "1.4.1",
      "text": "He checks the parking lot and sees Hidaka's SAAB is missing, suggesting he is out.",
      "level": 3
    },
    {
      "id": "1.5",
      "text": "Nonoguchi decides to enter the property uninvited, heading towards the courtyard to see a double-flowered cherry tree.",
      "level": 2
    },
    {
      "id": "1.6",
      "text": "In the courtyard, he encounters an unfamiliar woman bending down and looking at something on the ground.",
      "level": 2
    },
    {
      "id": "1.6.1",
      "text": "She is wearing jeans and a sweater and holding a white cloth-like object.",
      "level": 3
    },
    {
      "id": "1.6.2",
      "text": "The woman apologizes, explaining her hat blew into the yard and she entered because the residents seemed absent.",
      "level": 3
    },
    {
      "id": "1.6.3",
      "text": "She appears to be between 35 and 40 years old, with plain features and a sallow complexion.",
      "level": 3
    },
    {
      "id": "1.7",
      "text": "Nonoguchi internally questions the strength of the wind, given her explanation.",
      "level": 2
    },
    {
      "id": "1.7.1",
      "text": "When Nonoguchi comments on her focus on the ground, she claims to be admiring the lawn's upkeep.",
      "level": 3
    },
    {
      "id": "1.8",
      "text": "The woman leaves, and shortly after, a car engine is heard in the parking lot.",
      "level": 2
    },
    {
      "id": "1.9",
      "text": "Hidaka returns with Rie, who apologizes for the delay caused by traffic.",
      "level": 2
    },
    {
      "id": "1.10",
      "text": "Nonoguchi mentions he went to the yard to see the cherry blossoms.",
      "level": 2
    },
    {
      "id": "1.10.1",
      "text": "Hidaka notes the blossoms are starting to fall and mentions the problem of caterpillars from the tree affecting his studio window.",
      "level": 3
    },
    {
      "id": "1.11",
      "text": "Hidaka expresses relief at leaving the 'caterpillar hell' and offers Nonoguchi coffee.",
      "level": 2
    },
    {
      "id": "1.12",
      "text": "Inside, the house appears mostly packed, with wall hangings removed.",
      "level": 2
    },
    {
      "id": "1.12.1",
      "text": "Hidaka confirms most belongings are packed, with the moving company handling the rest.",
      "level": 3
    },
    {
      "id": "1.12.2",
      "text": "They plan to stay at the Crown Hotel, but Hidaka might sleep at home.",
      "level": 3
    },
    {
      "id": "1.13",
      "text": "In the studio, a 10-tatami room, only a voltage desk and a small bookshelf remain.",
      "level": 2
    },
    {
      "id": "1.13.1",
      "text": "Hidaka reveals he has a manuscript deadline for the next day, needing to submit the final installment of a serialized work by midnight.",
      "level": 3
    },
    {
      "id": "1.13.2",
      "text": "The manuscript is for 'Sumisei Monthly' and requires thirty more pages.",
      "level": 3
    },
    {
      "id": "1.14",
      "text": "Rie brings coffee, and they discuss Vancouver's weather, which is colder than Japan.",
      "level": 2
    },
    {
      "id": "1.14.1",
      "text": "Nonoguchi expresses the benefit of a cool summer, while Hidaka jokes about the impossibility of working in a cool room.",
      "level": 3
    },
    {
      "id": "1.15",
      "text": "Hidaka invites Nonoguchi to visit and offers to be his guide in Canada.",
      "level": 2
    },
    {
      "id": "1.16",
      "text": "Hidaka looks out at the cherry tree, regretting that he will miss its full bloom.",
      "level": 2
    },
    {
      "id": "1.17",
      "text": "Nonoguchi promises to send photos of the blossoms.",
      "level": 2
    },
    {
      "id": "1.18",
      "text": "Nonoguchi decides to tell Hidaka about the strange woman he encountered in the yard.",
      "level": 2
    },
    {
      "id": "1.18.1",
      "text": "Hidaka's reaction shifts from surprise to understanding upon hearing the description.",
      "level": 3
    },
    {
      "id": "1.18.2",
      "text": "He describes the woman as looking like a 'wooden folk doll'.",
      "level": 3
    },
    {
      "id": "1.18.3",
      "text": "Hidaka reveals her name is likely Niimi, she lives nearby, appears younger than her age (over 40), has a son in middle school, and her husband works away from home.",
      "level": 3
    },
    {
      "id": "1.18.4",
      "text": "He states that the woman hates them, not that they have a good relationship.",
      "level": 3
    },
    {
      "id": "1.19",
      "text": "The reason for her animosity is a dead cat.",
      "level": 2
    },
    {
      "id": "1.19.1",
      "text": "The cat, which died suddenly by the roadside, was suspected to have been poisoned.",
      "level": 3
    },
    {
      "id": "1.19.2",
      "text": "The woman suspects Hidaka poisoned the cat, believing it ate poisoned pellets he placed in the yard.",
      "level": 3
    },
    {
      "id": "1.20",
      "text": "Hidaka shows Nonoguchi an article in 'Sumisei Monthly' titled 'The Limit of Tolerance', which details his frustration with cats.",
      "level": 2
    },
    {
      "id": "1.20.1",
      "text": "The article describes issues like cat feces in the yard, paw prints on car hoods, and damaged plants, all attributed to a white and brown cat.",
      "level": 3
    },
    {
      "id": "1.20.2",
      "text": "Despite attempts to deter the cats, nothing worked, pushing him to his limit.",
      "level": 3
    },
    {
      "id": "1.21",
      "text": "Nonoguchi realizes the connection and understands why the woman suspects him.",
      "level": 2
    },
    {
      "id": "1.22",
      "text": "The woman had confronted Hidaka the previous week, implying he poisoned the cat.",
      "level": 2
    },
    {
      "id": "1.22.1",
      "text": "Rie had angrily dismissed her, but the woman's lingering presence suggests she is still searching for evidence of poison.",
      "level": 3
    },
    {
      "id": "1.23",
      "text": "Nonoguchi comments on her persistence.",
      "level": 2
    },
    {
      "id": "1.24",
      "text": "Hidaka mentions that Rie informed the woman about their move to Canada, suggesting she only had to endure the cats for a short time.",
      "level": 2
    },
    {
      "id": "1.25",
      "text": "Nonoguchi points out that they had no reason to kill the cat at this particular time.",
      "level": 2
    },
    {
      "id": "1.26",
      "text": "Hidaka, with a smile, confesses, \"It was me.\"",
      "level": 2
    },
    {
      "id": "1.26.1",
      "text": "He admits to putting the poisoned pellets in the yard and expresses surprise at how smoothly things went.",
      "level": 3
    },
    {
      "id": "1.26.2",
      "text": "Nonoguchi initially believes he is joking but notices Hidaka's serious demeanor.",
      "level": 3
    },
    {
      "id": "1.27",
      "text": "Hidaka explains how to make the poisoned pellets: mixing pesticide with cat food, as cats apparently eat anything.",
      "level": 2
    },
    {
      "id": "1.28",
      "text": "Nonoguchi feels uneasy asking why Hidaka did it.",
      "level": 2
    },
    {
      "id": "1.29",
      "text": "Hidaka explains that the house was difficult to rent out due to the cat problem, which would deter potential tenants.",
      "level": 2
    },
    {
      "id": "1.29.1",
      "text": "He reasoned that removing the cat deterrents wouldn't solve the issue if potential renters saw cat feces everywhere.",
      "level": 3
    },
    {
      "id": "1.30",
      "text": "Hidaka believes it's the owner's responsibility to manage their pets.",
      "level": 2
    },
    {
      "id": "1.31",
      "text": "When asked if Rie knows, Hidaka denies it, stating she would consider him a devil for liking cats so much.",
      "level": 2
    },
    {
      "id": "1.32",
      "text": "The phone rings, and Hidaka speaks with Mr. Yamabe from 'Sumisei'.",
      "level": 2
    },
    {
      "id": "1.32.1",
      "text": "Hidaka assures him the manuscript will be finished tonight and will be sent from the hotel.",
      "level": 3
    },
    {
      "id": "1.33",
      "text": "Nonoguchi decides to leave, but Rie interrupts to announce the arrival of Ms. Fujio.",
      "level": 2
    },
    {
      "id": "1.34",
      "text": "Hidaka recognizes the name as Fujio Miyako, implying a significant issue.",
      "level": 2
    },
    {
      "id": "1.34.1",
      "text": "He believes she heard about their move to Canada and is coming to discuss something.",
      "level": 3
    },
    {
      "id": "1.35",
      "text": "Hidaka agrees to meet her, wanting to resolve the issue there.",
      "level": 2
    },
    {
      "id": "1.36",
      "text": "Nonoguchi asks if Fujio is the sister of Fujio Masaya, whom Hidaka implicitly referenced.",
      "level": 2
    },
    {
      "id": "1.37",
      "text": "Hidaka confirms she is his sister and expresses concern about her demands, potentially involving the withdrawal or rewriting of his books.",
      "level": 2
    },
    {
      "id": "1.38",
      "text": "Nonoguchi leaves, offering a silent farewell to Hidaka, who is about to meet Fujio Miyako.",
      "level": 2
    },
    {
      "id": "1.39",
      "text": "Rie apologizes for the inconvenience, and Nonoguchi reiterates his intention to see them off.",
      "level": 2
    },
    {
      "id": "2",
      "text": "Nonoguchi returns to his small apartment, which serves as both a studio and living space.",
      "level": 1
    },
    {
      "id": "2.1",
      "text": "Oshima from Dōji Publishing arrives precisely on time, bringing a gift of Japanese sweets.",
      "level": 2
    },
    {
      "id": "2.2",
      "text": "Nonoguchi offers Oshima tea and his manuscript.",
      "level": 2
    },
    {
      "id": "2.3",
      "text": "While Oshima reads, the cordless phone rings.",
      "level": 2
    },
    {
      "id": "2.4",
      "text": "It's Hidaka, sounding troubled, asking if Nonoguchi is busy.",
      "level": 2
    },
    {
      "id": "2.5",
      "text": "Nonoguchi mentions having a guest but agrees to meet Hidaka at his place at 8 PM.",
      "level": 2
    },
    {
      "id": "2.6",
      "text": "Oshima prepares to leave, but Nonoguchi assures him he has time and encourages him to continue reading.",
      "level": 2
    },
    {
      "id": "2.7",
      "text": "Nonoguchi speculates that Hidaka's urgency is related to Fujio Miyako.",
      "level": 2
    },
    {
      "id": "2.8",
      "text": "He recalls Hidaka's novel 'Forbidden Ground', which thinly disguised the life of a printmaker named Fujio Masaya.",
      "level": 2
    },
    {
      "id": "2.8.1",
      "text": "The novel depicted Masaya's past misdeeds and student-era behavior, even including his death at the hands of a prostitute, matching reality.",
      "level": 3
    },
    {
      "id": "2.8.2",
      "text": "The novel became a bestseller, leading Fujio Masaya's family to protest.",
      "level": 3
    },
    {
      "id": "2.8.3",
      "text": "His mother and sister demanded the book be recalled and rewritten, citing the unauthorized use of Masaya's life and damage to his reputation.",
      "level": 3
    },
    {
      "id": "2.8.4",
      "text": "They did not request financial compensation, leaving the possibility of other motives open.",
      "level": 3
    },
    {
      "id": "2.9",
      "text": "Nonoguchi ponders what he can do to help if negotiations with Fujio Miyako have failed.",
      "level": 2
    },
    {
      "id": "2.10",
      "text": "Oshima finishes reading and praises Nonoguchi's work for its warmth and nostalgia.",
      "level": 2
    },
    {
      "id": "2.11",
      "text": "Nonoguchi, relieved by the positive feedback, suggests they discuss future plans over dinner.",
      "level": 2
    },
    {
      "id": "2.12",
      "text": "They go to a nearby restaurant, where Nonoguchi reveals his meeting with Kunihiko Hidaka.",
      "level": 2
    },
    {
      "id": "2.13",
      "text": "Oshima expresses surprise and admiration, mentioning Hidaka had initially rejected an invitation from his company but introduced Oshima to them instead.",
      "level": 2
    },
    {
      "id": "2.14",
      "text": "Nonoguchi explains his childhood friendship with Hidaka and their continued correspondence.",
      "level": 2
    },
    {
      "id": "2.15",
      "text": "Oshima asks if Nonoguchi would consider writing adult fiction, to which Nonoguchi truthfully replies he would if given the opportunity.",
      "level": 2
    },
    {
      "id": "2.16",
      "text": "After dinner, Nonoguchi sees Oshima off at the station.",
      "level": 2
    },
    {
      "id": "2.17",
      "text": "Arriving at Hidaka's house at 8 PM, Nonoguchi finds it completely dark and the doorbell unresponsive.",
      "level": 2
    },
    {
      "id": "2.18",
      "text": "He suspects he might have misunderstood the meeting time or location.",
      "level": 2
    },
    {
      "id": "2.19",
      "text": "He goes to a nearby park and calls the Crown Hotel from a phone booth.",
      "level": 2
    },
    {
      "id": "2.19.1",
      "text": "Rie answers, stating Hidaka is not there and is likely still at home working.",
      "level": 3
    },
    {
      "id": "2.20",
      "text": "Nonoguchi informs Rie that the house appears empty, which confuses her.",
      "level": 2
    },
    {
      "id": "2.20.1",
      "text": "Rie decides to go to the house and estimates arriving in about 40 minutes.",
      "level": 3
    },
    {
      "id": "2.21",
      "text": "Nonoguchi checks Hidaka's house again before going to a coffee shop.",
      "level": 2
    },
    {
      "id": "2.22",
      "text": "At the coffee shop, the owner inquires about Hidaka's absence.",
      "level": 2
    },
    {
      "id": "2.23",
      "text": "After spending time at the coffee shop, Nonoguchi returns to Hidaka's house.",
      "level": 2
    },
    {
      "id": "2.24",
      "text": "He sees Rie arriving by taxi, her expression turning to worry upon seeing the dark house.",
      "level": 2
    },
    {
      "id": "2.25",
      "text": "Rie unlocks the door, and they enter the cold, seemingly empty house.",
      "level": 2
    },
    {
      "id": "2.26",
      "text": "The studio door is locked, which is unusual for Hidaka.",
      "level": 2
    },
    {
      "id": "2.27",
      "text": "Upon unlocking the studio, they find the computer screen emitting light, indicating it's on.",
      "level": 2
    },
    {
      "id": "2.28",
      "text": "Hidaka is found dead on the floor, facing them.",
      "level": 2
    },
    {
      "id": "2.29",
      "text": "Nonoguchi confirms Hidaka is dead.",
      "level": 2
    },
    {
      "id": "2.29.1",
      "text": "Rie collapses in grief.",
      "level": 3
    },
    {
      "id": "3",
      "text": "A police forensics team arrives at the scene while Nonoguchi and Rie wait in the living room.",
      "level": 1
    },
    {
      "id": "3.1",
      "text": "Inspector Matsuda, the lead investigator, questions Nonoguchi and Rie about the events leading up to the discovery of the body.",
      "level": 2
    },
    {
      "id": "3.2",
      "text": "Nonoguchi recounts receiving a call from Hidaka around 6 PM, who only mentioned needing to discuss something.",
      "level": 2
    },
    {
      "id": "3.3",
      "text": "He states that Hidaka did not mention Fujio Miyako at that time.",
      "level": 2
    },
    {
      "id": "3.4",
      "text": "Rie confirms Fujio Miyako left around 5 PM.",
      "level": 2
    },
    {
      "id": "3.4.1",
      "text": "She mentions that Hidaka seemed troubled after his discussion with Fujio Miyako but told her not to worry.",
      "level": 3
    },
    {
      "id": "3.5",
      "text": "The inspector reviews the information about their planned trip to Canada and Hidaka staying behind to work.",
      "level": 2
    },
    {
      "id": "3.6",
      "text": "He asks about others who knew about their travel plans, mentioning the 'Sumisei' employees.",
      "level": 2
    },
    {
      "id": "3.7",
      "text": "Rie states she has no recollection of suspicious individuals near their home.",
      "level": 2
    },
    {
      "id": "3.8",
      "text": "Nonoguchi hesitates to mention the woman he saw in the yard, deeming her motive for murder too extreme.",
      "level": 2
    },
    {
      "id": "3.9",
      "text": "Inspector Matsuda arranges for Nonoguchi to be taken home by a police car.",
      "level": 2
    },
    {
      "id": "3.10",
      "text": "Outside, Nonoguchi encounters Kaga, a former teacher of his who is now a police detective.",
      "level": 2
    },
    {
      "id": "3.11",
      "text": "Kaga reveals he recognized Nonoguchi's name from the case file.",
      "level": 2
    },
    {
      "id": "3.12",
      "text": "They discuss Nonoguchi's past as a teacher and his current career as a children's book author, which led to his acquaintance with Hidaka.",
      "level": 2
    },
    {
      "id": "3.13",
      "text": "Nonoguchi explains Hidaka's literary career and recommends a book titled 'Hotaru' (Firefly) for Kaga to read.",
      "level": 2
    },
    {
      "id": "3.14",
      "text": "They discuss Hidaka's reasons for moving to Canada and his recent marriage to Rie.",
      "level": 2
    },
    {
      "id": "3.15",
      "text": "Nonoguchi reflects on his regret for not arriving earlier to see Hidaka.",
      "level": 2
    },
    {
      "id": "3.16",
      "text": "Kaga asks if Hidaka was involved in any other disputes, related to his novels or personal life.",
      "level": 2
    },
    {
      "id": "3.17",
      "text": "Kaga inquires about specific names: Nishizaki Namiko, Kozano Tetsuji, and Aizunabe Hajime.",
      "level": 2
    },
    {
      "id": "3.18",
      "text": "Nonoguchi recognizes these as characters from Hidaka's current serialized novel, 'Hyō no Tobira' (The Door of Ice).",
      "level": 2
    },
    {
      "id": "3.19",
      "text": "They discuss the fact that Hidaka was still working on this novel at the time of his death.",
      "level": 2
    },
    {
      "id": "3.20",
      "text": "Nonoguchi states that Hidaka needed to write thirty pages that night.",
      "level": 2
    },
    {
      "id": "3.21",
      "text": "Kaga suggests the number of pages written could help estimate the time of death.",
      "level": 2
    },
    {
      "id": "3.22",
      "text": "Nonoguchi estimates Hidaka's writing speed at four pages per hour, or six pages when rushed.",
      "level": 2
    },
    {
      "id": "3.23",
      "text": "Kaga reveals the police estimate the time of death to be between 5 PM and 7 PM, pending autopsy results.",
      "level": 2
    },
    {
      "id": "3.24",
      "text": "Nonoguchi asks how Hidaka was killed.",
      "level": 2
    },
    {
      "id": "3.25",
      "text": "Kaga explains Hidaka was strangled with a telephone cord and also suffered a blow to the back of the head with a brass paperweight.",
      "level": 2
    },
    {
      "id": "3.26",
      "text": "The police suspect someone knocked him out from behind before strangling him.",
      "level": 2
    },
    {
      "id": "3.27",
      "text": "Kaga asks Nonoguchi for the magazine serializing Hidaka's novel.",
      "level": 2
    },
    {
      "id": "3.28",
      "text": "Nonoguchi returns home, feeling overwhelmed and decides to document his experience in writing.",
      "level": 2
    },
    {
      "id": "4",
      "text": "Hidaka's death is reported in the morning papers, with extensive media coverage.",
      "level": 1
    },
    {
      "id": "4.1",
      "text": "The newspaper reports largely align with the facts, though Nonoguchi's role as a co-discoverer is omitted.",
      "level": 2
    },
    {
      "id": "4.2",
      "text": "The police are investigating both impulsive and premeditated murder, inferring the perpetrator entered through the studio window due to the locked main door.",
      "level": 2
    },
    {
      "id": "4.3",
      "text": "A TV reporter contacts Nonoguchi, having learned of his involvement.",
      "level": 2
    },
    {
      "id": "4.4",
      "text": "Nonoguchi deflects questions, referring them to the police.",
      "level": 2
    },
    {
      "id": "4.5",
      "text": "Another reporter arrives, persisting in their interview attempts.",
      "level": 2
    },
    {
      "id": "4.6",
      "text": "Nonoguchi relents, allowing himself to be interviewed, which consumes his morning.",
      "level": 2
    },
    {
      "id": "4.7",
      "text": "During a TV interview, Nonoguchi describes Hidaka as a strong-willed individual with both kind and surprisingly cold aspects.",
      "level": 2
    }
  ],
  "concepts": [
    {
      "name": "Nonoguchi Shū",
      "frequency": 31,
      "context": "The narrator and author of the 'Event Chapter: Nonoguchi Shū's Notes'."
    },
    {
      "name": "Kunihiko Hidaka",
      "frequency": 34,
      "context": "The victim of the murder and a writer."
    },
    {
      "name": "Rie",
      "frequency": 18,
      "context": "Hidaka's wife."
    },
    {
      "name": "Fujio Miyako",
      "frequency": 6,
      "context": "A character who arrives to confront Hidaka about his novel."
    },
    {
      "name": "Fujio Masaya",
      "frequency": 3,
      "context": "The real-life inspiration for a character in Hidaka's novel."
    },
    {
      "name": "Inspector Matsuda",
      "frequency": 5,
      "context": "The lead investigator of Hidaka's murder."
    },
    {
      "name": "Kaga",
      "frequency": 12,
      "context": "A police detective and former teacher of Nonoguchi."
    },
    {
      "name": "Cat",
      "frequency": 10,
      "context": "A recurring theme related to a dispute with a neighbor."
    },
    {
      "name": "Novel",
      "frequency": 14,
      "context": "Central to the plot, with references to Hidaka's and Nonoguchi's works."
    },
    {
      "name": "Manuscript",
      "frequency": 5,
      "context": "Hidaka's urgent writing deadline."
    },
    {
      "name": "Murder",
      "frequency": 9,
      "context": "The central event of the narrative."
    },
    {
      "name": "Investigation",
      "frequency": 6,
      "context": "The police's process of solving the murder."
    },
    {
      "name": "Canada",
      "frequency": 5,
      "context": "Hidaka and Rie's planned destination."
    },
    {
      "name": "House",
      "frequency": 10,
      "context": "The location of the murder and the setting for key events."
    },
    {
      "name": "Studio",
      "frequency": 5,
      "context": "The room where Hidaka's body was found."
    },
    {
      "name": "Time",
      "frequency": 10,
      "context": "Crucial for establishing alibis and the timeline of events."
    },
    {
      "name": "Telephone",
      "frequency": 4,
      "context": "Used for communication and as a potential murder weapon."
    },
    {
      "name": "Poison",
      "frequency": 3,
      "context": "A key element in the dispute involving the cat."
    },
    {
      "name": "Sumisei Monthly",
      "frequency": 3,
      "context": "The magazine publishing Hidaka's serialized novel."
    },
    {
      "name": "Reporter",
      "frequency": 4,
      "context": "Individuals who persistently try to interview Nonoguchi."
    },
    {
      "name": "Teacher",
      "frequency": 5,
      "context": "Nonoguchi's past profession and Kaga's former role."
    },
    {
      "name": "Friendship",
      "frequency": 3,
      "context": "The relationship between Nonoguchi and Hidaka."
    }
  ],
  "relations": [
    {
      "source": "Nonoguchi Shū",
      "target": "Kunihiko Hidaka",
      "type": "friend"
    },
    {
      "source": "Kunihiko Hidaka",
      "target": "Rie",
      "type": "husband"
    },
    {
      "source": "Rie",
      "target": "Kunihiko Hidaka",
      "type": "wife"
    },
    {
      "source": "Fujio Masaya",
      "target": "Fujio Miyako",
      "type": "sibling"
    },
    {
      "source": "Kunihiko Hidaka",
      "target": "Fujio Miyako",
      "type": "confronts"
    },
    {
      "source": "Kunihiko Hidaka",
      "target": "Novel",
      "type": "writes"
    },
    {
      "source": "Nonoguchi Shū",
      "target": "Novel",
      "type": "writes"
    },
    {
      "source": "Kunihiko Hidaka",
      "target": "Murder",
      "type": "victim"
    },
    {
      "source": "Inspector Matsuda",
      "target": "Investigation",
      "type": "leads"
    },
    {
      "source": "Kaga",
      "target": "Investigation",
      "type": "participates"
    },
    {
      "source": "Nonoguchi Shū",
      "target": "Kaga",
      "type": "knows (former student)"
    },
    {
      "source": "Kaga",
      "target": "Nonoguchi Shū",
      "type": "knows (former teacher)"
    },
    {
      "source": "Cat",
      "target": "Poison",
      "type": "involved_in"
    },
    {
      "source": "Kunihiko Hidaka",
      "target": "Cat",
      "type": "disputes_with_neighbor_over"
    },
    {
      "source": "Kunihiko Hidaka",
      "target": "Canada",
      "type": "plans_to_move_to"
    },
    {
      "source": "Rie",
      "target": "Canada",
      "type": "plans_to_move_to"
    },
    {
      "source": "Kunihiko Hidaka",
      "target": "House",
      "type": "resides_in"
    },
    {
      "source": "Murder",
      "target": "House",
      "type": "occurred_at"
    },
    {
      "source": "Murder",
      "target": "Studio",
      "type": "occurred_in"
    },
    {
      "source": "Kunihiko Hidaka",
      "target": "Manuscript",
      "type": "is_writing"
    },
    {
      "source": "Telephone",
      "target": "Murder",
      "type": "used_as_weapon"
    },
    {
      "source": "Nonoguchi Shū",
      "target": "Reporter",
      "type": "is_interviewed_by"
    },
    {
      "source": "Kunihiko Hidaka",
      "target": "Sumisei Monthly",
      "type": "writes_for"
    }
  ],
  "hierarchy": {
    "main_topics": [
      "The Discovery of the Crime",
      "The Investigation Begins",
      "Background and Motives",
      "Media Intrusion"
    ],
    "structure": "The document is divided into three chapters: 'Event Chapter: Nonoguchi Shū's Notes-1', 'Event Chapter: Nonoguchi Shū's Notes-2', and 'Chapter Two'. It follows a chronological narrative of the events leading up to and immediately following the murder of Kunihiko Hidaka, interspersed with Nonoguchi's reflections and interviews with the police."
  }
}