{
  "propositions": [
    {
      "id": "1",
      "text": "The narrator wakes up to a thick fog, which mirrors the confusion in his mind.",
      "level": 1
    },
    {
      "id": "1.1",
      "text": "The fog envelops his deceased wife's photo, making her smile seem distant.",
      "level": 2
    },
    {
      "id": "1.1.1",
      "text": "His wife, Wen Yu, asks him, \"In this fog, which of everything you see is real?\"",
      "level": 3
    },
    {
      "id": "2",
      "text": "The narrator recounts his first mission with the criminal investigation team, led by Captain Yue Lin.",
      "level": 1
    },
    {
      "id": "2.1",
      "text": "The mission involves apprehending a drug dealer named Zhao Si.",
      "level": 2
    },
    {
      "id": "2.1.1",
      "text": "They are uncertain about the number of people involved and their security measures.",
      "level": 3
    },
    {
      "id": "2.1.1.1",
      "text": "Yue Lin devises a plan to infiltrate the location by disguising herself as a complaining neighbor.",
      "level": 4
    },
    {
      "id": "2.1.1.1.1",
      "text": "The plan involves Yue Lin knocking loudly, pretending to have a plumbing issue, to draw out the suspects.",
      "level": 5
    },
    {
      "id": "2.1.1.1.1.1",
      "text": "Zhao Si opens the door, and Yue Lin, after a brief staged argument, signals the number of suspects and their lack of weapons to the narrator and Lin Guangyuan.",
      "level": 6
    },
    {
      "id": "2.1.1.1.1.1.1",
      "text": "The narrator and Lin Guangyuan then storm the apartment and apprehend the three suspects.",
      "level": 7
    },
    {
      "id": "2.2",
      "text": "The narrator reflects on Yue Lin's unconventional but effective methods and her enigmatic personality.",
      "level": 2
    },
    {
      "id": "3",
      "text": "The narrator describes his life after Wen Yu's death.",
      "level": 1
    },
    {
      "id": "3.1",
      "text": "He lives alone in their shared home and finds solace in visiting Wen Yu's mother.",
      "level": 2
    },
    {
      "id": "3.1.1",
      "text": "Wen Yu's room remains untouched, preserving memories of her.",
      "level": 3
    },
    {
      "id": "3.2",
      "text": "He has largely withdrawn from social interactions, resisting attempts to introduce him to new women.",
      "level": 2
    },
    {
      "id": "3.2.1",
      "text": "A former colleague, Xiao Chen, expresses her frustration with his emotional unavailability.",
      "level": 3
    },
    {
      "id": "3.2.1.1",
      "text": "Xiao Chen confesses that he is emotionally absent and that she feels suffocated by his detachment.",
      "level": 4
    },
    {
      "id": "3.3",
      "text": "He realizes that while he needs a woman, it must be someone with whom he shares a profound connection, like Wen Yu.",
      "level": 2
    },
    {
      "id": "4",
      "text": "The narrator explains that his dedication to his work as a criminal investigator helps him cope with his personal losses.",
      "level": 1
    },
    {
      "id": "4.1",
      "text": "He believes that intense mental focus and physical exhaustion distract him from life's deficiencies.",
      "level": 2
    },
    {
      "id": "4.2",
      "text": "He is suspicious of Yue Lin's behavior and the circumstances surrounding a peculiar anonymous tip.",
      "level": 2
    },
    {
      "id": "4.2.1",
      "text": "He receives a fragmented phone call reporting a murder at the Jing Hua Hotel.",
      "level": 3
    },
    {
      "id": "4.2.1.1",
      "text": "The caller is nervous and hangs up before providing full details or contact information.",
      "level": 4
    },
    {
      "id": "4.2.1.1.1",
      "text": "He finds that the hotel is actually called Jing Hua Hotel and that the police had previously investigated a similar false report there.",
      "level": 5
    },
    {
      "id": "4.2.1.1.1.1",
      "text": "Yue Lin shows a flicker of concern when he mentions the hotel, further fueling his suspicions.",
      "level": 6
    },
    {
      "id": "4.3",
      "text": "He investigates the Jing Hua Hotel with Lin Guangyuan.",
      "level": 2
    },
    {
      "id": "4.3.1",
      "text": "The hotel's security manager, Zhao Donglai, is evasive and implies the caller was a woman, despite the police not revealing this detail.",
      "level": 3
    },
    {
      "id": "4.3.2",
      "text": "He encounters Li Anmin, the hotel's general manager, who is revealed to be an old acquaintance with a past negative interaction with the narrator.",
      "level": 3
    },
    {
      "id": "4.3.2.1",
      "text": "Li Anmin's reaction upon seeing the narrator suggests he is hiding something.",
      "level": 4
    },
    {
      "id": "4.3.3",
      "text": "The narrator and Lin Guangyuan agree that Zhao Donglai and Li Anmin are hiding something.",
      "level": 3
    },
    {
      "id": "5",
      "text": "The narrator reflects on his routine of visiting a tea house every Sunday evening, a habit formed with Wen Yu.",
      "level": 1
    },
    {
      "id": "5.1",
      "text": "The tea house has been renamed 'Water Flower' and has undergone renovations, but he continues to visit the same table.",
      "level": 2
    },
    {
      "id": "5.1.1",
      "text": "This routine provides him with a sense of warmth and continuity amidst his grief.",
      "level": 3
    },
    {
      "id": "6",
      "text": "The narrator has a conflict with Yue Lin regarding the investigation of Jing Hua Hotel.",
      "level": 1
    },
    {
      "id": "6.1",
      "text": "Yue Lin dismisses his suspicions about the hotel, emphasizing the need for evidence over intuition.",
      "level": 2
    },
    {
      "id": "6.2",
      "text": "The narrator insists on pursuing the investigation, citing inconsistencies and his past negative experience with Li Anmin.",
      "level": 2
    },
    {
      "id": "6.3",
      "text": "Despite the disagreement, the narrator apologizes to Yue Lin, acknowledging her authority and his own impulsiveness.",
      "level": 2
    },
    {
      "id": "7",
      "text": "The narrator receives a call from his old friend Zhu Wenjie, Yue Lin's husband.",
      "level": 1
    },
    {
      "id": "7.1",
      "text": "Zhu Wenjie hints at a reason for his resignation from the police force that he is reluctant to discuss.",
      "level": 2
    },
    {
      "id": "7.2",
      "text": "The narrator believes that his work and the complexities of his relationships with Yue Lin and Zhu Wenjie will likely lead to unexpected events.",
      "level": 2
    }
  ],
  "concepts": [
    {
      "name": "Narrator (Qin Yangping)",
      "frequency": 15,
      "context": "The protagonist of the story, a criminal investigator haunted by the death of his wife, Wen Yu."
    },
    {
      "name": "Wen Yu",
      "frequency": 6,
      "context": "The narrator's deceased wife, whose memory and presence continue to influence his life."
    },
    {
      "name": "Yue Lin",
      "frequency": 12,
      "context": "The narrator's new captain, a formidable and enigmatic criminal investigator."
    },
    {
      "name": "Lin Guangyuan",
      "frequency": 5,
      "context": "A colleague of the narrator and a member of the criminal investigation team."
    },
    {
      "name": "Jing Hua Hotel",
      "frequency": 7,
      "context": "A hotel that becomes the focus of a mysterious investigation after an anonymous tip."
    },
    {
      "name": "Fog",
      "frequency": 2,
      "context": "A symbolic element representing confusion and uncertainty in the narrator's mind."
    },
    {
      "name": "Investigation",
      "frequency": 5,
      "context": "The core activity of the criminal investigation team, driving the plot forward."
    },
    {
      "name": "Memory",
      "frequency": 3,
      "context": "The narrator's past with Wen Yu significantly impacts his present actions and perceptions."
    },
    {
      "name": "Suspicion",
      "frequency": 4,
      "context": "The narrator's professional habit and personal experiences lead him to suspect hidden truths."
    },
    {
      "name": "Zhu Wenjie",
      "frequency": 4,
      "context": "Yue Lin's husband and an old friend of the narrator."
    },
    {
      "name": "Zhao Si",
      "frequency": 2,
      "context": "The initial target of the drug bust mission."
    },
    {
      "name": "Zhao Donglai",
      "frequency": 3,
      "context": "The security manager at Jing Hua Hotel, who is evasive during the investigation."
    },
    {
      "name": "Li Anmin",
      "frequency": 4,
      "context": "The general manager of Jing Hua Hotel and an old acquaintance of the narrator with a past grievance."
    },
    {
      "name": "Habit",
      "frequency": 4,
      "context": "The narrator maintains routines, like visiting the tea house, as a coping mechanism."
    },
    {
      "name": "Woman",
      "frequency": 7,
      "context": "A recurring theme, with the narrator's complex relationships with Wen Yu, Yue Lin, and other women."
    },
    {
      "name": "Xiao Chen",
      "frequency": 3,
      "context": "A former colleague who confronts the narrator about his emotional unavailability."
    }
  ],
  "relations": [
    {
      "source": "Narrator",
      "target": "Wen Yu",
      "type": "deceased wife of"
    },
    {
      "source": "Narrator",
      "target": "Yue Lin",
      "type": "subordinate of"
    },
    {
      "source": "Narrator",
      "target": "Lin Guangyuan",
      "type": "colleague of"
    },
    {
      "source": "Narrator",
      "target": "Jing Hua Hotel",
      "type": "investigates"
    },
    {
      "source": "Yue Lin",
      "target": "Narrator",
      "type": "superior of"
    },
    {
      "source": "Yue Lin",
      "target": "Zhu Wenjie",
      "type": "wife of"
    },
    {
      "source": "Zhu Wenjie",
      "target": "Narrator",
      "type": "friend of"
    },
    {
      "source": "Zhu Wenjie",
      "target": "Yue Lin",
      "type": "husband of"
    },
    {
      "source": "Zhao Donglai",
      "target": "Jing Hua Hotel",
      "type": "employee of"
    },
    {
      "source": "Li Anmin",
      "target": "Jing Hua Hotel",
      "type": "manager of"
    },
    {
      "source": "Narrator",
      "target": "Li Anmin",
      "type": "had past negative encounter with"
    },
    {
      "source": "Fog",
      "target": "Narrator's mind",
      "type": "symbolizes confusion in"
    },
    {
      "source": "Habit",
      "target": "Narrator",
      "type": "maintained by"
    },
    {
      "source": "Investigation",
      "target": "Jing Hua Hotel",
      "type": "focus of"
    },
    {
      "source": "Memory",
      "target": "Wen Yu",
      "type": "of"
    },
    {
      "source": "Suspicion",
      "target": "Narrator",
      "type": "held by"
    },
    {
      "source": "Xiao Chen",
      "target": "Narrator",
      "type": "confronts about emotional unavailability"
    }
  ],
  "hierarchy": {
    "main_topics": [
      "The Narrator's Inner Turmoil and Grief",
      "The Criminal Investigation Team and its Operations",
      "The Mysterious Case of Jing Hua Hotel",
      "Relationships and Past Encounters"
    ],
    "structure": "The document is structured as a narrative, beginning with an introspective opening, followed by detailed accounts of police investigations, personal reflections on loss and relationships, and the unfolding of a mystery. It alternates between plot progression and character introspection."
  }
}