{
  "propositions": [
    {
      "id": "1",
      "text": "A mysterious woman enters the chaotic Warring States period, destined to influence its course.",
      "level": 1
    },
    {
      "id": "1.1",
      "text": "She arrives with an enigmatic background and extraordinary aura.",
      "level": 2
    },
    {
      "id": "2",
      "text": "She meets a wise old master who becomes her mentor.",
      "level": 1
    },
    {
      "id": "2.1",
      "text": "The master trains her rigorously in martial arts and strategy.",
      "level": 2
    },
    {
      "id": "3",
      "text": "The Warring States are depicted as a land of constant war and suffering.",
      "level": 1
    },
    {
      "id": "3.1",
      "text": "She witnesses the devastation of war and resolves to bring change.",
      "level": 2
    },
    {
      "id": "4",
      "text": "Her beauty and talents attract attention, but her true identity remains a mystery.",
      "level": 1
    },
    {
      "id": "4.1",
      "text": "Romantic feelings develop between her and a young general, though duty takes precedence.",
      "level": 2
    },
    {
      "id": "5",
      "text": "She faces conspiracies and betrayal from trusted allies.",
      "level": 1
    },
    {
      "id": "5.1",
      "text": "Despite setbacks, she grows stronger and begins building her own faction.",
      "level": 2
    },
    {
      "id": "6",
      "text": "Her influence grows, making her a significant player in the Warring States.",
      "level": 1
    },
    {
      "id": "6.1",
      "text": "She proposes alliances and strategies to unite weaker states against stronger foes.",
      "level": 2
    },
    {
      "id": "7",
      "text": "A climactic battle determines the fate of the land.",
      "level": 1
    },
    {
      "id": "7.1",
      "text": "She leads her forces to victory, securing a pivotal win.",
      "level": 2
    },
    {
      "id": "8",
      "text": "Her legacy endures as a transformative figure in history.",
      "level": 1
    }
  ],
  "concepts": [
    {
      "name": "Warring States",
      "frequency": 10,
      "context": "Historical period of chaos and conflict in ancient China."
    },
    {
      "name": "Red Yan (Heroine)",
      "frequency": 15,
      "context": "Central female character with mysterious origins and transformative impact."
    },
    {
      "name": "Chaos",
      "frequency": 8,
      "context": "State of disorder and war in the Warring States period."
    },
    {
      "name": "Master",
      "frequency": 5,
      "context": "Wise mentor who trains the heroine in skills and strategy."
    },
    {
      "name": "Betrayal",
      "frequency": 4,
      "context": "Acts of disloyalty faced by the heroine from trusted allies."
    },
    {
      "name": "Romance",
      "frequency": 3,
      "context": "Emotional bond between the heroine and a young general."
    }
  ],
  "relations": [
    {
      "source": "Red Yan",
      "target": "Warring States",
      "type": "influences"
    },
    {
      "source": "Red Yan",
      "target": "Master",
      "type": "is_mentored_by"
    },
    {
      "source": "Red Yan",
      "target": "Chaos",
      "type": "opposes"
    },
    {
      "source": "Red Yan",
      "target": "Betrayal",
      "type": "experiences"
    },
    {
      "source": "Red Yan",
      "target": "Romance",
      "type": "involved_in"
    }
  ],
  "hierarchy": {
    "main_topics": [
      "Introduction to Warring States",
      "Heroine's Journey",
      "Conflict and Betrayal",
      "Rise to Power",
      "Climactic Battle",
      "Legacy"
    ],
    "structure": "The document follows a chronological narrative of a heroine's journey through the Warring States period, structured into chapters that detail her growth, challenges, and ultimate impact on history."
  }
}