{
  "propositions": [
    {
      "id": "1",
      "text": "In a female-dominated society, women are superior and men are inferior.",
      "level": 1
    },
    {
      "id": "1.1",
      "text": "The protagonist, an ordinary woman, questions the societal norms of female superiority.",
      "level": 2
    },
    {
      "id": "1.2",
      "text": "She feels burdened by societal rules and expectations.",
      "level": 2
    },
    {
      "id": "2",
      "text": "The protagonist encounters Lin Jin, a low-status man, sparking an emotional connection.",
      "level": 1
    },
    {
      "id": "2.1",
      "text": "Their relationship faces challenges due to societal hierarchy and disapproval.",
      "level": 2
    },
    {
      "id": "3",
      "text": "Emotional bonds deepen, but external pressures create conflict.",
      "level": 1
    },
    {
      "id": "3.1",
      "text": "The protagonist struggles with the decision to pursue love or conform to societal expectations.",
      "level": 2
    },
    {
      "id": "4",
      "text": "The protagonist decides to fight for her happiness and challenge societal norms.",
      "level": 1
    },
    {
      "id": "4.1",
      "text": "She faces opposition from family and society in her efforts to change Lin Jin's status.",
      "level": 2
    },
    {
      "id": "5",
      "text": "A crisis emerges as the protagonist is confined by her family, and Lin Jin is forced to leave.",
      "level": 1
    },
    {
      "id": "5.1",
      "text": "A letter from Lin Jin rekindles hope for their future.",
      "level": 2
    },
    {
      "id": "6",
      "text": "Lin Jin returns after improving his status, and they reunite to live happily despite societal norms.",
      "level": 1
    }
  ],
  "concepts": [
    {
      "name": "Female Dominance",
      "frequency": 10,
      "context": "Central societal structure where women hold power over men."
    },
    {
      "name": "Societal Norms",
      "frequency": 8,
      "context": "Rules and expectations that enforce gender hierarchy."
    },
    {
      "name": "Love",
      "frequency": 7,
      "context": "Emotional bond between the protagonist and Lin Jin, defying societal rules."
    },
    {
      "name": "Rebellion",
      "frequency": 5,
      "context": "Protagonist's resistance against societal and familial constraints."
    },
    {
      "name": "Status",
      "frequency": 6,
      "context": "Social hierarchy defining individual worth, especially for Lin Jin."
    }
  ],
  "relations": [
    {
      "source": "Female Dominance",
      "target": "Societal Norms",
      "type": "implies"
    },
    {
      "source": "Love",
      "target": "Rebellion",
      "type": "causes"
    },
    {
      "source": "Status",
      "target": "Love",
      "type": "obstructs"
    },
    {
      "source": "Rebellion",
      "target": "Societal Norms",
      "type": "opposes"
    },
    {
      "source": "Female Dominance",
      "target": "Status",
      "type": "determines"
    }
  ],
  "hierarchy": {
    "main_topics": [
      "Female-Dominated Society",
      "Forbidden Love",
      "Rebellion Against Norms",
      "Personal Growth and Reunion"
    ],
    "structure": "The document follows a linear narrative structure with six chapters, progressing from societal context and personal conflict to resolution and reunion."
  }
}