{
  "propositions": [
    {
      "id": "1",
      "text": "夜路走多了，难免会撞鬼。",
      "level": 2
    },
    {
      "id": "2",
      "text": "我在出差的旅途中，意外获得了一本奇异的风水书，却因此被迫丢掉了工作，流落他乡。",
      "level": 2
    },
    {
      "id": "3",
      "text": "我租了一套廉价的房子居住，却压根也没有想到，就在这宅子的地下，竟然埋藏着恐怖的过去……",
      "level": 2
    },
    {
      "id": "4",
      "text": "棺材钉下的女人遗像，妖棺中被剥了皮的尸体，盗墓团伙的胆大，苗人的蛊毒迫害，扛天灯者的诡秘，边境雪山上的内幕，目睹凌迟酷刑的感觉……",
      "level": 3
    },
    {
      "id": "5",
      "text": "接踵而来的这一切阴森恐怖都起源于这个建在古墓上的凶宅。",
      "level": 2
    },
    {
      "id": "6",
      "text": "谜一般的凶宅，从此留给我挥之不去的噩梦……",
      "level": 2
    },
    {
      "id": "7",
      "text": "奇异的盗墓探险，更是给我的经历不经意间涂上浓墨重彩的一笔……",
      "level": 2
    },
    {
      "id": "8",
      "text": "人走路，鬼打墙。",
      "level": 2
    },
    {
      "id": "9",
      "text": "当你意识到自己迷路的时候，也许一只脚已经踏进了鬼门关。",
      "level": 3
    },
    {
      "id": "10",
      "text": "所以要切记：背后不是人，天黑莫独行。",
      "level": 2
    },
    {
      "id": "11",
      "text": "我叫冯一西，我一直觉得这名字很奇怪，一西一西，这岂不是说要一命归西吗？",
      "level": 1
    },
    {
      "id": "12",
      "text": "我问爸妈为什么要给我起这名字。",
      "level": 2
    },
    {
      "id": "13",
      "text": "爸爸说：你这娃儿老是做恶梦，那年你舅舅从乡下来，拿了你的八字回去，没过多久，带了个很神的算命先儿来家里，我央着人家好好算了一把，这才专门给你改的这名字。",
      "level": 3
    },
    {
      "id": "14",
      "text": "我又问这名字好吗？",
      "level": 2
    },
    {
      "id": "15",
      "text": "我爸就反问我：难道不好吗？又响亮，又洋气，那个算命先儿还说和你很有缘分，改成这名儿才能保住你的小命。",
      "level": 3
    },
    {
      "id": "16",
      "text": "从那时开始我就一直不明白，为什么起个怪气的名字就能保住我的小命。",
      "level": 2
    },
    {
      "id": "17",
      "text": "不过倒是问明白了一件事，给我起名这半仙一样的老家伙，居住在江西的龙虎山，俗名叫张道临，一般人都称呼他张天师，给我起名时已经是五十多岁的一个老头了。",
      "level": 2
    },
    {
      "id": "18",
      "text": "我暗暗记住了这一切，总要找机会去问问他。",
      "level": 2
    },
    {
      "id": "19",
      "text": "现在我碰到了一些麻烦事儿，而这些麻烦事儿要从我小时候的一段经历谈谈，这段经历，却和我的梦有联系。",
      "level": 1
    },
    {
      "id": "20",
      "text": "梦，自然是千奇百怪的，光怪陆离。",
      "level": 2
    },
    {
      "id": "21",
      "text": "小时候我问别人：你梦到过死人吗？",
      "level": 3
    },
    {
      "id": "22",
      "text": "那人迟疑一下，死人嘛，当然梦见过。",
      "level": 4
    },
    {
      "id": "23",
      "text": "那么你梦见过很多死尸吗？就是好大一堆纠缠在一起，横七竖八的叠放在一个大坑里，而你就在坑边蹲着。",
      "level": 3
    },
    {
      "id": "24",
      "text": "那人笑笑，拍拍我脑袋说我小屁孩，净想些什么乱七八糟的事情。",
      "level": 4
    },
    {
      "id": "25",
      "text": "我这么问是因为小时候，我好几次都做过同一个梦，一个人跑进了松树林，好大好大一片树林，阴沉沉的，树下面还老是蹲着一个老头，在地上拣那些松塔和松针，不停地摆成一个个小人形状，我按顺序往下看，就像读一本连环画一样，但是我一直没搞懂这些小人究竟在做什么，只是那老头摆的很逼真很有趣，所以每次我都看的很高兴。",
      "level": 2
    },
    {
      "id": "26",
      "text": "那个老头很和蔼地笑笑，说：好玩吧？我来讲给你听，这些小人在干什么？",
      "level": 3
    },
    {
      "id": "27",
      "text": "每次都是讲到一半时候，老头就会看看天，忧心忡忡地说：唉，时间差不多了，我得走了，讲的这些你可不要忘了啊。",
      "level": 3
    },
    {
      "id": "28",
      "text": "老头站起来就走，我在后面跟着，走上几步，前面就出现一个大坑，老头像没看见一样，往坑里一跳，立刻就不见了，我追过去找时，就看见坑里全是各种各样的干枯尸体，怎么着也有几百具吧，还老老少少的啥模样都有，杂七杂八叠成一大堆，我立刻就吓哭了，梦也就醒了。",
      "level": 3
    },
    {
      "id": "29",
      "text": "哭醒的时候，天总是蒙蒙亮，爸妈也还睡得熟，没个人来照顾我，我就只好一个人瞪眼看窗户，盼着天快点亮起来，嘴里嘟哝着念叨：没有皮……都没有皮……这么多人都没有皮……。",
      "level": 2
    },
    {
      "id": "30",
      "text": "坑里那些尸体，确实没有皮肤，每个都是这样，让我印象很深，唯独老头讲了些什么，梦一醒就忘的一干二净，啥也没记着。",
      "level": 2
    },
    {
      "id": "31",
      "text": "我家是三线厂的工人，因为国防需要，在一九五八年时，好多军工厂都搬迁到了深山老林，据说是为了安全，所以我从小生活和读书的地方，就是这样一个距离城市很远的山沟沟里。",
      "level": 2
    },
    {
      "id": "32",
      "text": "厂里的子弟，混到高中毕业，是可以接班当工人的，所以我们那儿的高中，学风一直以来都不怎么样，于是爸妈就让我去县里的高中试试，看能不能考个大学，就这样，我去了县里的高中读书，离乡下老家也近，那年是一九八六年。",
      "level": 2
    },
    {
      "id": "33",
      "text": "这县重点高中的学风就是正，可是完全不合我的习惯，特别是到了高三，千军万马都冲上了独木桥，压力极大，有一天晚上，我实在忍受不了疲惫的晚自习，就独自一人溜出了校门闲逛。",
      "level": 2
    },
    {
      "id": "34",
      "text": "我读的高中在县城的七里河，一般又叫大东关，大东关再过去，稍远一点驻扎着一个团部，我有个五叔在那做炊事员，眼看逛着逛着，我就快到团部的驻地了，那天是个月亮夜，心想干脆就去五叔那凑合一晚上算了。",
      "level": 2
    },
    {
      "id": "35",
      "text": "这时候突然发现路中间有一只白色的兔子，非常可爱，趴在那儿一动不不动，我一时起兴，就想去抓它，谁知道我一追它就跑，我停下来兔子也停下来，一会儿功夫，我俩就跑离了大路，七拐八拐跑进了河沟，直到一栋挺新的瓦房挡在面前，跟着那白兔子进了没人的屋子里，兔子顺着一个洞跳了进去找不着了，我这才发现自己迷路了，离那团部的驻地挺远，到处黑乎乎的啥也看不清楚，心里有点发毛，但还没感到害怕，只是费劲的辨别方向，想不起来自己这是钻到了哪块地头？",
      "level": 2
    },
    {
      "id": "36",
      "text": "本来是个月亮夜的晚上，这时候变得无星无月的，到处漆黑一团，我顺着来路，费了差不多半夜，才摸到了团部，还好，五叔睡得轻，我叫了几声，就起床给我开了门，我说起白兔子的事儿，五叔皱着眉头说：这哪是小白兔啊，这就是-仙皮子。俗话说，千年黑、万年白。你能碰到白皮子，说明你有福气。",
      "level": 2
    },
    {
      "id": "37",
      "text": "我赶忙问五叔啥是仙皮子？我咋没有听说过呢。",
      "level": 3
    },
    {
      "id": "38",
      "text": "五叔拍拍我脑袋：你碰到那个是假白兔，又叫仙皮子，白的仙皮子最少见，咱这儿还从来没人碰到过，你这可是第一个，老一辈的人知道，月亮夜里碰到假白兔，往往都是要发财、走好运的意思，那白兔躲进的屋里，嘿嘿，肯定有，肯定有大宝贝藏着，说了你也不懂，快点去睡吧！",
      "level": 3
    },
    {
      "id": "39",
      "text": "第二天一大早，五叔问明白我碰到假白兔的大致地方，就骑上单车送我回学校，路上一言不发，弄的我满腹狐疑，到了校门口，我跳下车子，忍不住问：五叔，你咋一句话都不说呢，是不是我说的那地方不对？你要是去挖什么宝贝的话，带上我好不好？不是你说我有福气吗？",
      "level": 2
    },
    {
      "id": "40",
      "text": "五叔没吭气，挥手叫我快点回学校去，铁青的脸色看起来很阴沉，不过我从小就和他混的熟，一点都不怕，缠磨着要他答应我，最后五叔说道：那地方不行，你不能去，老实跟你说，那栋房子是个凶宅，根本没人敢靠近，算你小子命大，昨晚没死在那儿，我可告诉你，往后再来团部找我，绝对不准走离大路，听着了，要不然我就揍你！",
      "level": 2
    },
    {
      "id": "41",
      "text": "后来，又过了三四天，我越想越觉得事情太蹊跷，我咋就会碰到这事儿呢？刚好明天是星期天，一个月就这一天可以休息，于是我早早吃了晚饭，就直奔团部找我那五叔去了。",
      "level": 2
    },
    {
      "id": "42",
      "text": "到地方的时候五叔不在，我在门口等了老半天，才看见五叔和一个陌生人一起，骑了辆单车从外面回来，五叔看到我在门口等他，明显愣了一下，那陌生人倒是沉得住气，简单招呼了声，就拉着五叔进屋里一起喝酒。",
      "level": 2
    },
    {
      "id": "43",
      "text": "这陌生人很怪，我一看见他就觉得不自在，穿的也不咋样，那时候像我这样的学生都时兴穿绿军衣，大裆裤，黄胶鞋，我穿的是白球鞋，刚买的回力牌，而这陌生人上面裹了件灰西装，配着下面的绿色大裆裤，衣服就算干净也显得很邋遢，浑身上下还透出股子臭气，不是汗臭味，而是冰凉的那种死臭味，五叔也不在意，和他一杯接一杯的喝酒说话。",
      "level": 2
    },
    {
      "id": "44",
      "text": "后来我听明白了，原来他们今晚就要去那栋房子里找宝贝，我来的正是时候，顿时来了精神，死乞白赖的要跟上他们一起去。",
      "level": 2
    },
    {
      "id": "45",
      "text": "那陌生人听五叔称呼他叫陈脸子，是十里八乡比较神秘的一个窖客，我们那的乡下，家家都挖有红薯窖，窖客，就是挖红薯窖很内行的人，只不过听五叔的意思，这个陈脸子窖客，不单挖窖子本事不小，还会很多别的玩意儿，当时不知道，要是现在我就会明白，这陈脸子也就是个盗墓贼！",
      "level": 2
    },
    {
      "id": "46",
      "text": "陈脸子劝五叔带上我算了，两个大人还能看不住我这十六七的小屁孩儿？煞有介事的拍胸脯担保我坏不了事儿，五叔想着我是被仙皮子引去的，应该挺有福气，于是也就勉强同意了。",
      "level": 2
    },
    {
      "id": "47",
      "text": "陈脸子和五叔聊了差不多三四个小时，天也黑透了，一人一个编织袋背着出了门，我换上五叔的一双黄胶鞋，跟在后面，朝我到过的那栋房子走去，顺着河沟的另一边是一串矮山坡，不紧不慢地走了二个多小时才走到头，这串矮山坡高大了许多，月光映衬下，庄严肃穆，那栋没人住的空房子就盖在河水流出来的山脚下。",
      "level": 2
    },
    {
      "id": "48",
      "text": "我问五叔啥是仙皮子，怎么会有福气才能碰到呢？",
      "level": 3
    },
    {
      "id": "49",
      "text": "五叔说：仙皮子是咱这的土话，这东西是讲缘分的，一般都出现在大墓的周围，跟着仙皮子要么可以找到大墓的暗门，要么就能找到兵荒马乱时候的藏宝，反正碰上仙皮子都是好事儿！",
      "level": 4
    },
    {
      "id": "50",
      "text": "陈脸子也说：是啊，老五，干我们这行的，听说还有人专门养小白兔、大公鸡的，不过我倒还没听说过谁，有用这些东西找着什么大墓的。",
      "level": 4
    },
    {
      "id": "51",
      "text": "进了屋子，我们三个都感觉这房子冰凉、漆黑、大气，转了一圈几乎要迷路，陈脸子用的是火折子照亮，这玩意儿不少人都会做，但陈脸子这个质量明显要好许多，使劲吹一口，腾起的火苗不大不小的，我就问他为什么不用手电筒呢？",
      "level": 2
    },
    {
      "id": "52",
      "text": "陈脸子没理我，脸上的汗珠子顺着脑门子往下淌，低声问五叔：老五，你只说这是个凶宅，咋不说清楚呢！这么厉害的幌子，恐怕只有我师傅亲自来才行。你看，那房梁上！",
      "level": 2
    },
    {
      "id": "53",
      "text": "我和五叔抬头一看，顿时吓了一大跳，知道我看到了什么吗？",
      "level": 2
    },
    {
      "id": "54",
      "text": "我们这儿有个风俗，如果有人在自家的屋里上吊自杀，就要在房梁上竖着砍一道痕迹，如果是在别人的屋子里上吊自杀，就要在房梁上横着砍一道痕迹。",
      "level": 1
    },
    {
      "id": "55",
      "text": "这间房子呢，以后就算是凶宅，这道刀痕也有和吊死鬼分割的含义在里头，意思是房子已经弄成凶宅了，以后就不要在屋子里闹事了。",
      "level": 2
    },
    {
      "id": "56",
      "text": "而我们面前这粗大的房梁上，三竖两横，五道很深的刀痕张着口子，告诉我们这儿曾经吊死过三个主人和两个客人！恐怕是凶宅中的顶尖极品了。",
      "level": 2
    },
    {
      "id": "57",
      "text": "到了这般田地，五叔只好问我，引我来那白兔是跳到哪儿消失不见的？听他的意思是找出那地方看看，没发财希望就早点回家，省得夜长梦多，招惹上什么不好的东西。",
      "level": 2
    },
    {
      "id": "58",
      "text": "我迟疑了一会儿，就带着他俩找到了那地方，原来是一个地洞，很普通的那种洞，除了比兔子洞大了几倍外，没有什么出奇的地方。",
      "level": 2
    },
    {
      "id": "59",
      "text": "陈脸子不愧是个窖客，仔细辨认了一会儿，就告诉我们这个洞肯定是人挖出来的，绝不会是天生的，执意要钻进去看看。",
      "level": 2
    },
    {
      "id": "60",
      "text": "五叔操心我的安全，说什么也不肯下去，一时三个人僵在了洞口。",
      "level": 2
    },
    {
      "id": "61",
      "text": "正在惊疑不定时，却传来喵呜——一声尖锐的猫叫，把我们三个绷紧的神经都快叫断了。",
      "level": 2
    },
    {
      "id": "62",
      "text": "一只大黄猫蹲在屋角瞅着我们，个头颇大，五叔颤抖着声音说：狗来富，猫来孝，猫叫没好事呀。",
      "level": 2
    },
    {
      "id": "63",
      "text": "陈脸子苦着脸说：是啊是啊，狗来富，猫来孝，人要死了，身子才会发出一股子臭味，只有猫能闻到，这猫要来行孝了，总不会是应在我们身上吧？",
      "level": 3
    },
    {
      "id": "64",
      "text": "黑暗中，猫眼绿油油的闪着凶光，看的我们心里发毛。",
      "level": 2
    },
    {
      "id": "65",
      "text": "五叔忍不住地问：那现在咋办？不行咱们回去吧，我也不知道这屋子会死过这么多人，再说了，还都是吊死在这里，恐怕不是什么好事儿！",
      "level": 2
    },
    {
      "id": "66",
      "text": "陈脸子犹豫了一下，接着说：噢，等等，老五你看那猫的眼睛，是往上翻着还是往下翻着？我咋觉着这猫眼是往上翻着看呢？",
      "level": 2
    },
    {
      "id": "67",
      "text": "我仔细看了看，说实话，真看不出来，猫眼圆圆的不像人眼有白眼珠子，谁知道它是看天还是看地呢？正想嘲笑一下，却听五叔叫道：西子快跑！一把揪着我衣裳就往后扯。",
      "level": 2
    },
    {
      "id": "68",
      "text": "陈脸子已经跑了出去，五叔在后面推着我没命地跟着，前面陈脸子手上那跳跃的红点忽然停住不动了，我和五叔终于追上了他，只见墙上嵌着一盏灯，黑色的灯！",
      "level": 2
    },
    {
      "id": "69",
      "text": "陈脸子顿时被吓得面无人色，根本不敢去碰那黑灯，带着我们，小心翼翼地绕开黑灯，溜之大吉。",
      "level": 2
    },
    {
      "id": "70",
      "text": "这栋旧宅子也是古怪，不知道宅子的主人出于什么目的，把房子修的曲折离奇，千门万户的连环缠绕在一起，我们费了老大力气，没命地跑了好久，才出了旧宅子，站在河沟边直喘粗气。",
      "level": 2
    },
    {
      "id": "71",
      "text": "趁这功夫，我就问五叔：刚才我正看那猫眼时，五叔你为啥拉着我快跑呢？我没发现什么不对头的地方啊？",
      "level": 3
    },
    {
      "id": "72",
      "text": "陈脸子接过话头：那个猫眼是往上看还是往下看，区别很大的，这屋子邪气的很，所谓凶宅贼猫，死人憋宝。",
      "level": 3
    },
    {
      "id": "73",
      "text": "这凶宅里的猫眼往上翻，那是死人在看你还有多久阳寿，往下翻则是大吉大利，快点开挖，憋了多年的宝贝该咱们拿！",
      "level": 4
    },
    {
      "id": "74",
      "text": "刚才我是看出来那猫眼往上翻的，就知道这一趟要白跑了。",
      "level": 4
    },
    {
      "id": "75",
      "text": "更何况看见黑灯，更可怕了，幸亏咱们跑得快，啥也别说了，快回家吧！",
      "level": 4
    },
    {
      "id": "76",
      "text": "然后我们三个默不作声地回了五叔的屋里，天也马上就要大亮了，我们好好睡了一大觉，这件事情就一直压在我心底，接下来的高考就快要到了，繁重的复re把我的大部分时间都占得满满的，也就没有再去五叔那里玩耍，都快忘了这档子事儿了。",
      "level": 2
    },
    {
      "id": "77",
      "text": "如愿以偿地升入了大学，还不错，北京的一个大专院校录取了我，转眼就过去了两年，我马上就要毕业了。",
      "level": 2
    },
    {
      "id": "78",
      "text": "暑假里，我总觉得心里头搁了件事儿没解决，在家无聊地呆了几天，终于下定决心回老家去看看五叔。",
      "level": 2
    },
    {
      "id": "79",
      "text": "我已经二十多岁的大人了，于是一个人买了票和爸妈打声招呼后，径自回了老家，直接去找五叔。",
      "level": 2
    },
    {
      "id": "80",
      "text": "五叔看见我很高兴，直夸我两年不见，长成这么大个娃儿了，还考去了北京读书，了不起！",
      "level": 2
    },
    {
      "id": "81",
      "text": "吃罢饭，我心里一直惦记那大东关的凶宅贼猫，就问五叔后来有没有什么稀奇事发生，这才知道，不甘心的陈脸子，后来又约了五叔私下去过一次，仍然是一无所获，空手而归，还差点把命给弄丢了。",
      "level": 2
    },
    {
      "id": "82",
      "text": "五叔讲故事一样讲给我听，当然是在我买了两瓶卧龙玉液外加两个小菜之后……",
      "level": 2
    },
    {
      "id": "83",
      "text": "下面就是五叔告诉我的事情，比起那天我们三个人被吓跑的经历，更多了几分凶险。",
      "level": 2
    },
    {
      "id": "84",
      "text": "那是一个酷热的白天，黄昏时下了阵子猛雨，雨一停，就见陈脸子来找我，还准备了不少下墓的东西。",
      "level": 2
    },
    {
      "id": "85",
      "text": "这人很犟，认死理儿，执意要再去一趟，郑重地给我讲了很多有关盗墓的窖客规矩，也很有趣，按照他说的，祖传下来的盗墓有四个门派，穿山掘岭为始祖，发丘摸金是分支。",
      "level": 2
    },
    {
      "id": "86",
      "text": "干盗墓这一行，有些情况是非常凶险的，总的来讲，有两种情况威胁极大，一种是鹧鸪穿山甲，发丘天官印，墓里黑灯鬼打墙，说的是发丘一派的盗墓本领，都源自古代的穿山术，那些古代的盗墓者经常扮做入山修行，暗中却以盗墓为生，在山中时遇上同道中人，就用嘴吹出鹧鸪的叫声相互联络，不仅找墓本领天下无双，而且还是破开大墓机关的高手，可谓盗墓一派的全才，可惜的是后来日渐没落。",
      "level": 2
    },
    {
      "id": "87",
      "text": "其后分支出发丘一派，找墓时擅长二指发丘，被曹操授以发丘天官印，渐成一派的标志，这两派渊源极深，不约而同地认定，如果在墓里碰到黑灯，必然会遭逢鬼打墙，死无葬身之地。",
      "level": 3
    },
    {
      "id": "88",
      "text": "另外一种凶险的情况是掘岭四海游，摸金校尉留，鸡鸣五鼓鬼上身，则指的是掘岭和摸金两派，同样历史悠久。",
      "level": 2
    },
    {
      "id": "89",
      "text": "和穿山发丘的找墓理论不同，掘岭摸金的手法也大相径庭。",
      "level": 3
    },
    {
      "id": "90",
      "text": "其中掘岭剑侠最为神秘，和春秋战国时候的剑士侠客有关，最后走上四海巡游之路，基本算脱离了盗墓这一行。",
      "level": 4
    },
    {
      "id": "91",
      "text": "而传下来的摸金门人则代代都有杰出人才，把分金定穴、金盘观山的本领发扬光大，同样到了汉末时候达到顶峰，被曹操封为摸金校尉。",
      "level": 4
    },
    {
      "id": "92",
      "text": "两派师出一门，掘岭门规上明文规定，鸡鸣五鼓或者墓中火烛熄灭，都是不可盗墓的标志，必须立即停手，否则尸变化煞，被鬼上身，将会血流成河。",
      "level": 4
    },
    {
      "id": "93",
      "text": "陈脸子是个穿山发丘的高手，他说遇到鬼打墙比起鬼上身要严重的多，鬼上身不过是尸煞作怪，碰到灯灭就会跳出来咬人，十个墓里总有一个会出现。",
      "level": 2
    },
    {
      "id": "94",
      "text": "并非碰上就死，而鬼打墙却是必死无疑，对手是看不见摸不着的无形力量，据他师傅说，在墙中还有非常邪恶厉害的鬼怪。",
      "level": 3
    },
    {
      "id": "95",
      "text": "那天我们刚进了鬼宅子，就看到了曾经见过的那盏黑灯，陈脸子嘟哝着灯定是给人动过位置，一个劲摇头说今天开张不顺。",
      "level": 2
    },
    {
      "id": "96",
      "text": "我最先发现那个没敢下去的洞口猫着一人，蜷缩着身子一动不动，姿势很是怪异，陈脸子也算早有准备，从腰里摸出根红色丝线拿手上，另一头拴着个小玉坠，晃晃悠悠走过去看，走了几步就回头说：这不是个活人，是个喜材。",
      "level": 2
    },
    {
      "id": "97",
      "text": "奇怪，怎会摆在屋子里？这玩意儿应该埋地下才是！",
      "level": 3
    },
    {
      "id": "98",
      "text": "我们这儿一般把棺材叫做喜材，没人会觉得是个晦气的东西。",
      "level": 3
    },
    {
      "id": "99",
      "text": "陈脸子仔细看过那喜材后，满头是汗：老五啊，我是咋也没想到咱会碰上这种喜材，可是来头不小，这他娘的是个蹲葬棺，上头还刻的有殓文！",
      "level": 2
    },
    {
      "id": "100",
      "text": "我认不了几个，就这水平，比我高十倍都不止，这次咱俩是要阴沟里翻船了。",
      "level": 3
    },
    {
      "id": "101",
      "text": "虽然不懂这喜材怎么是个蹲葬棺，但是看那模样阴森森的，是个不祥之物，我也有点害怕，只好凭感觉跟着陈脸子摸索，顺着走廊门厅翻检有没有什么机关暗道之类的东西，却突兀的出现了四个人形棺，黑黢黢的挡在四个门口里，比刚才看到那个更大了一圈，面向自己的一面上，还有两个拳头大的小黑洞，黑得异常。",
      "level": 2
    },
    {
      "id": "102",
      "text": "陈脸子当时就吓懵了，扑通跪在了地上磕头祷告：祖师爷祖师爷，小的鬼迷心窍，惊了您老人家清静，实在是万分万分后悔啊，求求您高抬贵手，饶过小的吧，可怜小人上有高堂，下有儿女，今后再也不敢冒犯您了！求您饶命啊！",
      "level": 2
    },
    {
      "id": "103",
      "text": "我当时可是听得目瞪口呆，这几口喜材有那么唬人吗？",
      "level": 2
    },
    {
      "id": "104",
      "text": "喜材呢，也分个三六九等，我们碰到只不过是个杨木套棺，就是那种九寸板的樟木或者檀木等质地坚硬的木材，外面又套了个杨木的棺材套，按我们这厚葬的习俗来看，属于中等水平，难得的是一下出现五个，还做成人的模样，这就透出些蹊跷。",
      "level": 2
    },
    {
      "id": "105",
      "text": "陈脸子拜了几拜，却听得隔壁不断传来咚咚的脚步声，好像很多人都在往这个方向奔跑，重重围了上来，可把我给吓得不轻，着急的一劲催他：老脸子别扯淡了！快他娘起来，咱们再不跑，真想死到这啊？",
      "level": 2
    },
    {
      "id": "106",
      "text": "陈脸子摘下脖子里挂的所有项链还有一些护身符，拿在手上，看着我说：这五个喜材里各有一具尸体，采用的都是蹲葬方式，这种布局是有名的五鬼轧尸局，那五个吊死鬼是被逼死在这的，下头肯定是埋着什么大墓，只不过这大墓不是寻常意义的墓葬，最多只能算是个镇尸冢，葬在里头的家伙死后永远不安生，活不过三十岁还要祸延数代，我师傅当年可是严厉警告过我，像这样的五鬼轧尸局，碰上就死！",
      "level": 2
    },
    {
      "id": "107",
      "text": "周围奔跑的脚步声安静了下来，火折子也在一瞬间黯淡，黑暗中，我俩一下子冷静下来，既然知道了这是咋回事，现在就要想办法脱身了。",
      "level": 2
    },
    {
      "id": "108",
      "text": "陈脸子低声说道：想不到居然有五鬼轧尸棺，这下头埋着的不祥之物，闹不好是个妖怪！",
      "level": 2
    },
    {
      "id": "109",
      "text": "现在才知道这么多年，为啥好几个道上的好手，都在这大东关凭空没影了，看来这儿还真是个禁地。",
      "level": 3
    },
    {
      "id": "110",
      "text": "他娘的既然左右是个死，不如挑了这马蜂窝同归于尽！老五，咱们干吧！说到后来，陈脸子的语气已经是恶狠狠了许多亡命徒的狠劲。",
      "level": 3
    },
    {
      "id": "111",
      "text": "我对这些墓葬东西比起陈脸子，懂那点儿可是差太多了，知道弄不好会把老命撂在这后，肠子都快悔青了。",
      "level": 2
    },
    {
      "id": "112",
      "text": "猫眼跟狼眼一样，据说可以采光。一到黑夜，就会发出绿光，我听到一阵含糊的声音，那是猫的喉咙里发出的低啸。",
      "level": 1
    },
    {
      "id": "113",
      "text": "陈脸子冷冷吩咐道：我现在要破他这个五鬼轧尸棺，成功的把握老实讲我没多少，不过就是比等死强点罢了，老五你必须照我说的去做，明白？",
      "level": 2
    },
    {
      "id": "114",
      "text": "我当时就傻了，站在那儿，看着陈脸子从怀里掏东西，有黄裱符、小旗、几块散碎的旧玉，一一在地上摆好，还拿出把寒光闪闪的短刀，噌的一声，就割烂了手指头，逐一在这堆物件上面滴了血。",
      "level": 2
    },
    {
      "id": "115",
      "text": "陈脸子要我做得很简单，就是拿这几块滴了血的旧玉，往每个喜材的黑洞口里塞上一块就成，我想想也不是很难，就接了过来。",
      "level": 2
    },
    {
      "id": "116",
      "text": "陈脸子告诉我，这种不起眼的旧玉，叫做死玉，在识货的人看来，这种玉属于品相极差的那种烂玉，但在盗墓贼眼中这可都是宝贝，因为这些散碎的死玉，基本上都出自陈年老墓，见光前已经在地下埋了不知多少年，把墓中的尸气和阴气一股脑吸收在玉内，现在染上了人血，拿来克制喜材里头五鬼轧尸的尸气，是极好的宝贝，阴气和尸气都会被这块死玉吸附，若没有这些死玉，我俩当时就一命呜呜那是必然的。",
      "level": 2
    },
    {
      "id": "117",
      "text": "准备妥当，陈脸子干巴巴地对我说：老五啊，咱俩认识时间不长，谈不上谁害谁，这次也怪我心贪，没有估计到凶宅里的危险。",
      "level": 2
    },
    {
      "id": "118",
      "text": "如果运气够好，逃得出去，那是咱命大，往后我是洗手不干了，要是咱们该死绝到这儿，你也别怨我，黄泉路上我背着你就是了。唉！",
      "level": 3
    },
    {
      "id": "119",
      "text": "陈脸子顿了顿接着说道：我这次破局，必定会折了阳寿，暴死当场的可能都有，这些猫我刚才注意看了一下，都不是些善类，甚至还有些吃人肉的老猫，其中有些猫眼下翻的吉物，我一时半会也说不清，只能告诉你，凭我的本事，拖个一时三刻，让你逃跑还是可以的。",
      "level": 2
    },
    {
      "id": "120",
      "text": "我被陈脸子的悲壮语调说的很黯然，瞅着他，啥话也讲不出来。",
      "level": 2
    },
    {
      "id": "121",
      "text": "这时候，火折子像是被谁吹了一口气，扑的一下腾起了火焰。",
      "level": 2
    },
    {
      "id": "122",
      "text": "陈脸子大喝一声：还不快跑！一巴掌就把我推了出去……",
      "level": 2
    },
    {
      "id": "123",
      "text": "我冷不防被推的一个踉跄，看那最大个子的喜材，盖子似乎有点松动，冒出阴冷的气息越发凝重，强大的压力让我迈不出脚步，呼吸都觉得困难。",
      "level": 2
    },
    {
      "id": "124",
      "text": "只见陈脸子吞下一张黄裱符，捏起血浸的旧玉，一步步向阴气冒出的地方挪去。",
      "level": 2
    },
    {
      "id": "125",
      "text": "喜材里，一个束发男尸抬着头一动不动，皮肉干枯，色泽黝黑无比，微微张开的嘴里，哧哧冒着黑色寒气和扑鼻的尸臭，陈脸子费劲的把血玉往那干尸嘴里塞，直到旧玉完全塞进干尸嘴里，我才稍稍好受了些，赶忙去那几个喜材跟前，往里塞染了血的死玉。",
      "level": 2
    },
    {
      "id": "126",
      "text": "还好，陈脸子的办法很对路子，喜材里刚塞进去死玉，就爆开了盖子，里头的男尸迅速萎缩，皮肤和骨骼间的肌肉像是突然融化，变成一层厚厚的黑皮贴着骨头，萎缩的一动不动，整个化成一张狰狞的黑皮。说不出的一种诡异神态，很有点如释重负的感觉。",
      "level": 2
    },
    {
      "id": "127",
      "text": "可惜我就倒霉了，喉咙里越来越难受，沙哑刺痛，似乎有不少东西，紧紧贴在喉管的管壁上，一只大手要从肚子里拼命地伸出来，后面还有无数的小手在拉扯心肺，让我根本喘不上气来，只能双手捏住脖子，痛苦的在地上打滚。",
      "level": 2
    },
    {
      "id": "128",
      "text": "就在我掐着脖子蹬着腿挣命时，却见陈脸子瘸着一条腿爬了过来，手里拖着盏黑灯，一脸疲惫。",
      "level": 2
    },
    {
      "id": "129",
      "text": "陈脸子喃喃的好像是说：这是黑焰灯，黑焰灯……就是这个词。",
      "level": 2
    },
    {
      "id": "130",
      "text": "黑焰灯，没错！我现在也不太懂是啥意思，难道还有黑色的火焰不成？那还叫什么灯，照给谁看啊？",
      "level": 3
    },
    {
      "id": "131",
      "text": "我当时也不懂是啥意思，但是自从这黑灯离近，喉咙里感觉舒服了许多，直到沙哑的感觉终于没了，高兴得一翻身爬了起来。",
      "level": 2
    },
    {
      "id": "132",
      "text": "陈脸子拖着的是一盏黑色的灯，老式铜灯，底座是一个人跪着高举双手，顶部是一个圆碗形状的灯盏，发出暗金色的冷光，有点像自己平常使用的旱烟那么长，我当时在心里想，就是精致了许多。",
      "level": 2
    },
    {
      "id": "133",
      "text": "目不转睛地看着这盏奇怪的黑灯，我和陈脸子都不吱声了，圆形的灯碗里空无一物，连个灯芯都没有，而且整个灯的颜色太黑，黑得让人心慌，我想起陈脸子说的鬼打墙的事，更加忍不住直想逃跑。",
      "level": 2
    },
    {
      "id": "134",
      "text": "咱们南阳，地理上来看，是位于秦岭山麓，汉水源头，自古都是豫西南的腹地。",
      "level": 2
    },
    {
      "id": "135",
      "text": "陈脸子小声说，这黑焰灯的秘密，据说和当年的蒙古人有关，元朝时，蒙古人如狼似虎，血洗欧亚大陆，传说这黑焰灯当时可以唤醒战死的士兵，重新投入死亡战场，那不就是个战无不胜的鬼军团吗？",
      "level": 2
    },
    {
      "id": "136",
      "text": "我可不信这一套胡说八道，陈脸子苦笑着解释，后来朱元璋赶走鞑子后，听说这黑焰灯就被刘伯温给毁了，我师傅就是这么告诉我的，打那以后，我下窖子时就很注意这老铜灯一类的物什，却没想到在这儿给碰上了。",
      "level": 2
    },
    {
      "id": "137",
      "text": "我被陈脸子说的一愣一愣地扭头看看他，觉得有点不对劲，仔细一瞧，差点没把我吓趴下！",
      "level": 2
    },
    {
      "id": "138",
      "text": "原来在陈脸子的背上，不知啥时候，轻飘飘地趴了个黄衣女人，低着头，长长的黑发披散在两边，白惨惨的脸上毫无表情，两个白眼圈里，全是黑眼珠子，正眨也不眨地看着他，随着他说话和动作左右摆动，根本就没有改变视线的意思。",
      "level": 2
    },
    {
      "id": "139",
      "text": "我还以为是自己一时眼花，忍不住使劲闭上了眼睛，准备再仔细瞧瞧，而陈脸子还一点都没有觉察到背上多了个女人。",
      "level": 2
    },
    {
      "id": "140",
      "text": "我刚闭上眼睛，就听见两声短促地尖叫，睁开眼睛时，只见陈脸子已经瘫地上了，几只老猫跳他背上对那黄衣女人又撕又咬，猝不及防，尖叫两声跌下了陈脸子的身上，立刻被黑焰灯吸了进去。",
      "level": 2
    },
    {
      "id": "141",
      "text": "陈脸子好久才醒过来，脖子上全是黑手印，这下可给箍的不轻，恐怕再多几分钟，必死无疑！",
      "level": 2
    },
    {
      "id": "142",
      "text": "清醒过来后我陪着他喘了半天气，想想此地不宜久留，赶忙往外跑，我这辈子从来没有见过鬼，这下算是开了眼界。",
      "level": 2
    },
    {
      "id": "143",
      "text": "这黑焰灯恐怕真的有号令阴曹厉鬼的能力呢！",
      "level": 3
    },
    {
      "id": "144",
      "text": "从那鬼宅子里头跑出来时，天才蒙蒙亮，后来陈脸子回去后，听说大病了一场，躺了三个多月才下地。",
      "level": 2
    },
    {
      "id": "145",
      "text": "五叔讲完这事儿，酒也喝得差不多了，哈欠连天地倒头睡下，我反倒是给这一波三折的惊险事儿刺激的半夜都睡不安生，不过我是个坚定的无神论者，压根不信这世界上会有什么鬼怪，一直琢M那黄衣女鬼到底是怎么回事儿？",
      "level": 2
    },
    {
      "id": "146",
      "text": "刘伯温可是朱元璋的头号谋士，这五鬼轧尸局恐怕就是他的杰作，黑焰灯和黄衣女人，还有刻着殓文的蹲葬棺，莫非真的是一个镇尸冢，下头埋着什么吓人的秘密不成？",
      "level": 2
    },
    {
      "id": "147",
      "text": "第二天我问五叔，那藏在山里的旧宅子现在怎么样了？",
      "level": 2
    },
    {
      "id": "148",
      "text": "五叔却说，去年发大水，早淹了，现在在河底，谁也看不着……",
      "level": 3
    },
    {
      "id": "149",
      "text": "一说两瞪眼，我就打消了去瞧瞧的念头。",
      "level": 2
    },
    {
      "id": "150",
      "text": "回北京后忙着毕业分配的麻烦事儿，好久没和五叔再联系，这事儿也就慢慢淡忘了。",
      "level": 2
    },
    {
      "id": "151",
      "text": "毕业后，还算差强人意，我在北京的一家外企找了份工作，同时也交往了一个条件相当不错的女朋友，她叫韩叶娜。",
      "level": 2
    },
    {
      "id": "152",
      "text": "长得很漂亮，性格开朗善良，以我的个人条件，已经觉得相当满足了。",
      "level": 2
    },
    {
      "id": "153",
      "text": "现在说说我个人条件吧，长相比较出众，当然不是英俊到需要去整容那种极端，而是比较瘦削。",
      "level": 2
    },
    {
      "id": "154",
      "text": "个子又高，头发飘在后脑勺上，属于那种从背后就能猜出前面长相的人，但问题就偏偏出在这里。",
      "level": 2
    },
    {
      "id": "155",
      "text": "走在后面看见我的人，都会以为我一定是戴副近视眼镜，没几根胡子，整天熬夜，面色苍白，去电脑城闭眼就能抓一把的俗人，但走上来回头一印证，才猛然发现我根本不是这般样子。",
      "level": 2
    },
    {
      "id": "156",
      "text": "我眼睛细长，细长到总是给人眯缝着眼的感觉，这样一来，就显得黑眼珠子特别多，再加上小时候不老实，摔跤把下巴磕的往上翻着，连累得嘴角也是往上翘起。",
      "level": 2
    },
    {
      "id": "157",
      "text": "一眼望去，就是个正在嬉笑的家伙，黑眼珠子转转，又有点高深莫测。",
      "level": 3
    },
    {
      "id": "158",
      "text": "所以靠这副极有亲和力的微笑面孔，我的人缘不错，朋友还算不少，谈起女朋友来，更是得心应手。",
      "level": 2
    },
    {
      "id": "159",
      "text": "认识漂亮的女朋友，让我很是开心了一段日子，可惜常言说得好：天有不测风云，人有三衰六旺。",
      "level": 2
    },
    {
      "id": "160",
      "text": "那次出差去江西鹰潭公干，回来后却让我的生活发生了天翻地覆的变化。",
      "level": 2
    },
    {
      "id": "161",
      "text": "要说也是我自己纯属多事。",
      "level": 2
    },
    {
      "id": "162",
      "text": "龙虎山这样的风景名胜地，测字打卦的人不计其数，可唯一吸引住我的就唯独这一个测字先生。",
      "level": 1
    },
    {
      "id": "163",
      "text": "大约六十岁上下的样子，面容清癯，身上穿的长褂也一尘不染，或许我就是被这古装打扮吸引了，他见我走过来，对我一笑，招呼我坐下，问我：年轻人，要测字还是求签啊？",
      "level": 2
    },
    {
      "id": "164",
      "text": "我说：老先生，我先测个字吧。",
      "level": 2
    },
    {
      "id": "165",
      "text": "测字先生点点头，递给我一张纸和一支笔，让我把要测的字写在上面。",
      "level": 2
    },
    {
      "id": "166",
      "text": "我想我还过得比较顺，不如测测女朋友，于是提笔在纸上随便写了个女朋友的名字韩叶娜中间那个叶字。",
      "level": 2
    },
    {
      "id": "167",
      "text": "测字先生一看我写了个-叶-字，就问：你这测的是一个女人吧？",
      "level": 2
    },
    {
      "id": "168",
      "text": "我心下暗自吃惊，点头称是，测字先生面色变得相当难看，沉吟了一下接着说道：这树叶不是大树的主干，自古红花都还要绿叶来配，所以我断定是个女人，但实在可惜，这个女人不是已经死了，就是即将亡故，年轻人你可千万要节哀顺便啊！",
      "level": 2
    },
    {
      "id": "169",
      "text": "我不由心里偷笑，真是狗屁不通。",
      "level": 2
    },
    {
      "id": "170",
      "text": "刚才我还和女朋友通过电话，哪能这么快就死了，看来这算命佬是要把活人咒的快死才能骗钱，顿时兴趣大减，随口敷衍：那你接着断吧。",
      "level": 3
    },
    {
      "id": "171",
      "text": "测字先生提笔在纸上写了一个繁体的-葉-字，指给我看：你看这世在草木之中，人恐怕是要早早的命丧黄泉。",
      "level": 2
    },
    {
      "id": "172",
      "text": "观此字的形状，和-弃-字-药-字都有些相似，所以据我断来，这女人以后必然会得怪病，而且用药不当，被意外地废弃于草木之中，自生自灭，真是怪事啊！",
      "level": 3
    },
    {
      "id": "173",
      "text": "年轻人，你再写一个字来，这次我要看看这女人为什么会这样，顺便测测你的命数，一定要随意写，什么都行。",
      "level": 2
    },
    {
      "id": "174",
      "text": "算命佬解释一个叶字有理有据的，顿时把我说的有点发毛，想到我名字里有个一字，这个字写法最为简单，而且一有第一的意思，算的结果必然不错，心里虽然明白君子问祸不问福的道理，但还是担心测出不好的结果来，于是就提笔在纸上写了个-一-字。",
      "level": 2
    },
    {
      "id": "175",
      "text": "测字先生对着我写的这个字，面色沉重，很久没有答话。",
      "level": 2
    },
    {
      "id": "176",
      "text": "我觉得纳闷，就连声催促：是好是坏您倒是给解释一下啊。",
      "level": 2
    },
    {
      "id": "177",
      "text": "测字先生叹了口气：小伙子，这个-一-字，是生的最后一笔，也是死的头一笔。",
      "level": 2
    },
    {
      "id": "178",
      "text": "一者，生末死初也，再加上你测的叶字，犹如一叶扁舟徜徉于汪洋之中，求生不得，求死不能。",
      "level": 3
    },
    {
      "id": "179",
      "text": "主有大凶，九死一生矣。",
      "level": 3
    },
    {
      "id": "180",
      "text": "我明白你刚测的那女人为什么会早早丧命了，实在和你是大有关系啊。",
      "level": 3
    },
    {
      "id": "181",
      "text": "我一听这话赶忙说：你算的准不准啊？别净吓唬老实人呵，要不然我换个字成吗？",
      "level": 2
    },
    {
      "id": "182",
      "text": "这-一-字不算，我名里还有个-西-字，咱就当测这-西-字怎么样？",
      "level": 3
    },
    {
      "id": "183",
      "text": "何况我女朋友也活得好好的，刚还通过电话呢！",
      "level": 3
    },
    {
      "id": "184",
      "text": "测字先生苦笑：字为心声，心乱则字乱，运衰则字衰，可一而不可再，你女朋友我断她已死，自有我的道理，这是改变不了的。",
      "level": 2
    },
    {
      "id": "185",
      "text": "观你面相，目长眉细，地阁上翻，一副早夭之相，但你这两个字却写得笔意饱满昂扬，毫无衰败之象，说明你身体健康，性格达观。",
      "level": 3
    },
    {
      "id": "186",
      "text": "如果能谨慎言行，万事顺其自然，勿强行逆施，多行善举，凭你的造化也许能渡过此劫。",
      "level": 3
    },
    {
      "id": "187",
      "text": "我听他这么说才算放心，就忙问怎么才能让女朋友一起避过灾祸，测字先生想了很久说道：若你名字里真有个西字，倒是一线生机。",
      "level": 2
    },
    {
      "id": "188",
      "text": "给你起名的也算个老手，一为乾元，西属幽金。",
      "level": 3
    },
    {
      "id": "189",
      "text": "你的阳身必须入于极阴多金之地，以金之力聚敛你的阳气，或许能遭逢转机，改变宿命中的缺陷。",
      "level": 3
    },
    {
      "id": "190",
      "text": "观你面相，今日之后变故迭起，将会有一番大的作为，奈何都是在生死边缘游荡，稍有不慎，就万劫不复！",
      "level": 3
    },
    {
      "id": "191",
      "text": "我们龙虎山有个张道临天师，你要是有缘碰到的话，可要好好向他讨教一下，不过可惜的是这位大师我也有年头没有见过他了，不知道在哪里，所以没有办法指点你。",
      "level": 2
    },
    {
      "id": "192",
      "text": "我历来胆大，不信怪力乱神之事，什么阳身必须入于极阴多金之地，想了又想也不懂是什么意思。",
      "level": 2
    },
    {
      "id": "193",
      "text": "人，大不了就是一死而已，万劫不复这类的鬼话也说的出口？",
      "level": 3
    },
    {
      "id": "194",
      "text": "说明他也许就是个跑江湖骗钱的，肯定是信口开河，自己怎能叫他给唬住了？",
      "level": 3
    },
    {
      "id": "195",
      "text": "但是看那测字先生的气度举止，又丝毫不似街边的那些骗子，居然说出了一直萦绕我心里的张天师的俗家名字，让我十分震惊。",
      "level": 2
    },
    {
      "id": "196",
      "text": "看来小时候我还真碰过这个人，不是老爹故意糊弄我，心烦意乱之下也不想再多说别的了，交了卦钱之后就匆匆忙忙地回了宾馆。",
      "level": 2
    },
    {
      "id": "197",
      "text": "第二天，我继续在龙虎山转悠，古悬棺一直是龙虎山旅游的看点，在仙水岩下搭建的70余米的攀登钢架下，我百无聊赖地混在人堆里留影纪念，龙虎山悬棺分布点多面广，我先后去了仙水岩、仙人峰和米仓峰等崖墓，看到了保存最完整的、带有封门板的悬棺及新的古悬棺群，但就是一直没有再听到和张天师有关的任何消息。",
      "level": 2
    },
    {
      "id": "198",
      "text": "直到最后快要离开前的几天，我的注意力全给山崖上的悬棺吸引去了，甚至不由自主地想爬上去看看峭壁上的悬棺里是个什么情况。",
      "level": 2
    },
    {
      "id": "199",
      "text": "一时冲动下，我还真找到个没人注意的角落。",
      "level": 3
    },
    {
      "id": "200",
      "text": "憋了口气，就开始手脚并用地往上爬，我的本意只是想离近了看看，瞧清楚后过个眼瘾就下来，谁知道越爬越高，到了最后，我发现自己已经很难一个人爬下去了。",
      "level": 3
    },
    {
      "id": "201",
      "text": "正在为难的时候，是张天师救了我，出现得很突兀，让我觉得像做梦一样，不怎么相信这一切会是真的，看来这张天师很像是一直在跟踪我，但是让我感觉糟糕的是，直到分别我也忘记了问他，为什么会给我取这个怪名字。",
      "level": 2
    },
    {
      "id": "202",
      "text": "张天师话很少，仔细观察了我的面相一会儿，抛下一本旧书就飘然而去。",
      "level": 2
    },
    {
      "id": "203",
      "text": "我依稀听到他似乎在叹什么缘起缘灭的鬼话，但根本没有在意，因为张天师给我的这本旧书，书名叫做《天渊山水纵横秘术》。",
      "level": 2
    },
    {
      "id": "204",
      "text": "重点讲述了观山望水，机关邪术的八字秘诀，虽然并非一个装帧精美的全本，却让我一下看入迷了。",
      "level": 2
    },
    {
      "id": "205",
      "text": "古人云：一命二运三风水，风水学说历来被视为左右命运的枢纽。",
      "level": 2
    },
    {
      "id": "206",
      "text": "什么是风水？气乘风而散，界水则止。聚之使不散，行之使有止，故谓风水。",
      "level": 2
    },
    {
      "id": "207",
      "text": "风水之法，得水为上，藏风次之。",
      "level": 2
    },
    {
      "id": "208",
      "text": "书的中心意思说的是观风望水要堪天道，舆地道。",
      "level": 2
    },
    {
      "id": "209",
      "text": "深奥的内容充满玄机，提到了很多五行八卦易数之类的名词，比如什么东方甲乙木，南方丙丁火，中央戊己土，西方庚辛金，北方壬癸水，什么乾、坎、艮、震、坤、兑、离、未等等，多有不解之处，对付着看只能明白个三四成。",
      "level": 2
    },
    {
      "id": "210",
      "text": "这本书看不出是什么年代的，也不知出自何人之手，应该算是《堪舆学》中的一个另类。",
      "level": 2
    },
    {
      "id": "211",
      "text": "它提出风水学的五大要素：龙、穴、砂、水、向，其本质必然是-气。",
      "level": 2
    },
    {
      "id": "212",
      "text": "那些所谓的寻龙，捉穴，察砂，觅水，定向，目的都在于察寻吉气，避开煞气。",
      "level": 3
    },
    {
      "id": "213",
      "text": "何谓-气-？气者，虚处来，实处止。",
      "level": 2
    },
    {
      "id": "214",
      "text": "民谚曰：阳宅照鞍重水，阴穴照尖重山。",
      "level": 3
    },
    {
      "id": "215",
      "text": "说的就是阳宅看重水势，要向照马鞍形的虚缺处，以求无阻地吸纳生元之气。",
      "level": 4
    },
    {
      "id": "216",
      "text": "埋葬死人的阴宅则看重山体的龙脉之气，墓穴吸收的生气和死气有很大讲究，一般都维持尖顶，种植松柏等尖顶植物或矗立石像。",
      "level": 4
    },
    {
      "id": "217",
      "text": "至于截腰、汲阴、担枕头、角冲、天堑煞的不利地形，尽力避免。",
      "level": 4
    },
    {
      "id": "218",
      "text": "书的大部分篇幅都用来讲述风水学的原理和奥秘，其中往往用青龙、白虎、朱雀、玄武来表示方位。",
      "level": 2
    },
    {
      "id": "219",
      "text": "比如说：凡宅左长流水，谓之有青龙；右边饶长道，谓之白虎轩；前有浅池塘，谓之朱雀临；后方靠丘陵，谓之玄武地，为最贵地。",
      "level": 3
    },
    {
      "id": "220",
      "text": "青龙宜紧不宜迫，案山要近明堂卧。",
      "level": 2
    },
    {
      "id": "221",
      "text": "风水宝地的构成，不仅要求四像毕备：玄武垂首，朱雀欣舞，青龙环绕，白虎驯伏。",
      "level": 3
    },
    {
      "id": "222",
      "text": "还要求北面主龙脉要绵延不绝，南方朝案山远近呼应，左右两侧护山拱卫，中间的明堂地势宽敞，且有流水瀑布环抱，玄武方向的山峰垂首不语，朱雀方向的山脉欣喜歌舞，左之青龙山势要起伏，右之白虎山形要柔顺，这样的环境就是风水宝地。",
      "level": 4
    },
    {
      "id": "223",
      "text": "正所谓：靠山起伏，高低错落，曲曲如活，中心出脉，穴位突起，龙砂虎砂，重重环抱，外山外水，层层护卫。",
      "level": 5
    },
    {
      "id": "224",
      "text": "然后讲述怎么依照天上星辰、地上山岭来点穴的诀窍秘术，文字愈发艰深晦涩，看得我眼花缭乱，头晕脑涨，只好不停地向后查。",
      "level": 2
    },
    {
      "id": "225",
      "text": "最后部分专门讲了伏羲八卦的潜藏秘密，分别用八个字来归纳出所谓的《天渊山水纵横秘术》，上篇核心是点穴，下篇重点在破穴。",
      "level": 2
    },
    {
      "id": "226",
      "text": "点穴八字很可能已经失传，书中介绍的很笼统，下篇破穴八字讲的很细致。",
      "level": 3
    },
    {
      "id": "227",
      "text": "怎么布阵破阵，怎么利用玄奥的阴阳杀局来左右气运命数的绝技，以及各种我都没有听说过的巫术、邪术都做了翔实的介绍。",
      "level": 3
    },
    {
      "id": "228",
      "text": "我心想这趟还算没白跑，有这个收获也是不小，所以离开龙虎山没多久，我就回到了北京，潜心钻研这《天渊山水纵横秘术》，好些日子过去了，命运有时侯真的像是在捉弄人，测字先生说的话一直像阴影一样蒙在我心头，而张天师给我的半本风水书却引来了老天爷的折磨。",
      "level": 2
    },
    {
      "id": "229",
      "text": "从一九九四年刚过二十五岁生日开始，我的生活就发生了翻天覆地的变化，在这一年中很多恐怖而又难以想象的事情在等待着我。",
      "level": 2
    },
    {
      "id": "230",
      "text": "不说别的，就在此刻，六枚棺材钉，又扁又长的钉身上还生了不少铁锈，沉甸甸地摆在我面前，让我百思不得其解。",
      "level": 2
    },
    {
      "id": "231",
      "text": "为什么这六枚年深日久、长着铁锈的棺材钉会摆在我面前？",
      "level": 3
    },
    {
      "id": "232",
      "text": "不是平放着，而是笔直插在一张相片上。",
      "level": 3
    },
    {
      "id": "233",
      "text": "这相尺寸不像我经常见到的那种，相当大，呈方形，边长差不多四十厘米，是一个女人的半身黑白照片。",
      "level": 4
    },
    {
      "id": "234",
      "text": "六枚棺材钉分别钉在照片中女人的双眼、双耳、鼻子和嘴里。",
      "level": 4
    },
    {
      "id": "235",
      "text": "被钉过的这六个地方叫那钉子挡住，看不清楚到底长了啥样，不过，应该比较年轻，因为她脸上没有多少皱纹，显得平滑光洁，肯定还不到三十岁。",
      "level": 4
    },
    {
      "id": "236",
      "text": "为什么这六枚年深日久的棺材钉会摆在我面前，说来就话长了。",
      "level": 1
    },
    {
      "id": "237",
      "text": "做梦也想不到我这样一个清白的工薪上班族，居然和跑江湖，据说还是专干那见不得光，掉脑袋事的盗墓团伙起了冲突，都是因为那本《天渊山水纵横秘术》的古书招来横祸，不知道这些亡命徒从哪里得知我有了这古书，几次三番搅闹我的生活，要夺走此书作为盗墓的绝活。",
      "level": 2
    },
    {
      "id": "238",
      "text": "直到我小试牛刀拿出学会的最简单一点-摄-字布局，竟然差点搞出了人命，弄得对方放出狠话要做掉我，书也不要了。",
      "level": 2
    },
    {
      "id": "239",
      "text": "我在单位，包括北京都实在没法待下去了。",
      "level": 2
    },
    {
      "id": "240",
      "text": "最后我担心连累女朋友，又联想到测字先生说她死于非命都是因为我，所以只好忍痛选择了逃避。",
      "level": 2
    },
    {
      "id": "241",
      "text": "我给韩叶娜留了一封信，跟她提出分手，然后揣着仅剩的一千多块钱，收拾了几件随身衣服和一些必需品就离开了。",
      "level": 2
    },
    {
      "id": "242",
      "text": "但我实在是舍不得女朋友，想来想去选择去了天津，因为这两个城市离得很近，每当想到和她离得近一些，我心里便稍微舒服一点。",
      "level": 2
    },
    {
      "id": "243",
      "text": "到了天津之后，我联系了一个大学时的同学，就是和我关系很铁的柴勇，一个出生在天津的老门老户，毕业后在中国电信工作。",
      "level": 2
    },
    {
      "id": "244",
      "text": "柴勇体形很胖，我称他为肥佬。",
      "level": 2
    },
    {
      "id": "245",
      "text": "见面之后，喝了不少啤酒，我对哥们儿自然没什么隐瞒的，再加上见识过风水秘术的威力，十分担心不可知的邪恶力量害了女朋友，也不愿意跟肥佬讲这些不怎么科学的东西，怕他笑话我胆小，只是说自己跟别人结仇，不得已跑了出来，肥佬倒是劝我给韩叶娜打电话把实情说出来。",
      "level": 2
    },
    {
      "id": "246",
      "text": "他说你们俩的感情那么好，她肯定会担心你的，哪里还会扯到谁连累谁的蠢话。",
      "level": 3
    },
    {
      "id": "247",
      "text": "我说：肥佬别说了，别说了，你就给我留点尊严行吗？我要是能跟她说我早跟她说了，我这次真是活见鬼，惹上了这些盗墓贼，后头的麻烦事儿还多着呢，哪还有脸再见她？",
      "level": 3
    },
    {
      "id": "248",
      "text": "这事儿要是连累到她，我还不如死了算了。总之我这辈子对不起她，下辈子去给她当牛做马补偿好了。",
      "level": 3
    },
    {
      "id": "249",
      "text": "肥佬又劝了一会儿，见我的态度坚决，似乎有难言之隐，也就不多说了。",
      "level": 2
    },
    {
      "id": "250",
      "text": "酒入愁肠，俩人很快就醉了。等意识恢复的时候发现躺在肥佬家的床上，肥佬告诉我说他老婆这些天被他打发回娘家住了，让我就先住在这里，等他帮我找到住的地方再走。",
      "level": 2
    },
    {
      "id": "251",
      "text": "因为肥佬结婚了，我不能在他家里常住，第二天，我就出去租房子，我给自己定的预算是一百到二百一个月，风头过去之前，一定要省着过。",
      "level": 2
    },
    {
      "id": "252",
      "text": "在中介那挑来拣去，发现一地方挺合适。",
      "level": 2
    },
    {
      "id": "253",
      "text": "租金才一百五一个月，十五平米，家具齐备，地点靠近工人文化宫，离东站不远。",
      "level": 3
    },
    {
      "id": "254",
      "text": "于是我交了信息费，要了详细的地址和房东的联系电话，并约好了时间，马上过去看房。",
      "level": 2
    },
    {
      "id": "255",
      "text": "刚找到地方，几乎是立刻见到了房东，一个很阴沉的老女人，叫我称呼她做梅姨。",
      "level": 2
    },
    {
      "id": "256",
      "text": "大热的天儿，还穿着件对襟老式外褂，一句多余的话也不问，漠然地带我看了我想租的房子。",
      "level": 2
    },
    {
      "id": "257",
      "text": "这一带都是解放之前的老式洋楼，房子格局都差不多，一个小院里面带一幢小楼，有三层的和两层的，每一幢小楼里面大约住了六到八户。",
      "level": 2
    },
    {
      "id": "258",
      "text": "我打算..."
    }
  ],
  "concepts": [
    {
      "name": "鬼打墙",
      "frequency": 7,
      "context": "A supernatural phenomenon where one gets lost in a loop, often associated with spirits."
    },
    {
      "name": "风水书",
      "frequency": 1,
      "context": "A book related to the principles of Feng Shui."
    },
    {
      "name": "凶宅",
      "frequency": 5,
      "context": "A house considered to be haunted or unlucky."
    },
    {
      "name": "盗墓",
      "frequency": 9,
      "context": "The act of grave robbing or tomb raiding."
    },
    {
      "name": "探险",
      "frequency": 1,
      "context": "The act of exploring or undertaking adventurous activities."
    },
    {
      "name": "名字",
      "frequency": 4,
      "context": "The designation given to a person or thing."
    },
    {
      "name": "算命",
      "frequency": 5,
      "context": "The practice of telling fortunes or predicting the future."
    },
    {
      "name": "梦",
      "frequency": 4,
      "context": "A series of thoughts, images, and sensations occurring in a person's mind during sleep."
    },
    {
      "name": "尸体",
      "frequency": 2,
      "context": "A dead body."
    },
    {
      "name": "老头",
      "frequency": 2,
      "context": "An elderly man."
    },
    {
      "name": "松树林",
      "frequency": 1,
      "context": "A forest consisting primarily of pine trees."
    },
    {
      "name": "兔子",
      "frequency": 4,
      "context": "A small, furry mammal with long ears and a short tail."
    },
    {
      "name": "仙皮子",
      "frequency": 4,
      "context": "A term for a white rabbit believed to bring good fortune."
    },
    {
      "name": "五叔",
      "frequency": 12,
      "context": "The narrator's paternal uncle."
    },
    {
      "name": "团部",
      "frequency": 4,
      "context": "A military headquarters or unit."
    },
    {
      "name": "凶宅",
      "frequency": 5,
      "context": "A house considered to be haunted or unlucky."
    },
    {
      "name": "陈脸子",
      "frequency": 16,
      "context": "A mysterious character, a '窖客' (cellar expert) and likely a tomb robber."
    },
    {
      "name": "窖客",
      "frequency": 3,
      "context": "An expert in digging cellars, also implied to be a tomb robber."
    },
    {
      "name": "黑灯",
      "frequency": 4,
      "context": "A black, mysterious lamp, often associated with danger or the supernatural."
    },
    {
      "name": "五鬼轧尸局",
      "frequency": 3,
      "context": "A specific burial or arrangement of coffins believed to bring misfortune."
    },
    {
      "name": "死玉",
      "frequency": 2,
      "context": "Old jade believed to absorb corpse energy, used in rituals."
    },
    {
      "name": "黑焰灯",
      "frequency": 4,
      "context": "A mysterious black lamp with unknown properties."
    },
    {
      "name": "黄衣女人",
      "frequency": 2,
      "context": "A ghost of a woman in yellow clothing."
    },
    {
      "name": "棺材钉",
      "frequency": 3,
      "context": "Nails used to secure a coffin, in this context, used in a ritualistic manner."
    },
    {
      "name": "风水秘术",
      "frequency": 2,
      "context": "Secret techniques related to Feng Shui."
    },
    {
      "name": "韩叶娜",
      "frequency": 6,
      "context": "The narrator's girlfriend."
    },
    {
      "name": "测字先生",
      "frequency": 4,
      "context": "A fortune teller who interprets characters."
    },
    {
      "name": "张天师",
      "frequency": 6,
      "context": "A prominent Taoist priest, also referred to as Zhang Daolin."
    },
    {
      "name": "刘伯温",
      "frequency": 1,
      "context": "A historical figure, strategist and advisor to Zhu Yuanzhang."
    },
    {
      "name": "柴勇",
      "frequency": 3,
      "context": "The narrator's college friend, nicknamed 'Fatty'."
    }
  ],
  "relations": [
    {
      "source": "风水书",
      "target": "鬼打墙",
      "type": "causes"
    },
    {
      "source": "凶宅",
      "target": "恐怖的过去",
      "type": "contains"
    },
    {
      "source": "盗墓团伙",
      "target": "胆大",
      "type": "has_trait"
    },
    {
      "source": "苗人",
      "target": "蛊毒",
      "type": "uses"
    },
    {
      "source": "扛天灯者",
      "target": "诡秘",
      "type": "associated_with"
    },
    {
      "source": "凶宅",
      "target": "阴森恐怖",
      "type": "originates_from"
    },
    {
      "source": "冯一西",
      "target": "名字",
      "type": "has_name"
    },
    {
      "source": "名字",
      "target": "一命归西",
      "type": "implies"
    },
    {
      "source": "爸爸",
      "target": "名字",
      "type": "gave"
    },
    {
      "source": "名字",
      "target": "保住小命",
      "type": "intended_to"
    },
    {
      "source": "张道临",
      "target": "龙虎山",
      "type": "resides_in"
    },
    {
      "source": "张天师",
      "target": "算命",
      "type": "performs"
    },
    {
      "source": "冯一西",
      "target": "麻烦事儿",
      "type": "encounters"
    },
    {
      "source": "麻烦事儿",
      "target": "小时候的经历",
      "type": "related_to"
    },
    {
      "source": "梦",
      "target": "死人",
      "type": "features"
    },
    {
      "source": "梦",
      "target": "死尸",
      "type": "features"
    },
    {
      "source": "老头",
      "target": "小人形状",
      "type": "creates"
    },
    {
      "source": "老头",
      "target": "大坑",
      "type": "leaps_into"
    },
    {
      "source": "坑",
      "target": "干枯尸体",
      "type": "contains"
    },
    {
      "source": "尸体",
      "target": "没有皮肤",
      "type": "lacks"
    },
    {
      "source": "家",
      "target": "三线厂工人",
      "type": "belonged_to"
    },
    {
      "source": "军工厂",
      "target": "深山老林",
      "type": "relocated_to"
    },
    {
      "source": "爸爸",
      "target": "高中",
      "type": "sent_to"
    },
    {
      "source": "高中",
      "target": "大学",
      "type": "aimed_for"
    },
    {
      "id": "33",
      "source": "晚自习",
      "target": "溜出校门",
      "type": "led_to"
    },
    {
      "id": "34",
      "text": "我读的高中在县城的七里河，一般又叫大东关，大东关再过去，稍远一点驻扎着一个团部，我有个五叔在那做炊事员，眼看逛着逛着，我就快到团部的驻地了，那天是个月亮夜，心想干脆就去五叔那凑合一晚上算了。",
      "level": 2
    },
    {
      "id": "35",
      "text": "这时候突然发现路中间有一只白色的兔子，非常可爱，趴在那儿一动不动，我一时起兴，就想去抓它，谁知道我一追它就跑，我停下来兔子也停下来，一会儿功夫，我俩就跑离了大路，七拐八拐跑进了河沟，直到一栋挺新的瓦房挡在面前，跟着那白兔子进了没人的屋子里，兔子顺着一个洞跳了进去找不着了，我这才发现自己迷路了，离那团部的驻地挺远，到处黑乎乎的啥也看不清楚，心里有点发毛，但还没感到害怕，只是费劲的辨别方向，想不起来自己这是钻到了哪块地头？",
      "level": 2
    },
    {
      "id": "36",
      "text": "本来是个月亮夜的晚上，这时候变得无星无月的，到处漆黑一团，我顺着来路，费了差不多半夜，才摸到了团部，还好，五叔睡得轻，我叫了几声，就起床给我开了门，我说起白兔子的事儿，五叔皱着眉头说：这哪是小白兔啊，这就是-仙皮子。俗话说，千年黑、万年白。你能碰到白皮子，说明你有福气。",
      "level": 2
    },
    {
      "id": "37",
      "text": "我赶忙问五叔啥是仙皮子？我咋没有听说过呢。",
      "level": 3
    },
    {
      "id": "38",
      "text": "五叔拍拍我脑袋：你碰到那个是假白兔，又叫仙皮子，白的仙皮子最少见，咱这儿还从来没人碰到过，你这可是第一个，老一辈的人知道，月亮夜里碰到假白兔，往往都是要发财、走好运的意思，那白兔躲进的屋里，嘿嘿，肯定有，肯定有大宝贝藏着，说了你也不懂，快点去睡吧！",
      "level": 3
    },
    {
      "id": "39",
      "text": "第二天一大早，五叔问明白我碰到假白兔的大致地方，就骑上单车送我回学校，路上一言不发，弄的我满腹狐疑，到了校门口，我跳下车子，忍不住问：五叔，你咋一句话都不说呢，是不是我说的那地方不对？你要是去挖什么宝贝的话，带上我好不好？不是你说我有福气吗？",
      "level": 2
    },
    {
      "id": "40",
      "text": "五叔没吭气，挥手叫我快点回学校去，铁青的脸色看起来很阴沉，不过我从小就和他混的熟，一点都不怕，缠磨着要他答应我，最后五叔说道：那地方不行，你不能去，老实跟你说，那栋房子是个凶宅，根本没人敢靠近，算你小子命大，昨晚没死在那儿，我可告诉你，往后再来团部找我，绝对不准走离大路，听着了，要不然我就揍你！",
      "level": 2
    },
    {
      "id": "41",
      "text": "后来，又过了三四天，我越想越觉得事情太蹊跷，我咋就会碰到这事儿呢？刚好明天是星期天，一个月就这一天可以休息，于是我早早吃了晚饭，就直奔团部找我那五叔去了。",
      "level": 2
    },
    {
      "id": "42",
      "text": "到地方的时候五叔不在，我在门口等了老半天，才看见五叔和一个陌生人一起，骑了辆单车从外面回来，五叔看到我在门口等他，明显愣了一下，那陌生人倒是沉得住气，简单招呼了声，就拉着五叔进屋里一起喝酒。",
      "level": 2
    },
    {
      "id": "43",
      "text": "这陌生人很怪，我一看见他就觉得不自在，穿的也不咋样，那时候像我这样的学生都时兴穿绿军衣，大裆裤，黄胶鞋，我穿的是白球鞋，刚买的回力牌，而这陌生人上面裹了件灰西装，配着下面的绿色大裆裤，衣服就算干净也显得很邋遢，浑身上下还透出股子臭气，不是汗臭味，而是冰凉的那种死臭味，五叔也不在意，和他一杯接一杯的喝酒说话。",
      "level": 2
    },
    {
      "id": "44",
      "text": "后来我听明白了，原来他们今晚就要去那栋房子里找宝贝，我来的正是时候，顿时来了精神，死乞白赖的要跟上他们一起去。",
      "level": 2
    },
    {
      "id": "45",
      "text": "那陌生人听五叔称呼他叫陈脸子，是十里八乡比较神秘的一个窖客，我们那的乡下，家家都挖有红薯窖，窖客，就是挖红薯窖很内行的人，只不过听五叔的意思，这个陈脸子窖客，不单挖窖子本事不小，还会很多别的玩意儿，当时不知道，要是现在我就会明白，这陈脸子也就是个盗墓贼！",
      "level": 2
    },
    {
      "id": "46",
      "text": "陈脸子劝五叔带上我算了，两个大人还能看不住我这十六七的小屁孩儿？煞有介事的拍胸脯担保我坏不了事儿，五叔想着我是被仙皮子引去的，应该挺有福气，于是也就勉强同意了。",
      "level": 2
    },
    {
      "id": "47",
      "text": "陈脸子和五叔聊了差不多三四个小时，天也黑透了，一人一个编织袋背着出了门，我换上五叔的一双黄胶鞋，跟在后面，朝我到过的那栋房子走去，顺着河沟的另一边是一串矮山坡，不紧不慢地走了二个多小时才走到头，这串矮山坡高大了许多，月光映衬下，庄严肃穆，那栋没人住的空房子就盖在河水流出来的山脚下。",
      "level": 2
    },
    {
      "id": "48",
      "text": "我问五叔啥是仙皮子，怎么会有福气才能碰到呢？",
      "level": 3
    },
    {
      "id": "49",
      "text": "五叔说：仙皮子是咱这的土话，这东西是讲缘分的，一般都出现在大墓的周围，跟着仙皮子要么可以找到大墓的暗门，要么就能找到兵荒马乱时候的藏宝，反正碰上仙皮子都是好事儿！",
      "level": 4
    },
    {
      "id": "50",
      "text": "陈脸子也说：是啊，老五，干我们这行的，听说还有人专门养小白兔、大公鸡的，不过我倒还没听说过谁，有用这些东西找着什么大墓的。",
      "level": 4
    },
    {
      "id": "51",
      "text": "进了屋子，我们三个都感觉这房子冰凉、漆黑、大气，转了一圈几乎要迷路，陈脸子用的是火折子照亮，这玩意儿不少人都会做，但陈脸子这个质量明显要好许多，使劲吹一口，腾起的火苗不大不小的，我就问他为什么不用手电筒呢？",
      "level": 2
    },
    {
      "id": "52",
      "text": "陈脸子没理我，脸上的汗珠子顺着脑门子往下淌，低声问五叔：老五，你只说这是个凶宅，咋不说清楚呢！这么厉害的幌子，恐怕只有我师傅亲自来才行。你看，那房梁上！",
      "level": 2
    },
    {
      "id": "53",
      "text": "我和五叔抬头一看，顿时吓了一大跳，知道我看到了什么吗？",
      "level": 2
    },
    {
      "id": "54",
      "text": "我们这儿有个风俗，如果有人在自家的屋里上吊自杀，就要在房梁上竖着砍一道痕迹，如果是在别人的屋子里上吊自杀，就要在房梁上横着砍一道痕迹。",
      "level": 1
    },
    {
      "id": "55",
      "text": "这间房子呢，以后就算是凶宅，这道刀痕也有和吊死鬼分割的含义在里头，意思是房子已经弄成凶宅了，以后就不要在屋子里闹事了。",
      "level": 2
    },
    {
      "id": "56",
      "text": "而我们面前这粗大的房梁上，三竖两横，五道很深的刀痕张着口子，告诉我们这儿曾经吊死过三个主人和两个客人！恐怕是凶宅中的顶尖极品了。",
      "level": 2
    },
    {
      "id": "57",
      "text": "到了这般田地，五叔只好问我，引我来那白兔是跳到哪儿消失不见的？听他的意思是找出那地方看看，没发财希望就早点回家，省得夜长梦多，招惹上什么不好的东西。",
      "level": 2
    },
    {
      "id": "58",
      "text": "我迟疑了一会儿，就带着他俩找到了那地方，原来是一个地洞，很普通的那种洞，除了比兔子洞大了几倍外，没有什么出奇的地方。",
      "level": 2
    },
    {
      "id": "59",
      "text": "陈脸子不愧是个窖客，仔细辨认了一会儿，就告诉我们这个洞肯定是人挖出来的，绝不会是天生的，执意要钻进去看看。",
      "level": 2
    },
    {
      "id": "60",
      "text": "五叔操心我的安全，说什么也不肯下去，一时三个人僵在了洞口。",
      "level": 2
    },
    {
      "id": "61",
      "text": "正在惊疑不定时，却传来喵呜——一声尖锐的猫叫，把我们三个绷紧的神经都快叫断了。",
      "level": 2
    },
    {
      "id": "62",
      "text": "一只大黄猫蹲在屋角瞅着我们，个头颇大，五叔颤抖着声音说：狗来富，猫来孝，猫叫没好事呀。",
      "level": 2
    },
    {
      "id": "63",
      "text": "陈脸子苦着脸说：是啊是啊，狗来富，猫来孝，人要死了，身子才会发出一股子臭味，只有猫能闻到，这猫要来行孝了，总不会是应在我们身上吧？",
      "level": 3
    },
    {
      "id": "64",
      "text": "黑暗中，猫眼绿油油的闪着凶光，看的我们心里发毛。",
      "level": 2
    },
    {
      "id": "65",
      "text": "五叔忍不住地问：那现在咋办？不行咱们回去吧，我也不知道这屋子会死过这么多人，再说了，还都是吊死在这里，恐怕不是什么好事儿！",
      "level": 2
    },
    {
      "id": "66",
      "text": "陈脸子犹豫了一下，接着说：噢，等等，老五你看那猫的眼睛，是往上翻着还是往下翻着？我咋觉着这猫眼是往上翻着看呢？",
      "level": 2
    },
    {
      "id": "67",
      "text": "我仔细看了看，说实话，真看不出来，猫眼圆圆的不像人眼有白眼珠子，谁知道它是看天还是看地呢？正想嘲笑一下，却听五叔叫道：西子快跑！一把揪着我衣裳就往后扯。",
      "level": 2
    },
    {
      "id": "68",
      "text": "陈脸子已经跑了出去，五叔在后面推着我没命地跟着，前面陈脸子手上那跳跃的红点忽然停住不动了，我和五叔终于追上了他，只见墙上嵌着一盏灯，黑色的灯！",
      "level": 2
    },
    {
      "id": "69",
      "text": "陈脸子顿时被吓得面无人色，根本不敢去碰那黑灯，带着我们，小心翼翼地绕开黑灯，溜之大吉。",
      "level": 2
    },
    {
      "id": "70",
      "text": "这栋旧宅子也是古怪，不知道宅子的主人出于什么目的，把房子修的曲折离奇，千门万户的连环缠绕在一起，我们费了老大力气，没命地跑了好久，才出了旧宅子，站在河沟边直喘粗气。",
      "level": 2
    },
    {
      "id": "71",
      "text": "趁这功夫，我就问五叔：刚才我正看那猫眼时，五叔你为啥拉着我快跑呢？我没发现什么不对头的地方啊？",
      "level": 3
    },
    {
      "id": "72",
      "text": "陈脸子接过话头：那个猫眼是往上看还是往下看，区别很大的，这屋子邪气的很，所谓凶宅贼猫，死人憋宝。",
      "level": 3
    },
    {
      "id": "73",
      "text": "这凶宅里的猫眼往上翻，那是死人在看你还有多久阳寿，往下翻则是大吉大利，快点开挖，憋了多年的宝贝该咱们拿！",
      "level": 4
    },
    {
      "id": "74",
      "text": "刚才我是看出来那猫眼往上翻的，就知道这一趟要白跑了。",
      "level": 4
    },
    {
      "id": "75",
      "text": "更何况看见黑灯，更可怕了，幸亏咱们跑得快，啥也别说了，快回家吧！",
      "level": 4
    },
    {
      "id": "76",
      "text": "然后我们三个默不作声地回了五叔的屋里，天也马上就要大亮了，我们好好睡了一大觉，这件事情就一直压在我心底，接下来的高考就快要到了，繁重的复re把我的大部分时间都占得满满的，也就没有再去五叔那里玩耍，都快忘了这档子事儿了。",
      "level": 2
    },
    {
      "id": "77",
      "text": "如愿以偿地升入了大学，还不错，北京的一个大专院校录取了我，转眼就过去了两年，我马上就要毕业了。",
      "level": 2
    },
    {
      "id": "78",
      "text": "暑假里，我总觉得心里头搁了件事儿没解决，在家无聊地呆了几天，终于下定决心回老家去看看五叔。",
      "level": 2
    },
    {
      "id": "79",
      "text": "我已经二十多岁的大人了，于是一个人买了票和爸妈打声招呼后，径自回了老家，直接去找五叔。",
      "level": 2
    },
    {
      "id": "80",
      "text": "五叔看见我很高兴，直夸我两年不见，长成这么大个娃儿了，还考去了北京读书，了不起！",
      "level": 2
    },
    {
      "id": "81",
      "text": "吃罢饭，我心里一直惦记那大东关的凶宅贼猫，就问五叔后来有没有什么稀奇事发生，这才知道，不甘心的陈脸子，后来又约了五叔私下去过一次，仍然是一无所获，空手而归，还差点把命给弄丢了。",
      "level": 2
    },
    {
      "id": "82",
      "text": "五叔讲故事一样讲给我听，当然是在我买了两瓶卧龙玉液外加两个小菜之后……",
      "level": 2
    },
    {
      "id": "83",
      "text": "下面就是五叔告诉我的事情，比起那天我们三个人被吓跑的经历，更多了几分凶险。",
      "level": 2
    },
    {
      "id": "84",
      "text": "那是一个酷热的白天，黄昏时下了阵子猛雨，雨一停，就见陈脸子来找我，还准备了不少下墓的东西。",
      "level": 2
    },
    {
      "id": "85",
      "text": "这人很犟，认死理儿，执意要再去一趟，郑重地给我讲了很多有关盗墓的窖客规矩，也很有趣，按照他说的，祖传下来的盗墓有四个门派，穿山掘岭为始祖，发丘摸金是分支。",
      "level": 2
    },
    {
      "id": "86",
      "text": "干盗墓这一行，有些情况是非常凶险的，总的来讲，有两种情况威胁极大，一种是鹧鸪穿山甲，发丘天官印，墓里黑灯鬼打墙，说的是发丘一派的盗墓本领，都源自古代的穿山术，那些古代的盗墓者经常扮做入山修行，暗中却以盗墓为生，在山中时遇上同道中人，就用嘴吹出鹧鸪的叫声相互联络，不仅找墓本领天下无双，而且还是破开大墓机关的高手，可谓盗墓一派的全才，可惜的是后来日渐没落。",
      "level": 2
    },
    {
      "id": "87",
      "text": "其后分支出发丘一派，找墓时擅长二指发丘，被曹操授以发丘天官印，渐成一派的标志，这两派渊源极深，不约而同地认定，如果在墓里碰到黑灯，必然会遭逢鬼打墙，死无葬身之地。",
      "level": 3
    },
    {
      "id": "88",
      "text": "另外一种凶险的情况是掘岭四海游，摸金校尉留，鸡鸣五鼓鬼上身，则指的是掘岭和摸金两派，同样历史悠久。",
      "level": 2
    },
    {
      "id": "89",
      "text": "和穿山发丘的找墓理论不同，掘岭摸金的手法也大相径庭。",
      "level": 3
    },
    {
      "id": "90",
      "text": "其中掘岭剑侠最为神秘，和春秋战国时候的剑士侠客有关，最后走上四海巡游之路，基本算脱离了盗墓这一行。",
      "level": 4
    },
    {
      "id": "91",
      "text": "而传下来的摸金门人则代代都有杰出人才，把分金定穴、金盘观山的本领发扬光大，同样到了汉末时候达到顶峰，被曹操封为摸金校尉。",
      "level": 4
    },
    {
      "id": "92",
      "text": "两派师出一门，掘岭门规上明文规定，鸡鸣五鼓或者墓中火烛熄灭，都是不可盗墓的标志，必须立即停手，否则尸变化煞，被鬼上身，将会血流成河。",
      "level": 4
    },
    {
      "id": "93",
      "text": "陈脸子是个穿山发丘的高手，他说遇到鬼打墙比起鬼上身要严重的多，鬼上身不过是尸煞作怪，碰到灯灭就会跳出来咬人，十个墓里总有一个会出现。",
      "level": 2
    },
    {
      "id": "94",
      "text": "并非碰上就死，而鬼打墙却是必死无疑，对手是看不见摸不着的无形力量，据他师傅说，在墙中还有非常邪恶厉害的鬼怪。",
      "level": 3
    },
    {
      "id": "95",
      "text": "那天我们刚进了鬼宅子，就看到了曾经见过的那盏黑灯，陈脸子嘟哝着灯定是给人动过位置，一个劲摇头说今天开张不顺。",
      "level": 2
    },
    {
      "id": "96",
      "text": "我最先发现那个没敢下去的洞口猫着一人，蜷缩着身子一动不动，姿势很是怪异，陈脸子也算早有准备，从腰里摸出根红色丝线拿手上，另一头拴着个小玉坠，晃晃悠悠走过去看，走了几步就回头说：这不是个活人，是个喜材。",
      "level": 2
    },
    {
      "id": "97",
      "text": "奇怪，怎会摆在屋子里？这玩意儿应该埋地下才是！",
      "level": 3
    },
    {
      "id": "98",
      "text": "我们这儿一般把棺材叫做喜材，没人会觉得是个晦气的东西。",
      "level": 3
    },
    {
      "id": "99",
      "text": "陈脸子仔细看过那喜材后，满头是汗：老五啊，我是咋也没想到咱会碰上这种喜材，可是来头不小，这他娘的是个蹲葬棺，上头还刻的有殓文！",
      "level": 2
    },
    {
      "id": "100",
      "text": "我认不了几个，就这水平，比我高十倍都不止，这次咱俩是要阴沟里翻船了。",
      "level": 3
    },
    {
      "id": "101",
      "text": "虽然不懂这喜材怎么是个蹲葬棺，但是看那模样阴森森的，是个不祥之物，我也有点害怕，只好凭感觉跟着陈脸子摸索，顺着走廊门厅翻检有没有什么机关暗道之类的东西，却突兀的出现了四个人形棺，黑黢黢的挡在四个门口里，比刚才看到那个更大了一圈，面向自己的一面上，还有两个拳头大的小黑洞，黑得异常。",
      "level": 2
    },
    {
      "id": "102",
      "text": "陈脸子当时就吓懵了，扑通跪在了地上磕头祷告：祖师爷祖师爷，小的鬼迷心窍，惊了您老人家清静，实在是万分万分后悔啊，求求您高抬贵手，饶过小的吧，可怜小人上有高堂，下有儿女，今后再也不敢冒犯您了！求您饶命啊！",
      "level": 2
    },
    {
      "id": "103",
      "text": "我当时可是听得目瞪口呆，这几口喜材有那么唬人吗？",
      "level": 2
    },
    {
      "id": "104",
      "text": "喜材呢，也分个三六九等，我们碰到只不过是个杨木套棺，就是那种九寸板的樟木或者檀木等质地坚硬的木材，外面又套了个杨木的棺材套，按我们这厚葬的习俗来看，属于中等水平，难得的是一下出现五个，还做成人的模样，这就透出些蹊跷。",
      "level": 2
    },
    {
      "id": "105",
      "text": "陈脸子拜了几拜，却听得隔壁不断传来咚咚的脚步声，好像很多人都在往这个方向奔跑，重重围了上来，可把我给吓得不轻，着急的一劲催他：老脸子别扯淡了！快他娘起来，咱们再不跑，真想死到这啊？",
      "level": 2
    },
    {
      "id": "106",
      "text": "陈脸子摘下脖子里挂的所有项链还有一些护身符，拿在手上，看着我说：这五个喜材里各有一具尸体，采用的都是蹲葬方式，这种布局是有名的五鬼轧尸局，那五个吊死鬼是被逼死在这的，下头肯定是埋着什么大墓，只不过这大墓不是寻常意义的墓葬，最多只能算是个镇尸冢，葬在里头的家伙死后永远不安生，活不过三十岁还要祸延数代，我师傅当年可是严厉警告过我，像这样的五鬼轧尸局，碰上就死！",
      "level": 2
    },
    {
      "id": "107",
      "text": "周围奔跑的脚步声安静了下来，火折子也在一瞬间黯淡，黑暗中，我俩一下子冷静下来，既然知道了这是咋回事，现在就要想办法脱身了。",
      "level": 2
    },
    {
      "id": "108",
      "text": "陈脸子低声说道：想不到居然有五鬼轧尸棺，这下头埋着的不祥之物，闹不好是个妖怪！",
      "level": 2
    },
    {
      "id": "109",
      "text": "现在才知道这么多年，为啥好几个道上的好手，都在这大东关凭空没影了，看来这儿还真是个禁地。",
      "level": 3
    },
    {
      "id": "110",
      "text": "他娘的既然左右是个死，不如挑了这马蜂窝同归于尽！老五，咱们干吧！说到后来，陈脸子的语气已经是恶狠狠了许多亡命徒的狠劲。",
      "level": 3
    },
    {
      "id": "111",
      "text": "我对这些墓葬东西比起陈脸子，懂那点儿可是差太多了，知道弄不好会把老命撂在这后，肠子都快悔青了。",
      "level": 2
    },
    {
      "id": "112",
      "text": "猫眼跟狼眼一样，据说可以采光。一到黑夜，就会发出绿光，我听到一阵含糊的声音，那是猫的喉咙里发出的低啸。",
      "level": 1
    },
    {
      "id": "113",
      "text": "陈脸子冷冷吩咐道：我现在要破他这个五鬼轧尸棺，成功的把握老实讲我没多少，不过就是比等死强点罢了，老五你必须照我说的去做，明白？",
      "level": 2
    },
    {
      "id": "114",
      "text": "我当时就傻了，站在那儿，看着陈脸子从怀里掏东西，有黄裱符、小旗、几块散碎的旧玉，一一在地上摆好，还拿出把寒光闪闪的短刀，噌的一声，就割烂了手指头，逐一在这堆物件上面滴了血。",
      "level": 2
    },
    {
      "id": "115",
      "text": "陈脸子要我做得很简单，就是拿这几块滴了血的旧玉，往每个喜材的黑洞口里塞上一块就成，我想想也不是很难，就接了过来。",
      "level": 2
    },
    {
      "id": "116",
      "text": "陈脸子告诉我，这种不起眼的旧玉，叫做死玉，在识货的人看来，这种玉属于品相极差的那种烂玉，但在盗墓贼眼中这可都是宝贝，因为这些散碎的死玉，基本上都出自陈年老墓，见光前已经在地下埋了不知多少年，把墓中的尸气和阴气一股脑吸收在玉内，现在染上了人血，拿来克制喜材里头五鬼轧尸的尸气，是极好的宝贝，阴气和尸气都会被这块死玉吸附，若没有这些死玉，我俩当时就一命呜呜那是必然的。",
      "level": 2
    },
    {
      "id": "117",
      "text": "准备妥当，陈脸子干巴巴地对我说：老五啊，咱俩认识时间不长，谈不上谁害谁，这次也怪我心贪，没有估计到凶宅里的危险。",
      "level": 2
    },
    {
      "id": "118",
      "text": "如果运气够好，逃得出去，那是咱命大，往后我是洗手不干了，要是咱们该死绝到这儿，你也别怨我，黄泉路上我背着你就是了。唉！",
      "level": 3
    },
    {
      "id": "119",
      "text": "陈脸子顿了顿接着说道：我这次破局，必定会折了阳寿，暴死当场的可能都有，这些猫我刚才注意看了一下，都不是些善类，甚至还有些吃人肉的老猫，其中有些猫眼下翻的吉物，我一时半会也说不清，只能告诉你，凭我的本事，拖个一时三刻，让你逃跑还是可以的。",
      "level": 2
    },
    {
      "id": "120",
      "text": "我被陈脸子的悲壮语调说的很黯然，瞅着他，啥话也讲不出来。",
      "level": 2
    },
    {
      "id": "121",
      "text": "这时候，火折子像是被谁吹了一口气，扑的一下腾起了火焰。",
      "level": 2
    },
    {
      "id": "122",
      "text": "陈脸子大喝一声：还不快跑！一巴掌就把我推了出去……",
      "level": 2
    },
    {
      "id": "123",
      "text": "我冷不防被推的一个踉跄，看那最大个子的喜材，盖子似乎有点松动，冒出阴冷的气息越发凝重，强大的压力让我迈不出脚步，呼吸都觉得困难。",
      "level": 2
    },
    {
      "id": "124",
      "text": "只见陈脸子吞下一张黄裱符，捏起血浸的旧玉，一步步向阴气冒出的地方挪去。",
      "level": 2
    },
    {
      "id": "125",
      "text": "喜材里，一个束发男尸抬着头一动不动，皮肉干枯，色泽黝黑无比，微微张开的嘴里，哧哧冒着黑色寒气和扑鼻的尸臭，陈脸子费劲的把血玉往那干尸嘴里塞，直到旧玉完全塞进干尸嘴里，我才稍稍好受了些，赶忙去那几个喜材跟前，往里塞染了血的死玉。",
      "level": 2
    },
    {
      "id": "126",
      "text": "还好，陈脸子的办法很对路子，喜材里刚塞进去死玉，就爆开了盖子，里头的男尸迅速萎缩，皮肤和骨骼间的肌肉像是突然融化，变成一层厚厚的黑皮贴着骨头，萎缩的一动不动，整个化成一张狰狞的黑皮。说不出的一种诡异神态，很有点如释重负的感觉。",
      "level": 2
    },
    {
      "id": "127",
      "text": "可惜我就倒霉了，喉咙里越来越难受，沙哑刺痛，似乎有不少东西，紧紧贴在喉管的管壁上，一只大手要从肚子里拼命地伸出来，后面还有无数的小手在拉扯心肺，让我根本喘不上气来，只能双手捏住脖子，痛苦的在地上打滚。",
      "level": 2
    },
    {
      "id": "128",
      "text": "就在我掐着脖子蹬着腿挣命时，却见陈脸子瘸着一条腿爬了过来，手里拖着盏黑灯，一脸疲惫。",
      "level": 2
    },
    {
      "id": "129",
      "text": "陈脸子喃喃的好像是说：这是黑焰灯，黑焰灯……就是这个词。",
      "level": 2
    },
    {
      "id": "130",
      "text": "黑焰灯，没错！我现在也不太懂是啥意思，难道还有黑色的火焰不成？那还叫什么灯，照给谁看啊？",
      "level": 3
    },
    {
      "id": "131",
      "text": "我当时也不懂是啥意思，但是自从这黑灯离近，喉咙里感觉舒服了许多，直到沙哑的感觉终于没了，高兴得一翻身爬了起来。",
      "level": 2
    },
    {
      "id": "132",
      "text": "陈脸子拖着的是一盏黑色的灯，老式铜灯，底座是一个人跪着高举双手，顶部是一个圆碗形状的灯盏，发出暗金色的冷光，有点像自己平常使用的旱烟那么长，我当时在心里想，就是精致了许多。",
      "level": 2
    },
    {
      "id": "133",
      "text": "目不转睛地看着这盏奇怪的黑灯，我和陈脸子都不吱声了，圆形的灯碗里空无一物，连个灯芯都没有，而且整个灯的颜色太黑，黑得让人心慌，我想起陈脸子说的鬼打墙的事，更加忍不住直想逃跑。",
      "level": 2
    },
    {
      "id": "134",
      "text": "咱们南阳，地理上来看，是位于秦岭山麓，汉水源头，自古都是豫西南的腹地。",
      "level": 2
    },
    {
      "id": "135",
      "text": "陈脸子小声说，这黑焰灯的秘密，据说和当年的蒙古人有关，元朝时，蒙古人如狼似虎，血洗欧亚大陆，传说这黑焰灯当时可以唤醒战死的士兵，重新投入死亡战场，那不就是个战无不胜的鬼军团吗？",
      "level": 2
    },
    {
      "id": "136",
      "text": "我可不信这一套胡说八道，陈脸子苦笑着解释，后来朱元璋赶走鞑子后，听说这黑焰灯就被刘伯温给毁了，我师傅<bos> was told to me by my master, and from then on, I have paid close attention to old bronze lamps and similar items when digging, but I never expected to encounter one here.",
      "type": "told_by"
    },
    {
      "id": "137",
      "text": "我被陈脸子说的一愣一愣地扭头看看他，觉得有点不对劲，仔细一瞧，差点没把我吓趴下！",
      "level": 2
    },
    {
      "id": "138",
      "text": "原来在陈脸子的背上，不知啥时候，轻飘飘地趴了个黄衣女人，低着头，长长的黑发披散在两边，白惨惨的脸上毫无表情，两个白眼圈里，全是黑眼珠子，正眨也不眨地看着他，随着他说话和动作左右摆动，根本就没有改变视线的意思。",
      "level": 2
    },
    {
      "id": "139",
      "text": "我还以为是自己一时眼花，忍不住使劲闭上了眼睛，准备再仔细瞧瞧，而陈脸子还一点都没有觉察到背上多了个女人。",
      "level": 2
    },
    {
      "id": "140",
      "text": "我刚闭上眼睛，就听见两声短促地尖叫，睁开眼睛时，只见陈脸子已经瘫地上了，几只老猫跳他背上对那黄衣女人又撕又咬，猝不及防，尖叫两声跌下了陈脸子的身上，立刻被黑焰灯吸了进去。",
      "level": 2
    },
    {
      "id": "141",
      "text": "陈脸子好久才醒过来，脖子上全是黑手印，这下可给箍的不轻，恐怕再多几分钟，必死无疑！",
      "level": 2
    },
    {
      "id": "142",
      "text": "清醒过来后我陪着他喘了半天气，想想此地不宜久留，赶忙往外跑，我这辈子从来没有见过鬼，这下算是开了眼界。",
      "level": 2
    },
    {
      "id": "143",
      "text": "这黑焰灯恐怕真的有号令阴曹厉鬼的能力呢！",
      "level": 3
    },
    {
      "id": "144",
      "text": "从那鬼宅子里头跑出来时，天才蒙蒙亮，后来陈脸子回去后，听说大病了一场，躺了三个多月才下地。",
      "level": 2
    },
    {
      "id": "145",
      "text": "五叔讲完这事儿，酒也喝得差不多了，哈欠连天地倒头睡下，我反倒是给这一波三折的惊险事儿刺激的半夜都睡不安生，不过我是个坚定的无神论者，压根不信这世界上会有什么鬼怪，一直琢M那黄衣女鬼到底是怎么回事儿？",
      "level": 2
    },
    {
      "id": "146",
      "text": "刘伯温可是朱元璋的头号谋士，这五鬼轧尸局恐怕就是他的杰作，黑焰灯和黄衣女人，还有刻着殓文的蹲葬棺，莫非真的是一个镇尸冢，下头埋着什么吓人的秘密不成？",
      "level": 2
    },
    {
      "id": "147",
      "text": "第二天我问五叔，那藏在山里的旧宅子现在怎么样了？",
      "level": 2
    },
    {
      "id": "148",
      "text": "五叔却说，去年发大水，早淹了，现在在河底，谁也看不着……",
      "level": 3
    },
    {
      "id": "149",
      "text": "一说两瞪眼，我就打消了去瞧瞧的念头。",
      "level": 2
    },
    {
      "id": "150",
      "text": "回北京后忙着毕业分配的麻烦事儿，好久没和五叔再联系，这事儿也就慢慢淡忘了。",
      "level": 2
    },
    {
      "id": "151",
      "text": "毕业后，还算差强人意，我在北京的一家外企找了份工作，同时也交往了一个条件相当不错的女朋友，她叫韩叶娜。",
      "level": 2
    },
    {
      "id": "152",
      "text": "长得很漂亮，性格开朗善良，以我的个人条件，已经觉得相当满足了。",
      "level": 2
    },
    {
      "id": "153",
      "text": "现在说说我个人条件吧，长相比较出众，当然不是英俊到需要去整容那种极端，而是比较瘦削。",
      "level": 2
    },
    {
      "id": "154",
      "text": "个子又高，头发飘在后脑勺上，属于那种从背后就能猜出前面长相的人，但问题就偏偏出在这里。",
      "level": 2
    },
    {
      "id": "155",
      "text": "走在后面看见我的人，都会以为我一定是戴副近视眼镜，没几根胡子，整天熬夜，面色苍白，去电脑城闭眼就能抓一把的俗人，但走上来回头一印证，才猛然发现我根本不是这般样子。",
      "level": 2
    },
    {
      "id": "156",
      "text": "我眼睛细长，细长到总是给人眯缝着眼的感觉，这样一来，就显得黑眼珠子特别多，再加上小时候不老实，摔跤把下巴磕的往上翻着，连累得嘴角也是往上翘起。",
      "level": 2
    },
    {
      "id": "157",
      "text": "一眼望去，就是个正在嬉笑的家伙，黑眼珠子转转，又有点高深莫测。",
      "level": 3
    },
    {
      "id": "158",
      "text": "所以靠这副极有亲和力的微笑面孔，我的人缘不错，朋友还算不少，谈起女朋友来，更是得心应手。",
      "level": 2
    },
    {
      "id": "159",
      "text": "认识漂亮的女朋友，让我很是开心了一段日子，可惜常言说得好：天有不测风云，人有三衰六旺。",
      "level": 2
    },
    {
      "id": "160",
      "text": "那次出差去江西鹰潭公干，回来后却让我的生活发生了天翻地覆的变化。",
      "level": 2
    },
    {
      "id": "161",
      "text": "要说也是我自己纯属多事。",
      "level": 2
    },
    {
      "id": "162",
      "text": "龙虎山这样的风景名胜地，测字打卦的人不计其数，可唯一吸引住我的就唯独这一个测字先生。",
      "level": 1
    },
    {
      "id": "163",
      "text": "大约六十岁上下的样子，面容清癯，身上穿的长褂也一尘不染，或许我就是被这古装打扮吸引了，他见我走过来，对我一笑，招呼我坐下，问我：年轻人，要测字还是求签啊？",
      "level": 2
    },
    {
      "id": "164",
      "text": "我说：老先生，我先测个字吧。",
      "level": 2
    },
    {
      "id": "165",
      "text": "测字先生点点头，递给我一张纸和一支笔，让我把要测的字写在上面。",
      "level": 2
    },
    {
      "id": "166",
      "text": "我想我还过得比较顺，不如测测女朋友，于是提笔在纸上随便写了个女朋友的名字韩叶娜中间那个叶字。",
      "level": 2
    },
    {
      "id": "167",
      "text": "测字先生一看我写了个-叶-字，就问：你这测的是一个女人吧？",
      "level": 2
    },
    {
      "id": "168",
      "text": "我心下暗自吃惊，点头称是，测字先生面色变得相当难看，沉吟了一下接着说道：这树叶不是大树的主干，自古红花都还要绿叶来配，所以我断定是个女人，但实在可惜，这个女人不是已经死了，就是即将亡故，年轻人你可千万要节哀顺便啊！",
      "level": 2
    },
    {
      "id": "169",
      "text": "我不由心里偷笑，真是狗屁不通。",
      "level": 2
    },
    {
      "id": "170",
      "text": "刚才我还和女朋友通过电话，哪能这么快就死了，看来这算命佬是要把活人咒的快死才能骗钱，顿时兴趣大减，随口敷衍：那你接着断吧。",
      "level": 3
    },
    {
      "id": "171",
      "text": "测字先生提笔在纸上写了一个繁体的-葉-字，指给我看：你看这世在草木之中，人恐怕是要早早的命丧黄泉。",
      "level": 2
    },
    {
      "id": "172",
      "text": "观此字的形状，和-弃-字-药-字都有些相似，所以据我断来，这女人以后必然会得怪病，而且用药不当，被意外地废弃于草木之中，自生自灭，真是怪事啊！",
      "level": 3
    },
    {
      "id": "173",
      "text": "年轻人，你再写一个字来，这次我要看看这女人为什么会这样，顺便测测你的命数， অবিলম্বে一定要随意写，什么都行。",
      "level": 2
    },
    {
      "id": "174",
      "text": "算命佬解释一个叶字有理有据的，顿时把我说的有点发毛，想到我名字里有个一字，这个字写法最为简单，而且一有第一的意思，算的结果必然不错，心里虽然明白君子问祸不问福的道理，但还是担心测出不好的结果来，于是就提笔在纸上写了个-一-字。",
      "level": 2
    },
    {
      "id": "175",
      "text": "测字先生对着我写的这个字，面色沉重，很久没有答话。",
      "level": 2
    },
    {
      "id": "176",
      "text": "我觉得纳闷，就连声催促：是好是坏您倒是给解释一下啊。",
      "level": 2
    },
    {
      "id": "177",
      "text": "测字先生叹了口气：小伙子，这个-一-字，是生的最后一笔，也是死的头一笔。",
      "level": 2
    },
    {
      "id": "178",
      "text": "一者，生末死初也，再加上你测的叶字，犹如一叶扁舟徜徉于汪洋之中，求生不得，求死不能。",
      "level": 3
    },
    {
      "id": "179",
      "text": "主有大凶，九死一生矣。",
      "level": 3
    },
    {
      "id": "180",
      "text": "我明白你刚测的那女人为什么会早早丧命了，实在和你是大有关系啊。",
      "level": 3
    },
    {
      "id": "181",
      "text": "我一听这话赶忙说：你算的准不准啊？别净吓唬老实人呵，要不然我换个字成吗？",
      "level": 2
    },
    {
      "id": "182",
      "text": "这-一-字不算，我名里还有个-西-字，咱就当测这-西-字怎么样？",
      "level": 3
    },
    {
      "id": "183",
      "text": "何况我女朋友也活得好好的，刚还通过电话呢！",
      "level": 3
    },
    {
      "id": "184",
      "text": "测字先生苦笑：字为心声，心乱则字乱，运衰则字衰，可一而不可再，你女朋友我断她已死，自有我的道理，这是改变不了的。",
      "level": 2
    },
    {
      "id": "185",
      "text": "观你面相，目长眉细，地阁上翻，一副早夭之相，但你这两个字却写得笔意饱满昂扬，毫无衰败之象，说明你身体健康，性格达观。",
      "level": 3
    },
    {
      "id": "186",
      "text": "如果能谨慎言行，万事顺其自然，勿强行逆施，多行善举，凭你的造化也许能渡过此劫。",
      "level": 3
    },
    {
      "id": "187",
      "text": "我听他这么说才算放心，就忙问怎么才能让女朋友一起避过灾祸，测字先生想了很久说道：若你名字里真有个西字，倒是一线生机。",
      "level": 2
    },
    {
      "id": "188",
      "text": "给你起名的也算个老手，一为乾元，西属幽金。",
      "level": 3
    },
    {
      "id": "189",
      "text": "你的阳身必须入于极阴多金之地，以金之力聚敛你的阳气，或许能遭逢转机，改变宿命中的缺陷。",
      "level": 3
    },
    {
      "id": "190",
      "text": "观你面相，今日之后变故迭起，将会有一番大的作为，奈何都是在生死边缘游荡，稍有不慎，就万劫不复！",
      "level": 3
    },
    {
      "id": "191",
      "text": "我们龙虎山有个张道临天师，你要是有缘碰到的话，可要好好向他讨教一下，不过可惜的是这位大师我也有年头没有见过他了，不知道在哪里，所以没有办法指点你。",
      "level": 2
    },
    {
      "id": "192",
      "text": "我历来胆大，不信怪力乱神之事，什么阳身必须入于极阴多金之地，想了又想也不懂是什么意思。",
      "level": 2
    },
    {
      "id": "193",
      "text": "人，大不了就是一死而已，万劫不复这类的鬼话也说的出口？",
      "level": 3
    },
    {
      "id": "194",
      "text": "说明他也许就是个跑江湖骗钱的，肯定是信口开河，自己怎能叫他给唬住了？",
      "level": 3
    },
    {
      "id": "195",
      "text": "但是看那测字先生的气度举止，又丝毫不似街边的那些骗子，居然说出了一直萦绕我心里的张天师的俗家名字，让我十分震惊。",
      "level": 2
    },
    {
      "id": "196",
      "text": "看来小时候我还真碰过这个人，不是老爹故意糊弄我，心烦意乱之下也不想再多说别的了，交了卦钱之后就匆匆忙忙地回了宾馆。",
      "level": 2
    },
    {
      "id": "197",
      "text": "第二天，我继续在龙虎山转悠，古悬棺一直是龙虎山旅游的看点，在仙水岩下搭建的70余米的攀登钢架下，我百无聊赖地混在人堆里留影纪念，龙虎山悬棺分布点多面广，我先后去了仙水岩、仙人峰和米仓峰等崖墓，看到了保存最完整的、带有封门板的悬棺及新的古悬棺群，但就是一直没有再听到和张天师有关的任何消息。",
      "level": 2
    },
    {
      "id": "198",
      "text": "直到最后快要离开前的几天，我的注意力全给山崖上的悬棺吸引去了，甚至不由自主地想爬上去看看峭壁上的悬棺里是个什么情况。",
      "level": 2
    },
    {
      "id": "199",
      "text": "一时冲动下，我还真找到个没人注意的角落。",
      "level": 3
    },
    {
      "id": "200",
      "text": "憋了口气，就开始手脚并用地往上爬，我的本意只是想离近了看看，瞧清楚后过个眼瘾就下来，谁知道越爬越高，到了最后，我发现自己已经很难一个人爬下去了。",
      "level": 3
    },
    {
      "id": "201",
      "text": "正在为难的时候，是张天师救了我，出现得很突兀，让我觉得像做梦一样，不怎么相信这一切会是真的，看来这张天师很像是一直在跟踪我，但是让我感觉糟糕的是，直到分别我也忘记了问他，为什么会给我取这个怪名字。",
      "level": 2
    },
    {
      "id": "202",
      "text": "张天师话很少，仔细观察了我的面相一会儿，抛下一本旧书就飘然而去。",
      "level": 2
    },
    {
      "id": "203",
      "text": "我依稀听到他似乎在叹什么缘起缘灭的鬼话，但根本没有在意，因为张天师给我的这本旧书，书名叫做《天渊山水纵横秘术》。",
      "level": 2
    },
    {
      "id": "204",
      "text": "重点讲述了观山望水，机关邪术的八字秘诀，虽然并非一个装帧精美的全本，却让我一下看入迷了。",
      "level": 2
    },
    {
      "id": "205",
      "text": "古人云：一命二运三风水，风水学说历来被视为左右命运的枢纽。",
      "level": 2
    },
    {
      "id": "206",
      "text": "什么是风水？气乘风而散，界水则止。聚之使不散，行之使有止，故谓风水。",
      "level": 2
    },
    {
      "id": "207",
      "text": "风水之法，得水为上，藏风次之。",
      "level": 2
    },
    {
      "id": "208",
      "text": "书的中心意思说的是观风望水要堪天道，舆地道。",
      "level": 2
    },
    {
      "id": "209",
      "text": "深奥的内容充满玄机，提到了很多五行八卦易数之类的名词，比如什么东方甲乙木，南方丙丁火，中央戊己土，西方庚辛金，北方壬癸水，什么乾、坎、艮、震、坤、兑、离、未等等，多有不解之处，对付着看只能明白个三四成。",
      "level": 2
    },
    {
      "id": "210",
      "text": "这本书看不出是什么年代的，也不知出自何人之手，应该算是《堪舆学》中的一个另类。",
      "level": 2
    },
    {
      "id": "211",
      "text": "它提出风水学的五大要素：龙、穴、砂、水、向，其本质必然是-气。",
      "level": 2
    },
    {
      "id": "212",
      "text": "那些所谓的寻龙，捉穴，察砂，觅水，定向，目的都在于察寻吉气，避开煞气。",
      "level": 3
    },
    {
      "id": "213",
      "text": "何谓-气-？气者，虚处来，实处止。",
      "level": 2
    },
    {
      "id": "214",
      "text": "民谚曰：阳宅照鞍重水，阴穴照尖重山。",
      "level": 3
    },
    {
      "id": "215",
      "text": "说的就是阳宅看重水势，要向照马鞍形的虚缺处，以求无阻地吸纳生元之气。",
      "level": 4
    },
    {
      "id": "216",
      "text": "埋葬死人的阴宅则看重山体的龙脉之气，墓穴吸收的生气和死气有很大讲究，一般都维持尖顶，种植松柏等尖顶植物或矗立石像。",
      "level": 4
    },
    {
      "id": "217",
      "text": "至于截腰、汲阴、担枕头、角冲、天堑煞的不利地形，尽力避免。",
      "level": 4
    },
    {
      "id": "218",
      "text": "书的大部分篇幅都用来讲述风水学的原理和奥秘，其中往往用青龙、白虎、朱雀、玄武来表示方位。",
      "level": 2
    },
    {
      "id": "219",
      "text": "比如说：凡宅左长流水，谓之有青龙；右边饶长道，谓之白虎轩；前有浅池塘，谓之朱雀临；后方靠丘陵，谓之玄武地，为最贵地。",
      "level": 3
    },
    {
      "id": "220",
      "text": "青龙宜紧不宜迫，案山要近明堂卧。",
      "level": 2
    },
    {
      "id": "221",
      "text": "风水宝地的构成，不仅要求四像毕备：玄武垂首，朱雀欣舞，青龙环绕，白虎驯伏。",
      "level": 3
    },
    {
      "id": "222",
      "text": "还要求北面主龙脉要绵延不绝，南方朝案山远近呼应，左右两侧护山拱卫，中间的明堂地势宽敞，且有流水瀑布环抱，玄武方向的山峰垂首不语，朱雀方向的山脉欣喜歌舞，左之青龙山势要起伏，右之白虎山形要柔顺，这样的环境就是风水宝地。",
      "level": 4
    },
    {
      "id": "223",
      "text": "正所谓：靠山起伏，高低错落，曲曲如活，中心出脉，穴位突起，龙砂虎砂，重重环抱，外山外水，层层护卫。",
      "level": 5
    },
    {
      "id": "224",
      "text": "然后讲述怎么依照天上星辰、地上山岭来点穴的诀窍秘术，文字愈发艰深晦涩，看得我眼花缭乱，头晕脑涨，只好不停地向后查。",
      "level": 2
    },
    {
      "id": "225",
      "text": "最后部分专门讲了伏羲八卦的潜藏秘密，分别用八个字来归纳出所谓的《天渊山水纵横秘术》，上篇核心是点穴，下篇重点在破穴。",
      "level": 2
    },
    {
      "id": "226",
      "text": "点穴八字很可能已经失传，书中介绍的很笼统，下篇破穴八字讲的很细致。",
      "level": 3
    },
    {
      "id": "227",
      "text": "怎么布阵破阵，怎么利用玄奥的阴阳杀局来左右气运命数的绝技，以及各种我都没有听说过的巫术、邪术都做了翔实的介绍。",
      "level": 3
    },
    {
      "id": "228",
      "text": "我心想这趟还算没白跑，有这个收获也是不小，所以离开龙虎山没多久，我就回到了北京，潜心钻研这《天渊山水纵横秘术》，好些日子过去了，命运有时侯真的像是在捉弄人，测字先生说的话一直像阴影一样蒙在我心头，而张天师给我的半本风水书却引来了老天爷的折磨。",
      "level": 2
    },
    {
      "id": "229",
      "text": "从一九九四年刚过二十五岁生日开始，我的生活就发生了翻天覆地的变化，在这一年中很多恐怖而又难以想象的事情在等待着我。",
      "level": 2
    },
    {
      "id": "230",
      "text": "不说别的，就在此刻，六枚棺材钉，又扁又长的钉身上还生了不少铁锈，沉甸甸地摆在我面前，让我百思不得其解。",
      "level": 2
    },
    {
      "id": "231",
      "text": "为什么这六枚年深日久、长着铁锈的棺材钉会摆在我面前？",
      "level": 3
    },
    {
      "id": "232",
      "text": "不是平放着，而是笔直插在一张相片上。",
      "level": 3
    },
    {
      "id": "233",
      "text": "这相尺寸不像我经常见到的那种，相当大，呈方形，边长差不多四十厘米，是一个女人的半身黑白照片。",
      "level": 4
    },
    {
      "id": "234",
      "text": "六枚棺材钉分别钉在照片中女人的双眼、双耳、鼻子和嘴里。",
      "level": 4
    },
    {
      "id": "235",
      "text": "被钉过的这六个地方叫那钉子挡住，看不清楚到底长了啥样，不过，应该比较年轻，因为她脸上没有多少皱纹，显得平滑光洁，肯定还不到三十岁。",
      "level": 4
    },
    {
      "id": "236",
      "text": "为什么这六枚年深日久的棺材钉会摆在我面前，说来就话长了。",
      "level": 1
    },
    {
      "id": "237",
      "text": "做梦也想不到我这样一个清白的工薪上班族，居然和跑江湖，据说还是专干那见不得光，掉脑袋事的盗墓团伙起了冲突，都是因为那本《天渊山水纵横秘术》的古书招来横祸，不知道这些亡命徒从哪里得知我有了这古书，几次三番搅闹我的生活，要夺走此书作为盗墓的绝活。",
      "level": 2
    },
    {
      "id": "238",
      "text": "直到我小试牛刀拿出学会的最简单一点-摄-字布局，竟然差点搞出了人命，弄得对方放出狠话要做掉我，书也不要了。",
      "level": 2
    },
    {
      "id": "239",
      "text": "我在单位，包括北京都实在没法待下去了。",
      "level": 2
    },
    {
      "id": "240",
      "text": "最后我担心连累女朋友，又联想到测字先生说她死于非命都是因为我，所以只好忍痛选择了逃避。",
      "level": 2
    },
    {
      "id": "241",
      "text": "我给韩叶娜留了一封信，跟她提出分手，然后揣着仅剩的一千多块钱，收拾了几件随身衣服和一些必需品就离开了。",
      "level": 2
    },
    {
      "id": "242",
      "text": "但我实在是舍不得女朋友，想来想去选择去了天津，因为这两个城市离得很近，每当想到和她离得近一些，我心里便稍微舒服一点。",
      "level": 2
    },
    {
      "id": "243",
      "text": "到了天津之后，我联系了一个大学时的同学，就是和我关系很铁的柴勇，一个出生在天津的老门老户，毕业后在中国电信工作。",
      "level": 2
    },
    {
      "id": "244",
      "text": "柴勇体形很胖，我称他为肥佬。",
      "level": 2
    },
    {
      "id": "245",
      "text": "见面之后，喝了不少啤酒，我对哥们儿自然没什么隐瞒的，再加上见识过风水秘术的威力，十分担心不可知的邪恶力量害了女朋友，也不愿意跟肥佬讲这些不怎么科学的东西，怕他笑话我胆小，只是说自己跟别人结仇，不得已跑了出来，肥佬倒是劝我给韩叶娜打电话把实情说出来。",
      "level": 2
    },
    {
      "id": "246",
      "text": "他说你们俩的感情那么好，她肯定会担心你的，哪里还会扯到谁连累谁的蠢话。",
      "level": 3
    },
    {
      "id": "247",
      "text": "我说：肥佬别说了，别说了，你就给我留点尊严行吗？我要是能跟她说我早跟她说了，我这次真是活见鬼，惹上了这些盗墓贼，后头的麻烦事儿还多着呢，哪还有脸再见她？",
      "level": 3
    },
    {
      "id": "248",
      "text": "这事儿要是连累到她，我还不如死了算了。总之我这辈子对不起她，下辈子去给她当牛做马补偿好了。",
      "level": 3
    },
    {
      "id": "249",
      "text": "肥佬又劝了一会儿，见我的态度坚决，似乎有难言之隐，也就不多说了。",
      "level": 2
    },
    {
      "id": "250",
      "text": "酒入愁肠，俩人很快就醉了。等意识恢复的时候发现躺在肥佬家的床上，肥佬告诉我说他老婆这些天被他打发回娘家住了，让我就先住在这里，等他帮我找到住的地方再走。",
      "level": 2
    },
    {
      "id": "251",
      "text": "因为肥佬结婚了，我不能在他家里常住，第二天，我就出去租房子，我给自己定的预算是一百到二百一个月，风头过去之前，一定要省着过。",
      "level": 2
    },
    {
      "id": "252",
      "text": "在中介那挑来拣去，发现一地方挺合适。",
      "level": 2
    },
    {
      "id": "253",
      "text": "租金才一百五一个月，十五平米，家具齐备，地点靠近工人文化宫，离东站不远。",
      "level": 3
    },
    {
      "id": "254",
      "text": "于是我交了信息费，要了详细的地址和房东的联系电话，并约好了时间，马上过去看房。",
      "level": 2
    },
    {
      "id": "255",
      "text": "刚找到地方，几乎是立刻见到了房东，一个很阴沉的老女人，叫我称呼她做梅姨。",
      "level": 2
    },
    {
      "id": "256",
      "text": "大热的天儿，还穿着件对襟老式外褂，一句多余的话也不问，漠然地带我看了我想租的房子。",
      "level": 2
    },
    {
      "id": "257",
      "text": "这一带都是解放之前的老式洋楼，房子格局都差不多，一个小院里面带一幢小楼，有三层的和两层的，每一幢小楼里面大约住了六到八户。",
      "level": 2
    },
    {
      "id": "258",
      "text": "我打算..."
    }
  ],
  "hierarchy": {
    "main_topics": [
      "Introduction",
      "The Narrator's Name and Childhood Dreams",
      "Encounter with the White Rabbit and 'Xian Pi Zi'",
      "Exploring the Haunted House",
      "The 'Five Ghosts Crushing Corpse' Phenomenon",
      "The Black Flame Lamp and its Mysteries",
      "The Fortune Teller's Prophecy",
      "The Feng Shui Book and its Teachings",
      "The Coffin Nails and the Conflict with Tomb Robbers",
      "Seeking Refuge and a New Apartment"
    ],
    "structure": "The document is structured in chapters, each detailing a specific part of the narrator's supernatural and mysterious experiences. It begins with an introduction to the 'ghost hitting wall' phenomenon and the narrator's unusual name, then progresses through childhood dreams, a significant encounter with a 'Xian Pi Zi', exploration of a haunted house, encounters with supernatural entities and rituals, a prophetic fortune teller, the acquisition of a Feng Shui book, and finally, a conflict with tomb robbers leading to a period of evasion and a new living situation."
  }
}