{
  "propositions": [
    {
      "id": "1",
      "text": "The document is a preface to a work titled \"Liaodong Yiwenshouji: Zhiren Getoulu\" (辽东轶闻手记：纸人割头颅), written by Ye Dun.",
      "level": 1
    },
    {
      "id": "1.1",
      "text": "The author's note explains the inspiration behind the title and the novel.",
      "level": 2
    },
    {
      "id": "1.1.1",
      "text": "The primary inspiration comes from two ancient folk accounts.",
      "level": 3
    },
    {
      "id": "1.1.1.1",
      "text": "The first account is from Yu Qingyuan's \"Mengchang Zazhu\" (梦厂杂著) describing the \"Jie Bian\" (截辫) phenomenon.",
      "level": 4
    },
    {
      "id": "1.1.1.2",
      "text": "The second account is from \"Yangjizhai Conglu\" (养吉斋丛录), also detailing \"Ge Bian\" (割辫) incidents.",
      "level": 4
    },
    {
      "id": "1.1.2",
      "text": "The author discovered the \"Jie Bian\" text in 2010 and was so inspired that they halted work on their first novel, \"Zha Street Archives\" (卅街档案馆), to begin outlining \"Liaodong Yiwenshouji\".",
      "level": 3
    },
    {
      "id": "1.1.3",
      "text": "The writing process for \"Liaodong Yiwenshouji\" was challenging, with the author experiencing creative block and rewriting the manuscript multiple times.",
      "level": 3
    },
    {
      "id": "1.1.3.1",
      "text": "The first draft's beginning was written on February 8, 2011.",
      "level": 4
    },
    {
      "id": "1.1.3.2",
      "text": "Sixty thousand words of the first draft were discarded, and the second draft was written on May 24, 2011.",
      "level": 4
    },
    {
      "id": "1.1.3.3",
      "text": "The third draft, written on August 19, 2011, was successful, establishing trust between the author and the text.",
      "level": 4
    },
    {
      "id": "1.1.4",
      "text": "The author acknowledges the help and encouragement of editors: Zhou Xianliang, Wu Ning, Liu Xuheng, and Qi Xiaoshuang.",
      "level": 3
    },
    {
      "id": "1.1.5",
      "text": "Despite the perceived flaws in the novel, the author's passion for writing remains strong, and they are determined to continue.",
      "level": 3
    },
    {
      "id": "1.2",
      "text": "Chapter 1, \"Xiezi\" (楔子 - Prologue), describes the narrator's past as a second-hand dealer and the origins of the \"ghost market\".",
      "level": 2
    },
    {
      "id": "1.2.1",
      "text": "The narrator confesses to being a mischievous and uneducated individual, recalling childhood misdeeds.",
      "level": 3
    },
    {
      "id": "1.2.2",
      "text": "The narrator's second-hand dealing was surprisingly successful, particularly after an initial lucky find.",
      "level": 3
    },
    {
      "id": "1.2.2.1",
      "text": "The narrator's first business was a broken fan claimed to be used by Zhang Ailing, which was bought on impulse.",
      "level": 4
    },
    {
      "id": "1.2.2.2",
      "text": "A Zhang Ailing expert later bought the fan at a high price, leading to further successful dealings for the narrator.",
      "level": 4
    },
    {
      "id": "1.2.3",
      "text": "The narrator opened an online store specializing in rare books and old manuscripts.",
      "level": 3
    },
    {
      "id": "1.2.4",
      "text": "On the first day of the year's opening for the \"ghost market\", the narrator experienced frustration due to being outmaneuvered for desirable items.",
      "level": 3
    },
    {
      "id": "1.2.5",
      "text": "The narrator impulsively bought a bag of twenty-odd notebooks from a merchant out of spite towards a rival dealer.",
      "level": 3
    },
    {
      "id": "1.2.6",
      "text": "Upon inspecting the notebooks, the narrator found the recorded name indicated a profession in \"food research\", leading to disappointment.",
      "level": 3
    },
    {
      "id": "1.2.7",
      "text": "The narrator listed the notebooks online for ten times the purchase price, regretting the impulsive purchase.",
      "level": 3
    },
    {
      "id": "1.2.8",
      "text": "A woman with a hoarse voice contacted the narrator to buy the notebooks, agreeing to the online price without negotiation.",
      "level": 3
    },
    {
      "id": "1.2.9",
      "text": "After receiving the notebooks, the woman called again, stating one notebook was missing and asking the narrator to find it.",
      "level": 3
    },
    {
      "id": "1.2.10",
      "text": "The narrator found the missing notebook and was instructed to deliver it to a specific address.",
      "level": 3
    },
    {
      "id": "1.2.11",
      "text": "Upon reading the notebook, the narrator discovered a repeated, unrelated passage about a murder case in Lviv, likely from a Soviet book titled \"Investigation of Murder Cases\".",
      "level": 3
    },
    {
      "id": "1.2.12",
      "text": "The narrator met an elderly man at the given address, who identified himself as the original owner of the notebooks and the father of the woman who called.",
      "level": 3
    },
    {
      "id": "1.2.13",
      "text": "The old man revealed that his profession was a cover for his work in a secret organization called the \"Special Cases Handling Group,\" also known as \"Sijian\" (死间 - Dead Agent/Interception).",
      "level": 3
    },
    {
      "id": "1.2.14",
      "text": "The \"Sijian\" organization deals with \"bizarre and unexplainable investigation records\" that are permanently sealed.",
      "level": 3
    },
    {
      "id": "1.2.15",
      "text": "The old man listed examples of cases handled by \"Sijian,\" including the \"Liaodong Zhiren Getoulu Incident\" (辽东纸人割头颅事件).",
      "level": 3
    },
    {
      "id": "1.2.16",
      "text": "The old man explained that his involvement in the \"Zhiren Getoulu Incident\" led to his recruitment into \"Sijian\".",
      "level": 3
    },
    {
      "id": "1.2.17",
      "text": "The old man implies that paper figures can indeed cut off heads, and then begins to tell his story.",
      "level": 3
    },
    {
      "id": "1.3",
      "text": "Chapter 2, \"An Ye Yan Yan\" (暗夜魇魇 - Dark Night Nightmare), recounts the narrator's (Qiu Ming) experience as a truck driver in 1961.",
      "level": 2
    },
    {
      "id": "1.3.1",
      "text": "The narrator was a truck driver for the commune's transportation team, transporting lumber from Ji'an to Andong (later Dandong).",
      "level": 3
    },
    {
      "id": "1.3.2",
      "text": "The journey was long and arduous, with poor road conditions.",
      "level": 3
    },
    {
      "id": "1.3.3",
      "text": "On the night of the Ghost Festival (July 15th), the narrator and his partner, Cui Guoliang, encountered a mysterious phenomenon during a heavy rainstorm.",
      "level": 3
    },
    {
      "id": "1.3.4",
      "text": "The truck suddenly stopped inexplicably, and despite the heavy rain, no water fell on the vehicle's windows.",
      "level": 3
    },
    {
      "id": "1.3.5",
      "text": "They heard a child's sobbing sound and were surrounded by a dense fog, leading them to believe they had encountered \"Yin Xie\" (阴燮), a supernatural entity.",
      "level": 3
    },
    {
      "id": "1.3.6",
      "text": "Cui Guoliang recounts a story about a man named Yan Er Lengzi, who believed in supernatural occurrences and warned of the \"Yin Xie\".",
      "level": 3
    },
    {
      "id": "1.3.7",
      "text": "The \"Yin Xie\" is described as the spirit of a deformed, stillborn fetus with immense resentment, known to block roads at night and appear as incomplete body parts.",
      "level": 3
    },
    {
      "id": "1.3.8",
      "text": "The mysterious fog dissipated, and they discovered the cause of the truck's stopping was a stray dog caught between rocks, whose whimpers were mistaken for the \"Yin Xie\".",
      "level": 3
    },
    {
      "id": "1.3.9",
      "text": "Despite the false alarm, the narrator remained unsettled by the unexplained fog and its effects.",
      "level": 3
    },
    {
      "id": "1.3.10",
      "text": "Cui Guoliang asked the narrator to make a detour to his parents' graves to burn paper money, which the narrator agreed to.",
      "level": 3
    },
    {
      "id": "1.4",
      "text": "Chapter 3, \"Chuan Shi Gui Zhu\" (传尸鬼疰 - Corpse Transmitting Ghost Haunting), continues the narrative from the detour.",
      "level": 2
    },
    {
      "id": "1.4.1",
      "text": "The detour led them to a much muddier road, and upon reaching a mountain base, the narrator became drowsy.",
      "level": 3
    },
    {
      "id": "1.4.2",
      "text": "The narrator observed three flickering lights in the distance, initially mistaking them for villagers burning offerings.",
      "level": 3
    },
    {
      "id": "1.4.3",
      "text": "The lights began to approach the truck, and the narrator, suspecting something unusual, grabbed his dagger.",
      "level": 3
    },
    {
      "id": "1.4.4",
      "text": "The narrator then dismissed the idea of \"Chihu Liandan\" (赤狐炼丹 - Red Fox Alchemy) and identified the lights as something else.",
      "level": 3
    }
  ],
  "concepts": [
    {
      "name": "Liaodong Yiwenshouji",
      "frequency": 1,
      "context": "The title of the novel being discussed."
    },
    {
      "name": "Ye Dun",
      "frequency": 1,
      "context": "The author of the novel."
    },
    {
      "name": "Zhiren Getoulu",
      "frequency": 1,
      "context": "The specific incident that inspired the novel's title, meaning 'Paper Man Cuts Off Head'."
    },
    {
      "name": "Jie Bian",
      "frequency": 1,
      "context": "A phenomenon described in folk records where people's queues were cut off."
    },
    {
      "name": "Ge Bian",
      "frequency": 1,
      "context": "Similar to 'Jie Bian', referring to incidents of braid cutting."
    },
    {
      "name": "Yu Qingyuan",
      "frequency": 1,
      "context": "Author of 'Mengchang Zazhu', one of the source texts."
    },
    {
      "name": "Mengchang Zazhu",
      "frequency": 1,
      "context": "A historical text that provided inspiration for the novel."
    },
    {
      "name": "Yangjizhai Conglu",
      "frequency": 1,
      "context": "Another historical text that provided inspiration for the novel."
    },
    {
      "name": "Zha Street Archives",
      "frequency": 1,
      "context": "The author's previously worked-on novel that was put aside for 'Liaodong Yiwenshouji'."
    },
    {
      "name": "Ghost Market",
      "frequency": 4,
      "context": "A clandestine market for trading used goods, often in the early morning hours."
    },
    {
      "name": "Zhang Ailing",
      "frequency": 1,
      "context": "A famous writer whose association with an object made it valuable in the second-hand market."
    },
    {
      "name": "Food Research",
      "frequency": 1,
      "context": "The stated profession of the notebook's author, used as a cover."
    },
    {
      "name": "Special Cases Handling Group",
      "frequency": 1,
      "context": "The secret organization where the old man worked."
    },
    {
      "name": "Sijian",
      "frequency": 4,
      "context": "The internal name for the 'Special Cases Handling Group', meaning 'Dead Agent'."
    },
    {
      "name": "Investigation Records",
      "frequency": 2,
      "context": "The content handled by 'Sijian', described as bizarre and unexplainable."
    },
    {
      "name": "Qiu Ming",
      "frequency": 5,
      "context": "The narrator of Chapters 2 and 3, a truck driver."
    },
    {
      "name": "Cui Guoliang",
      "frequency": 6,
      "context": "Qiu Ming's truck driving partner."
    },
    {
      "name": "Yin Xie",
      "frequency": 4,
      "context": "A supernatural entity described as the spirit of a deformed fetus, known to haunt roads."
    },
    {
      "name": "Yan Er Lengzi",
      "frequency": 3,
      "context": "A man who believed in the supernatural and warned of 'Yin Xie'."
    },
    {
      "name": "Chihu Liandan",
      "frequency": 1,
      "context": "A folk belief about red foxes exhibiting unusual behavior in the mountains during rainy seasons."
    }
  ],
  "relations": [
    {
      "source": "Jie Bian",
      "target": "Yu Qingyuan",
      "type": "documented_by"
    },
    {
      "source": "Ge Bian",
      "target": "Yangjizhai Conglu",
      "type": "documented_by"
    },
    {
      "source": "Liaodong Yiwenshouji",
      "target": "Jie Bian",
      "type": "inspired_by"
    },
    {
      "source": "Liaodong Yiwenshouji",
      "target": "Ge Bian",
      "type": "inspired_by"
    },
    {
      "source": "Zha Street Archives",
      "target": "Liaodong Yiwenshouji",
      "type": "superseded_by"
    },
    {
      "source": "Ghost Market",
      "target": "Second-hand dealer",
      "type": "venue_for"
    },
    {
      "source": "Zhang Ailing",
      "target": "Fan",
      "type": "associated_with"
    },
    {
      "source": "Special Cases Handling Group",
      "target": "Sijian",
      "type": "also_known_as"
    },
    {
      "source": "Sijian",
      "target": "Investigation Records",
      "type": "handles"
    },
    {
      "source": "Zhiren Getoulu Incident",
      "target": "Sijian",
      "type": "recruitment_cause_for"
    },
    {
      "source": "Qiu Ming",
      "target": "Truck Driver",
      "type": "occupation"
    },
    {
      "source": "Qiu Ming",
      "target": "Cui Guoliang",
      "type": "partner_of"
    },
    {
      "source": "Yin Xie",
      "target": "Yan Er Lengzi",
      "type": "believed_by"
    },
    {
      "source": "Yin Xie",
      "target": "Deformed fetus spirit",
      "type": "description"
    },
    {
      "source": "Qiu Ming",
      "target": "Yin Xie",
      "type": "mistakenly_encountered"
    },
    {
      "source": "Cui Guoliang",
      "target": "Parents' Graves",
      "type": "visited_for_ceremony"
    },
    {
      "source": "Three Flickering Lights",
      "target": "Approaching Truck",
      "type": "movement_towards"
    }
  ],
  "hierarchy": {
    "main_topics": [
      "Author's Preface",
      "Chapter 1: Prologue",
      "Chapter 2: Dark Night Nightmare",
      "Chapter 3: Corpse Transmitting Ghost Haunting"
    ],
    "structure": "The document is structured as a preface by the author, followed by numbered chapters that narrate a story from different perspectives and timelines. The preface sets the stage by explaining the novel's genesis and the author's creative process. The subsequent chapters delve into the narrative, introducing characters and supernatural or mysterious events."
  }
}