{
  "propositions": [
    {
      "id": "1",
      "text": "The document is a narrative about tomb raiding, presented as a serialized novel titled '盗墓笔记'.",
      "level": 1
    },
    {
      "id": "1.1",
      "text": "The story is divided into chapters and sections, indicated by numerical progression and titles.",
      "level": 2
    },
    {
      "id": "1.2",
      "text": "The narrative begins with a flashback to an event 50 years prior.",
      "level": 2
    },
    {
      "id": "1.3",
      "text": "The narrative then shifts to the present day, introducing a protagonist and their interactions related to antiquities.",
      "level": 2
    },
    {
      "id": "1.4",
      "text": "The plot involves the discovery and pursuit of ancient artifacts, specifically a '战国帛书' (Warring States silk manuscript).",
      "level": 2
    },
    {
      "id": "1.5",
      "text": "The story details the dangerous expeditions and the mysterious phenomena encountered during these ventures.",
      "level": 2
    },
    {
      "id": "1.6",
      "text": "The narrative explores the history and traditions of tomb raiding through different factions and historical periods.",
      "level": 2
    },
    {
      "id": "1.7",
      "text": "The protagonist's family has a history of being tomb raiders, specifically from the '南派' (Southern School).",
      "level": 2
    },
    {
      "id": "1.8",
      "text": "A significant event involving a '血尸' (blood corpse) is recounted from the past.",
      "level": 2
    },
    {
      "id": "1.9",
      "text": "A mysterious '闷油瓶' (mute bottle) character plays a role in the present-day expeditions.",
      "level": 2
    },
    {
      "id": "1.10",
      "text": "The narrative culminates in an expedition into a dangerous '水盗洞' (water tomb raiding tunnel) with supernatural elements.",
      "level": 2
    },
    {
      "id": "1.11",
      "text": "The concept of '尸洞' (corpse tunnel) and its associated dangers are introduced.",
      "level": 2
    },
    {
      "id": "1.12",
      "text": "The story suggests a conflict or rivalry between different tomb raiding factions, '南派' and '北派'.",
      "level": 2
    },
    {
      "id": "1.13",
      "text": "The document is an excerpt from a larger work, indicated by chapter and volume headings.",
      "level": 2
    },
    {
      "id": "2",
      "text": "The initial chapter describes an unsuccessful tomb raiding attempt involving '土夫子' (tomb raiders) encountering a '血尸'.",
      "level": 1
    },
    {
      "id": "2.1",
      "text": "The scene involves dialogue among the tomb raiders about the danger of the '血尸' and the decision to proceed or retreat.",
      "level": 2
    },
    {
      "id": "2.2",
      "text": "One of the younger tomb raiders, referred to as '老三' (Old Third), is instructed to stay above ground and pull out the unearthed items.",
      "level": 2
    },
    {
      "id": "2.3",
      "text": "A struggle ensues underground, resulting in the loss of one of the tomb raiders, implied to be '老二' (Old Second).",
      "level": 2
    },
    {
      "id": "2.4",
      "text": "'老三' flees after witnessing a horrifying creature and retrieving a severed hand, which he recognizes as belonging to '老二'.",
      "level": 2
    },
    {
      "id": "2.5",
      "text": "'老三' confronts the creature, identified as a '血尸', and engages in a dangerous encounter.",
      "level": 2
    },
    {
      "id": "3",
      "text": "The second chapter shifts to 50 years later, introducing the narrator and their occupation as an antiquities dealer.",
      "level": 1
    },
    {
      "id": "3.1",
      "text": "The narrator is approached by a man with a gold tooth, seeking information about a specific '战国帛书'.",
      "level": 2
    },
    {
      "id": "3.2",
      "text": "The man reveals he was sent by '老痒' (Old Itch), a figure known to the narrator.",
      "level": 2
    },
    {
      "id": "3.3",
      "text": "The narrator's grandfather was involved in the original excavation of a '战国帛书' at '长沙镖子岭' (Changsha Biaozi Ling).",
      "level": 2
    },
    {
      "id": "3.4",
      "text": "The narrator refuses to reveal information about their grandfather's artifact, citing his passing and the sensitive nature of the past events.",
      "level": 2
    },
    {
      "id": "3.5",
      "text": "The narrator examines a copy of a '战国帛书' brought by the man and identifies it as a Han Dynasty replica, not the original.",
      "level": 2
    },
    {
      "id": "3.6",
      "text": "The narrator notices a peculiar '狐狸一样的人脸' (fox-like human face) pattern on the replica.",
      "level": 2
    },
    {
      "id": "3.7",
      "text": "The narrator learns about their family's history as '土夫子' (tomb raiders) from the '南派' school, known for their use of the '洛阳铲' (Luoyang shovel).",
      "level": 2
    },
    {
      "id": "3.8",
      "text": "The narrator's grandfather's experiences, including the event at '长沙镖子岭', are recorded in a notebook.",
      "level": 2
    },
    {
      "id": "4",
      "text": "The third chapter details the narrator's conversation with their '三叔' (Uncle Third) about the mysterious pattern found on the '战国帛书' replica.",
      "level": 1
    },
    {
      "id": "4.1",
      "text": "'三叔' identifies the pattern as a '字画' (pictographic map) pointing to a high-status Warring States era tomb, possibly of a nobleman from the State of Lu.",
      "level": 2
    },
    {
      "id": "4.2",
      "text": "The narrator expresses a desire to join the expedition to find this tomb.",
      "level": 2
    },
    {
      "id": "4.3",
      "text": "'三叔' initially resists, citing the dangers, but eventually agrees, with the condition that the narrator stays above ground during the descent.",
      "level": 2
    },
    {
      "id": "4.4",
      "text": "Preparations are made for the expedition, including gathering specialized equipment.",
      "level": 2
    },
    {
      "id": "5",
      "text": "The fourth chapter describes the beginning of the expedition to '瓜子庙' (Guazi Temple) and the journey to a mysterious cave.",
      "level": 1
    },
    {
      "id": "5.1",
      "text": "The group travels through various modes of transportation, eventually reaching a remote location.",
      "level": 2
    },
    {
      "id": "5.2",
      "text": "They encounter a local guide and a dog named '驴蛋蛋' (Donkey Egg) who is crucial for navigation.",
      "level": 2
    },
    {
      "id": "5.3",
      "text": "The destination involves a '水盗洞' (water tomb raiding tunnel) guarded by a local ferryman with a reputation for being immune to its dangers.",
      "level": 2
    },
    {
      "id": "5.4",
      "text": "The ferryman warns of the dangers within the cave, including potential supernatural entities and the urgency to avoid speaking ill of the '河神' (river god).",
      "level": 2
    },
    {
      "id": "5.5",
      "text": "Upon entering the cave, the group encounters a '尸洞' (corpse tunnel) and strange phenomena.",
      "level": 2
    },
    {
      "id": "5.6",
      "text": "The ferryman and the old guide mysteriously disappear.",
      "level": 2
    },
    {
      "id": "5.7",
      "text": "A giant shadow is seen in the water, leading to fear and speculation about its nature.",
      "level": 2
    },
    {
      "id": "5.8",
      "text": "A character referred to as '闷油瓶' (Mute Bottle) exhibits unusual abilities and knowledge.",
      "level": 2
    },
    {
      "id": "5.9",
      "text": "A creature is captured, initially identified as a '龙虱' (water beetle), but later revealed to be a '尸蹩' (corpse bug).",
      "level": 2
    },
    {
      "id": "5.10",
      "text": "The presence of numerous '尸蹩' suggests a significant '积尸地' (corpse accumulation area) upstream.",
      "level": 2
    },
    {
      "id": "5.11",
      "text": "The '闷油瓶' suggests that the creatures were fleeing from something deeper within the cave.",
      "level": 2
    },
    {
      "id": "5.12",
      "text": "The group decides to retreat, but '闷油瓶' believes it may be too late to escape.",
      "level": 2
    },
    {
      "id": "6",
      "text": "The fifth chapter continues the exploration of the '水盗洞' and the growing dread among the characters.",
      "level": 1
    },
    {
      "id": "6.1",
      "text": "The characters debate whether to proceed forward or retreat, with '闷油瓶' expressing pessimism about their escape.",
      "level": 2
    },
    {
      "id": "6.2",
      "text": "They decide to retreat, with '潘子' (Panzi) and '阿奎' (A Kui) preparing to defend and navigate.",
      "level": 2
    },
    {
      "id": "6.3",
      "text": "The presence of the ox on the second boat becomes an issue for navigation.",
      "level": 2
    },
    {
      "id": "6.4",
      "text": "'闷油瓶' demonstrates extraordinary skill in identifying the cause of the disturbance in the water - a large congregation of '尸蹩'.",
      "level": 2
    }
  ],
  "concepts": [
    {
      "name": "盗墓笔记",
      "frequency": 1,
      "context": "Title of the document, referring to the novel series."
    },
    {
      "name": "南派",
      "frequency": 3,
      "context": "Refers to the Southern School of tomb raiding, characterized by specific techniques and traditions."
    },
    {
      "name": "北派",
      "frequency": 2,
      "context": "Refers to the Northern School of tomb raiding, contrasted with the Southern School."
    },
    {
      "name": "血尸",
      "frequency": 5,
      "context": "A type of dangerous undead creature encountered in tomb raiding, described as being covered in blood."
    },
    {
      "name": "土夫子",
      "frequency": 3,
      "context": "A colloquial term for tomb raiders."
    },
    {
      "name": "洛阳铲",
      "frequency": 3,
      "context": "A specialized tool used by tomb raiders for probing the ground and identifying burial sites."
    },
    {
      "name": "长沙镖子岭",
      "frequency": 2,
      "context": "A specific location where a significant tomb raiding event occurred in the past."
    },
    {
      "name": "战国帛书",
      "frequency": 4,
      "context": "A precious artifact, a silk manuscript from the Warring States period, sought after for its historical and possibly cryptic content."
    },
    {
      "name": "老三",
      "frequency": 7,
      "context": "The youngest character in the initial flashback, who is a key witness to the '血尸' encounter and later plays a role in the present-day narrative."
    },
    {
      "name": "老二",
      "frequency": 3,
      "context": "The second eldest son in the initial flashback, implied to be lost or severely injured during the '血尸' encounter."
    },
    {
      "name": "老痒",
      "frequency": 3,
      "context": "A character who introduces the narrator to the man with the gold tooth."
    },
    {
      "name": "三叔",
      "frequency": 16,
      "context": "The narrator's uncle, who is knowledgeable about ancient texts and symbols and leads the expedition."
    },
    {
      "name": "闷油瓶",
      "frequency": 7,
      "context": "A mysterious and taciturn character with exceptional abilities and knowledge, who joins the expedition."
    },
    {
      "name": "字画",
      "frequency": 4,
      "context": "A form of ancient map or code, combining text and imagery, used to depict geographical locations."
    },
    {
      "name": "水盗洞",
      "frequency": 4,
      "context": "A tomb raiding tunnel filled with water, presenting unique challenges and dangers."
    },
    {
      "name": "尸洞",
      "frequency": 3,
      "context": "A tunnel or area associated with corpses or death, often with supernatural or dangerous properties."
    },
    {
      "name": "瓜子庙",
      "frequency": 1,
      "context": "The location where the expedition begins."
    },
    {
      "name": "驴蛋蛋",
      "frequency": 5,
      "context": "A dog that plays a crucial role in navigation and signaling during the expedition."
    },
    {
      "name": "河神",
      "frequency": 2,
      "context": "A deity associated with the river, whose appeasement is important for safe passage."
    },
    {
      "name": "潘子",
      "frequency": 6,
      "context": "A seasoned and capable member of the expedition team, a former soldier."
    },
    {
      "name": "阿奎",
      "frequency": 5,
      "context": "A large and strong but timid member of the expedition team."
    },
    {
      "name": "龙虱",
      "frequency": 2,
      "context": "A type of water insect, initially mistaken for the creature encountered in the water."
    },
    {
      "name": "尸蹩",
      "frequency": 3,
      "context": "A creature that feeds on carrion, found in areas of accumulation of dead bodies, encountered in the water tunnel."
    },
    {
      "name": "积尸地",
      "frequency": 1,
      "context": "An area where a large number of dead bodies have accumulated."
    }
  ],
  "relations": [
    {
      "source": "盗墓笔记",
      "target": "小说",
      "type": "is_a"
    },
    {
      "source": "南派",
      "target": "盗墓派别",
      "type": "is_a"
    },
    {
      "source": "北派",
      "target": "盗墓派别",
      "type": "is_a"
    },
    {
      "source": "南派",
      "target": "洛阳铲",
      "type": "uses"
    },
    {
      "source": "血尸",
      "target": "危险生物",
      "type": "is_a"
    },
    {
      "source": "土夫子",
      "target": "盗墓者",
      "type": "is_a"
    },
    {
      "source": "长沙镖子岭",
      "target": "事件发生地",
      "type": "location_of"
    },
    {
      "source": "战国帛书",
      "target": "古代文献",
      "type": "is_a"
    },
    {
      "source": "老三",
      "target": "主角",
      "type": "protagonist_in_flashback"
    },
    {
      "source": "老三",
      "target": "老二",
      "type": "brother_of"
    },
    {
      "source": "老痒",
      "target": "叙述者",
      "type": "introducer_of"
    },
    {
      "source": "三叔",
      "target": "叙述者",
      "type": "uncle_of"
    },
    {
      "source": "三叔",
      "target": "字画",
      "type": "interprets"
    },
    {
      "source": "闷油瓶",
      "target": "同伴",
      "type": "is_a"
    },
    {
      "source": "闷油瓶",
      "target": "特殊能力",
      "type": "possesses"
    },
    {
      "source": "字画",
      "target": "地图",
      "type": "represents"
    },
    {
      "source": "水盗洞",
      "target": "危险环境",
      "type": "is_a"
    },
    {
      "source": "尸洞",
      "target": "危险环境",
      "type": "is_a"
    },
    {
      "source": "瓜子庙",
      "target": "起始地点",
      "type": "location_of"
    },
    {
      "source": "驴蛋蛋",
      "target": "导航动物",
      "type": "is_a"
    },
    {
      "source": "河神",
      "target": "超自然存在",
      "type": "is_a"
    },
    {
      "source": "潘子",
      "target": "团队成员",
      "type": "is_a"
    },
    {
      "source": "阿奎",
      "target": "团队成员",
      "type": "is_a"
    },
    {
      "source": "龙虱",
      "target": "水生昆虫",
      "type": "is_a"
    },
    {
      "source": "尸蹩",
      "target": "危险生物",
      "type": "is_a"
    },
    {
      "source": "尸蹩",
      "target": "积尸地",
      "type": "inhabits"
    },
    {
      "source": "血尸",
      "target": "古墓",
      "type": "found_in"
    },
    {
      "source": "战国帛书",
      "target": "盗墓者",
      "type": "sought_by"
    },
    {
      "source": "长沙镖子岭",
      "target": "战国帛书",
      "type": "excavated_at"
    },
    {
      "source": "三叔",
      "target": "主角（叙述者）",
      "type": "uncle_of"
    },
    {
      "source": "闷油瓶",
      "target": "谜团",
      "type": "surrounded_by"
    },
    {
      "source": "水盗洞",
      "target": "超自然现象",
      "type": "features"
    },
    {
      "source": "尸洞",
      "target": "危险",
      "type": "associated_with"
    },
    {
      "source": "驴蛋蛋",
      "target": "船工",
      "type": "guided_by"
    },
    {
      "source": "河神",
      "target": "船工",
      "type": "appeased_by"
    },
    {
      "source": "潘子",
      "target": "战术",
      "type": "employs"
    },
    {
      "source": "闷油瓶",
      "target": "观察",
      "type": "performs"
    },
    {
      "source": "尸蹩",
      "target": "逃命",
      "type": "was"
    }
  ],
  "hierarchy": {
    "main_topics": [
      "Tomb Raiding Narrative",
      "Ancient Artifacts",
      "Mysterious Creatures and Phenomena",
      "Family History and Traditions"
    ],
    "structure": "The document is structured as a serialized novel with chapters. It begins with a past event, transitions to the present, and then details an expedition. The narrative progresses chronologically within each chapter while flashbacks and discussions of history provide context."
  }
}