{
  "propositions": [
    {
      "id": "1",
      "text": "A military tent is set up in a mountain gully, illuminated by high-intensity lights, with dozens of people in orange-red protective suits busy working.",
      "level": 1
    },
    {
      "id": "1.1",
      "text": "A modern excavator is continuously roaring, digging rocks from the mountainside.",
      "level": 2
    },
    {
      "id": "1.2",
      "text": "Some individuals are using a micro magnetic field detector and radio communicators to guide the excavator driver.",
      "level": 2
    },
    {
      "id": "1.3",
      "text": "The torrential rain and thunder effectively mask the noise of the excavator, ensuring secrecy.",
      "level": 2
    },
    {
      "id": "2",
      "text": "Three people stand outside a Toyota SUV parked 500 meters away, wearing protective suits and looking sternly at the flashing lights and excavator headlights.",
      "level": 1
    },
    {
      "id": "2.1",
      "text": "Rainwater streams down their hoods.",
      "level": 2
    },
    {
      "id": "3",
      "text": "One person excitedly states that the radiation field strength is increasing and that their intelligence about a giant uranium deposit is likely correct.",
      "level": 1
    },
    {
      "id": "4",
      "text": "Another person, referred to as 'Old Wei', nods and stares at a micro magnetic field detector, an advanced model from Texas Instruments.",
      "level": 1
    },
    {
      "id": "4.1",
      "text": "The device detects electromagnetic and ionizing radiation.",
      "level": 2
    },
    {
      "id": "4.2",
      "text": "The numerical readings on the device increase with each scoop of earth removed by the excavator.",
      "level": 2
    },
    {
      "id": "5",
      "text": "Old Wei predicts that after digging another fifty meters, something significant will be discovered.",
      "level": 1
    },
    {
      "id": "6",
      "text": "Old Liang orders the work to be expedited.",
      "level": 1
    },
    {
      "id": "7",
      "text": "Communication is conducted via radio due to the difficulty of hearing in the storm.",
      "level": 1
    },
    {
      "id": "8",
      "text": "Old Liang asks the workers if they feel unwell.",
      "level": 1
    },
    {
      "id": "9",
      "text": "A worker reports feeling dizzy and nauseous.",
      "level": 1
    },
    {
      "id": "10",
      "text": "Old Liang reassures them that their German-made protective suits can withstand 5000 rem of radiation.",
      "level": 1
    },
    {
      "id": "11",
      "text": "The site commander reports that the excavator has hit something metallic and cannot proceed.",
      "level": 1
    },
    {
      "id": "12",
      "text": "Old Wei, identified as 'Wei Zong', asks for confirmation and visual inspection.",
      "level": 1
    },
    {
      "id": "13",
      "text": "The commander states that visual inspection is not yet possible and recommends manual clearing.",
      "level": 1
    },
    {
      "id": "14",
      "text": "Wei Zong orders continued excavation and regular updates.",
      "level": 1
    },
    {
      "id": "15",
      "text": "The magnetic field strength rapidly increases, and surrounding personnel experience dizziness.",
      "level": 1
    },
    {
      "id": "16",
      "text": "Wei Zong decides to continue excavation.",
      "level": 1
    },
    {
      "id": "17",
      "text": "The site commander excitedly reports the discovery of a target: a bronze rectangular object resembling a coffin.",
      "level": 1
    },
    {
      "id": "18",
      "text": "Wei Zong's breathing quickens, and his hand holding the detector trembles.",
      "level": 1
    },
    {
      "id": "19",
      "text": "He questions the identity of 'Tian Yan' (天眼).",
      "level": 1
    },
    {
      "id": "20",
      "text": "Some workers begin to experience mild vomiting.",
      "level": 1
    },
    {
      "id": "21",
      "text": "Someone suggests stopping due to the extreme radioactivity of the uranium ore.",
      "level": 1
    },
    {
      "id": "22",
      "text": "Wei Zong decisively orders to continue and extract the bronze coffin.",
      "level": 1
    },
    {
      "id": "23",
      "text": "Rocks fall from the mountainside, hitting the tent's steel pipes.",
      "level": 1
    },
    {
      "id": "24",
      "text": "The commander reports signs of a landslide above.",
      "level": 1
    },
    {
      "id": "25",
      "text": "Wei Zong dismisses the landslide, ordering immediate and urgent excavation.",
      "level": 1
    },
    {
      "id": "26",
      "text": "The people around exchange worried glances.",
      "level": 1
    },
    {
      "id": "27",
      "text": "The excavator's bucket cannot work, so manual shoveling begins.",
      "level": 1
    },
    {
      "id": "28",
      "text": "The bronze coffin is gradually unearthed.",
      "level": 1
    },
    {
      "id": "29",
      "text": "The commander orders the coffin to be washed and illuminated by spotlights.",
      "level": 1
    },
    {
      "id": "30",
      "text": "Wei Zong orders the coffin to be pried open.",
      "level": 1
    },
    {
      "id": "31",
      "text": "The bronze coffin, covered in green patina, has been buried for an unknown number of years.",
      "level": 1
    },
    {
      "id": "32",
      "text": "A narrow gap is pried open in the coffin lid.",
      "level": 1
    },
    {
      "id": "33",
      "text": "Someone cries out in pain, clutching their nose.",
      "level": 1
    },
    {
      "id": "34",
      "text": "Blood flows from the person's nose and mouth.",
      "level": 1
    },
    {
      "id": "35",
      "text": "The bronze coffin suddenly vibrates, causing everyone to recoil.",
      "level": 1
    },
    {
      "id": "36",
      "text": "Wei Zong asks what happened.",
      "level": 1
    },
    {
      "id": "37",
      "text": "The commander nervously reports that there seems to be something inside the coffin.",
      "level": 1
    },
    {
      "id": "38",
      "text": "The person with the bleeding nose points at the coffin in terror, exclaiming that there is someone inside.",
      "level": 1
    },
    {
      "id": "39",
      "text": "The person foams at the mouth, falls to the ground, and convulses.",
      "level": 1
    },
    {
      "id": "40",
      "text": "The commander orders them to open the coffin, but no one is willing.",
      "level": 1
    },
    {
      "id": "41",
      "text": "The commander draws a pistol and forces two men to resume prying the lid open.",
      "level": 1
    },
    {
      "id": "42",
      "text": "Others join in the effort.",
      "level": 1
    },
    {
      "id": "43",
      "text": "Video recording begins.",
      "level": 1
    },
    {
      "id": "44",
      "text": "As the coffin lid is pried further open, a person filming notices an itch under their nose and subsequently bleeds from the nose.",
      "level": 1
    },
    {
      "id": "45",
      "text": "This person's vision blurs and their ears ring.",
      "level": 1
    },
    {
      "id": "46",
      "text": "They film their own face, seeing blood flowing from their seven orifices.",
      "level": 1
    },
    {
      "id": "47",
      "text": "Screaming, they fall to the ground and cease to move.",
      "level": 1
    },
    {
      "id": "48",
      "text": "Several people prying the coffin fall to the ground, and others flee.",
      "level": 1
    },
    {
      "id": "49",
      "text": "The commander attempts to shoot them but finds their arm weak.",
      "level": 1
    },
    {
      "id": "50",
      "text": "They feel their temples bulging and their vision darkening.",
      "level": 1
    },
    {
      "id": "51",
      "text": "The commander collapses while trying to report the situation to Wei Zong, citing extreme radiation.",
      "level": 1
    },
    {
      "id": "52",
      "text": "Wei Zong tries to contact the site via multiple channels with no response.",
      "level": 1
    },
    {
      "id": "53",
      "text": "Old Liang observes the silent site through binoculars.",
      "level": 1
    },
    {
      "id": "54",
      "text": "Old Liang expresses concern about a potential major incident and suggests leaving.",
      "level": 1
    },
    {
      "id": "55",
      "text": "Wei Zong, unwilling to leave empty-handed, orders two others to investigate.",
      "level": 1
    },
    {
      "id": "56",
      "text": "The two men express surprise and suggest retreating, prioritizing their lives over 'Tian Yan'.",
      "level": 1
    },
    {
      "id": "57",
      "text": "Wei Zong insists their lives are worth sacrificing for the secrets of 'Tian Yan' and threatens them with his pistol.",
      "level": 1
    },
    {
      "id": "58",
      "text": "The two men reluctantly approach the tent.",
      "level": 1
    },
    {
      "id": "59",
      "text": "Inside the tent, they find numerous orange-suited corpses.",
      "level": 1
    },
    {
      "id": "60",
      "text": "Old Liang draws his pistol and nervously surveys the scene, asking what happened.",
      "level": 1
    },
    {
      "id": "61",
      "text": "They approach the bronze coffin and the commander's body.",
      "level": 1
    },
    {
      "id": "62",
      "text": "The electromagnetic detector near the commander's body suddenly beeps, its three red lights flashing intensely.",
      "level": 1
    },
    {
      "id": "63",
      "text": "They recognize this as exceeding the detector's maximum range of 12000 rem, comparable to radiation near a nuclear explosion.",
      "level": 1
    },
    {
      "id": "64",
      "text": "The other person urges Old Liang to leave immediately.",
      "level": 1
    },
    {
      "id": "65",
      "text": "Suddenly, all the spotlights extinguish, plunging them into darkness.",
      "level": 1
    },
    {
      "id": "66",
      "text": "Old Liang exclaims he cannot see anything.",
      "level": 1
    },
    {
      "id": "67",
      "text": "The other person states their eyes are blind and urges them to run.",
      "level": 1
    },
    {
      "id": "68",
      "text": "They stumble and fall, convulsing and foaming at the mouth.",
      "level": 1
    },
    {
      "id": "69",
      "text": "Wei Zong, observing through binoculars, abandons his desire and flees in the SUV.",
      "level": 1
    },
    {
      "id": "70",
      "text": "Inside the car, Wei Zong breathes fresh air, profoundly affected by the events.",
      "level": 1
    },
    {
      "id": "71",
      "text": "He notices blood on his hands, which he realizes is coming from his nose, eyes, and mouth.",
      "level": 1
    },
    {
      "id": "72",
      "text": "Understanding the radiation has affected him, he aims to reach Qinghe County Hospital for treatment.",
      "level": 1
    },
    {
      "id": "73",
      "text": "The SUV, traveling at high speed on uneven terrain, crashes into a rock, launches into the air, and explodes.",
      "level": 1
    },
    {
      "id": "74",
      "text": "The story then shifts to a different scene.",
      "level": 1
    },
    {
      "id": "75",
      "text": "A character named Liu Da Nao Di (刘大脑袋) explores a narrow passage and finds an iron offering table with a square iron box.",
      "level": 1
    },
    {
      "id": "76",
      "text": "Inside the box is a golden circular disk adorned with intricate patterns.",
      "level": 1
    },
    {
      "id": "77",
      "text": "The narrative moves to Xingping County, Shaanxi Province, in early spring 2011.",
      "level": 1
    },
    {
      "id": "78",
      "text": "The area is known as the burial place of Emperor Wu of Han and the hometown of the general Ma Chao.",
      "level": 1
    },
    {
      "id": "79",
      "text": "Maoling Village, located west of Xingping, is sparsely populated.",
      "level": 1
    },
    {
      "id": "80",
      "text": "A widow named Ding and her five-and-a-half-year-old son, Xiao Bao, live there.",
      "level": 1
    },
    {
      "id": "81",
      "text": "Ding warns Xiao Bao not to stray too far while playing with a wild rabbit.",
      "level": 1
    },
    {
      "id": "82",
      "text": "The rabbit escapes into a disused large stove pit.",
      "level": 1
    },
    {
      "id": "83",
      "text": "Xiao Bao follows the rabbit into the pit and accidentally knocks down a brick wall, revealing a dark hole.",
      "level": 1
    },
    {
      "id": "84",
      "text": "Curiosity overcomes Xiao Bao, and he crawls into the hole with a flashlight.",
      "level": 1
    },
    {
      "id": "85",
      "text": "Ding cannot find Xiao Bao and becomes worried about child abductions.",
      "level": 1
    },
    {
      "id": "86",
      "text": "She discovers the hole in the stove pit and realizes Xiao Bao's disappearance is connected.",
      "level": 1
    },
    {
      "id": "87",
      "text": "The hole is too small for an adult, so she seeks help.",
      "level": 1
    },
    {
      "id": "88",
      "text": "She encounters Liu Da Nao Di, a cunning man known for dealing in antiques.",
      "level": 1
    },
    {
      "id": "89",
      "text": "Liu Da Nao Di examines the bricks and identifies them as 'Qing Tie Zhuan' (青铁砖), dating back to before the Song Dynasty.",
      "level": 1
    },
    {
      "id": "90",
      "text": "He detects an iron smell from the hole and excitedly suggests it might be an ancient military tunnel.",
      "level": 1
    },
    {
      "id": "91",
      "text": "He tells Ding not to tell anyone and goes to recruit others.",
      "level": 1
    },
    {
      "id": "92",
      "text": "Liu Da Nao Di enlists the help of the Du brothers (Du Decai and Du Defu), skilled carpenters, and Sun Quanzhu, who brings an ancient pottery pot.",
      "level": 1
    },
    {
      "id": "93",
      "text": "The pottery pot contains a map that appears to depict Maoling Village.",
      "level": 1
    },
    {
      "id": "94",
      "text": "Liu Da Nao Di believes the location of the hole corresponds to a specific point on the map, possibly related to an 'Eight Bird Formation' (八鸟阵).",
      "level": 1
    },
    {
      "id": "95",
      "text": "They bring their tools and enter the hole.",
      "level": 1
    },
    {
      "id": "96",
      "text": "They find Xiao Bao, who has fainted from lack of oxygen, and send him back out.",
      "level": 1
    },
    {
      "id": "97",
      "text": "They proceed further into a narrow, cold stone passage.",
      "level": 1
    },
    {
      "id": "98",
      "text": "They encounter a stone wall with an octagonal pattern and steel balls at each corner.",
      "level": 1
    },
    {
      "id": "99",
      "text": "Du Decai realizes it's an 'Eight Bird Formation' by removing a steel ball and finding a small hole.",
      "level": 1
    },
    {
      "id": "100",
      "text": "They use clear glass bottles containing live sparrows, each with a cork and a small opening for air and grain.",
      "level": 1
    },
    {
      "id": "101",
      "text": "They replace the steel balls with the sparrow bottles.",
      "level": 1
    },
    {
      "id": "102",
      "text": "Seven of the sparrows become agitated and die, while one remains calm.",
      "level": 1
    },
    {
      "id": "103",
      "text": "They identify the calm sparrow's bottle as the key to opening the 'Eight Bird Stone Gate Formation'.",
      "level": 1
    },
    {
      "id": "104",
      "text": "They pour ten pounds of soybean oil into the hole.",
      "level": 1
    },
    {
      "id": "105",
      "text": "A rumbling sound indicates the stone wall separating, revealing a half-meter high opening.",
      "level": 1
    },
    {
      "id": "106",
      "text": "Du Defu explains that the oil dissolves the 'Sanhe Stone' (三合石) filling the gears, allowing the mechanism to activate.",
      "level": 1
    },
    {
      "id": "107",
      "text": "The Sanhe Stone is made of bone ash, flour, and pine oil, hardening into a solid but water-soluble substance.",
      "level": 1
    },
    {
      "id": "108",
      "text": "Liu Da Nao Di suggests whoever enters first gets the largest share.",
      "level": 1
    },
    {
      "id": "109",
      "text": "Sun Quanzhu, having drawn the short straw, enters first.",
      "level": 1
    },
    {
      "id": "110",
      "text": "The upper part of the stone wall rapidly descends, crushing Sun Quanzhu into a paste.",
      "level": 1
    },
    {
      "id": "111",
      "text": "The stone wall then slowly rises again.",
      "level": 1
    },
    {
      "id": "112",
      "text": "Du Decai believes Sun Quanzhu's blood is melting the Sanhe Stone, reactivating the mechanism.",
      "level": 1
    },
    {
      "id": "113",
      "text": "They quickly crawl through the opening.",
      "level": 1
    },
    {
      "id": "114",
      "text": "They enter a long stone passage with no apparent mechanisms.",
      "level": 1
    },
    {
      "id": "115",
      "text": "As they proceed, Du Defu forgets the rule about not lifting his feet.",
      "level": 1
    },
    {
      "id": "116",
      "text": "Ten iron crossbow bolts shoot out from the wall, hitting Du Decai and Du Defu, who die spitting blood.",
      "level": 1
    },
    {
      "id": "117",
      "text": "Liu Da Nao Di decides to abandon the venture and leave the village.",
      "level": 1
    },
    {
      "id": "118",
      "text": "He continues down the passage and finds an iron offering table with a square iron box.",
      "level": 1
    },
    {
      "id": "119",
      "text": "Inside the box is a pure gold circular disk with intricate patterns.",
      "level": 1
    },
    {
      "id": "120",
      "text": "Liu Da Nao Di, struggling to breathe, takes the box and leaves.",
      "level": 1
    },
    {
      "id": "121",
      "text": "He deceives Ding, telling her that the others are guarding weapons and promising her a share of the profits.",
      "level": 1
    },
    {
      "id": "122",
      "text": "Liu Da Nao Di flees Xi'an and meets a wealthy antique dealer named Bai Zhanguang.",
      "level": 1
    },
    {
      "id": "123",
      "text": "Bai Zhanguang buys the gold disk for 200,000 yuan.",
      "level": 1
    },
    {
      "id": "124",
      "text": "Bai Zhanguang sells it for ten times the price to Lin Zhiyang, a renowned Xi'an archaeologist and collector.",
      "level": 1
    },
    {
      "id": "125",
      "text": "Lin Zhiyang, a white-haired professor, examines the gold disk in his study.",
      "level": 1
    },
    {
      "id": "126",
      "text": "The gold disk consists of thirteen rotatable gold rings with complex patterns.",
      "level": 1
    },
    {
      "id": "127",
      "text": "The seventh ring has a prominent red dot.",
      "level": 2
    },
    {
      "id": "128",
      "text": "The disk has small, archaic script at the bottom: 'Six Ren Ji Le Pan (六壬极乐盘), Tian Yan (天眼) reveals divine powers. Seek the immortal mountain, and you shall see the infinite.'",
      "level": 1
    },
    {
      "id": "129",
      "text": "Lin Zhiyang compares the inscription to an ancient book and becomes excited, questioning the existence of 'Tian Yan' and the meaning of 'immortal mountain'.",
      "level": 1
    },
    {
      "id": "130",
      "text": "He takes medication for his heart and paces, appearing conflicted.",
      "level": 1
    },
    {
      "id": "131",
      "text": "Lin Zhiyang opens a hidden safe behind a painting.",
      "level": 1
    },
    {
      "id": "132",
      "text": "Inside the safe, he finds an album of old photographs.",
      "level": 1
    },
    {
      "id": "133",
      "text": "One photograph shows a younger Lin Zhiyang and a pockmarked man named Chang Tianxi, holding two pottery vases.",
      "level": 1
    },
    {
      "id": "134",
      "text": "Lin Zhiyang reminisces about Chang Tianxi and their potential continued connection.",
      "level": 1
    },
    {
      "id": "135",
      "text": "The narrative shifts to the Zhuque Road Antique Market in Xi'an.",
      "level": 1
    },
    {
      "id": "136",
      "text": "The market is large and diverse, with both general merchandise stalls and more specialized antique shops.",
      "level": 1
    },
    {
      "id": "137",
      "text": "Tang Xun, an editor from Shenyang interested in antiques, visits the market.",
      "level": 1
    },
    {
      "id": "138",
      "text": "He laments the increasing prevalence of fakes in the market.",
      "level": 1
    },
    {
      "id": "139",
      "text": "He is drawn to a bustling antique shop called 'Shengyun Zhai' (盛芸斋).",
      "level": 1
    },
    {
      "id": "140",
      "text": "The shop displays a gleaming gold disk on a rosewood table, wrapped in red silk.",
      "level": 1
    },
    {
      "id": "141",
      "text": "The shop owner, a middle-aged man with a long face, watches the crowd.",
      "level": 1
    },
    {
      "id": "142",
      "text": "Customers speculate about the object's origin and purpose.",
      "level": 1
    },
    {
      "id": "143",
      "text": "Tang Xun casually mentions 'Liu Ren Ji Le Pan' (六壬极乐盘).",
      "level": 1
    },
    {
      "id": "144",
      "text": "Some customers mock him, while a man with a scar on his forehead observes Tang Xun.",
      "level": 1
    },
    {
      "id": "145",
      "text": "The shop owner announces that no one recognizes the object and prepares to close.",
      "level": 1
    },
    {
      "id": "146",
      "text": "The owner calls Tang Xun aside and invites him to the back room to talk.",
      "level": 1
    },
    {
      "id": "147",
      "text": "The owner introduces himself as Chang Tianxi.",
      "level": 1
    },
    {
      "id": "148",
      "text": "Tang Xun, a magazine editor, explains his interest in ancient texts and civilizations.",
      "level": 1
    },
    {
      "id": "149",
      "text": "Chang Tianxi notes Tang Xun's potential family background related to the Imperial Household Department.",
      "level": 1
    },
    {
      "id": "150",
      "text": "Tang Xun recounts how his family lost many antiques during the Cultural Revolution.",
      "level": 1
    },
    {
      "id": "151",
      "text": "Chang Tianxi expresses regret over the destruction of cultural heritage.",
      "level": 1
    },
    {
      "id": "152",
      "text": "Tang Xun mentions his grandfather sold a valuable Tang Bohu painting to a foreign professor.",
      "level": 1
    },
    {
      "id": "153",
      "text": "Chang Tianxi inquires about Tang Xun's other interests.",
      "level": 1
    },
    {
      "id": "154",
      "text": "Tang Xun states his broad interests, including ancient architecture and mechanisms.",
      "level": 1
    },
    {
      "id": "155",
      "text": "Tang Xun's magazine specializes in rare texts and studies ancient civilizations like Loulan and Khotan.",
      "level": 1
    },
    {
      "id": "156",
      "text": "Chang Tianxi directly asks Tang Xun about the 'Liu Ren Ji Le Pan'.",
      "level": 1
    },
    {
      "id": "157",
      "text": "Tang Xun admits he encountered the name in a damaged ancient book, 'Imperial Tomb Secret Techniques' (皇陵秘术), which described ancient construction mechanisms.",
      "level": 1
    },
    {
      "id": "158",
      "text": "The book provided instructions on how to open the gold disk's mechanism.",
      "level": 1
    },
    {
      "id": "159",
      "text": "Tang Xun demonstrates how to open the gold disk by rotating the rings.",
      "level": 1
    },
    {
      "id": "160",
      "text": "The gold rings separate, revealing half-formed rune-like symbols on the underside.",
      "level": 1
    },
    {
      "id": "161",
      "text": "Tang Xun suggests these symbols are the key to the disk's patterns and meaning.",
      "level": 1
    },
    {
      "id": "162",
      "text": "Chang Tianxi is astonished by the hidden mechanism.",
      "level": 1
    },
    {
      "id": "163",
      "text": "Chang Tianxi reveals that the disk is already owned by his friend, Professor Lin Zhiyang, who is seeking to understand its purpose.",
      "level": 1
    },
    {
      "id": "164",
      "text": "Chang Tianxi invites Tang Xun to visit Professor Lin Zhiyang's home to discuss the disk.",
      "level": 1
    },
    {
      "id": "165",
      "text": "Tang Xun agrees to the invitation.",
      "level": 1
    },
    {
      "id": "166",
      "text": "Tang Xun visits Professor Lin Zhiyang's opulent villa.",
      "level": 1
    },
    {
      "id": "167",
      "text": "The villa is filled with valuable antique furniture and artworks.",
      "level": 1
    },
    {
      "id": "168",
      "text": "Lin Zhiyang, an esteemed professor and antique collector, greets them.",
      "level": 1
    },
    {
      "id": "169",
      "text": "Lin Zhiyang asks about Tang Xun's area of expertise in antiques.",
      "level": 1
    },
    {
      "id": "170",
      "text": "Tang Xun humbly states his interest in Han-Tang jade and ancient architectural mechanisms.",
      "level": 1
    }
  ],
  "concepts": [
    {
      "name": "Military Tent",
      "frequency": 1,
      "context": "A large military tent is set up in a mountain gully."
    },
    {
      "name": "Protective Suits",
      "frequency": 4,
      "context": "Dozens of people in orange-red protective suits are busy working; Three people stand outside a Toyota SUV, wearing protective suits."
    },
    {
      "name": "Excavator",
      "frequency": 3,
      "context": "A modern excavator is continuously roaring; The excavator driver; The excavator's bucket cannot work."
    },
    {
      "name": "Magnetic Field Detector",
      "frequency": 3,
      "context": "Some individuals are using a micro magnetic field detector; Old Wei stares at a micro magnetic field detector; The magnetic field strength rapidly increases."
    },
    {
      "name": "Radiation",
      "frequency": 5,
      "context": "Radiation field strength is increasing; 5000 rem of radiation; extreme radioactivity; extreme radiation; radiation has affected him."
    },
    {
      "name": "Uranium Deposit",
      "frequency": 1,
      "context": "intelligence about a giant uranium deposit is likely correct."
    },
    {
      "name": "Toyota SUV",
      "frequency": 2,
      "context": "A Toyota SUV parked 500 meters away; The SUV, traveling at high speed."
    },
    {
      "name": "Bronze Coffin",
      "frequency": 5,
      "context": "a bronze rectangular object resembling a coffin; extract the bronze coffin; The bronze coffin is gradually unearthed; The bronze coffin, covered in green patina; The bronze coffin suddenly vibrates."
    },
    {
      "name": "Dizziness",
      "frequency": 3,
      "context": "feeling dizzy and nauseous; surrounding personnel experience dizziness; I feel increasingly dizzy."
    },
    {
      "name": "Nausea",
      "frequency": 1,
      "context": "feeling dizzy and nauseous."
    },
    {
      "name": "Vomiting",
      "frequency": 1,
      "context": "Some workers begin to experience mild vomiting."
    },
    {
      "name": "Landslide",
      "frequency": 1,
      "context": "reports signs of a landslide above."
    },
    {
      "name": "Blood",
      "frequency": 5,
      "context": "Blood flows from the person's nose and mouth; notices blood on his hands; blood coming from his nose, eyes, and mouth; spit out blood; Sun Quanzhu's blood."
    },
    {
      "name": "Tian Yan (天眼)",
      "frequency": 3,
      "context": "He questions the identity of 'Tian Yan'; secrets of 'Tian Yan'; Tian Yan reveals divine powers."
    },
    {
      "name": "Radio Communication",
      "frequency": 3,
      "context": "radio communicators to guide the excavator driver; Communication is conducted via radio; Wei Zong asks what happened via radio."
    },
    {
      "name": "Site Commander",
      "frequency": 4,
      "context": "The site commander reports; The commander states; The commander reports; The commander nervously reports."
    },
    {
      "name": "Workers",
      "frequency": 3,
      "context": "workers if they feel unwell; A worker reports; workers begin to experience mild vomiting."
    },
    {
      "name": "Wei Zong (魏总)",
      "frequency": 8,
      "context": "identified as 'Wei Zong'; Wei Zong predicts; Wei Zong orders; Wei Zong decides; Wei Zong's breathing quickens; Wei Zong orders; Wei Zong dismisses the landslide; Wei Zong tries to contact."
    },
    {
      "name": "Old Liang",
      "frequency": 5,
      "context": "Old Liang orders; Old Liang asks; Old Liang observes; Old Liang expresses concern; Old Liang draws his pistol."
    },
    {
      "name": "Dead Bodies",
      "frequency": 1,
      "context": "find numerous orange-suited corpses."
    },
    {
      "name": "Electromagnetic Detector",
      "frequency": 2,
      "context": "The electromagnetic detector near the commander's body suddenly beeps; a micro magnetic field detector."
    },
    {
      "name": "Blindness",
      "frequency": 1,
      "context": "The other person states their eyes are blind."
    },
    {
      "name": "Liu Da Nao Di (刘大脑袋)",
      "frequency": 8,
      "context": "A character named Liu Da Nao Di explores; Liu Da Nao Di examines the bricks; Liu Da Nao Di enlists the help; Liu Da Nao Di believes; Liu Da Nao Di suggests; Liu Da Nao Di decides to abandon; Liu Da Nao Di, struggling to breathe; Liu Da Nao Di deceives Ding."
    },
    {
      "name": "Golden Disk",
      "frequency": 7,
      "context": "a golden circular disk; a pure gold circular disk; The gold disk consists of thirteen rotatable gold rings; opens the gold disk's mechanism; Tang Xun demonstrates how to open the gold disk; the gold disk's patterns and meaning; The gold disk is already owned by his friend."
    },
    {
      "name": "Xingping County",
      "frequency": 1,
      "context": "in Xingping County, Shaanxi Province."
    },
    {
      "name": "Maoling Village",
      "frequency": 2,
      "context": "Maoling Village; depict Maoling Village."
    },
    {
      "name": "Widow Ding",
      "frequency": 3,
      "context": "A widow named Ding; Ding warns Xiao Bao; Ding cannot find Xiao Bao; Ding realizes Xiao Bao's disappearance; Ding, telling her that the others are guarding weapons."
    },
    {
      "name": "Xiao Bao",
      "frequency": 3,
      "context": "her five-and-a-half-year-old son, Xiao Bao; Xiao Bao follows the rabbit; They find Xiao Bao."
    },
    {
      "name": "Wild Rabbit",
      "frequency": 2,
      "context": "playing with a wild rabbit; The rabbit escapes into a disused large stove pit."
    },
    {
      "name": "Stove Pit",
      "frequency": 3,
      "context": "disused large stove pit; the hole in the stove pit; the stove pit."
    },
    {
      "name": "Military Tunnel",
      "frequency": 1,
      "context": "suggests it might be an ancient military tunnel."
    },
    {
      "name": "Pottery Pot",
      "frequency": 2,
      "context": "Sun Quanzhu, who brings an ancient pottery pot; The pottery pot contains a map."
    },
    {
      "name": "Map",
      "frequency": 2,
      "context": "The pottery pot contains a map; map that appears to depict Maoling Village."
    },
    {
      "name": "Eight Bird Formation (八鸟阵)",
      "frequency": 3,
      "context": "related to an 'Eight Bird Formation'; 'Eight Bird Formation'; 'Eight Bird Stone Gate Formation'."
    },
    {
      "name": "Live Sparrows",
      "frequency": 2,
      "context": "containing live sparrows; the calm sparrow's bottle."
    },
    {
      "name": "Soybean Oil",
      "frequency": 2,
      "context": "pour ten pounds of soybean oil; oil dissolves the 'Sanhe Stone'."
    },
    {
      "name": "Sanhe Stone (三合石)",
      "frequency": 3,
      "context": "dissolves the 'Sanhe Stone'; The Sanhe Stone is made of bone ash; Sun Quanzhu's blood is melting the Sanhe Stone."
    },
    {
      "name": "Crossbow Bolts",
      "frequency": 1,
      "context": "Ten iron crossbow bolts shoot out."
    },
    {
      "name": "Antique Market",
      "frequency": 4,
      "context": "the Zhuque Road Antique Market; the market is large; visits the market; Antique Market."
    },
    {
      "name": "Tang Xun",
      "frequency": 11,
      "context": "Tang Xun, an editor from Shenyang; Tang Xun casually mentions; The owner calls Tang Xun aside; Tang Xun, a magazine editor; Tang Xun recounts; Tang Xun mentions; Tang Xun states; Tang Xun's magazine specializes; Tang Xun admits he encountered the name; Tang Xun demonstrates; Tang Xun suggests."
    },
    {
      "name": "Chang Tianxi",
      "frequency": 7,
      "context": "a pockmarked man named Chang Tianxi; Chang Tianxi; Chang Tianxi notes Tang Xun's potential family background; Chang Tianxi expresses regret; Chang Tianxi inquires; Chang Tianxi directly asks; Chang Tianxi reveals."
    },
    {
      "name": "Lin Zhiyang (林之洋)",
      "frequency": 7,
      "context": "Lin Zhiyang, a renowned Xi'an archaeologist; Lin Zhiyang, a white-haired professor; Lin Zhiyang reminisces; Lin Zhiyang, an esteemed professor; Lin Zhiyang asks; Lin Zhiyang greets them; Lin Zhiyang, the disk is already owned by his friend."
    },
    {
      "name": "Imperial Household Department",
      "frequency": 1,
      "context": "family background related to the Imperial Household Department."
    },
    {
      "name": "Cultural Revolution",
      "frequency": 2,
      "context": "during the Cultural Revolution; Chang Tianxi expresses regret over the destruction of cultural heritage."
    },
    {
      "name": "Tang Bohu",
      "frequency": 1,
      "context": "sold a valuable Tang Bohu painting."
    },
    {
      "name": "Ancient Texts",
      "frequency": 1,
      "context": "interest in ancient texts."
    },
    {
      "name": "Ancient Civilizations",
      "frequency": 1,
      "context": "studies ancient civilizations like Loulan and Khotan."
    },
    {
      "name": "Loulan",
      "frequency": 1,
      "context": "civilizations like Loulan."
    },
    {
      "name": "Khotan",
      "frequency": 1,
      "context": "and Khotan."
    },
    {
      "name": "Imperial Tomb Secret Techniques (皇陵秘术)",
      "frequency": 1,
      "context": "a damaged ancient book, 'Imperial Tomb Secret Techniques'."
    },
    {
      "name": "Ancient Construction Mechanisms",
      "frequency": 1,
      "context": "ancient construction mechanisms."
    },
    {
      "name": "Han-Tang Jade",
      "frequency": 1,
      "context": "interest in Han-Tang jade."
    },
    {
      "name": "Architectural Mechanisms",
      "frequency": 1,
      "context": "ancient architectural mechanisms."
    },
    {
      "name": "Immortal Mountain",
      "frequency": 1,
      "context": "Seek the immortal mountain."
    },
    {
      "name": "Divine Powers",
      "frequency": 1,
      "context": "Tian Yan reveals divine powers."
    }
  ],
  "relations": [
    {
      "source": "Military Tent",
      "target": "Protective Suits",
      "type": "has_personnel"
    },
    {
      "source": "Military Tent",
      "target": "Excavator",
      "type": "has_equipment"
    },
    {
      "source": "Military Tent",
      "target": "Magnetic Field Detector",
      "type": "has_equipment"
    },
    {
      "source": "Protective Suits",
      "target": "Radiation",
      "type": "protects_from"
    },
    {
      "source": "Radiation",
      "target": "Uranium Deposit",
      "type": "associated_with"
    },
    {
      "source": "Radiation",
      "target": "Dizziness",
      "type": "causes"
    },
    {
      "source": "Radiation",
      "target": "Vomiting",
      "type": "causes"
    },
    {
      "source": "Radiation",
      "target": "Blood",
      "type": "causes"
    },
    {
      "source": "Radiation",
      "target": "Blindness",
      "type": "causes"
    },
    {
      "source": "Excavator",
      "target": "Bronze Coffin",
      "type": "discovers"
    },
    {
      "source": "Magnetic Field Detector",
      "target": "Radiation",
      "type": "detects"
    },
    {
      "source": "Bronze Coffin",
      "target": "Blood",
      "type": "associated_with_emergence"
    },
    {
      "source": "Bronze Coffin",
      "target": "Tian Yan (天眼)",
      "type": "related_to"
    },
    {
      "source": "Wei Zong (魏总)",
      "target": "Bronze Coffin",
      "type": "orders_extraction_of"
    },
    {
      "source": "Wei Zong (魏总)",
      "target": "Tian Yan (天眼)",
      "type": "seeks_secrets_of"
    },
    {
      "source": "Wei Zong (魏总)",
      "target": "Radiation",
      "type": "experienced"
    },
    {
      "source": "Old Liang",
      "target": "Radiation",
      "type": "experienced"
    },
    {
      "source": "Old Liang",
      "target": "Dead Bodies",
      "type": "discovers"
    },
    {
      "source": "Dead Bodies",
      "target": "Radiation",
      "type": "cause_of_death"
    },
    {
      "source": "Electromagnetic Detector",
      "target": "Radiation",
      "type": "indicates"
    },
    {
      "source": "Toyota SUV",
      "target": "Explosion",
      "type": "suffers"
    },
    {
      "source": "Liu Da Nao Di (刘大脑袋)",
      "target": "Golden Disk",
      "type": "finds"
    },
    {
      "source": "Golden Disk",
      "target": "Tian Yan (天眼)",
      "type": "related_to"
    },
    {
      "source": "Golden Disk",
      "target": "Six Ren Ji Le Pan (六壬极乐盘)",
      "type": "is_a"
    },
    {
      "source": "Golden Disk",
      "target": "Ancient Construction Mechanisms",
      "type": "contains_information_on"
    },
    {
      "source": "Golden Disk",
      "target": "Imperial Tomb Secret Techniques (皇陵秘术)",
      "type": "described_in"
    },
    {
      "source": "Liu Da Nao Di (刘大脑袋)",
      "target": "Pottery Pot",
      "type": "uses_for_map"
    },
    {
      "source": "Pottery Pot",
      "target": "Map",
      "type": "contains"
    },
    {
      "source": "Map",
      "target": "Maoling Village",
      "type": "depicts"
    },
    {
      "source": "Eight Bird Formation (八鸟阵)",
      "target": "Live Sparrows",
      "type": "mechanism_involves"
    },
    {
      "source": "Eight Bird Formation (八鸟阵)",
      "target": "Soybean Oil",
      "type": "activator_for"
    },
    {
      "source": "Eight Bird Formation (八鸟阵)",
      "target": "Sanhe Stone (三合石)",
      "type": "uses"
    },
    {
      "source": "Sanhe Stone (三合石)",
      "target": "Soybean Oil",
      "type": "dissolved_by"
    },
    {
      "source": "Sanhe Stone (三合石)",
      "target": "Blood",
      "type": "melted_by"
    },
    {
      "source": "Eight Bird Formation (八鸟阵)",
      "target": "Crossbow Bolts",
      "type": "defense_mechanism"
    },
    {
      "source": "Tang Xun",
      "target": "Antique Market",
      "type": "visits"
    },
    {
      "source": "Tang Xun",
      "target": "Golden Disk",
      "type": "identifies"
    },
    {
      "source": "Tang Xun",
      "target": "Ancient Texts",
      "type": "studies"
    },
    {
      "source": "Tang Xun",
      "target": "Imperial Tomb Secret Techniques (皇陵秘术)",
      "type": "read"
    },
    {
      "source": "Tang Xun",
      "target": "Ancient Construction Mechanisms",
      "type": "interested_in"
    },
    {
      "source": "Tang Xun",
      "target": "Chang Tianxi",
      "type": "interacts_with"
    },
    {
      "source": "Chang Tianxi",
      "target": "Golden Disk",
      "type": "possesses"
    },
    {
      "source": "Chang Tianxi",
      "target": "Lin Zhiyang (林之洋)",
      "type": "acquaintance_of"
    },
    {
      "source": "Chang Tianxi",
      "target": "Tang Xun",
      "type": "interacts_with"
    },
    {
      "source": "Lin Zhiyang (林之洋)",
      "target": "Golden Disk",
      "type": "possesses"
    },
    {
      "source": "Lin Zhiyang (林之洋)",
      "target": "Ancient Artifacts",
      "type": "collects"
    },
    {
      "source": "Lin Zhiyang (林之洋)",
      "target": "Tang Xun",
      "type": "meets"
    },
    {
      "source": "Lin Zhiyang (林之洋)",
      "target": "Chang Tianxi",
      "type": "acquaintance_of"
    },
    {
      "source": "Lin Zhiyang (林之洋)",
      "target": "Han-Tang Jade",
      "type": "interested_in"
    },
    {
      "source": "Lin Zhiyang (林之洋)",
      "target": "Architectural Mechanisms",
      "type": "interested_in"
    },
    {
      "source": "Lin Zhiyang (林之洋)",
      "target": "Immortal Mountain",
      "type": "seeks_meaning_of"
    },
    {
      "source": "Lin Zhiyang (林之洋)",
      "target": "Tian Yan (天眼)",
      "type": "seeks_meaning_of"
    }
  ],
  "hierarchy": {
    "main_topics": [
      "Discovery of a Mysterious Object",
      "Exploration of Ancient Secrets",
      "The Role of Artifacts in Unveiling Mysteries"
    ],
    "structure": "The document is divided into chapters, with Chapter 1 and 3 focusing on the initial discovery and the artifact itself, while Chapter 2 delves into the exploration of a subterranean passage and the artifact's connection to ancient formations. The narrative progresses from a modern-day archaeological dig to an ancient tomb exploration and finally to the examination of the artifact by collectors and scholars."
  }
}