{
  "propositions": [
    {
      "id": "1",
      "text": "The story revolves around Jun Ying, a woman in a female-dominated society, seeking freedom and respect amidst traditional constraints.",
      "level": 1
    },
    {
      "id": "1.1",
      "text": "Jun Ying's internal struggle and desire for freedom are central themes.",
      "level": 2
    },
    {
      "id": "1.2",
      "text": "Jun Ying meets Fei Hua, a bold and ambitious woman, leading to a complex relationship.",
      "level": 2
    },
    {
      "id": "2",
      "text": "The relationship between Jun Ying and Fei Hua evolves with emotional conflicts driven by control and freedom.",
      "level": 1
    },
    {
      "id": "2.1",
      "text": "Jun Ying feels both attraction and fear of being controlled by Fei Hua.",
      "level": 2
    },
    {
      "id": "2.2",
      "text": "Societal stereotypes about female relationships add pressure to their bond.",
      "level": 2
    },
    {
      "id": "3",
      "text": "Societal expectations in a female-dominated world burden Jun Ying with family responsibilities, conflicting with her personal dreams.",
      "level": 1
    },
    {
      "id": "3.1",
      "text": "Jun Ying faces family criticism for prioritizing personal desires over duty.",
      "level": 2
    },
    {
      "id": "4",
      "text": "Jun Ying chooses to leave her familiar environment for personal growth, marking a significant separation from Fei Hua.",
      "level": 1
    },
    {
      "id": "4.1",
      "text": "Her journey teaches her independence and clarity about her desires.",
      "level": 2
    },
    {
      "id": "5",
      "text": "Years later, Jun Ying and Fei Hua reunite, having grown individually, and attempt to rebuild their relationship on equal terms.",
      "level": 1
    },
    {
      "id": "5.1",
      "text": "Their reconciliation suggests a hopeful, open-ended future.",
      "level": 2
    }
  ],
  "concepts": [
    {
      "name": "Female-Dominated Society",
      "frequency": 5,
      "context": "A societal structure where women hold primary power and responsibility."
    },
    {
      "name": "Freedom",
      "frequency": 6,
      "context": "Jun Ying's central desire to escape societal and relational constraints."
    },
    {
      "name": "Control",
      "frequency": 4,
      "context": "Fei Hua's initial tendency to dominate Jun Ying, creating relational tension."
    },
    {
      "name": "Emotional Conflict",
      "frequency": 3,
      "context": "The tension between attraction and fear in Jun Ying and Fei Hua's relationship."
    },
    {
      "name": "Growth",
      "frequency": 3,
      "context": "Personal development of Jun Ying and Fei Hua through separation and challenges."
    }
  ],
  "relations": [
    {
      "source": "Female-Dominated Society",
      "target": "Freedom",
      "type": "constrains"
    },
    {
      "source": "Jun Ying",
      "target": "Freedom",
      "type": "desires"
    },
    {
      "source": "Fei Hua",
      "target": "Control",
      "type": "exhibits"
    },
    {
      "source": "Jun Ying",
      "target": "Fei Hua",
      "type": "attracted_to"
    },
    {
      "source": "Emotional Conflict",
      "target": "Jun Ying",
      "type": "affects"
    },
    {
      "source": "Growth",
      "target": "Jun Ying",
      "type": "results_in"
    },
    {
      "source": "Growth",
      "target": "Fei Hua",
      "type": "results_in"
    }
  ],
  "hierarchy": {
    "main_topics": [
      "Jun Ying's Struggle for Freedom",
      "Relationship Dynamics with Fei Hua",
      "Societal Pressures in a Female-Dominated World",
      "Personal Growth and Reconciliation"
    ],
    "structure": "The document is organized into five chapters, each focusing on a stage of Jun Ying's journey—introduction, relational conflict, societal challenge, personal growth through separation, and eventual reunion and reconciliation."
  }
}