{
  "propositions": [
    {
      "id": "1",
      "text": "The document is a preface and the first part of a novel titled 'The Desert Wolf' by Nanpai Sanshu.",
      "level": 1
    },
    {
      "id": "1.1",
      "text": "The author, a retired geological exploration team member, decides to record past events despite their strangeness and potential inconsistency with the world view.",
      "level": 2
    },
    {
      "id": "1.2",
      "text": "These events are described as 'things that should not exist' and are not found in official archives.",
      "level": 2
    },
    {
      "id": "1.3",
      "text": "The author emphasizes that the reader is encountering a novel, not a reportage.",
      "level": 2
    },
    {
      "id": "2",
      "text": "The first part, 'Desperate Exploration', details a significant event in 1962.",
      "level": 1
    },
    {
      "id": "2.1",
      "text": "Before 1962, the author found geological exploration extremely monotonous and suffocating.",
      "level": 2
    },
    {
      "id": "2.2",
      "text": "The 1962 event dispelled this feeling, revealing hidden mysteries within the mountains.",
      "level": 2
    },
    {
      "id": "2.3",
      "text": "The event is connected to the 'No. 723 Project' in Inner Mongolia, a coal mine exploration operation.",
      "level": 2
    },
    {
      "id": "2.4",
      "text": "The project was abruptly halted, and technical personnel were secretly requisitioned.",
      "level": 2
    },
    {
      "id": "2.5",
      "text": "The author was among the twenty-four technical personnel selected and transported to Inner Mongolia.",
      "level": 2
    },
    {
      "id": "2.6",
      "text": "Initial speculation among the technical staff was the discovery of a large oil field, similar to the Daqing oilfield discovery.",
      "level": 2
    },
    {
      "id": "2.7",
      "text": "Upon arrival, the scale of the operation, with numerous military tents and army engineers, suggested something far more significant than oil exploration.",
      "level": 2
    },
    {
      "id": "2.8",
      "text": "The presence of advanced, Soviet-imported deep-drilling equipment, beyond the capabilities of the era, further fueled suspicion.",
      "level": 2
    },
    {
      "id": "2.9",
      "text": "The author describes a tense wait for a month in the camp, with no clear explanation for their presence.",
      "level": 2
    },
    {
      "id": "2.10",
      "text": "After a month, they were transported further into the mountains.",
      "level": 2
    },
    {
      "id": "3",
      "text": "The journey to the destination was arduous and disorienting.",
      "level": 1
    },
    {
      "id": "3.1",
      "text": "They traveled through rough, newly created mountain roads for four to five days.",
      "level": 2
    },
    {
      "id": "3.2",
      "text": "The exact location remained unknown, with speculation it could be near the Sino-Mongolian border.",
      "level": 2
    },
    {
      "id": "3.3",
      "text": "Upon arrival, they found a dilapidated area with rusted barbed wire and remnants of Japanese structures.",
      "level": 2
    },
    {
      "id": "3.4",
      "text": "The presence of these Japanese remnants suggested past secret activities in the region.",
      "level": 2
    },
    {
      "id": "3.5",
      "text": "They were housed in old, dilapidated Japanese soldiers' quarters.",
      "level": 2
    },
    {
      "id": "3.6",
      "text": "A secret meeting was held where participants were required to swear an oath of absolute secrecy.",
      "level": 2
    },
    {
      "id": "3.7",
      "text": "The meeting involved viewing a classified black-and-white film, referred to as a 'Zero Tape'.",
      "level": 2
    },
    {
      "id": "4",
      "text": "The 'Zero Tape' revealed the purpose of their summons.",
      "level": 1
    },
    {
      "id": "4.1",
      "text": "The 'Zero Tape' is a designation for secret films shown to high-ranking officials, originating from a film about the Daqing oilfield.",
      "level": 2
    },
    {
      "id": "4.2",
      "text": "The film described the discovery of a Japanese transport plane wreck in a mud pit in 1959.",
      "level": 2
    },
    {
      "id": "4.3",
      "text": "The plane's cargo consisted of Japanese Kwantung Army geological exploration documents for Northeast China and Mongolia.",
      "level": 2
    },
    {
      "id": "4.4",
      "text": "These documents were lost after WWII and were believed to be destroyed or captured by other powers.",
      "level": 2
    },
    {
      "id": "4.5",
      "text": "A meticulously designed, locked metal box was found within the documents.",
      "level": 2
    },
    {
      "id": "4.6",
      "text": "Upon opening the box, they found geological exploration data written in code, hinting at something exceptionally important.",
      "level": 2
    },
    {
      "id": "4.7",
      "text": "Following the data's guidance, a special project team was formed for the No. 723 Project, leading to the discovery of the abandoned Japanese base.",
      "level": 2
    },
    {
      "id": "4.8",
      "text": "Despite extensive Japanese exploration, no surface traces of significant mineral deposits were found by the Chinese team.",
      "level": 2
    },
    {
      "id": "4.9",
      "text": "Advanced Soviet seismic exploration equipment was deployed to investigate the area based on the Japanese data.",
      "level": 2
    },
    {
      "id": "4.10",
      "text": "The seismic data revealed an anomalous reflection 1200 meters underground, shaped like a cross.",
      "level": 2
    },
    {
      "id": "4.11",
      "text": "Upon magnification, the shape was identified as a Japanese 'Shenshan' heavy bomber.",
      "level": 2
    },
    {
      "id": "5",
      "text": "The discovery of the buried bomber led to a startling hypothesis.",
      "level": 1
    },
    {
      "id": "5.1",
      "text": "The most plausible explanation, given the evidence, was that the Japanese had dug or found a passage to the underground, disassembled the bomber, and reassembled it 1200 meters below the surface.",
      "level": 2
    },
    {
      "id": "5.2",
      "text": "To confirm this, they needed to find the passage and evidence of equipment used in the process.",
      "level": 2
    },
    {
      "id": "5.3",
      "text": "Traces of antifreeze oil were found, supporting the theory that equipment had been used.",
      "level": 2
    },
    {
      "id": "5.4",
      "text": "The current mission was to find the underground passage.",
      "level": 2
    },
    {
      "id": "6",
      "text": "The search for the passage led to the discovery of a cave.",
      "level": 1
    },
    {
      "id": "6.1",
      "text": "After twelve days of searching, a hidden, large geological cave was found approximately eight kilometers away.",
      "level": 2
    },
    {
      "id": "6.2",
      "text": "The cave's entrance was well-concealed, suggesting it was not recently discovered.",
      "level": 2
    },
    {
      "id": "6.3",
      "text": "The initial section of the cave was a vertical shaft, 214 meters deep, leading to an underground river.",
      "level": 2
    },
    {
      "id": "6.4",
      "text": "Four branching tunnels were discovered at the bottom of the vertical shaft.",
      "level": 2
    },
    {
      "id": "6.5",
      "text": "The group was to be divided into teams to explore these tunnels.",
      "level": 2
    },
    {
      "id": "6.6",
      "text": "The author was assigned to the second group, along with Wang Sichuan and two others.",
      "level": 2
    },
    {
      "id": "6.7",
      "text": "The exploration required specialized engineering troops for support and carrying equipment.",
      "level": 2
    },
    {
      "id": "6.8",
      "text": "The author and his team were equipped with geological tools, while Wang Sichuan carried mess kits.",
      "level": 2
    },
    {
      "id": "6.9",
      "text": "The descent into the cave was a lengthy and challenging experience.",
      "level": 2
    },
    {
      "id": "6.10",
      "text": "The cave's geology suggested it was a composite of a solutional and a structural cave.",
      "level": 2
    }
  ],
  "concepts": [
    {
      "name": "Geological Exploration",
      "frequency": 15,
      "context": "The primary occupation of the narrator and his colleagues, involving fieldwork in remote areas to find mineral resources. It is characterized by both extreme hardship and the possibility of encountering unexplained phenomena."
    },
    {
      "name": "No. 723 Project",
      "frequency": 8,
      "context": "A secret geological engineering project in Inner Mongolia, the central focus of the narrative. Its abrupt halt and the subsequent secretive requisitioning of personnel indicate its extraordinary nature."
    },
    {
      "name": "Secret/Classified Information",
      "frequency": 12,
      "context": "Pervasive throughout the narrative, from the 'should not exist' events to the 'Zero Tape' and the coded data. This concept underscores the clandestine nature of the events and the government's efforts to control information."
    },
    {
      "name": "Japanese Remnants",
      "frequency": 7,
      "context": "Includes abandoned structures, barbed wire, and potential evidence of Japanese military or exploration activities in the region. These remnants hint at a historical context of covert operations and prior discovery."
    },
    {
      "name": "Soviet Equipment",
      "frequency": 4,
      "context": "Advanced seismic exploration equipment imported from the Soviet Union, highlighting the technological disparities of the era and the high stakes of the project. Its presence suggests the importance of the mission."
    },
    {
      "name": "Zero Tape",
      "frequency": 4,
      "context": "A classified film shown to the technical personnel, containing crucial information about the mission's origins. It represents a critical piece of evidence and a revelation of profound secrets."
    },
    {
      "name": "Coded Data",
      "frequency": 3,
      "context": "A mysterious black metal box containing coded geological exploration data from the Japanese. Its existence and the difficulty in deciphering it emphasize the extreme importance and secrecy of the information."
    },
    {
      "name": "Buried Bomber",
      "frequency": 6,
      "context": "The discovery of a Japanese 'Shenshan' bomber buried 1200 meters underground. This inexplicable finding is the primary mystery driving the narrative and the subsequent exploration."
    },
    {
      "name": "Underground Passage/Cave",
      "frequency": 8,
      "context": "The hypothesized route for the bomber and the subsequent focus of the search. The discovery of a large geological cave signifies the potential breakthrough in understanding the mystery."
    },
    {
      "name": "Technical Personnel",
      "frequency": 10,
      "context": "The group of geologists and engineers brought together for the secret project. Their expertise and their ordinary backgrounds contrast with the extraordinary events they encounter."
    },
    {
      "name": "Engineering Troops",
      "frequency": 6,
      "context": "The military personnel supporting the exploration. Their presence highlights the scale and seriousness of the operation and their role in logistics and security."
    },
    {
      "name": "Old Cat (Lao Mao)",
      "frequency": 10,
      "context": "A mysterious and perceptive older member of the technical team. He exhibits a keen intuition and a detached wisdom, often anticipating events and warning others."
    },
    {
      "name": "Wang Sichuan (Xiongzi)",
      "frequency": 6,
      "context": "A jovial and robust member of the team, serving as a foil to the narrator's more introspective nature. He provides a relatable perspective and companionship."
    },
    {
      "name": "Hypothesis/Deduction",
      "frequency": 5,
      "context": "The process of forming theories to explain the strange occurrences, particularly regarding the buried bomber. This involves scientific reasoning and a willingness to consider unconventional explanations."
    },
    {
      "name": "Secrecy Oath",
      "frequency": 3,
      "context": "A ritualistic swearing of silence, emphasizing the high level of classification surrounding the No. 723 Project and its findings. It highlights the government's control over information."
    }
  ],
  "relations": [
    {
      "source": "Geological Exploration",
      "target": "No. 723 Project",
      "type": "is_part_of"
    },
    {
      "source": "No. 723 Project",
      "target": "Secret/Classified Information",
      "type": "involves"
    },
    {
      "source": "No. 723 Project",
      "target": "Technical Personnel",
      "type": "requires"
    },
    {
      "source": "No. 723 Project",
      "target": "Engineering Troops",
      "type": "supported_by"
    },
    {
      "source": "Secret/Classified Information",
      "target": "Zero Tape",
      "type": "contained_in"
    },
    {
      "source": "Secret/Classified Information",
      "target": "Coded Data",
      "type": "contained_in"
    },
    {
      "source": "Coded Data",
      "target": "Japanese Remnants",
      "type": "originates_from"
    },
    {
      "source": "Japanese Remnants",
      "target": "Buried Bomber",
      "type": "related_to"
    },
    {
      "source": "Buried Bomber",
      "target": "Underground Passage/Cave",
      "type": "implies_existence_of"
    },
    {
      "source": "Underground Passage/Cave",
      "target": "No. 723 Project",
      "type": "focus_of"
    },
    {
      "source": "Hypothesis/Deduction",
      "target": "Buried Bomber",
      "type": "explains"
    },
    {
      "source": "Hypothesis/Deduction",
      "target": "Underground Passage/Cave",
      "type": "confirms"
    },
    {
      "source": "Old Cat (Lao Mao)",
      "target": "Hypothesis/Deduction",
      "type": "employs"
    },
    {
      "source": "Old Cat (Lao Mao)",
      "target": "Underground Passage/Cave",
      "type": "pre-perceives"
    },
    {
      "source": "Secrecy Oath",
      "target": "No. 723 Project",
      "type": "required_for"
    },
    {
      "source": "Soviet Equipment",
      "target": "No. 723 Project",
      "type": "used_in"
    }
  ],
  "hierarchy": {
    "main_topics": [
      "Author's Preface and Motivation",
      "The No. 723 Project: Mobilization and Initial Impressions",
      "The Journey and Arrival at the Site",
      "The 'Zero Tape' Revelation",
      "The Discovery of the Buried Bomber and the Hypothesis",
      "The Search for the Underground Passage",
      "Exploration of the Cave and Team Formation"
    ],
    "structure": "The document follows a chronological and deductive structure, starting with the author's personal motivation, then detailing the mysterious circumstances leading to the No. 723 Project, the arduous journey, the shocking revelations from a classified film, the mind-bending discovery of a buried bomber, the subsequent hypothesis, and finally, the initial stages of exploring a newly discovered cave believed to be connected to the mystery."
  }
}