{
  "propositions": [
    {
      "id": "1",
      "text": "The story revolves around a modern woman, Mei Xun, who traverses to a female-dominated ancient world.",
      "level": 1
    },
    {
      "id": "1.1",
      "text": "Mei Xun struggles with the cultural shift where women hold supreme power and men are subservient.",
      "level": 2
    },
    {
      "id": "1.2",
      "text": "She adapts to her new identity as a poor woman responsible for her household.",
      "level": 2
    },
    {
      "id": "2",
      "text": "Mei Xun forms an emotional bond with a young boy named Xiao Dou, providing him care and protection.",
      "level": 1
    },
    {
      "id": "2.1",
      "text": "This relationship evolves from pity to a deeper, complex affection, challenging societal norms.",
      "level": 2
    },
    {
      "id": "3",
      "text": "Daily life in the female-dominated society is harsh, requiring Mei Xun to labor and face social ostracism.",
      "level": 1
    },
    {
      "id": "3.1",
      "text": "She uses her modern medical knowledge to develop herbal remedies, gradually earning trust as a healer.",
      "level": 2
    },
    {
      "id": "4",
      "text": "A crisis emerges when bandits attack the village, forcing Mei Xun to protect Xiao Dou at all costs.",
      "level": 1
    },
    {
      "id": "4.1",
      "text": "This event solidifies her resolve to defy societal rules for the sake of her bond with Xiao Dou.",
      "level": 2
    },
    {
      "id": "5",
      "text": "Mei Xun envisions a future where she and Xiao Dou can escape prejudice and live freely.",
      "level": 1
    }
  ],
  "concepts": [
    {
      "name": "Female Dominance",
      "frequency": 8,
      "context": "Central theme of societal structure where women hold power over men."
    },
    {
      "name": "Time Travel",
      "frequency": 5,
      "context": "Protagonist's journey from modern to ancient world."
    },
    {
      "name": "Emotional Bond",
      "frequency": 6,
      "context": "Developing relationship between Mei Xun and Xiao Dou."
    },
    {
      "name": "Medical Knowledge",
      "frequency": 4,
      "context": "Use of modern medicine and herbal remedies to heal and gain trust."
    },
    {
      "name": "Social Struggle",
      "frequency": 5,
      "context": "Challenges faced due to outsider status and societal norms."
    }
  ],
  "relations": [
    {
      "source": "Female Dominance",
      "target": "Social Struggle",
      "type": "causes"
    },
    {
      "source": "Time Travel",
      "target": "Social Struggle",
      "type": "initiates"
    },
    {
      "source": "Mei Xun",
      "target": "Xiao Dou",
      "type": "protects"
    },
    {
      "source": "Emotional Bond",
      "target": "Social Struggle",
      "type": "conflicts_with"
    },
    {
      "source": "Medical Knowledge",
      "target": "Social Struggle",
      "type": "mitigates"
    }
  ],
  "hierarchy": {
    "main_topics": [
      "Female-Dominated Society",
      "Time Travel and Adaptation",
      "Emotional Relationships",
      "Survival and Growth"
    ],
    "structure": "The document is organized into chapters detailing the protagonist's journey from confusion and adaptation to emotional bonding, societal challenges, and eventual hope for a better future."
  }
}