{
  "propositions": [
    {
      "id": "1",
      "text": "The narrator observes a striking woman entering a bar.",
      "level": 1
    },
    {
      "id": "1.1",
      "text": "The woman has blonde hair, a high forehead, prominent cheekbones, a slightly large mouth, and wears Western-style boots.",
      "level": 2
    },
    {
      "id": "1.2",
      "text": "She is tall, with long legs, wearing purple designer jeans and a champagne-colored fur short coat.",
      "level": 2
    },
    {
      "id": "1.3",
      "text": "Despite the rain, she carries no umbrella and her hair is decorated with water droplets like diamonds.",
      "level": 2
    },
    {
      "id": "1.4",
      "text": "She stands at the entrance for a moment, looking around.",
      "level": 2
    },
    {
      "id": "1.5",
      "text": "It is a Wednesday afternoon, around 3:30 PM, a slow business time at Armstrong's bar.",
      "level": 2
    },
    {
      "id": "1.6",
      "text": "The narrator is sitting at his usual table in the back.",
      "level": 2
    },
    {
      "id": "1.7",
      "text": "The woman recognizes the narrator, and he notices the blue of her eyes across the room.",
      "level": 2
    },
    {
      "id": "1.8",
      "text": "She approaches the narrator after pausing at the bar.",
      "level": 2
    },
    {
      "id": "1.9",
      "text": "She introduces herself as Kim Dakin, a friend of Elaine Mader.",
      "level": 2
    },
    {
      "id": "1.10",
      "text": "The narrator invites her to sit.",
      "level": 2
    },
    {
      "id": "1.11",
      "text": "She sits opposite him, places her handbag on the table, and takes out cigarettes and a disposable lighter.",
      "level": 2
    },
    {
      "id": "1.12",
      "text": "She asks if he minds her smoking before lighting a cigarette.",
      "level": 2
    },
    {
      "id": "1.13",
      "text": "Her voice is soft and has a standard Midwestern accent, contrasting with the narrator's expectation of a rough, harsh European accent.",
      "level": 2
    },
    {
      "id": "1.14",
      "text": "She appears younger than her initial impression, not exceeding twenty-five years old.",
      "level": 2
    },
    {
      "id": "1.15",
      "text": "The waitress, Evelyn, is covering the day shift because she got a small part in an out-of-town performance.",
      "level": 2
    },
    {
      "id": "1.16",
      "text": "Kim orders a white wine.",
      "level": 2
    },
    {
      "id": "1.17",
      "text": "Kim decides to have coffee instead of white wine when Evelyn asks the narrator if he wants more coffee.",
      "level": 2
    },
    {
      "id": "1.18",
      "text": "She adds creamer and sugar to her coffee and drinks it slowly.",
      "level": 2
    },
    {
      "id": "1.19",
      "text": "Kim states she doesn't drink much, especially at this hour.",
      "level": 2
    },
    {
      "id": "1.20",
      "text": "She enjoys sweet coffee, almost like dessert, and feels lucky she never gains weight.",
      "level": 2
    },
    {
      "id": "1.21",
      "text": "The narrator agrees that it's lucky.",
      "level": 2
    },
    {
      "id": "1.22",
      "text": "The narrator has known Elaine for a few years.",
      "level": 2
    },
    {
      "id": "1.23",
      "text": "Kim hasn't known Elaine for long and isn't very close to her, but finds Elaine to be a very good person.",
      "level": 2
    },
    {
      "id": "1.24",
      "text": "The narrator agrees about Elaine's good nature and her calmness and rationality.",
      "level": 2
    },
    {
      "id": "1.25",
      "text": "Kim speaks a lot, smiles, and looks you in the eye, suggesting she'd win a \"most popular\" award in a beauty contest.",
      "level": 2
    },
    {
      "id": "1.26",
      "text": "The narrator doesn't mind if she takes time to get to the point, as he has nowhere else to go.",
      "level": 2
    },
    {
      "id": "1.27",
      "text": "Kim asks if the narrator used to be a policeman.",
      "level": 2
    },
    {
      "id": "1.28",
      "text": "He confirms he was, years ago.",
      "level": 2
    },
    {
      "id": "1.29",
      "text": "She asks if he is a private detective now.",
      "level": 2
    },
    {
      "id": "1.30",
      "text": "He replies, \"Not entirely.\"",
      "level": 2
    },
    {
      "id": "1.31",
      "text": "Her eyes widen, and he suspects she might be wearing colored contact lenses.",
      "level": 2
    },
    {
      "id": "1.32",
      "text": "He explains he doesn't have a license because he didn't want one after leaving the police force.",
      "level": 2
    },
    {
      "id": "1.33",
      "text": "He considers his work to be unofficial.",
      "level": 2
    },
    {
      "id": "1.34",
      "text": "She asks if that's what he does for a living.",
      "level": 2
    },
    {
      "id": "1.35",
      "text": "He confirms it is.",
      "level": 2
    },
    {
      "id": "1.36",
      "text": "She asks what he calls what he does.",
      "level": 2
    },
    {
      "id": "1.37",
      "text": "He humorously states he could call it 'making money,' though he doesn't make much.",
      "level": 2
    },
    {
      "id": "1.38",
      "text": "He explains that work comes to him, and he turns down more than he accepts, only taking jobs he can't find an excuse to refuse.",
      "level": 2
    },
    {
      "id": "1.39",
      "text": "He is currently thinking of an excuse to refuse whatever Kim wants.",
      "level": 2
    },
    {
      "id": "2",
      "text": "The narrator tells Kim he doesn't know what to call his work, suggesting he helps friends.",
      "level": 1
    },
    {
      "id": "2.1",
      "text": "Kim's face lights up, and for the first time, her smile reaches her eyes.",
      "level": 2
    },
    {
      "id": "2.2",
      "text": "She expresses excitement and says she can also benefit from it, needing help with a current matter.",
      "level": 2
    },
    {
      "id": "2.3",
      "text": "The narrator asks if she's in trouble.",
      "level": 2
    },
    {
      "id": "2.4",
      "text": "She lights another cigarette to give herself time to think.",
      "level": 2
    },
    {
      "id": "2.5",
      "text": "She looks at her hands, noting her well-trimmed, long, tea-red fingernails.",
      "level": 2
    },
    {
      "id": "2.6",
      "text": "She wears a gold ring with a large square emerald on her left ring finger.",
      "level": 2
    },
    {
      "id": "2.7",
      "text": "She tells the narrator she works in prostitution, like Elaine.",
      "level": 2
    },
    {
      "id": "2.8",
      "text": "The narrator nods.",
      "level": 2
    },
    {
      "id": "2.9",
      "text": "She straightens up, adjusts her fur coat, and unfastens the hook at her neck.",
      "level": 2
    },
    {
      "id": "2.10",
      "text": "The narrator smells her perfume, which he recognizes but can't place.",
      "level": 2
    },
    {
      "id": "2.11",
      "text": "He finishes his coffee.",
      "level": 2
    },
    {
      "id": "2.12",
      "text": "She says, \"I want out.\"",
      "level": 2
    },
    {
      "id": "2.13",
      "text": "The narrator asks, \"Out of this life?\"",
      "level": 2
    },
    {
      "id": "2.14",
      "text": "She confirms this, stating she has been in the profession for four years.",
      "level": 2
    },
    {
      "id": "2.15",
      "text": "She arrived in New York four years and four months ago and is now twenty-three.",
      "level": 2
    },
    {
      "id": "2.16",
      "text": "She doesn't feel as young as she is.",
      "level": 2
    },
    {
      "id": "2.17",
      "text": "She compares her current fur coat to the denim jacket she had when she arrived.",
      "level": 2
    },
    {
      "id": "2.18",
      "text": "She says she would trade the fur coat for the old denim jacket if she could live again, but then retracts this, stating she'd do the same things.",
      "level": 2
    },
    {
      "id": "2.19",
      "text": "She muses about the advantage of knowing what she knows now at nineteen, suggesting she might have started prostituting at fifteen and would be dead by now.",
      "level": 2
    },
    {
      "id": "2.20",
      "text": "She apologizes for rambling.",
      "level": 2
    },
    {
      "id": "2.21",
      "text": "She reiterates her desire to leave this life.",
      "level": 2
    },
    {
      "id": "2.22",
      "text": "The narrator asks what she plans to do, suggesting returning to Minnesota.",
      "level": 2
    },
    {
      "id": "2.23",
      "text": "She corrects him: Wisconsin. She states she won't go back there as there's nothing for her.",
      "level": 2
    },
    {
      "id": "2.24",
      "text": "She believes going back would cause her a lot of trouble.",
      "level": 2
    },
    {
      "id": "2.25",
      "text": "She simplifies life to two options, but acknowledges there are other possibilities.",
      "level": 2
    },
    {
      "id": "2.26",
      "text": "The narrator suggests she could teach philosophy and asks what she needs him to do.",
      "level": 2
    },
    {
      "id": "2.27",
      "text": "She states she has a pimp.",
      "level": 2
    },
    {
      "id": "2.28",
      "text": "The narrator asks if the pimp won't let her go.",
      "level": 2
    },
    {
      "id": "2.29",
      "text": "She hasn't told him yet, and he might know, but nothing has been said.",
      "level": 2
    },
    {
      "id": "2.30",
      "text": "Her whole upper body shakes, and fine sweat appears on her upper lip.",
      "level": 2
    },
    {
      "id": "2.31",
      "text": "The narrator concludes she's afraid of him.",
      "level": 2
    },
    {
      "id": "2.32",
      "text": "She asks how he guessed that.",
      "level": 2
    },
    {
      "id": "2.33",
      "text": "She clarifies he hasn't truly threatened her, but she feels threatened.",
      "level": 2
    },
    {
      "id": "2.34",
      "text": "The narrator asks if other girls have tried to leave.",
      "level": 2
    },
    {
      "id": "2.35",
      "text": "She doesn't know and doesn't know other girls well.",
      "level": 2
    },
    {
      "id": "2.36",
      "text": "She states her pimp is different from others she knows.",
      "level": 2
    },
    {
      "id": "2.37",
      "text": "The narrator asks how he is different.",
      "level": 2
    },
    {
      "id": "2.38",
      "text": "She describes him as more elegant and gentle.",
      "level": 2
    },
    {
      "id": "2.39",
      "text": "The narrator asks his name.",
      "level": 2
    },
    {
      "id": "2.40",
      "text": "She says everyone calls him Chance.",
      "level": 2
    },
    {
      "id": "2.41",
      "text": "She doesn't know if it's a first or last name, or perhaps a nickname.",
      "level": 2
    },
    {
      "id": "2.42",
      "text": "She mentions having a previous pimp named Duffy, whose full name might have been Duffy Green or Eugene Duffy.",
      "level": 2
    },
    {
      "id": "2.43",
      "text": "Duffy took her in when she was very young.",
      "level": 2
    },
    {
      "id": "3",
      "text": "The narrator asks if Duffy was Black.",
      "level": 1
    },
    {
      "id": "3.1",
      "text": "Kim confirms Duffy was Black, and so is Chance.",
      "level": 2
    },
    {
      "id": "3.2",
      "text": "Duffy arranged for her to work on Lexington Avenue, sometimes going to Long Island across the river.",
      "level": 2
    },
    {
      "id": "3.3",
      "text": "She closes her eyes, recalling her experiences on the street.",
      "level": 2
    },
    {
      "id": "3.4",
      "text": "Her stage name was Bambi.",
      "level": 2
    },
    {
      "id": "3.5",
      "text": "In Long Island, she worked in clients' cars; in Lexington, they had a hotel.",
      "level": 2
    },
    {
      "id": "3.6",
      "text": "She can't believe she lived that way, feeling she was too young despite knowing her purpose in New York.",
      "level": 2
    },
    {
      "id": "3.7",
      "text": "She worked on the street for five to six months and wasn't very good at it, despite being attractive and able to act.",
      "level": 2
    },
    {
      "id": "3.8",
      "text": "She suffered from anxiety attacks that prevented her from working.",
      "level": 2
    },
    {
      "id": "3.9",
      "text": "Duffy gave her 'white powder' (drugs) which made her feel worse.",
      "level": 2
    },
    {
      "id": "3.10",
      "text": "He then arranged for her to work indoors, which was better but less controllable for him.",
      "level": 2
    },
    {
      "id": "3.11",
      "text": "She worked indoors for about six months in a large apartment near Columbus Circle.",
      "level": 2
    },
    {
      "id": "3.12",
      "text": "After that, she started working with Chance.",
      "level": 2
    },
    {
      "id": "3.13",
      "text": "She met Chance at a jazz club with Duffy.",
      "level": 2
    },
    {
      "id": "3.14",
      "text": "Chance joined them, and then Duffy left them alone.",
      "level": 2
    },
    {
      "id": "3.15",
      "text": "Duffy later returned and said she would work with Chance.",
      "level": 2
    },
    {
      "id": "3.16",
      "text": "She initially thought Chance wanted her sexually, like prostitution, and was angry because she thought they were all out for a good time.",
      "level": 2
    },
    {
      "id": "3.17",
      "text": "Chance explained she would be his girl.",
      "level": 2
    },
    {
      "id": "3.18",
      "text": "She felt like a car being sold.",
      "level": 2
    },
    {
      "id": "3.19",
      "text": "The narrator asks if Duffy sold her to Chance.",
      "level": 2
    },
    {
      "id": "3.20",
      "text": "She doesn't know what Duffy did, but she went with Chance.",
      "level": 2
    },
    {
      "id": "3.21",
      "text": "It was better than being with Duffy, and she has been with Chance for three years, placed by a telephone.",
      "level": 2
    },
    {
      "id": "3.22",
      "text": "The narrator asks if she wants help getting out.",
      "level": 2
    },
    {
      "id": "3.23",
      "text": "She asks if he can help.",
      "level": 2
    },
    {
      "id": "3.24",
      "text": "He says he doesn't know, suggesting she might be able to do it herself.",
      "level": 2
    },
    {
      "id": "3.25",
      "text": "She hasn't spoken to Chance about leaving.",
      "level": 2
    },
    {
      "id": "3.26",
      "text": "She is afraid of him killing her, disfiguring her, or convincing her to change her mind.",
      "level": 2
    },
    {
      "id": "3.27",
      "text": "She leans forward, placing her hand on his wrist, a deliberate but effective gesture.",
      "level": 2
    },
    {
      "id": "3.28",
      "text": "He inhales her perfume and feels her sensuality, acknowledging her sex appeal without being driven by lust.",
      "level": 2
    },
    {
      "id": "3.29",
      "text": "She asks if he can help her, then asks if he minds her calling him Matthew.",
      "level": 2
    },
    {
      "id": "3.30",
      "text": "He smiles and says he doesn't mind.",
      "level": 2
    },
    {
      "id": "3.31",
      "text": "She mentions she makes money but can't keep it, earning no more than she did on the street.",
      "level": 2
    },
    {
      "id": "3.32",
      "text": "She reveals she has a thousand dollars.",
      "level": 2
    },
    {
      "id": "3.33",
      "text": "She opens her wallet, takes out a white envelope, and places a stack of bills on the table.",
      "level": 2
    },
    {
      "id": "3.34",
      "text": "She asks him to see Chance for her.",
      "level": 2
    },
    {
      "id": "3.35",
      "text": "He picks up the money, realizing he's been offered the role of mediator between a prostitute and a pimp.",
      "level": 2
    },
    {
      "id": "3.36",
      "text": "He considers returning the money but remembers his financial obligations.",
      "level": 2
    },
    {
      "id": "3.37",
      "text": "He counts the money: ten used hundred-dollar bills.",
      "level": 2
    },
    {
      "id": "3.38",
      "text": "He leaves five bills on the table and returns the other five to her.",
      "level": 2
    },
    {
      "id": "3.39",
      "text": "She looks surprised, and he suspects she's wearing colored contact lenses.",
      "level": 2
    },
    {
      "id": "3.40",
      "text": "He tells her he'll take five hundred now and five hundred later if he can get her out.",
      "level": 2
    },
    {
      "id": "4",
      "text": "Kim agrees to the deal, smiling and remarking he could have taken all thousand dollars.",
      "level": 1
    },
    {
      "id": "4.1",
      "text": "He suggests the incentive might make him work better and asks if she wants more coffee.",
      "level": 2
    },
    {
      "id": "4.2",
      "text": "She agrees to have coffee if he does, preferring something sweet.",
      "level": 2
    },
    {
      "id": "4.3",
      "text": "She asks if they have dessert.",
      "level": 2
    },
    {
      "id": "4.4",
      "text": "He recommends the pecan pie and cheese pie.",
      "level": 2
    },
    {
      "id": "4.5",
      "text": "She chooses the pecan pie, reiterating her fondness for sweets and her lack of weight gain, calling it luck.",
      "level": 2
    },
    {
      "id": "5",
      "text": "The narrator realizes a problem: he needs to find Chance, but Kim doesn't know how.",
      "level": 1
    },
    {
      "id": "5.1",
      "text": "Kim states that no one knows Chance's whereabouts, not even his girls.",
      "level": 2
    },
    {
      "id": "5.2",
      "text": "She describes how two of his girls sometimes play guessing games about where he lives when he's not around.",
      "level": 2
    },
    {
      "id": "5.3",
      "text": "She speculates about him living in Harlem, 'Sugar Hill,' a suburban bungalow, or even out of his car.",
      "level": 2
    },
    {
      "id": "5.4",
      "text": "She mentions that Chance never sleeps when he's with her, only lying down briefly before leaving.",
      "level": 2
    },
    {
      "id": "5.5",
      "text": "He says he can't sleep if someone else is in the room.",
      "level": 2
    },
    {
      "id": "5.6",
      "text": "The narrator asks about contacting him.",
      "level": 2
    },
    {
      "id": "5.7",
      "text": "Kim provides a phone number for a message-taking service, available 24 hours.",
      "level": 2
    },
    {
      "id": "5.8",
      "text": "Chance checks his phone records every half hour or hour if they are out.",
      "level": 2
    },
    {
      "id": "5.9",
      "text": "She doesn't know where he parks his car.",
      "level": 2
    },
    {
      "id": "5.10",
      "text": "She doesn't recall his car's license plate number; it's a Cadillac.",
      "level": 2
    },
    {
      "id": "5.11",
      "text": "The narrator asks where he hangs out.",
      "level": 2
    },
    {
      "id": "5.12",
      "text": "She says if she needs to find him, she leaves a message; she doesn't look for him.",
      "level": 2
    },
    {
      "id": "5.13",
      "text": "He asks what Chance usually does.",
      "level": 2
    },
    {
      "id": "5.14",
      "text": "She explains it depends on who he's with.",
      "level": 2
    },
    {
      "id": "5.15",
      "text": "With her, they go to jazz clubs.",
      "level": 2
    },
    {
      "id": "5.16",
      "text": "With another girl, they go to classical music concerts at Carnegie Hall.",
      "level": 2
    },
    {
      "id": "5.17",
      "text": "With a girl named Sunny, they go to ball games.",
      "level": 2
    },
    {
      "id": "5.18",
      "text": "He asks how many girls Chance has.",
      "level": 2
    },
    {
      "id": "5.19",
      "text": "She names Sunny, Nan, and the classical music fan, suggesting there might be one or two more.",
      "level": 2
    },
    {
      "id": "5.20",
      "text": "She notes that Chance doesn't discuss his private life.",
      "level": 2
    },
    {
      "id": "5.21",
      "text": "The narrator is surprised that after three years, she only knows half of his name, no address, and a message service number.",
      "level": 2
    },
    {
      "id": "5.22",
      "text": "She looks down at her hands.",
      "level": 2
    },
    {
      "id": "5.23",
      "text": "He asks how Chance collects money.",
      "level": 2
    },
    {
      "id": "5.24",
      "text": "She says he sometimes comes to her place or calls her to bring money to a cafe, bar, or street corner.",
      "level": 2
    },
    {
      "id": "5.25",
      "text": "The narrator asks if she gives him all her earnings.",
      "level": 2
    },
    {
      "id": "5.26",
      "text": "She confirms this, stating he provides her apartment, pays rent, phone bills, and buys her clothes.",
      "level": 2
    },
    {
      "id": "5.27",
      "text": "He gives her some back as pocket money.",
      "level": 2
    },
    {
      "id": "5.28",
      "text": "The narrator asks if she keeps private savings.",
      "level": 2
    },
    {
      "id": "5.29",
      "text": "She confirms she does, explaining how she got the thousand dollars, but admits she doesn't keep much.",
      "level": 2
    },
    {
      "id": "6",
      "text": "By the time Kim leaves, the bar is full of after-work patrons.",
      "level": 1
    },
    {
      "id": "6.1",
      "text": "She has finished her coffee and started on a white wine, leaving half a glass.",
      "level": 2
    },
    {
      "id": "6.2",
      "text": "The narrator has been drinking black coffee.",
      "level": 2
    },
    {
      "id": "6.3",
      "text": "He has Kim's address, phone number, and Chance's message service number in his notebook.",
      "level": 2
    },
    {
      "id": "6.4",
      "text": "After she leaves, he finishes his coffee and pays with one of the hundred-dollar bills.",
      "level": 2
    },
    {
      "id": "6.5",
      "text": "He walks back to his hotel.",
      "level": 2
    },
    {
      "id": "6.6",
      "text": "He checks for mail and messages at the front desk and uses the payphone to call Chance's message service.",
      "level": 2
    },
    {
      "id": "6.7",
      "text": "A middle-aged woman with a hoarse voice answers the phone and takes his name, hotel number, and reason for calling (private matter).",
      "level": 2
    },
    {
      "id": "6.8",
      "text": "He hangs up feeling shaky, possibly from the coffee, and contemplates having a drink.",
      "level": 2
    },
    {
      "id": "6.9",
      "text": "He considers going to Polly's bar across the street or buying a pint of bourbon from the liquor store next door.",
      "level": 2
    },
    {
      "id": "6.10",
      "text": "He decides against going out in the rain and returns to his room.",
      "level": 2
    },
    {
      "id": "6.11",
      "text": "He locks the door, pulls a chair to the window, and watches the rain.",
      "level": 2
    },
    {
      "id": "6.12",
      "text": "The urge to drink comes and goes for an hour.",
      "level": 2
    },
    {
      "id": "6.13",
      "text": "Around 7 PM, he calls Elaine Mader, reaching her answering machine.",
      "level": 2
    },
    {
      "id": "6.14",
      "text": "He leaves a message, thanking her for the recommendation and stating he may be able to repay her soon.",
      "level": 2
    },
    {
      "id": "6.15",
      "text": "Chance does not call back.",
      "level": 2
    },
    {
      "id": "6.16",
      "text": "He goes downstairs for a meal, ordering a hamburger and fries at the Blue Jay diner.",
      "level": 2
    },
    {
      "id": "6.17",
      "text": "He decides against ordering a beer with his meal.",
      "level": 2
    },
    {
      "id": "6.18",
      "text": "He eats most of his food and has two coffees, finishing with a partially eaten cherry.",
      "level": 2
    },
    {
      "id": "6.19",
      "text": "He stops by his hotel again, finds no messages, and walks towards Ninth Avenue.",
      "level": 2
    },
    {
      "id": "6.20",
      "text": "He passes the former location of a Greek bar and heads north past the hospital to St. Paul's Church.",
      "level": 2
    },
    {
      "id": "6.21",
      "text": "He goes down a narrow staircase to the basement, where the 'Anonymous Alcoholics' meeting is held.",
      "level": 2
    },
    {
      "id": "6.22",
      "text": "He sits in the back, gets coffee, and nods to the attendees.",
      "level": 2
    },
    {
      "id": "6.23",
      "text": "The speaker, a man his age, shares his life story of addiction and recovery.",
      "level": 2
    },
    {
      "id": "6.24",
      "text": "The narrator notes the common themes in these stories.",
      "level": 2
    },
    {
      "id": "6.25",
      "text": "During the break, he puts a dollar in the collection basket and gets more coffee and cookies.",
      "level": 2
    },
    {
      "id": "6.26",
      "text": "An acquaintance, an older man in a military uniform, greets him and expresses approval of his sobriety.",
      "level": 2
    },
    {
      "id": "6.27",
      "text": "The narrator inwardly admits he is not truly sober, detailing his pattern of drinking and subsequent hangovers.",
      "level": 2
    },
    {
      "id": "6.28",
      "text": "He doesn't share this with the man.",
      "level": 2
    },
    {
      "id": "6.29",
      "text": "Later, during the meeting, people introduce themselves as alcoholics and share their experiences.",
      "level": 2
    },
    {
      "id": "6.30",
      "text": "When it's his turn, he says, \"My name is Matthew. I have nothing to say.\"",
      "level": 2
    },
    {
      "id": "6.31",
      "text": "After the meeting, he stops at Armstrong's bar for coffee, despite being advised to avoid bars.",
      "level": 2
    },
    {
      "id": "6.32",
      "text": "He buys an early edition of The News and returns to his room.",
      "level": 2
    },
    {
      "id": "6.33",
      "text": "He calls Chance's message service again, leaving another message emphasizing urgency.",
      "level": 2
    },
    {
      "id": "6.34",
      "text": "He showers and reads the newspaper, focusing on smaller, local news stories.",
      "level": 2
    },
    {
      "id": "6.35",
      "text": "He reads about a woman surviving a train incident, a prostitute being murdered, and a police officer being critically injured.",
      "level": 2
    },
    {
      "id": "6.36",
      "text": "He doesn't expect Chance to call back, but realizes he will have to find him.",
      "level": 2
    },
    {
      "id": "6.37",
      "text": "He muses about Chance's elusive nature and the idea of a pimp's luxurious car.",
      "level": 2
    },
    {
      "id": "6.38",
      "text": "He returns to the news about the murdered prostitute, noting the lack of identifying information.",
      "level": 2
    },
    {
      "id": "6.39",
      "text": "He calls The News for the victim's name but is refused.",
      "level": 2
    },
    {
      "id": "6.40",
      "text": "He calls the Sixth Precinct but Eddie Keller is off-duty, and he doesn't know anyone else there.",
      "level": 2
    },
    {
      "id": "6.41",
      "text": "He considers calling Kim but decides it might be too late, and he can't assume the murdered prostitute is her.",
      "level": 2
    },
    {
      "id": "7",
      "text": "The narrator calls Kim to check if she has spoken to Chance.",
      "level": 1
    },
    {
      "id": "7.1",
      "text": "Kim confirms she has not spoken to Chance.",
      "level": 2
    },
    {
      "id": "7.2",
      "text": "The narrator explains his intention to find Chance himself and asks if she mentioned anything about leaving.",
      "level": 2
    },
    {
      "id": "7.3",
      "text": "Kim reassures him she hasn't said a word.",
      "level": 2
    },
    {
      "id": "7.4",
      "text": "He instructs her to act as if nothing has happened if she sees Chance before him and to call him if Chance summons her.",
      "level": 2
    },
    {
      "id": "7.5",
      "text": "He reassures Kim over the phone, knowing she is not the murdered prostitute.",
      "level": 2
    },
    {
      "id": "7.6",
      "text": "He goes to bed but can't sleep, eventually getting up to reread the newspaper.",
      "level": 2
    },
    {
      "id": "7.7",
      "text": "He has the thought of drinking to calm himself but resists until 4 AM.",
      "level": 2
    },
    {
      "id": "7.8",
      "text": "He tries to sleep again, reflecting on the city's violence and the idea of staying sober.",
      "level": 2
    },
    {
      "id": "8",
      "text": "The narrator wakes up around 10:30 AM feeling surprisingly refreshed.",
      "level": 1
    },
    {
      "id": "8.1",
      "text": "After showering and shaving, he has coffee and a roll for breakfast and goes to St. Paul's Church.",
      "level": 2
    },
    {
      "id": "8.2",
      "text": "He sits in a pew, lights candles, and donates fifty dollars to the poor box.",
      "level": 2
    },
    {
      "id": "8.3",
      "text": "At the post office, he buys a money order and an envelope to send to his ex-wife.",
      "level": 2
    },
    {
      "id": "8.4",
      "text": "He decides against writing a note, as it would sound like an apology.",
      "level": 2
    },
    {
      "id": "8.5",
      "text": "He reflects on the inadequacy of the money sent.",
      "level": 2
    },
    {
      "id": "8.6",
      "text": "He notices the gray, cold weather, similar to the wind that blew a man's hat away.",
      "level": 2
    },
    {
      "id": "8.7",
      "text": "He remembers Kim's limited funds and decides not to open a new bank account.",
      "level": 2
    },
    {
      "id": "8.8",
      "text": "He returns to his hotel and prepays half of next month's rent.",
      "level": 2
    },
    {
      "id": "8.9",
      "text": "He exchanges his remaining hundred-dollar bill for smaller denominations.",
      "level": 2
    },
    {
      "id": "8.10",
      "text": "He thinks about his earlier remark about motivation and realizes he has it now.",
      "level": 2
    },
    {
      "id": "8.11",
      "text": "He checks his mail: advertisements and a campaign letter.",
      "level": 2
    },
    {
      "id": "8.12",
      "text": "There is still no reply from Chance.",
      "level": 2
    },
    {
      "id": "8.13",
      "text": "He leaves another message for Chance's service, on a whim.",
      "level": 2
    },
    {
      "id": "8.14",
      "text": "He spends the afternoon walking and taking the subway, staying out of the potentially rainy weather.",
      "level": 2
    },
    {
      "id": "8.15",
      "text": "He visits two police precincts, several coffee shops, and six bars, drinking coffee and Coke.",
      "level": 2
    },
    {
      "id": "8.16",
      "text": "He talks to people, takes notes, and calls his hotel front desk a few times.",
      "level": 2
    },
    {
      "id": "8.17",
      "text": "He calls Kim's number twice, reaching her answering machine, and doesn't leave a message.",
      "level": 2
    },
    {
      "id": "8.18",
      "text": "He goes to a movie theater in Times Square to see two Clint Eastwood films.",
      "level": 2
    },
    {
      "id": "8.19",
      "text": "He eats pork fried rice at a Cuban-Chinese restaurant, checks his hotel again, and has coffee at Armstrong's bar.",
      "level": 2
    },
    {
      "id": "8.20",
      "text": "He forces himself to leave for the AA meeting at 8:30 PM.",
      "level": 2
    },
    {
      "id": "8.21",
      "text": "The speaker is a housewife who recounts a story of hiding her drinking from her children.",
      "level": 2
    },
    {
      "id": "8.22",
      "text": "When it's his turn, he says, \"My name is Matthew. I'm just listening tonight.\"",
      "level": 2
    },
    {
      "id": "8.23",
      "text": "He goes to the Kelvin Smalls bar in Harlem, noting the presence of Black musicians playing jazz.",
      "level": 2
    },
    {
      "id": "8.24",
      "text": "He is the only white male in the room, drawing attention.",
      "level": 2
    },
    {
      "id": "8.25",
      "text": "He uses the men's room and observes a tall man styling his hair.",
      "level": 2
    },
    {
      "id": "8.26",
      "text": "He walks through the room, observing the patrons, many of whom he suspects have criminal records.",
      "level": 2
    },
    {
      "id": "8.27",
      "text": "He recognizes a man named Royal Walden, previously a police informant.",
      "level": 2
    },
    {
      "id": "8.28",
      "text": "Royal is dressed ostentatiously and seems to be doing well in business.",
      "level": 2
    },
    {
      "id": "8.29",
      "text": "Royal asks if he's looking to buy anything, implying drugs.",
      "level": 2
    },
    {
      "id": "8.30",
      "text": "The narrator clarifies he's looking for a pimp named Chance.",
      "level": 2
    },
    {
      "id": "9",
      "text": "Royal Walden might know who Chance is.",
      "level": 1
    },
    {
      "id": "9.1",
      "text": "As they talk, a man walks by, seemingly examining the steel security shutters on the closed storefronts.",
      "level": 2
    },
    {
      "id": "9.2",
      "text": "Royal notes that Chance doesn't frequent this area and is hard to find, as he's always in unexpected places and doesn't stay long.",
      "level": 2
    },
    {
      "id": "9.3",
      "text": "The narrator has heard similar things.",
      "level": 2
    },
    {
      "id": "9.4",
      "text": "He lists the places he has already checked.",
      "level": 2
    },
    {
      "id": "9.5",
      "text": "Royal eliminates a specific location ('Muffin Burger' restaurant) because Chance's girls don't solicit on the street there.",
      "level": 2
    },
    {
      "id": "9.6",
      "text": "Royal expresses that Chance is a pimp and they have no business dealings.",
      "level": 2
    },
    {
      "id": "9.7",
      "text": "Royal mentions a place on St. Nicholas Avenue in Harlem.",
      "level": 2
    },
    {
      "id": "9.8",
      "text": "The narrator walks to the Camerone Club, which resembles the Kelvin Smalls bar but has a jukebox instead of live music.",
      "level": 2
    },
    {
      "id": "9.9",
      "text": "The men's room is unsanitary, with evidence of drug use.",
      "level": 2
    },
    {
      "id": "9.10",
      "text": "Inside the bar, he drinks a soda and observes the patrons.",
      "level": 2
    },
    {
      "id": "9.11",
      "text": "He feels he might have seen Chance but cannot be sure due to the lack of a clear description or photo.",
      "level": 2
    },
    {
      "id": "9.12",
      "text": "He notes his own plain appearance contrasts with the stylish attire of the other patrons, who he suspects are pimps.",
      "level": 2
    },
    {
      "id": "9.13",
      "text": "He considers finding out where the pimps buy their clothes, thinking it might lead to Chance.",
      "level": 2
    },
    {
      "id": "9.14",
      "text": "He observes a man ordering a mixed drink called a 'White Cadillac'.",
      "level": 2
    },
    {
      "id": "9.15",
      "text": "He feels his presence is creating tension in the room.",
      "level": 2
    },
    {
      "id": "10",
      "text": "The narrator leaves the Camerone Club and takes a taxi to another bar on West Ninety-sixth Street.",
      "level": 1
    },
    {
      "id": "10.1",
      "text": "It is after 2 AM, and he is tired.",
      "level": 2
    },
    {
      "id": "10.2",
      "text": "The bar has a Black pianist and a mixed clientele, with many interracial couples.",
      "level": 2
    },
    {
      "id": "10.3",
      "text": "The atmosphere is more subtle than in the Harlem or Times Square bars.",
      "level": 2
    },
    {
      "id": "10.4",
      "text": "He calls his hotel from the bar's phone, asking the night clerk, Jacob, to call a specific number and ask for Chance.",
      "level": 2
    },
    {
      "id": "10.5",
      "text": "Jacob agrees, and the narrator hangs up as the phone rings.",
      "level": 2
    },
    {
      "id": "10.6",
      "text": "A young man answers, but no one named Chance is present.",
      "level": 2
    },
    {
      "id": "10.7",
      "text": "The narrator regrets not trying this tactic at every bar he visited.",
      "level": 2
    },
    {
      "id": "10.8",
      "text": "He reflects on his current role as a detective drinking Coke while searching for a pimp.",
      "level": 2
    },
    {
      "id": "10.9",
      "text": "He hears Frank Sinatra on the jukebox, which reminds him of something.",
      "level": 2
    },
    {
      "id": "10.10",
      "text": "He takes a taxi to Columbus Avenue and gets out near Purgatory Bar.",
      "level": 2
    },
    {
      "id": "10.11",
      "text": "He is looking for Danny 'Boy' Bell.",
      "level": 2
    },
    {
      "id": "10.12",
      "text": "The bartender at Purgatory says Danny was just there and might be at the Top Tier bar.",
      "level": 2
    },
    {
      "id": "10.13",
      "text": "He finds Danny at the Top Tier bar.",
      "level": 2
    },
    {
      "id": "10.14",
      "text": "Danny, an albino, is significantly shorter and thinner than his self-proclaimed height and is always impeccably dressed.",
      "level": 2
    },
    {
      "id": "10.15",
      "text": "Danny expresses surprise at seeing Matthew after so long.",
      "level": 2
    },
    {
      "id": "10.16",
      "text": "Matthew states he is looking for information.",
      "level": 2
    },
    {
      "id": "11",
      "text": "Matthew and Danny 'Boy' Bell sit down to talk.",
      "level": 1
    },
    {
      "id": "11.1",
      "text": "Danny prefers Russian vodka served ice-cold but without ice in his glass.",
      "level": 2
    },
    {
      "id": "11.2",
      "text": "Matthew orders a Coke, explaining he is on the wagon.",
      "level": 2
    },
    {
      "id": "11.3",
      "text": "Danny remarks on the Greek concept of moderation.",
      "level": 2
    },
    {
      "id": "11.4",
      "text": "Matthew observes Danny's high alcohol tolerance.",
      "level": 2
    },
    {
      "id": "11.5",
      "text": "Danny's profession is collecting information, which he uses to facilitate meetings and earn a living.",
      "level": 2
    },
    {
      "id": "11.6",
      "text": "He has minor investments in various businesses, often illegal, but manages to avoid trouble.",
      "level": 2
    },
    {
      "id": "11.7",
      "text": "Danny was Matthew's best informant when Matthew was a police officer, providing information for other information.",
      "level": 2
    },
    {
      "id": "11.8",
      "text": "Danny asks if Matthew remembers Lou Rudenko, nicknamed 'Hat Lou'.",
      "level": 2
    },
    {
      "id": "11.9",
      "text": "Matthew confirms he remembers him and asks if Danny has heard any gossip about him.",
      "level": 2
    }
  ],
  "concepts": [
    {
      "name": "Kim Dakin",
      "frequency": 26,
      "context": "The central female character who approaches the narrator for help."
    },
    {
      "name": "Matthew Scudder",
      "frequency": 24,
      "context": "The narrator, a former policeman and private investigator."
    },
    {
      "name": "Chance",
      "frequency": 18,
      "context": "Kim's pimp, a mysterious and elusive figure."
    },
    {
      "name": "Elaine Mader",
      "frequency": 4,
      "context": "A friend of Kim's who recommended Matthew."
    },
    {
      "name": "Pimp",
      "frequency": 11,
      "context": "A person who arranges clients for prostitutes."
    },
    {
      "name": "Prostitute",
      "frequency": 7,
      "context": "A woman who engages in sexual activity for payment."
    },
    {
      "name": "Bar",
      "frequency": 13,
      "context": "The setting for several key interactions, including Armstrong's, Polly's, Kelvin Smalls, and Purgatory."
    },
    {
      "name": "Alcoholics Anonymous (AA)",
      "frequency": 5,
      "context": "A support group for people recovering from alcoholism."
    },
    {
      "name": "New York City",
      "frequency": 2,
      "context": "The primary location of the narrative."
    },
    {
      "name": "Money",
      "frequency": 7,
      "context": "A recurring theme, especially in relation to Kim's earnings and Matthew's financial situation."
    },
    {
      "name": "Information",
      "frequency": 4,
      "context": "A key element in Matthew's investigative work and Danny 'Boy' Bell's profession."
    },
    {
      "name": "Police",
      "frequency": 4,
      "context": "Matthew's past profession and a source of characters and plot elements."
    },
    {
      "name": "Duffy",
      "frequency": 4,
      "context": "Kim's previous pimp."
    },
    {
      "name": "Telephone",
      "frequency": 5,
      "context": "A crucial tool for communication and leaving messages."
    },
    {
      "name": "Message service",
      "frequency": 4,
      "context": "Chance's primary contact method."
    },
    {
      "name": "Danny 'Boy' Bell",
      "frequency": 7,
      "context": "A former informant of Matthew's, who collects information."
    },
    {
      "name": "Royal Walden",
      "frequency": 5,
      "context": "A former informant of Matthew's, now involved in business."
    }
  ],
  "relations": [
    {
      "source": "Kim Dakin",
      "target": "Matthew Scudder",
      "type": "seeks help from"
    },
    {
      "source": "Kim Dakin",
      "target": "Chance",
      "type": "is controlled by"
    },
    {
      "source": "Kim Dakin",
      "target": "Elaine Mader",
      "type": "is friend of"
    },
    {
      "source": "Matthew Scudder",
      "target": "Elaine Mader",
      "type": "knows"
    },
    {
      "source": "Matthew Scudder",
      "target": "Police",
      "type": "former profession"
    },
    {
      "source": "Chance",
      "target": "Pimp",
      "type": "is a"
    },
    {
      "source": "Kim Dakin",
      "target": "Prostitute",
      "type": "is a"
    },
    {
      "source": "Chance",
      "target": "Kim Dakin",
      "type": "employs"
    },
    {
      "source": "Matthew Scudder",
      "target": "Alcoholics Anonymous (AA)",
      "type": "attends"
    },
    {
      "source": "Danny 'Boy' Bell",
      "target": "Matthew Scudder",
      "type": "former informant of"
    },
    {
      "source": "Royal Walden",
      "target": "Matthew Scudder",
      "type": "former informant of"
    },
    {
      "source": "Matthew Scudder",
      "target": "Information",
      "type": "seeks"
    },
    {
      "source": "Danny 'Boy' Bell",
      "target": "Information",
      "type": "collects and disseminates"
    },
    {
      "source": "Chance",
      "target": "Message service",
      "type": "uses for contact"
    },
    {
      "source": "Duffy",
      "target": "Pimp",
      "type": "was a"
    },
    {
      "source": "Kim Dakin",
      "target": "Duffy",
      "type": "formerly employed by"
    },
    {
      "source": "Kim Dakin",
      "target": "Chance",
      "type": "currently employed by"
    }
  ],
  "hierarchy": {
    "main_topics": [
      "Introduction of characters and setting",
      "Kim Dakin's request for help",
      "Matthew Scudder's investigation into Chance",
      "Matthew's personal struggles with alcoholism",
      "The search for Chance and his associates"
    ],
    "structure": "The document is structured as a narrative, progressing chronologically through Matthew Scudder's investigation. It begins with an introduction to the characters and the central problem, then details Matthew's efforts to locate Chance, interspersed with his personal reflections and interactions with other characters. The narrative is divided into numbered sections, each representing a distinct phase or day of his investigation and personal life."
  }
}