{
  "propositions": [
    {
      "id": "1",
      "text": "Arthur Calgrie arrives at the ferry crossing in the late afternoon, delaying his necessary task.",
      "level": 1
    },
    {
      "id": "1.1",
      "text": "He had lunch with friends and accepted an invitation for tea, trying to postpone his confrontation.",
      "level": 2
    },
    {
      "id": "1.2",
      "text": "He eventually leaves and drives to the ferry dock, where a car is arranged to pick him up on the other side.",
      "level": 2
    },
    {
      "id": "2",
      "text": "Calgrie reflects on the stark contrast between the remote landscape and the proximity of civilization.",
      "level": 1
    },
    {
      "id": "3",
      "text": "He boards the ferry, observing the ferryman and feeling a sense of unease about his impending task.",
      "level": 1
    },
    {
      "id": "3.1",
      "text": "He notes the ferryman's curiosity about his unusual crossing at this late hour.",
      "level": 2
    },
    {
      "id": "3.2",
      "text": "He recalls a conversation from the previous day where he was pressed about his resolute course of action.",
      "level": 2
    },
    {
      "id": "3.3",
      "text": "During that conversation, he was urged to consider \"everything involved\" and not just \"justice.\"",
      "level": 3
    },
    {
      "id": "3.4",
      "text": "He implicitly understood this as a suggestion to conceal something.",
      "level": 3
    },
    {
      "id": "4",
      "text": "Upon reaching the other side, Calgrie asks about a house called 'Sunny Ridge'.",
      "level": 1
    },
    {
      "id": "4.1",
      "text": "The ferryman reveals that the house is locally known as 'Adder's Point'.",
      "level": 2
    },
    {
      "id": "4.2",
      "text": "The ferryman explains that Mrs. Argyll named it 'Sunny Ridge' but its original, descriptive name was 'Adder's Point'.",
      "level": 2
    },
    {
      "id": "5",
      "text": "Calgrie walks to Sunny Ridge, feeling observed.",
      "level": 1
    },
    {
      "id": "5.1",
      "text": "He finds the house modern and unremarkable, contrasting with the dramatic natural scenery.",
      "level": 2
    },
    {
      "id": "6",
      "text": "He rings the doorbell of Sunny Ridge.",
      "level": 1
    },
    {
      "id": "6.1",
      "text": "The door opens to reveal Hester Argyll, a young woman with a tragic and guarded demeanor.",
      "level": 2
    },
    {
      "id": "6.2",
      "text": "She is initially hostile and suspicious, believing him to be a reporter.",
      "level": 2
    },
    {
      "id": "6.3",
      "text": "Calgrie states that his visit concerns her brother, Jack.",
      "level": 3
    },
    {
      "id": "6.4",
      "text": "Hester reacts with distress, believing the matter to be closed with Jack's death.",
      "level": 3
    },
    {
      "id": "7",
      "text": "Calgrie presents a letter from Mr. Marshall.",
      "level": 1
    },
    {
      "id": "7.1",
      "text": "Hester is surprised and concerned by the mention of Mr. Marshall from London.",
      "level": 2
    },
    {
      "id": "7.2",
      "text": "A stern, middle-aged woman, Miss Linstroom, emerges and questions Calgrie's presence.",
      "level": 2
    },
    {
      "id": "8",
      "text": "Hester, after reading the letter, goes to fetch her father.",
      "level": 1
    },
    {
      "id": "9",
      "text": "Calgrie is led to a study, which he finds to be a comfortable and personal space.",
      "level": 1
    },
    {
      "id": "9.1",
      "text": "He notices another woman, Miss Gunda Fern, a secretary, and Leo Argyll, who appears frail.",
      "level": 2
    },
    {
      "id": "10",
      "text": "Leo Argyll, holding Marshall's letter, inquires about the purpose of Calgrie's visit.",
      "level": 1
    },
    {
      "id": "10.1",
      "text": "Calgrie finds Leo Argyll to be a man content in his detachment from the outside world.",
      "level": 2
    },
    {
      "id": "11",
      "text": "Leo Argyll assumes Calgrie's visit concerns his deceased son, Jack.",
      "level": 1
    },
    {
      "id": "11.1",
      "text": "He states that Jack was not entirely normal and that they are not surprised by anything he might have done.",
      "level": 2
    },
    {
      "id": "11.2",
      "text": "He believes Jack should not be held responsible for his actions.",
      "level": 2
    },
    {
      "id": "12",
      "text": "Hester interrupts, describing Jack's violent temper and behavior.",
      "level": 1
    },
    {
      "id": "13",
      "text": "Leo Argyll tries to calm Hester, reiterating that Jack should be seen as a patient and a child not adapted to his environment.",
      "level": 1
    },
    {
      "id": "14",
      "text": "Calgrie emphatically declares, 'No!' when asked if he agrees that Jack was not responsible.",
      "level": 1
    },
    {
      "id": "15",
      "text": "Calgrie reveals his true purpose: Jack Agill is innocent.",
      "level": 1
    },
    {
      "id": "15.1",
      "text": "He states that Jack did not commit the murder and could have proven his innocence.",
      "level": 2
    },
    {
      "id": "15.2",
      "text": "Calgrie reveals that he was the man in the car that Jack claimed to have hitched a ride with.",
      "level": 2
    },
    {
      "id": "16",
      "text": "Miss Linstroom bursts in, demanding an explanation.",
      "level": 1
    },
    {
      "id": "16.1",
      "text": "She expresses annoyance at the disruption of the family's peace.",
      "level": 2
    },
    {
      "id": "17",
      "text": "Calgrie recounts his journey that evening: picking up Jack near Redman's, driving him to Drymouth, and then going to Porthasger to visit his old nurse.",
      "level": 1
    },
    {
      "id": "17.1",
      "text": "He explains that he was then on his way to Redman's to see Mr. Pismash about rare books.",
      "level": 2
    },
    {
      "id": "17.2",
      "text": "He states that he arrived in Drymouth after 7:30 PM, after dropping Jack off.",
      "level": 2
    },
    {
      "id": "17.3",
      "text": "He further recounts being hit by a van while crossing the road in Drymouth, suffering a concussion and memory loss.",
      "level": 2
    },
    {
      "id": "17.4",
      "text": "This memory loss prevented him from remembering giving Jack a ride until he saw a newspaper article about the case.",
      "level": 2
    },
    {
      "id": "17.5",
      "text": "He had left England shortly after the accident for an Antarctic expedition.",
      "level": 3
    },
    {
      "id": "18",
      "text": "Calgrie explains that he discovered the truth about Jack Agill's innocence approximately a month prior to his visit, after returning from the expedition.",
      "level": 1
    },
    {
      "id": "18.1",
      "text": "He found an old newspaper containing a picture of Jack and details of the trial.",
      "level": 2
    },
    {
      "id": "18.2",
      "text": "The memory of giving Jack a ride returned, confirming Jack's alibi.",
      "level": 2
    },
    {
      "id": "19",
      "text": "He admits he is too late to save Jack, who died in prison six months after his sentencing.",
      "level": 1
    },
    {
      "id": "19.1",
      "text": "He is seeking to clear Jack's memory and reputation.",
      "level": 2
    },
    {
      "id": "20",
      "text": "He asks for confirmation of the facts and expresses regret for the pain this revelation causes.",
      "level": 1
    },
    {
      "id": "20.1",
      "text": "Leo Argyll confirms the facts but questions the necessity of rehashing painful memories.",
      "level": 2
    },
    {
      "id": "20.2",
      "text": "Leo Argyll concedes that while the act was murder, Jack's instability makes the background complex.",
      "level": 2
    },
    {
      "id": "21",
      "text": "Hester expresses disbelief in Calgrie and questions why he didn't come forward earlier.",
      "level": 1
    },
    {
      "id": "21.1",
      "text": "She believes the focus should be on the living, not the deceased.",
      "level": 2
    },
    {
      "id": "22",
      "text": "Gunda Fern shows understanding and empathy towards Calgrie.",
      "level": 1
    },
    {
      "id": "23",
      "text": "Calgrie explains the legal process that will likely follow, involving the Home Secretary and potential royal clemency.",
      "level": 1
    },
    {
      "id": "24",
      "text": "Hester reacts with sarcastic laughter to the idea of clemency for something Jack didn't do.",
      "level": 1
    },
    {
      "id": "25",
      "text": "Calgrie leaves, with Gunda Fern advising him to go as the shock is too great.",
      "level": 1
    },
    {
      "id": "25.1",
      "text": "Miss Linstroom accompanies him, expressing her frustration that bringing up the past will cause further suffering.",
      "level": 2
    },
    {
      "id": "25.2",
      "text": "Miss Linstroom reveals her long-standing care for the Argyll family and her love for them, but also states Jack was 'not good'.",
      "level": 2
    },
    {
      "id": "26",
      "text": "Hester intercepts Calgrie at the door, questioning his motive for coming and stating that the living are more important than the dead.",
      "level": 1
    },
    {
      "id": "27",
      "text": "She claims that what Calgrie has done has harmed them all.",
      "level": 1
    },
    {
      "id": "28",
      "text": "Leo Argyll is attempting to contact Mary and Philip, and Gunda Fern attempts to contact Michael.",
      "level": 1
    },
    {
      "id": "29",
      "text": "Hester calls Donald, expressing her inability to go out and her distress over the news.",
      "level": 1
    },
    {
      "id": "30",
      "text": "Leo Argyll tries to comfort Hester, suggesting the news should be a source of happiness and relief.",
      "level": 1
    }
  ],
  "concepts": [
    {
      "name": "Arthur Calgrie",
      "frequency": 22,
      "context": "The protagonist who travels to Sunny Ridge to reveal a truth about Jack Argyll's innocence."
    },
    {
      "name": "Jack Argyll",
      "frequency": 17,
      "context": "The deceased son of Leo Argyll, convicted of murdering his mother, whose innocence is revealed."
    },
    {
      "name": "Hester Argyll",
      "frequency": 12,
      "context": "Leo Argyll's daughter, initially suspicious and later distressed by the revelation."
    },
    {
      "name": "Leo Argyll",
      "frequency": 11,
      "context": "The father of Jack and Hester, who appears frail and somewhat detached."
    },
    {
      "name": "Sunny Ridge",
      "frequency": 7,
      "context": "The name of the Argyll family's house, also known as Adder's Point."
    },
    {
      "name": "Adder's Point",
      "frequency": 3,
      "context": "The original and local name for Sunny Ridge."
    },
    {
      "name": "Miss Linstroom",
      "frequency": 7,
      "context": "A stern Scottish woman who has cared for the Argyll family for years and expresses strong opinions."
    },
    {
      "name": "Gunda Fern",
      "frequency": 7,
      "context": "Leo Argyll's secretary, who shows empathy and understanding towards Calgrie."
    },
    {
      "name": "Mr. Marshall",
      "frequency": 3,
      "context": "The lawyer who sent Calgrie to the Argyll family with a letter."
    },
    {
      "name": "Drymouth",
      "frequency": 6,
      "context": "A location where Jack Argyll was apprehended and where Calgrie had an accident."
    },
    {
      "name": "Redman's",
      "frequency": 3,
      "context": "A location from which Calgrie picked up Jack Argyll."
    },
    {
      "name": "Murder",
      "frequency": 7,
      "context": "The crime for which Jack Argyll was convicted."
    },
    {
      "name": "Innocence",
      "frequency": 5,
      "context": "The state of Jack Argyll that Calgrie seeks to prove."
    },
    {
      "name": "Memory loss",
      "frequency": 3,
      "context": "Calgrie's condition after an accident, which obscured his memory of meeting Jack."
    },
    {
      "name": "Alibi",
      "frequency": 3,
      "context": "Jack Argyll's claim of being in Calgrie's car, which proves his innocence."
    },
    {
      "name": "Trial",
      "frequency": 4,
      "context": "The legal proceedings against Jack Argyll."
    },
    {
      "name": "Conviction",
      "frequency": 2,
      "context": "The legal judgment of guilt against Jack Argyll."
    },
    {
      "name": "Clearing reputation",
      "frequency": 3,
      "context": "Calgrie's goal: to restore Jack's good name."
    },
    {
      "name": "Shock",
      "frequency": 4,
      "context": "The reaction of the Argyll family to the news of Jack's innocence."
    }
  ],
  "relations": [
    {
      "source": "Arthur Calgrie",
      "target": "Jack Argyll",
      "type": "investigates_innocence_of"
    },
    {
      "source": "Arthur Calgrie",
      "target": "Sunny Ridge",
      "type": "travels_to"
    },
    {
      "source": "Jack Argyll",
      "target": "Argyll family",
      "type": "member_of"
    },
    {
      "source": "Leo Argyll",
      "target": "Jack Argyll",
      "type": "father_of"
    },
    {
      "source": "Hester Argyll",
      "target": "Jack Argyll",
      "type": "sister_of"
    },
    {
      "source": "Leo Argyll",
      "target": "Hester Argyll",
      "type": "father_of"
    },
    {
      "source": "Sunny Ridge",
      "target": "Adder's Point",
      "type": "also_known_as"
    },
    {
      "source": "Arthur Calgrie",
      "target": "Mr. Marshall",
      "type": "sent_by"
    },
    {
      "source": "Mr. Marshall",
      "target": "Jack Argyll",
      "type": "lawyer_for"
    },
    {
      "source": "Arthur Calgrie",
      "target": "Murder",
      "type": "investigates"
    },
    {
      "source": "Jack Argyll",
      "target": "Murder",
      "type": "accused_of"
    },
    {
      "source": "Jack Argyll",
      "target": "Innocence",
      "type": "possesses"
    },
    {
      "source": "Arthur Calgrie",
      "target": "Memory loss",
      "type": "experiences"
    },
    {
      "source": "Memory loss",
      "target": "Alibi",
      "type": "obscures"
    },
    {
      "source": "Alibi",
      "target": "Jack Argyll",
      "type": "belongs_to"
    },
    {
      "source": "Jack Argyll",
      "target": "Trial",
      "type": "undergoes"
    },
    {
      "source": "Trial",
      "target": "Conviction",
      "type": "results_in"
    },
    {
      "source": "Arthur Calgrie",
      "target": "Clearing reputation",
      "type": "seeks_for"
    },
    {
      "source": "Clearing reputation",
      "target": "Jack Argyll",
      "type": "applies_to"
    },
    {
      "source": "Shock",
      "target": "Argyll family",
      "type": "affects"
    },
    {
      "source": "Arthur Calgrie",
      "target": "Shock",
      "type": "causes"
    },
    {
      "source": "Miss Linstroom",
      "target": "Argyll family",
      "type": "cares_for"
    },
    {
      "source": "Gunda Fern",
      "target": "Leo Argyll",
      "type": "works_for"
    },
    {
      "source": "Hester Argyll",
      "target": "Donald",
      "type": "dates"
    }
  ],
  "hierarchy": {
    "main_topics": [
      "The Ferry Crossing and Calgrie's Arrival",
      "Arrival at Sunny Ridge and Encounter with Hester",
      "The Revelation of Innocence",
      "The Aftermath and Family Reactions"
    ],
    "structure": "The document is structured chronologically, following Arthur Calgrie's journey and his interactions with the Argyll family and their household. It moves from the external setting to the internal conflict and revelation of truth, culminating in the family's complex emotional responses."
  }
}